["Wolbachia efforts ramp up to fight Zika in Brazil, Colombia | (25OCT16) ", "Read about symptoms, treatment and prevention of Zika - a disease caused by Zika virus which has been in news for all wrong reasons of late! ", "How To Build a Human (the standard model from Fertilization to Birth) Years ago when the term Microcephaly was first encountered it was categorized and stored away.  When it came into the news again this past year associated with the Zika virus outbreak.  It carried with it a good amount of confusion.  In trying to gain an better understanding of what it means, a visual aid of the normal *'Fertilization to Birth'* cycle was found. When tying in what is being learned about Microcephaly, it is furthered my understanding of this heart-breaking condition.  \n\n***\n\nHere and below you will find a link to Eleanor Lutz's ( webpage. It provides an amazing animation of the gestation process from fertilization to birth.  \n\n^(source: \n\n***\n( - *\"Tabletop Whale is a tiny blog run by a PhD student in Seattle. It is updated every few weeks with a science themed infographic, chart, or illustration.\"* She is a gifted visualizer and her, *'how to build a computer'* poster indicates a persona who might not see things the way a lot of use do.  \n\n^(Other Recommended Viewing: *An animated guide to the human body: The muscle edition* currently found on page 4)", "Zika virus linked to “diving bell” syndrome: New evidence ", "Harvard lab develops quick, portable and cheap Zika virus test ", "Viral load and cytokine response profile does not support antibody-dependent enhancement in dengue-primed Zika-infected patients | (20JUN17) CIDRAP summary in comments  &gt; **Study suggests prior dengue infection does not increase Zika viral load**\n&gt; \n&gt; An analysis of blood samples from Brazilian patients seen in an emergency department for acute febrile illness found no sign of antibody-dependent enhancement (ADE) in those with Zika infection who had previously been exposed to dengue virus.\n&gt; \n&gt; Both viruses are flaviviruses, which are known for enhancing immune response. As part of their work on Zika virus vaccines, scientists have been trying to tease out how and if ADE impacts Zika severity and if cross-infection with dengue or other flaviviruses worsens the disease.\n&gt; \n&gt; A Brazil-based research team examined samples from 65 patients who were evaluated at a hospital in Sao Paulo state during the first half of 2016, when the area was experiencing a Zika outbreak. To explore any connection between ADE and both dengue and Zika, the researchers examined patients' viral loads and their cytokine profiles during acute infection. They published their findings yesterday in Clinical Infectious Diseases.\n&gt; \n&gt; For patients diagnosed as having acute dengue or Zika infections, the researchers did not see higher viremia levels in those who had previously been infected with dengue, but they noted that the study had only enough power to detect the difference with Zika virus.\n&gt; \n&gt; In the cytokine analysis part of the study, the investigators looked at patterns with 10 cytokines, finding a significant difference in only one: IL-1-beta, which was lower in patients with acute dengue infections who had been infected with dengue previously. Again, the researchers said the power to detect differences between the groups was low, but in the Zika patients they did see a significant positive association between IL-1-beta and viral load.\n&gt; \n&gt; The authors said they will continue to evaluate the group of patients to assess if earlier dengue infection protects against future Zika infections or illnesses involving other dengue serotypes. They also said they will explore other immunoglobulin subclasses and different immune cell subsets to better understand the mechanisms of the findings they observed in the patients.\n&gt;\n&gt; Jun 20 Clin Infect Dis (\n&gt;___\n\n^(source: ", "Use Zika to renew focus on birth-defect research ", "Outsmarting Outbreaks: Using Genomics to Track Viruses - Kristian Andersen, Scripps Research (2019) Viruses are spread by airlines and cruise ships. A lot about zika, Ebola and a few other diseases and how and when they spread. ", "Scientific ignorance about Zika parallels Aids crisis in 1980s, say Brazilian experts ", "One state has suspended use of pyriproxyfen in drinking water after claims the chemical, rather than the Zika virus, could be behind the rise of the birth defect ", "The Saga Of Oxitech’s Self-Eliminating GM Mosquito ", "Researchers 'solve' key Zika virus protein structure ", "Zika Virus Disease Outbreak in Colombia: Interactive Tool for Monitoring Cases ", "Official Map Finds Zika-Transmitting Mosquitoes In Much Of U.S. ", "Zika threat hits home: Which U.S. military hubs are most at risk? ", "Zika Virus Disease in Colombia — Preliminary Report ", "Is Venezuela Hiding Zika Cases? Venezuela has only reported 4700 cases, but infectious disease specialists fear the real total is \"in the six digits.\" ", "Why is not it possible to \"vaccinate\" against the Zika virus by intentionally infecting non-pregnant women with the virus? Since the Zika virus does not pose a risk to adults, if a woman wants to have a child and she lives in a Zika-affected area, why cannot she just have herself intentionally infected with the virus so that she can develop immunity before becoming pregnant?\n\nClearly this would not help any women already pregnant but if this is possible the whole \"do not have kids until 2018\" thing seems over-the-top.", "Working To Stop Zika Via Mosquitos ", "HOW I WAS CURED FROM ZIKA VIRUS ", "S.America holds crisis meeting as Zika 'nightmare' spreads ", "Rio Olympics could spark 'full blown global health disaster', say Harvard scientists ", "Does this virus remind anyone else of Plague the Game. ", "Genomic epidemiology reveals multiple introductions of Zika virus into the United States  This article is really interesting. Thanks for posting. ", "What are the chances I will get Zika from camping in Cabo? So I will be doing beach camping in Cabo Pulmo, which is East of Los Cabo, Mexico. \n\nAnyone heard of Zika bring there? \n\nAny risk being greater because of my beach camping?", "WHO | Zika virus infection – Netherlands (04MAR16) ", "Debug Fresno, our first U.S. field study | (14JUL17) ", "Collection of research about the Zika Virus ", "US-Brazil teams probe link between Zika and microcephaly ", "Only a Dozen Inspectors Stand Between Zika and Miami ", "Zika zone triples in Miami Beach after more cases found ", "The Breadth of Viruses in Human Semen - Emerging Infectious Disease journal | (13SEP17) CIDRAP summary in comments • r/infectiousdisease ", "‘Like it is been nuked’: Millions of bees dead after South Carolina sprays for Zika mosquitoes ", "Zika virus infection – Dominica and Cuba (29MAR16) ", "In Australia, a New Tactic in Battle Against Zika Virus: Mosquito Breeding ", "WHO | Zika situation report - 29 September 2016 ", "What is the Zika virus and how can it be stopped? ", "Why the Zika Virus may spread in southern US states this Spring ", "Obama diverts Ebola funds to fight Zika; Florida leads nation in cases ", "NextStrain - Real-time tracking of Zika virus evolution since 31 March 2016. ", "Brazil’s sprawling favelas bear the brunt of Zika ", "Venezuela Will not Talk To Colombia About Zika — And That is A Problem ", "'Nobody Is Immune': Bracing For Zika's First Summer In The U.S. | NPR Fresh Air ", "Postnatal zika infection in young infants - Basically no info available on the subject I have researched this issue ad nauseam, and I have spoken to MDs here at UCSF.  There is no knowledge as to how infection that occurs after birth, say at 3 months, affects the brain development of an infant.  If anyone has some information, please post.  Thank you. ZVD is an emerging disease as such there is little specific detailed information available on many aspects of its transmission. \n\nHave you read these articles? \n\n||Article|(/r/Zika)|\n|-|:-|:-|\n||(\n|*and*|||\n||( /ahead_of_print_zika_virus_infection_and_prolonged/)|\n\nWould not be surprised if your research missed these as it does not directly address your concerns. \n\nKnowing this is not close to what you are looking for, will be looking for specific information on this topic.  \n\nPlease restate your question with more specifics, (infected during pregnancy or after birth).  It will help narrow parameters of what look for. \n\n\n\n Thank you for taking such a keen interest in answering my question.  I have seen the first study, but the second one was new to me.  Thank you.  \n\nMy question is hypothetical in nature but relevant to my circumstances.  I am sure it is relevant to a large audience as well.  So, I will rephrase it as succinctly as possible:\n\n\"Is there any neurological and/or developmental harm associated with postnatal, non-congenital infection (infection occurring after birth) in young infants (&lt;1 year)?\"  \n\nMy wife and I are moving to Florida with a 3 month old child, and I am concerned that exposure to Zika at such a young age could impact her development.\n\nThank you!! To the best of my knowledge on the subject: There is no information currently published on the topic of children of any age being effected by ZVD (zika Virus Disease).  \n\nThe effect of a child contracting ZVD may lead to developmental difficulties in the future.  \n\nNeuropathy is not a widely studied field. The Zika virus will do much to change this for the benefit of all.  \n\nIf moving to Florida, you should guard against your home, yard and surrounding area becoming a breeding ground for Aedes mosquitoes.  Ample information on how to do this available online (CDC, PAHO, ECDC, State and Local Health Department websites).  \n\nThe main or key pieces of information needing to be understood:\n\n* Aedes mosquitoes are indoor pests. They live in and around our homes.  \n* Their bite does not cause irritation and may not be noticeable,\n* They do not make the buzzing sound normally associated with mosquitoes.\n\nWhen safeguarding your home, it is essential to eliminate possible breeding locations.  Female Aedes will deposit eggs above a water source. When the eggs hatch they fall into the water where the balance of the gestation process takes place.  Indoors, anywhere where there is a facet can become a breeding locations. ie In bathtubs and sinks overflow traps, under sinks located in kitchens, bathrooms , laundry  rooms, commode tanks. Outdoors, anything that can collect water can become a breeding location.\n\nWith the daily rainfall common in most areas of Florida, this can be a considerable task. \n\n", "Zika Virus and the Guillain–Barré Syndrome | Case Series from Seven Countries ", "If the Zika virus is bad only for pregnant women, why do not we just spread it to everybody before they get pregnant? ", "Study confirms and quantifies Zika-microcephaly link in Brazil | 05MAR19 ", "Florida reports more local Zika cases, FDA warns of possible IgM test problems | links in comments (28DEC16) ", "The disturbing truth about Zika that no one is talking about… ", "Mosquito sterilization offers new opportunity to control chikungunya, dengue, and Zika | 14NOV19 ", "US reviews plan to infect mosquitoes with bacteria to stop Zika and dengue viruses ", "PLOS Neglected Tropical Diseases: Zika Virus: Medical Countermeasure Development Challenges ", "New Utah Zika Case Baffles Health Officials: “Family Contact” ", "Zika's Mutations: From Patient Zero to Today ", "Thailand investigates four cases of suspected Zika-linked microcephaly ", "Florida Congressman Takes Mosquitoes to House Floor in Call for Zika Action ", "WHO continues Zika emergency amid virus spread, unanswered questions (02SEP16) ", "A speedy, sensitive, and low-cost detection test for Zika virus | (03MAY17) ", "Map of Zika cases in the U.S., by state  Column label 'Local cases' is misleading/ incorrect. CDC source has column header 'Presumptive viremic blood donors'. Local mosquito borne transmission has been identified in FL (N=218) or TX (N=6) only at this time. Ahh - good catch! Looks like the cdc has changed the label on their table that I generate this map from. Back when I originally set it up, in Aug 2016, that column of the table was labeled \"Locally acquired cases\" (see 'wayback machine' snapshot ...  Tripped me out there for a moment because I know this table very well. I was wondering what rock I had been under with mosquito transmission documented outside of FL and TX in the continental US.  Ok - I have updated my map using the new labels for the data categories. Depending on your browser's cache refresh settings, you might can just view the link again, or you might have to Ctrl+refresh or clear your browser cache to get rid of the old map. (Thanks for pointing this out!)", "Experts: Multiple Zika vaccine platforms likely needed | (15Nov16) ", "Zika virus infection – Argentina and France (07MAR16) ", "Puerto Rico may face 100,000 Zika cases by year's end: CDC ", "The 5 Zika Facts You Need to Know | MidMeds Infographic ", "Tropical Tonga declares Zika outbreak after five cases confirmed ", "Experts: USA must prepare now for Zika virus ", "So like how long does this thing stay in your system? Does it just pass through like a flu or cold or does it linger for a long time / forever?", "PLOS Neglected Tropical Diseases: Transmission Dynamics of Zika Virus in Island Populations: A Modelling Analysis of the 2013–14 French Polynesia Outbreak ", "Rory McIlroy pulls out of Rio Olympics over Zika concerns ", "Zika: the new enemy is here | population health caucus ", "Zika Virus Transmission Found In A Second Area of Miami ", "What is The Best Way To Keep Mosquitoes From Biting? ", "Pregnancy Registry | Zika virus ", "Do Not Fear the Drones Air-Dropping 50,000 Mosquitoes From Above | 20AUG18 ", "First baby with Zika-related microcephaly defect born in Spain ", "Singapore Zika cases increase to 56 ", "A Real-Time Window Into Zika Research On A Pregnant Monkey : (08MAR16) ", "WHO | Emergency Committee on microcephaly, other neurological disorders and Zika virus Press conference video. ", "Zika: The key unanswered questions ", "WHO | Zika situation report (04MAR16) ", "Brazil asks whether Zika acts alone to cause birth defects ", "Zika Cases In Philippines Rise To 57 | (04FEB17) ", "Obama threatens to veto GOP-backed bill on Zika virus aid ", "Zika mystery deepens with evidence of nerve cell infections (06APR16) ", "Scientists Find Abnormalities In Fetuses Exposed To Zika : Shots (Published 04MAR16) ", "Larvicide Manufactured By Sumitomo, Not Zika Virus, True Cause Of Brazil's Microcephaly Outbreak: Doctors : LIFE : Tech Times ", "Heart-breaking images of how Zika destroys babies’ brains ", "Older travelers less likely to cancel travel plans over Zika virus, study says ", "The Zika-Microcephaly Theory's Got Big Problems ", "ZIKA Mutant Progeny Virus: Linked to ROSWELL and ISRAEL in 1947? Human Depopulation Pandemic Arrives ", "zika aside, does not the data seem like Brazil has very low rates of microcephaly? In 2015 Brazil has roughly 2.8M kids born.  An estimated 3,500 cases of microcephaly are suspected.  \n\nIn the US there were almost 4M children born in 2015 and roughly 25,000 cases of microcephaly.\n\nI am guessing there is a lot of diagnosis mismatch and data problems, but is it possible that the microcephaly connection is overstated?  Any estimates of the actual number of pregnant Brazilians in 2015 that had exposure to Zika versus the likely true number of cases of microcephaly?", "Six Cases of Zika Virus-Linked Birth Defects in US, CDC Says ", "Zika May Be Tied To Another Brain Disease ", "Which Licensed Compounds Can Be Used Against Zika? | (03MAR17) ", "FDA paves way for first human Zika vaccine trial | (20JUN16) ", "FDA approves Zika-fighting genetically modified mosquito ", "Where is Zika in the US? ", "Microcephaly cases in Brazil predate Zika virus outbreak, study says  ", "Short videos about zika? Hi! Does anybody know and can share short videos (under 5 minutes) about zika virus to understand how does it spread, which are its symptomps and so on? Thanks!", "Time Lags between Exanthematous Illness Attributed to Zika Virus, Guillain-Barré Syndrome, and Microcephaly, Salvador, Brazil - Volume 22, Number 8—August 2016 - Emerging Infectious Disease journal | (03MAY16) ", "More than 5,000 pregnant women in Colombia have Zika virus: government ", "Why the Zika Virus Is a Good Thing for Condom Makers ", "Can Data Sharing Shed Light on Congenital Zika Syndrome? | Contagion Live | (24FEB17)  Alice Panchaud, PharmD, PhD, clinical pharmacist and pharmacoepidemiologist, CHUV, Lausanne University Hospital, Switzerland, explains how data sharing may be used to answer important questions regarding congenital Zika syndrome.", "Florida Counties Asked to Stop Blood Donations Over Zika Fears ", "New research suggests anti-viral role for aravive biologics' anti-AXL candidate against Zika virus | (11JAN16) ", "Zika virus in BRAZIL is causing BABIES TO HAVE ABNORMAL HEADSSSSS!! ", "Zika virus makes its way to Southeast Alaska ", "Zika Virus Reduces Male Fertility In Mice ", "Nicaragua confirms first microcephaly birth linked to Zika virus ", "A year since Zika outbreak, India keeps a check - Livemint ", "Zika Virus a big concern for people with family in Dominican Republic, doctor warns them to take precautions ", "Gov. Rick Scott declares Zika emergency in 4 counties ", "NOT-AI-16-026: Notice of NIAID's Interest to Highlight High-Priority Zika virus (ZIKV) Research Areas ", "Study associates Zika with more extensive birth defects ", "Zikacoin ", "Photos Reveal Impact of Zika on Brazil's Streets ", "Active Zika found in saliva and urine ", "Nys testing for males? ", "CDC investigates sexual transmission cases of Zika ", "Zika virus: scientists present strong evidence of Guillain-Barré link ", "Zika virus infection during pregnancy may increase birth defect risk 20-fold, CDC study finds ", "Zika virus: survey shows many Latin Americans lack faith in handling of crisis ", "University Of Sao Paulo (USP) Dr. Carolini Kaid Davila, PhD, - Co-Founder &amp; CSO, Vyro Biotherapeutics - Oncolytic Viruses (Zika) For Drug Resistant Cancers ", "CDC Issues New Warning On Potential Impact Of Zika Virus ", "WHO emergency panel to meet in June on Zika and Olympics ", "There is No Panacea for the Zika Epidemic ", "Zika Virus Can Be Transmitted Through Anal Sex, Too ", "Zika virus may linger in babies' blood for months, with unknown effects ", "20 Million Mosquitoes to Hit Fresno; That is a Good Thing, Really | (14JUL17) ", "Stopping the Zika Virus and Microcephaly | (26JUN16) ", "NIH | Zika Virus Information ", "Study: How Zika Could Be Causing Microcephaly ", "What does this mean? ", "Zika in Thailand - looking for some perspective on overall risk, and location-specific information. Hi,\n\nWe booked tickets to Thailand a few months ago for this November, as my wife has family there.  Been there several times, including in 2013, when she was pregnant (9w) with our first child.  Fast forward to this year, and it is like a repeat, as she is now pregnant with our second child.  She would be at the 5-month point when we travel, and we are a bit concerned about Zika in Thailand.  We would be spending the bulk of our time in Bangkok, indoors, visiting family, but maybe a couple of days at a beach destination like Hua Hin.\n\nThere does not seem to be a great deal of information on Zika in Thailand.  CDC excludes the country altogether from its list of active transmission countries, while the UK and EU list it as a place of high concern.  The chart in this subreddit rates the situation as \"sporadic.\"\n\nGiven that we are the types to take pretty generous precautions about mosquitoes (including DEET and appropriate clothing), should we continue with our trip, or defer?  Any additional information would be most welcome!\n\nThanks!\n\n", "Increase in Reported Prevalence of Microcephaly in Infants Born to Women Living in Areas with Confirmed Zika Virus Transmission (11MAR16) ", "Mosquitoes, not security, viewed as big Rio threat ", "Neurodevelopment in Infants Exposed to Zika Virus In Utero | 13DEC18 ", "A Brief History Of Zika Virus, From Its Discovery To Today ", "Use a Condom to Avoid Zika, CDC Tells Travelers ", "Renewed Zika outbreak feared on Texas border ", "Kinetics of Zika Viral Load in Semen | (17AUG17) CIDRAP summary in comments  &gt; Study: **Zika not always found in semen of infected men\n&gt;** \n&gt; A new study published in the New England Journal of Medicine complicates the understanding of Zika virus RNA in seminal fluid. The findings call into question recommendations about sexual activity when Zika virus is suspected or confirmed.\n&gt; \n&gt; The study was based on semen samples from 12 men from French Guiana with laboratory-confirmed Zika virus. Four of the men, 33%, had no detectable Zika RNA in their semen. Seven (58%) of the men excreted Zika virus RNA in their semen for up to 1 month. The average duration for Zika RNA detection in semen was 26 days, a shorter amount of time than other studies have reported.\n&gt; \n&gt; \"These data suggest that not all men who are symptomatically infected with ZIKV will have ZIKV RNA detectable in semen,\" the authors write. Moreover, viral loads in semen samples did not correspond to serum levels.\n&gt; \n&gt; Currently, the Centers for Disease Control and Prevention recommends that men wear condoms or abstain from sex for 6 months after possible Zika infection. The authors conclude their study by saying more data is needed before making recommendations about sexual health practices.\n&gt; Aug 16 NEJM (\n\n^(source: \n", "Following The World Health Organization reports- Zika mosquito may not be the reason for the Microscopically outbreaks. ", "Zika Virus May Push South America to Loosen Abortion Bans ", "I am going to Mexico soon without my pregnant wife. She is 25 weeks pregnant. I have concerns that I may catch Zika there, and I do not want to come back and transfer it to her or the baby she is pregnant with. I am unsure on how to proceed. Can anyone offer me some advice? ", "Mother and possibly two sisters may have Zika. ", "As Zika spreads, Florida town a study in bug-borne illness ", "Zika Virus Threatens U.S. from Abroad (updated regularly) ", "COCA Call July 27, 2017—Zika Virus: Updates to Clinical Guidance and Recommendations for Pregnant Women and Infants | (24JUL17) CIDRAP summary in comments  &gt; **CDC updates Zika testing recommendations for pregnant women**\n&gt; \n&gt; The US Centers for Disease Control and Prevention (CDC) today updated its recommendations for testing pregnant women for Zika virus, mainly because one of the most frequently used tests—which detected immunoglobulin B (IgM) antibodies—is more likely to yield a false positive result, especially as incidence of the disease in the Americas decreases.\n&gt; \n&gt; The CDC detailed the new guidance today in an early online edition of Morbidity and Mortality Weekly Report (MMWR).\n&gt; \n&gt; Health officials emphasized that health providers should continue to ask pregnant women at each prenatal visit about possible Zika exposure and possible symptoms of the illness before and during the current pregnancy. Nucleic acid and serologic testing are still recommended for symptomatic pregnant women within 12 weeks of illness onset.\n&gt; \n&gt; However, for asymptomatic women with ongoing possible exposure, the CDC no longer routinely recommends routine IgM testing, due to the test's limitations and difficulty interpreting results. Recent studies have down that Zika IgM antibodies might be detected for months after infection, limiting the ability to tell if the infection occurred before or during pregnancy.\n&gt; \n&gt; However, they note that in areas with ongoing possible Zika transmission, nucleic acid testing should be offered at the start of prenatal care, with follow-up testing based on local Zika transmission trends.\n&gt; \n&gt; The CDC will host a Clinician Outreach and Communication Activity (COCA) call to explain and field questions about the new guidance on Jul 27 at 2 pm eastern time.\n&gt;\n&gt; Jul 24 MMWR early release (\n&gt;\n&gt; CDC COCA call (\n___\n\n^(source: \n", "To Stop Zika, Aedes Aegypti Mosquito Must Be Controlled ", "Brazil pushes back at Zika critics, finds new evidence of link to birth defect ", "Zika May Increase Risk of Mental Illness, Researchers Say ", "Zika funding stalls in the Senate amid partisan rift ", "Exactly...made in the USA ", "New study helps reveal how #Zika virus causes devastating birth defects ", "IBM’s World Community Grid Launches OpenZika Project ", "Zika: The Latest Strain of Sexually Transmitted Disease? ", "Health Officials Clear Part of Miami Beach Zika Zone ", "Obama would veto Zika funding bill proposed by Kentucky Rep. Rogers ", "U.S. Reports First Zika Virus Death in Puerto Rico ", "Florida Sprays Residents Like Bugs Over Zika — With A Toxic Chemical That Reduces Fetal Brain Size In Studies ", "Tens of thousands of babies 'may be born with Zika disorders' ", "India reports its first cases of the Zika virus ", "Singapore Clears Drains and Sprays Residences in New Battle Against Zika ", "Colombia: A nation in panic over Zika ", "Revision to CDC’s Zika Travel Notices: Minimal Likelihood for Mosquito-Borne Zika Virus Transmission at Elevations Above 2,000 Meters (11MAR16) ", "Florida reports 4 more local Zika cases; Texas cites fatal microcephaly | (09AUG16) ", "Zika mosquito's habits force new strategy by U.S. cities, states (03APR16) ", "First Case of Female-to-Male Transmission of Zika Is Recorded ", "Zika Prevention: How To Avoid Mosquito Bites ", "Zika May Also Cause Eye Problems ", "Schumer says Washington not doing enough to fight Zika virus ", "Africa: We are a Step Closer to Figuring Out Why Mosquitoes Bite Some People and Not Others | 18MAY21 ", "WHO | Fifth meeting of the Emergency Committee under the International Health Regulations (2005) regarding microcephaly, other neurological disorders and Zika virus | (18NOV16) ", "How Zika virus might damage vision ", "Florida mosquitoes being tested for Zika to confirm US bite ", "Sperm banks draft Zika virus policy ", "QA: Infants and Zika Virus Infection | Zika virus ", "Journalist looking for people in South America effected or concerned by Zika Virus. ", "Hawaii governor signs emergency proclamation on Zika ", "Scientists are bewildered by Zika’s path across Latin America ", "Infecting mosquitoes with bacteria could help stop them spreading Zika, an early Brazilian study suggests. ", "Zika is a Reproductive Rights Issue ", "Mom of baby with microcephaly linked to Zika speaks out ", "Health official warns Zika could spread across U.S. Gulf ", "WHO CONFIRMS OUTBREAK OF ZIKA VIRUS IN INDIA  ", "Studies cite possible Zika-meningitis link, note virus in saliva ", "Mapping the Evolution of the Zika Virus ", "Zika crosses the placenta by latching on to fetal blood vessels | (13FEB17) ", "Florida Department of Health Daily Zika Update and CDC Maps (\n\n|^(Infection Type)|^(Travel-Related Infections of Zika) |^(Non-Travel Related Infections of Zika)|^(Infections   Involving Pregnant Women)|^(Out of State Cases (not Florida Residents)|^(Undetermined)|^(Total)|\n|:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:|\n|^(**Infection Count**)|**758**|**180**|**115**|**19**|**6**| **1078**|\n\n**Maps**\n\n* (\nMiami-Dade County, FL. Red shows areas of active transmission where CDC recommends adherence to travel and testing guidance for pregnant women, women of reproductive age, and their partners. Yellow shows areas where CDC recommends cautionary travel recommendations and strict adherence to precautions to prevent mosquito bites.\n\n* ( On August 1, CDC issued guidance for people who travel to or live in a 1-square-mile area of the Wynwood neighborhood in Miami, FL, identified by the Florida Department of Health as having mosquito-borne spread of Zika.\n\n* ( On August 19, CDC also issued guidance for a 1.5-square-mile section of Miami Beach identified to have mosquito-borne spread of Zika; on September 17, this section was expanded to a 4.5-square-mile area.\n\n* ( On October 13, 2016, Florida announced a new area of mosquito-borne spread of Zika in a 1-square-mile area in Miami-Dade County, FL.  \n\n* (\n\n* (\n\n* (\n\n    ^(source: ", "First baby with Zika-related microcephaly born in Florida ", "Studies highlight possible Zika treatments, mosquito control conundrum | (29AUG16) ", "Zika virus: Will condoms and repellent be enough to protect our athletes in Rio? ", "First locally transmitted Zika virus found in South Texas ", "ZIKA VIRUS &amp; ST. BARTS: 3 THINGS YOU NEED TO KNOW ", "Zika's origin and global spread ", "What happened to… Zika virus | 07APR21 ", "Texas reports Zika case imported from Miami, Florida reports 2 new local Zika infections | (15AUG16) ", "Two babies in California born with microcephaly from Zika, officials say ", "Zika virus discovered in human saliva and urine for the first time ", "How Many Zika Cases Are There In Venezuela: 4,000 Or 400,000? : Goats and Soda : NPR ", "Experts Study Zika’s Path From First Outbreak in Pacific ", "How street gangs are helping the spread of Zika ", "Banner Message Changes to provided more relevant information ", "Zika outbreak may have peaked in Brazil, researchers say ", "Guillain-Barré syndrome (GBS) ‘I could move my fingers but within days, I would probably be totally paralyzed.’ ", "CIDRAP | Zika count declines in Mexico; virus may be circulating in Angola (links in comments) | (16DEC16) ", "Zika infection decreases sperm count, study says | (22AUG17) ", "Dengue immunity may be protective against symptomatic Zika, study finds | 22JAN19 ", "Venezuela Takes on Zika Amid Shortages, Information Blackout ", "Florida IDs new Miami neighborhood as Zika zone ", "Microstructural Changes of the Retina in Infants With Congenital Zika Syndrome | (07SEP17) CIDRAP summary in comments  &gt; **Study: Zika damages ganglion cells in retina, leading to vision problems**\n&gt; \n&gt; A study today in JAMA Ophthalmology suggests that congenital infection with the Zika virus interferes with the correct formation of the retina's ganglion cell layer (GCL), leading to lasting vision problems.\n&gt; \n&gt; To conduct the study researchers compared eight infants who had confirmed congenital Zika syndrome (CZS) to eight infants with cobalamin C deficiency (cblC), an inherited disorder that affects the body's ability to process vitamin B12. All study participants had two eye evaluations.\n&gt; \n&gt; The infants with CZS had severe thinning of the ganglion cell region that lines the retina, in addition to increased retinal backscatter and severe structural disorganization. The central retinal degeneration was similar to that of cblC deficiency.\n&gt; \n&gt; \"The findings provide the first, to date, in vivo evidence in humans for possible retinal maldevelopment with a predilection for retinal GCL loss in CZS,\" the authors wrote.\n&gt; \n&gt; This is the first study to observe changes to the ganglion cells in the retina, and the authors said this malformation suggest a particular vulnerability of the inner retina to the Zika virus.\n&gt; \n&gt; Sep 7 JAMA Ophthalmol (\n\n^(source: \n", "Open Letter to Dr. Margaret Chan, Director-General, WHO | Rio Olympics Later - For the Good of Public Health and Spirit of Sport ", "Kidenga App Uses Crowdsourcing to Fight Zika ", "Emerging Infectious Disease journal - Characteristics of Dysphagia in Infants with Microcephaly Caused by Congenital Zika Virus Infection, Brazil, 2015 - Volume 23, Number 8, August 2017 | (15JUN17)  &gt; **Congenital Zika infection linked to problems with swallowing**\n&gt; \n&gt; Nine Brazilian infants with congenital Zika infections developed moderate to severe dysphagia, or problems with swallowing, increasing the risk of aspirating liquids and choking, according to a report yesterday in Emerging Infectious Disease.\n&gt; \n&gt; The infants, all of whom had microcephaly, showed delays in the oral phase, with eight out of nine exhibiting delayed initiation of the pharyngeal phase of swallowing and all showing general oral dysfunction.\n&gt; \n&gt; Onset of dysphagia began by the age of 3 months, and all the infants had difficulty swallowing, characterized by premature spillage, and marked loss of voluntary activity during the oral phase of swallowing. The authors describe many potential neurologic routes for the dysphagia, including hypertonia, which caused abnormal posture with hyperextension of the neck in six of the nine infants. The children with hyperextensions also displayed more irritability, making swallowing and eating more difficult.\n&gt; \n&gt; The authors say their study highlights the importance of looking for dysphagia in children who have congenital Zika syndrome.\n&gt; \n&gt; \"The clinical follow-up of children with  should be conducted by a comprehensive and multidisciplinary team of childhood specialists in neurology, gastroenterology, speech pathology, nutrition, and otorhinolaryngology, using clinical and instrumental swallowing assessments,\" the authors concluded.\n&gt;\n&gt; Jun 12 Emerg Infect Dis ( \n\n^(source: \n", "Zika raises profile of more common birth-defect virus ", "Joint deformity reports expand scope of Zika birth defects | (11AUG16) ", "Maldito ZIKA · Maniaco ", "I am a US citizen. I traveled around a country with zika within the past 30 days with my husband. We are both back in the US and asymptomatic. Now I want to get pregnant. Should I wait? How long? HELP! ", "First Likely Microcephalic Babies Born In Colombia ", "Mexico says six pregnant women infected with Zika virus ", "My family has a cruise to the Bahamas booked for December, 2016. Should we skip it? My mom called me freaking out, saying we probably will not be able to go on our cruise because of the Zika virus.  How much truth is there to this?  I do not know much about it, but what are the risks at this point?  Are they likely to be worse or better by December?  Is there anything else we should know/consider?", "Traveling in Central America a year ago...Pregnant now. Should I be worried? My wife and I were travelling in Central America in Feb last year (2015).  My wife got pregnant in August this year.  I am wondering if 1) was there Zika in Central America last year, 2) if she had gotten it, would there be issues with a current pregnancy...or is it only when getting the virus while pregnant?", "Epidemic Diseases - Zika in the Americas (interactive map) ", "Prolonged Zika Virus RNA Shedding &amp; Diagnosis | Contagion Live | (24FEB17)  &gt; Marta G. Cavalcanti, MD, PhD, physician at Infectious Diseases Clinic, Hospital Universitario Clementino Fraga Filho, UFRJ, Brazil, explains why prolonged RNA shedding delays diagnosis of Zika co-infection, as well as discussed Zika infection in a patient with lupus.", "Zika Buzz – BiondVax's Chief Scientist talks Zika ", "What to do when Zika carrying mosquitos are in your town. Hi, I am just wondering what expectant mothers are planning to do when Zika comes. Living in FL, this moment could be very soon, anytime really. Wearing long clothes, applying bug spray, and other protective measures are great and all. But the fact is, you will still get bit! Is moving North the only safe option?", "Recent numbers being presented from Puerto Rico The following report comes from:  and references the PDF file link (( shown below excerpt on the salud.gov.pr page.\n \nGoogle Translated copy: \n\n&gt;Office of Communications and Public Affairs\n&gt; \n&gt;​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​Comunicados Press\n&gt;July 2016\n&gt; \n&gt;They emphasize importance of community mobilization to fight against Zika  \n&gt;\n&gt;Data presented weekly update\n&gt; \n&gt; **EMPHASIZE THE IMPORTANCE OF COMMUNITY MOBILIZATION IN FIGHT AGAINST ZIKA WEEKLY UPDATE DATA PRESENTED**\n&gt; \n&gt; San Juan, PR Secretary of the Department of Health, Ana Ríus Armendariz, reported that for epidemiological week number 27 Zika 1145 new cases were confirmed, for A total of 5582 cases accumulated since the arrival of the virus to the island. These include 119 pregnant women for a total of 672, 10 hospitalizations for a total of 65 and 2 cases\n&gt; Guillain Barré syndrome for a total of 21.\n&gt; \n&gt; \"We can not forget that we are all an indispensable element in the battle against Zika. It is the duty of each of us eliminate potential breeding sites in our homes, wear clothing that limits the amount of skin that remains exposed and repellent, and invest in wire to our doors and windows to help prevent virus and the welfare of all. Try to avoid infecting our family continue, especially our pregnant, \"said the health minister specifying that must protect though not feel sick.\n&gt; \n&gt; Ríus Armendariz stressed that has also been proven sexual transmission of the virus, which it is essential to protect themselves using condoms as a preventive measure against this and other sexually transmitted diseases when having intercourse. \n&gt; \n&gt; Finally, the health official recalled that the main symptoms associated with Zika They are rash, fever, joint pain and conjunctivitis without secretion. to identify the presence of any of these symptoms, you should visit your doctor and ask that he do the test to detect if indeed has the virus.\n&gt; \n&gt; For more information about or access weekly reports Health surveillance You can access the website of the Department of Health: \n&gt; \n\nEdited: Clarity on referenced pdf file.\n\n\n", "Isolation of infectious Zika virus from saliva and prolonged viral RNA shedding in a traveller returning from the Dominican Republic to Italy, January 2016 (10MAR16) ", "Update: Ongoing Zika Virus Transmission — Puerto Rico, November 1, 2015–April 14, 2016 | (29APR16) ", "Zika epidemic uncovers Brazil’s hidden birth-defect problem ", "Ahead of Print -Francisella tularensis ssp. holarctica in Ringtail Possums, Australia - Volume 23, Number 7, July 2017 - Emerging Infectious Disease journal | (09MAY17) CIDRAP summary in comments  &gt; **Tests confirm tularemia in Southern Hemisphere animals**\n&gt; \n&gt; Researchers from Australia yesterday reported the first confirmation of Francisella in Southern Hemisphere animals. Ringtail possums that had been suspected as the source of isolated human infections in Australia tested positive for the bacterium, which causes tularemia.\n&gt; \n&gt; The group reported its findings yesterday in Emerging Infectious Diseases.\n&gt; \n&gt; As part of efforts to explore undiagnosed diseases in Australian wildlife, the investigators probed possible infectious causes of ringtail possum deaths that involved acute necrotizing enteritis or hepatitis. They included eight possums that were found dead in Sydney from 2000 to 2009.\n&gt; \n&gt; In analyzing RNA from liver samples, the researchers did not find any viral or fungal pathogens, but F tularensis was abundant. Sequencing tests suggested F tularensis holarctica.\n&gt; \n&gt; Individual liver samples were then screened for F tularensis, and two were positive. They were obtained from ringtail possums found in Sydney's north shore area during mass mortality events, one in May 2002 and the other in August 2003. An isolate was obtained from one of the two samples. The isolate and sequences from the original liver RNA data clustered with an Asian holarctica subspecies that includes the japonica biovar.\n&gt; \n&gt; Testing of eight other ringtail possums and three rabbits with similar symptoms were negative for F tularensis, suggesting that there are other sources for acute necrotizing enteritis and hepatitis in the animals.\n&gt; \n&gt; The team concluded that native ringtail possums in Australia might be a natural reservoir or host of tularemia and could serve as sentinels for disease activity that could pose a threat to humans.\n&gt;\n&gt; May 9 Emerg Infect Dis (\n", "Banner Message Changes to provide more relevant information The information block below the main banner has been updated to provide more relevant information on the spread of the Zika virus in all US States and Territories.\n\nMore information on the data displayed may be found in the ( under (\n\n***\n|^Legend|^Description|\n|:-|:-|\n|^(USA Zika Cases)|^(The total number of TAC &amp; LAC cases in all US States and Territories)|\n|^(As of Date)|^(The *latest* reporting date provided by the CDC.) |\n||^(**Note**: As information is reported at different times, there will be minor inconsistencies.)|\n|^(Total)|^(The total of all TAC, LAC, Pregnancies &amp; GBS cases.)|\n|^(Pregnancies)|^(Total number of pregnancies with possible zika infections at the reporting time.)|\n|^(GBS)|^(Total number of Guillain-Barre syndrome cases at the reporting time.)|\n|^(TAC)|^(**T**ravel **A**ssociated **C**ases.)|\n|^(LAC)|^(**L**ocally **A**cquired **C**ases.)|\n|^(Superscripted)|^(Superscript Numbers indicate the differences between the current and last report totals.)|   \n***\nPlease PM /u/IIWIIM8 with any questions, comments or suggestions regarding these changes.", "Zika’s long, strange trip into the limelight ", "Venezuelan health minister admits to 4500 cases of Zika, number might be even bigger according to public health specialists ", "How To Build a Human, the standard model: from Fertilization to Birth ", "Human Trials of Zika Vaccine Planned for 2016 ", "Measures Taken to Prevent Zika Virus Infection During Pregnancy — Puerto Rico, 2016 | (09JUN17)  &gt; **CDC notes 5% rate of Zika birth defects in US territories | Jun 08, 2017**\n&gt; \n&gt; Today the Centers for Disease Control and Prevention (CDC) released its first analysis of Zika-related birth defects in US territories, concluding that 5% of all pregnancies with a confirmed Zika diagnosis in the mother resulted in a birth defect.\n&gt; \n&gt; The study was published in Morbidity and Mortality Weekly Report (MMWR).\n&gt; \n&gt; \"These findings are consistent with an earlier report we produced on women in the 50 states who had Zika-affected pregnancies,\" said Anne Schuchat, MD, the acting director of the CDC, in a press briefing.\n&gt; \n&gt; The study tracked the outcomes of 2,549 pregnant women in territories (including Puerto Rico, Micronesia, and America Samoa) who had lab-confirmed Zika infections in pregnancy from Jan 1, 2016, to Apr 25 of this year. About 5%, or 122, of the babies born to these women had Zika-associated birth defects, ranging from hearing loss to severe microcephaly, or abnormally small heads.\n&gt; Largest analysis to date\n&gt; \n&gt; \"This is the largest analysis of completed pregnancies with Zika to date,\" said Schuchat. \"The Zika virus poses a serious threat to women and babies, regardless of when disease is diagnosed.\"\n&gt; \n&gt; The report compared the outcomes in relation to which trimester the mother was diagnosed in: If diagnosed in the first trimester, there was an 8% chance a baby would be born with a Zika-related birth defect. That number dropped slightly, to 5% and 4% in the second and third trimesters, respectively.\n&gt; \n&gt; Schuchat said that the earlier analysis of women with Zika in US states showed that 15% had babies with birth defects if they transmitted the disease in the first trimester.\n&gt; \n&gt; \"Those numbers are actually similar because the confidence intervals are the same, and the earlier study was much smaller,\" explained Peggy Honein, PhD, MPH, co-lead of the CDC's Zika Response's Pregnancy and Birth Defects Task Force.\n&gt; \n&gt; Severity of birth defect outcomes was not dependent on whether or not a woman had symptoms of Zika in pregnancy. According to the study, 5% of symptomatic pregnancies resulted in Zika-related defects, and 7% of asymptomatic pregnancies did.\n&gt; \n&gt; \"This study shows why it is so important for pregnant women to be protected throughout their pregnancy,\" said Honein.\n&gt; All territories now using same case definition\n&gt; \n&gt; The study did not say where the 122 Zika-related births were located, but many questions about Puerto Rico and its surveillance of the mosquito-borne disease were raised by reporters. Puerto Rico has documented by far the most cases of Zika-related birth defects in the US territories.\n&gt; \n&gt; Schuchat said that as of now, all US territories were using the same case definition for Zika-related birth defects, including Puerto Rico.\n&gt; \n&gt; In another study published today in MMWR, researchers analyzed the measures taken by pregnant women in Puerto Rico to prevent Zika infection in 2016.\n&gt; \n&gt; Almost all women, 98.1%, reported using at least one measure to avoid mosquito bites in pregnancy. But only 45.8% reported wearing bug spray daily, and less than 1 of 10 said they wore long sleeves and pants daily in pregnancy.\n&gt; \n&gt; About forty percent (38.5%) said they abstained from sex or used condoms throughout pregnancy.\n&gt; \n&gt; \"Although respondents reported high levels of concern about Zika virus infection and of receipt of counseling by health care providers about using condoms to prevent sexual transmission, only approximately one in five women reported consistently using condoms throughout pregnancy,\" the authors said. \"The most common reasons for not using condoms were thinking that their partner did not have Zika virus and thinking that condoms were not needed during pregnancy.\"\n&gt; \n&gt; Three quarters, or 76.9%, of the 2,364 women who participated in the survey reported being tested for Zika virus by their healthcare provider during the first or second trimester of pregnancy. The CDC recommends women in Puerto Rico be tested for Zika in each trimester.\n&gt; \n&gt; See also:\n&gt; \n&gt; Jun 8 MMWR (\n&gt; \n&gt; Jun 9 MMWR (\n\n^(source: \n\nNote: This comment is also found in:  \n\n\n", "As of: 18 February 2016 - Countries and territories with recent local Zika virus transmission. **Countries and territories with recent local Zika virus transmission.**\n( \n\n*Based on data reported by 18 February 2016*\n\n\nThis table contains information on countries and territories that have recently experienced or are currently experiencing local Zika virus transmission.\n\n|\tCountry/Territory \t|\tAffected in the |\tAffected in the \t|\n|\t:-\t|\t:-\t|\t:-\t|\n|\t|\t**past 2 months**\t|\t**past 9 months**\t|\n|\tAmerican Samoa\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tAruba\t|\tSporadic transmission following recent introduction\t|\tYes\t|\n|\tBarbados\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tBolivia\t|\tSporadic transmission following recent introduction\t|\tYes\t|\n|\tBrazil\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tBonaire\t|\tSporadic transmission following recent introduction\t|\tYes\t|\n|\tCape Verde\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tColombia\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tCosta Rica\t|\tSporadic transmission following recent introduction\t|\tYes\t|\n|\tCuraçao\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tDominican Republic\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tEcuador\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tEl salvador\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tFiji\t|\tNo\t|\tYes\t|\n|\tFrench Guiana\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tGuadeloupe\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tGuatemala\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tGuyana\t|\tSporadic transmission following recent introduction\t|\tYes\t|\n|\tHaiti\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tHonduras\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tJamaica\t|\tSporadic transmission following recent introduction\t|\tYes\t|\n|\tMaldives\t|\tNo\t|\tYes\t|\n|\tMarshall Islands\t|\tSporadic transmission following recent introduction\t|\tYes\t|\n|\tMartinique\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tMexico\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tNew Caledonia\t|\tNo\t|\tYes\t|\n|\tNicaragua\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tPanama\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tParaguay\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tPuerto Rico\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tSaint Martin\t|\tSporadic transmission following recent introduction\t|\tYes\t|\n|\tSamoa\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tSolomon Islands\t|\tNo\t|\tYes\t|\n|\tSuriname\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tThailand\t|\tSporadic transmission following recent introduction\t|\tYes\t|\n|\tTonga\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tTrinidad and Tobago\t|\tSporadic transmission following recent introduction\t|\tYes\t|\n|\tVenezuela\t|\tIncreasing or widespread transmission\t|\tYes\t|\n|\tVanuatu\t|\tNo\t|\tYes\t|\n|\tUS Virgin Islands\t|\tSporadic transmission following recent introduction\t|\tYes\t|\n", "The unsexy truth about how to kill off mosquitoes and stop the Zika virus ", "NICHD is hosting an AMA today on Zika and child development. Join us and ask your questions! ", "Mothers of Babies Afflicted by Zika Fight Poverty, Despair - OMG News Today ", "Media Availability: Scientists Discover Potential Bacterial Indicator for Serious Intestinal Disease in Premature Infants (08MAR16) ", "If a man is bitten and infected by Zika, will he carry it forever? Basically what I am asking is, if you get infected by Zika, does that mean all of your potential children will be deformed from that point on?", "Pregnancy Outcomes After Maternal Zika Virus Infection During Pregnancy — U.S. Territories, January 1, 2016–April 25, 2017  &gt; **CDC notes 5% rate of Zika birth defects in US territories | Jun 08, 2017**\n&gt; \n&gt; Today the Centers for Disease Control and Prevention (CDC) released its first analysis of Zika-related birth defects in US territories, concluding that 5% of all pregnancies with a confirmed Zika diagnosis in the mother resulted in a birth defect.\n&gt; \n&gt; The study was published in Morbidity and Mortality Weekly Report (MMWR).\n&gt; \n&gt; \"These findings are consistent with an earlier report we produced on women in the 50 states who had Zika-affected pregnancies,\" said Anne Schuchat, MD, the acting director of the CDC, in a press briefing.\n&gt; \n&gt; The study tracked the outcomes of 2,549 pregnant women in territories (including Puerto Rico, Micronesia, and America Samoa) who had lab-confirmed Zika infections in pregnancy from Jan 1, 2016, to Apr 25 of this year. About 5%, or 122, of the babies born to these women had Zika-associated birth defects, ranging from hearing loss to severe microcephaly, or abnormally small heads.\n&gt; Largest analysis to date\n&gt; \n&gt; \"This is the largest analysis of completed pregnancies with Zika to date,\" said Schuchat. \"The Zika virus poses a serious threat to women and babies, regardless of when disease is diagnosed.\"\n&gt; \n&gt; The report compared the outcomes in relation to which trimester the mother was diagnosed in: If diagnosed in the first trimester, there was an 8% chance a baby would be born with a Zika-related birth defect. That number dropped slightly, to 5% and 4% in the second and third trimesters, respectively.\n&gt; \n&gt; Schuchat said that the earlier analysis of women with Zika in US states showed that 15% had babies with birth defects if they transmitted the disease in the first trimester.\n&gt; \n&gt; \"Those numbers are actually similar because the confidence intervals are the same, and the earlier study was much smaller,\" explained Peggy Honein, PhD, MPH, co-lead of the CDC's Zika Response's Pregnancy and Birth Defects Task Force.\n&gt; \n&gt; Severity of birth defect outcomes was not dependent on whether or not a woman had symptoms of Zika in pregnancy. According to the study, 5% of symptomatic pregnancies resulted in Zika-related defects, and 7% of asymptomatic pregnancies did.\n&gt; \n&gt; \"This study shows why it is so important for pregnant women to be protected throughout their pregnancy,\" said Honein.\n&gt; All territories now using same case definition\n&gt; \n&gt; The study did not say where the 122 Zika-related births were located, but many questions about Puerto Rico and its surveillance of the mosquito-borne disease were raised by reporters. Puerto Rico has documented by far the most cases of Zika-related birth defects in the US territories.\n&gt; \n&gt; Schuchat said that as of now, all US territories were using the same case definition for Zika-related birth defects, including Puerto Rico.\n&gt; \n&gt; In another study published today in MMWR, researchers analyzed the measures taken by pregnant women in Puerto Rico to prevent Zika infection in 2016.\n&gt; \n&gt; Almost all women, 98.1%, reported using at least one measure to avoid mosquito bites in pregnancy. But only 45.8% reported wearing bug spray daily, and less than 1 of 10 said they wore long sleeves and pants daily in pregnancy.\n&gt; \n&gt; About forty percent (38.5%) said they abstained from sex or used condoms throughout pregnancy.\n&gt; \n&gt; \"Although respondents reported high levels of concern about Zika virus infection and of receipt of counseling by health care providers about using condoms to prevent sexual transmission, only approximately one in five women reported consistently using condoms throughout pregnancy,\" the authors said. \"The most common reasons for not using condoms were thinking that their partner did not have Zika virus and thinking that condoms were not needed during pregnancy.\"\n&gt; \n&gt; Three quarters, or 76.9%, of the 2,364 women who participated in the survey reported being tested for Zika virus by their healthcare provider during the first or second trimester of pregnancy. The CDC recommends women in Puerto Rico be tested for Zika in each trimester.\n&gt; \n&gt; See also:\n&gt; \n&gt; Jun 8 MMWR (\n&gt; \n&gt; Jun 9 MMWR (\n\n^(source: \n\n\n\n CDC is on plum island (a.k.a. animal testing island), yes? ", "Rubio: No abortions for Zika-infected women ", "Zika: What Happened to U.S. Pregnant Women with Zika ", "Puerto Rico may be underreporting Zika-affected births | (18APR17) ", "Zika virus and connected flight in Brasil and Argentina Hello,\n\nI am going to Patagonia (Chile) from Europe with my pregnant wife and we have to change flights in Sao Paulo (Brasil) and Buenos Aries (Argentina). \nWe have to wait 3 hours in Brasil and we have to change airport in Buenos Aires (also 3 hours time between flight).\n\nHow worried should we be regarding Zika virus for those 3+3 hours of exposure from being in Brasil/Argentina?\n\nThanks!", "Zika strain detected in Africa for the first time: WHO ", "Needs to be said The amount of conjecture is growing.    \n\nThere have been lines drawn between Microcephaly and the Zika virus.   \nThere have been lines drawn between GM Mosquitoes and the Zika virus.  \nThere have been lines drawn between Larvicide in drinking water and the Zika virus.    \n\nWe have reading stories from weeks ago stating (  More recently those stating a ( and that it dosen't.  Before those stories, one of how GM mosquitoes survived in the wild and created the problem.  \n\nThose and more articles you will find linked below and soon after you have read this post, more will be found above.   \n\nThe only thing known to be true is the world has no fact based information on the nature or scope of the problem Zika presents.  The northern hemisphere sits on the cusp of spring and the return of mosquito season. A lot of fretting is going on and mosquito repellent companies are looking forward to a great year financially.   \n\nI do not know if Zika is a contributing factor to Microcephaly or any other birth defect.  Just as I do not know whether GM Mosquitoes or a larvicide contributed to the outbreak.   \n\nWhat I do know is the scientific and medical communities are just now beginning to search for answers and it will take months for them to provide the world with their conclusions.   \n\nNow we have the blogosphere's tying their fund-raising banners to the matter and spinning the tale through the color of their oft biased lens.  Same can be said of Media agencies. \n\nBeing cautious with where I place my beliefs inoculates me from an abundance of future regret.  The blogosphere and media are less connected to a *'moral compass'* and a good number of them totally disregard them after finding a less arduous method of paying the bills.   \n\nDo we have a problem?   \n\nYes, we most definitely do.   \n\nBut as with all the problems that we have faced before, from how to control fire to the ebola virus, we will solve it.  As a species it is what we do.  \n\nI have yet to see anything positive ever come out of a fearful mind.  \n\nHave you ever heard the story about (  \n\nEdited: Typo and failing to include media agencies overlooked when making the original post. \n", "Virus Zika: Diagnosticado en Cataluña un caso importado de zika en una embarazada | Cataluña ", "'Striking' Results from Early Zika Vaccine Trial ", "Race to fast-track Zika trials as 12 groups seek vaccine ", "How To Build a Human. Visually connecting with normal Human Gestation. ", "First local Zika cases noted in India; studies explore transmission | (26MAY17) CIDRAP ", " Unsure about zika and pregnancy.  It is very disappointing your doctors have not been better communicators with you - I am sorry that you have not had your concerns more adequately addressed by them. I would recommend re-contacting your OB for an in-person appointment so that they can answer all of your questions as it pertains to your situation. The following information is general in nature, and so may change based on your circumstances and OB's advice, but hopefully can address some of your concerns. I work in this field, but I am not a medical doctor.\n\nFirstly, you and your fiancé should only use condoms from now until you are given the okay to stop from your OB. This is because the zika virus can be sexually transmitted, and if you or your fiancé was infected in December, you could transfer/have transferred it to each other if you have been having unprotected sex. However on the chance that it has not transferred, you do not want to risk that he transfers the virus to you and therefore your baby. Do not share sex toys, and always use a condom when having sex (oral, anal, or vaginal) for the rest of the pregnancy. \n\nZika can last in semen for at least 6 months, even if a man receives a negative blood test for Zika. Testing semen for Zika is difficult to interpret. This is why they are doing an antibody test. The antibody test will be on you - a blood test – not on her. It will test for antibodies in your blood that shows if you were infected with Zika. This test can be done up to 12 weeks after exposure, so you will want to do it asap. As we are in week 7 of this year, your dates are a little off (9 weeks would indicate possible pregnancy when you were exposed, but this is calculated on your last menstrual period not conception). Either way, you are still within that 12 week window, but the sooner the better. If the results of the test are positive, or unclear, the doctors will forward it on for a second test to be done by the CDC (called a PRNT) for complete confirmation. \n\nEven if it is positive, not every pregnant mother infected with Zika will result in a baby with Zika Congenital Syndrome. The CDC advises that \"Not all babies born with congenital Zika infection will have all of these problems. Some infants with congenital Zika virus infection who do not have microcephaly at birth may later experience slowed head growth and develop postnatal microcephaly. Recognizing that Zika is a cause of certain birth defects does not mean that every pregnant woman infected with Zika will have a baby with a birth defect. It means that infection with Zika during pregnancy increases the chances for these problems. Scientists continue to study how Zika virus affects mothers and their children to better understand the full range of potential health problems that Zika virus infection during pregnancy may cause.\"\n\nFinally, what are the chances of getting Zika in Ft Lauderdale in December 2016? The type of mosquito that spreads Zika only has a small range that it lives in. In December 2016, Zika was present in Miami Beach mosquitoes but was not identified in Ft Lauderdale mosquitoes. As of today, based on publicly available information, mosquitoes in Ft Lauderdale do not have Zika. I am not sure which \"yellow zone\" they are talking about, as the CDC has not publicly changed any status.  Even if there is a newly identified outbreak of Zika now, that does not mean that Ft Lauderdale mosquitoes had Zika back in December.\n\nAssuming all of the above, your doctor is doing the right thing getting you tested but I do not personally think there is a need to panic. There is no simple \"risk level\" as there are so many assumptions and variables. However, if it were me I would 1) get the antibody test done asap, and 2) only use condoms if you choose to have sex (oral, anal, vaginal) during the rest of the pregnancy. Your risk, from the information above, appears to be low – if it were me, I would be \"alert but not alarmed\". \n\nA lot of this is available on the CDC website but it is highly technical and full of jargon. I hope that this somehow helps, but know that your OB really should be doing a better job communicating with you and it is not your fault that you feel overwhelmed or panicked. This is a CDC page for new moms whose babies have been exposed to Zika. While you may not even be in that situation, it does provide some good advice about how to engage with your health care providers when talking about these highly uncertain and worrisome issues:  \n\nI hope you, your fiancé and your little one have a very healthy and safe start to your new lives together.\n\n &gt; Finally, what are the chances of getting Zika in Ft Lauderdale in December 2016?\n\nAedes mosquitoes have survived in the Washington DC sewer system for at least four years.  Winters in DC are considerably harsher than in Fort Lauderdale. \n\nAlso needing to be taken into account is Aedes being indoor pests.  They do not make a buzzing sound we commonly associate with mosquitoes, nor does their feeding leave an irritating bite mark.   Having aedes aegypti mosquitoes is different to having aedes aegypti mosquitoes with Zika.", "CDC says in full outbreak mode in response to Zika ", "WHO Latest Zika situation report (04MAR16) ", "Department of Health Daily Zika Update | (08AUG16) ", "Zika situation report (17MAR16) ", "ECDC-Countries and territories with local Zika transmission (08MAR16) ", "Senate Democrats Block GOP's Zika Funding Bill ", "As Zika Virus Spreads, New Survey Tracks Perceptions of U.S. OB/GYNs and Women | InCrowd ", "Confronting a Lingering Question About Zika: How It Enters the Womb ", "Are you pregnant? Pregnant? Please take this online survey and help Zika researchers at UTMB.\n\nSurvey Link:\n\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nYou are being invited to participate as a subject in the research project entitled \"Knowledge about the Zika virus among pregnant women in the United States\" under the direction of Abbey B. Berenson, MD, PhD, Professor in the Department of Obstetrics &amp; Gynecology, and Director of the Center for Interdisciplinary Research in Women’s Health at The University of Texas Medical Branch (UTMB Health). This study uses an online survey to gather information on knowledge about the Zika virus and travel information among pregnant women in the United States. The University of Texas Medical Branch (UTMB) is a component of the University of Texas System located in Galveston, Texas, United States. UTMB's primary missions are health sciences education, medical research (it is home to the Galveston National Laboratory) and health care services. The Center for Interdisciplinary Research in Women's Health promotes interdisciplinary research related to the health of women across the life span. This study has been approved by the Institutional Review Board at UTMB. Data will be stored on the principal investigator’s UTMB computer and the UTMB server. The computer is password protected and the office will be locked when the principal investigator is not present. No individually identifying information will be reported. These data protection procedures are likely to be highly effective in minimizing any risk to participants. Breaches of confidentiality will be immediately reported to the Institutional Review Board.", "CDC to begin reporting pregnancy outcomes of women with Zika ", "Florida tests bacteria-infected mosquitoes to kill off bugs | (18APR17)  Is it really a good idea to infect Mosquitos like this if there is a chance of mutations - nature sure bites us back one way or another Reports on testing in other countries^1 and information about Wolbachia^2 reveal it as a candidate for consideration. A natural means of dealing with the problem of mosquitoes spreading infectious disease.^3\n\n\n^1 ( Posted: 7 months ago \n\n^1-2 (\n\nand elsewhere (summary follows), ^3 *\"Wolbachia Blocks Currently Circulating Zika Virus Isolates in Brazilian Aedes aegypti Mosquitoes\"* (URL: \n\n&gt; **Summary**\n&gt; \n&gt; The recent association of Zika virus with cases of microcephaly has sparked a global health crisis and highlighted the need for mechanisms to combat the Zika vector, Aedes aegypti mosquitoes. Wolbachia pipientis, a bacterial endosymbiont of insect, has recently garnered attention as a mechanism for arbovirus control. Here we report that Aedes aegypti harboring Wolbachia are highly resistant to infection with two currently circulating Zika virus isolates from the recent Brazilian epidemic. Wolbachia-harboring mosquitoes displayed lower viral prevalence and intensity and decreased disseminated infection and, critically, did not carry infectious virus in the saliva, suggesting that viral transmission was blocked. Our data indicate that the use of Wolbachia-harboring mosquitoes could represent an effective mechanism to reduce Zika virus transmission and should be included as part of Zika control strategies.", "Department of Health Daily Zika Update ", "Washington’s first case of Zika virus found at Thurston County hospital ", "CDC's New Miami Zika 'Red Zone' Means Stay Out for Pregnant Women ", "Brazilian scientists find new Zika-linked brain disorder in adults ", "The Zika Virus: Will an outbreak occur? ", "Visualizing the Cluster of Microcephaly Cases and Zika Virus Disease in Brazil ", "The global distribution of the arbovirus vectors Aedes aegypti and Ae. albopictus | (13MAY16) ", "The Zika virus is here to stay in India, Kanpur just latest victim ", "Panama finds first case of microcephaly tied to Zika ", "Scientists Investigate How Viruses Like Zika Cause Birth Defects ", "What Is the Value of Different Zika Vaccination Strategies to Prevent and Mitigate Zika Outbreaks? | 13DEC18 ", "10 ZIKA Virus Facts, Symptoms and Locations ", "TED Talk - Hadyn Parry: Re-engineering mosquitos to fight disease ", "Control of Aedes aegypti in a remote Guatemalan community vulnerable to dengue, chikungunya and Zika virus: Prospective evaluation of an integrated intervention of web-based health worker training in vector control, low-cost ecological ovillantas, and community engagement (11APR16) ", "Active in Jamaica? Is Zika still a concern in Jamaica?? Just found out I am pregnant and have a trip in August Not at all Awareness is of paramount importance when traveling.  Forewarning allows travelers the ability to avoid problems.  Here are three links you might find useful: \n\n* (\n\n* (\n\n* (", "See Effects of Zika Virus with Detailed Zika Background ", "New Map Shows Where Zika Mosquitoes Live in U.S. ", "Report From Zach’s Research: (Nasdaq: $AEMD): Q1 Results. Add #Zika to List of Potential Targets ", "Botched Zika testing at D.C. public health lab was a failure of ‘basic arithmetic’ | (25FEB17) *^emphasis ^added*\n\n&gt;**Botched Zika testing at D.C. public health lab was a failure of ‘basic arithmetic’**\n\n&gt;When Anthony Tran took over the District’s public health lab late last year, he had a feeling something was wrong with its testing for the Zika virus. He had just come from the public health lab in New York City, where technicians had been finding markers for Zika in the blood of arriving travelers almost every day. In the smaller, but still international, city of Washington, the same test was negative — every time.\n&gt; \n&gt; Soon, U.S. health officials joined in Tran’s concern: Samples supplied by the federal government of the frightening, mosquito-borne virus that were tested in the lab as a control were appearing as if they contained no virus.\n&gt; \n&gt; “I knew then that something was tremendously wrong,” Tran said late last week in an interview. He halted testing, and with help from analysts at the Centers for Disease Control and Prevention, traced the problem to a mistake that any high school chemistry student could understand.\n&gt; \n&gt; There were two types of solution the District could have purchased to conduct a phase of the test. One bottle came marked with a “D,” for diluted, and the other with a “U”, for undiluted. D.C. lab workers had purchased the diluted version, Tran said, and then mistakenly watered it down as if it was the more concentrated one, weakening the ability to detect for Zika.\n&gt; \n&gt; For a public health lab to commit such an error once would be an embarrassment in the high-stakes testing of Zika, which has potentially devastating consequences for pregnant women, scientists and federal health officials say. **That the District lab — which is also a first line of defense in screening bioterrorism threats — repeated the mistake daily, and without anyone catching it for more than six months, amounts to a more systemic and worrisome failure, experts said.**\n&gt; \n&gt; Interviews and public documents show that the debacle unfolded over a period of months last year in which the District lab was in a state of turmoil — understaffed, lacking permanent leadership, spread thin on competing projects, and relying on new employees to test for the emerging public health threat in Zika.\n&gt; \n&gt; “A relatively inexperienced staff and a lack of leadership — that is a bad combination,” said Kelly Wroblewski, director of infectious diseases for the Association of Public Health Laboratories, which works to safeguard the integrity of public health labs nationwide. “The positive here is that the lab does have new leadership and he caught the error quickly, even though the situation is already really, very unfortunate.”\n&gt; \n&gt; Since D.C. officials announced the error on February 9, public health officials in a network of nearly 50 labs studying Zika have questioned how it could have gone so wrong. It was the only jurisdiction in the country to have mishandled the testing.\n&gt; \n&gt; In the District, the mishap has shaken public confidence in Zika testing and, attorneys say, could result in millions of dollars in legal claims. And all of that may pale in comparison to the effects that the botched tests may have on a handful of D.C. families.\n&gt; \n&gt; At least nine pregnant women in the nation’s capital were caught in the faulty testing between July and December of last year, D.C. officials said Thursday. The women were told they did not have Zika when in fact new testing by a CDC lab in Colorado shows that the women did have antibodies that could signal the presence of the virus. Follow-up tests on eight have been inconclusive and one has been confirmed as having a Zika infection.\n&gt; \n&gt; District officials say they do not know how far along any of the women were in their pregnancies when they were wrongly told they were healthy. The District also does not know if any of the women have since given birth.\n&gt; \n&gt; Zika is primarily transmitted through the bite of an infected mosquito but it can also be passed through sex, even if the infected person shows no symptoms.\n&gt; \n&gt; Public health officials say they have relayed the new test results to the women’s health care providers, and they are girding for the number of new Zika patients to rise as retesting is completed for the final third of the 300 pregnant women the District says were inaccurately tested.\n&gt; \n&gt; According to a study in December, about 6 percent of pregnant women believed to be infected with Zika in the United States had a baby or fetus with at least one birth defect related to the viral infection last year. Most suffered from severe microcephaly, characterized by abnormally small head size and, often, an underdeveloped brain.\n&gt; \n&gt; But babies infected with Zika are not always obvious. Some problems stemming from infection may not show up until a year after birth or longer and can include hearing loss, irritability, difficulty swallowing, and cognitive, sensory and motor-skill difficulties.\n&gt; \n&gt; That means the fallout in the District may not be felt for some time.\n&gt; \n&gt; **‘A mad scramble’**\n&gt; \n&gt; Tucked away in the District’s new glass-and-steel forensic sciences building, a couple of blocks south of the National Air and Space Museum, are a group of scientists who quietly toil away on some vitally important work.\n&gt; \n&gt; At inauguration time, they test the food served at high-dollar balls for food-borne illnesses and contamination. When a suspicious, white powder is found in the District, the lab is one of the first to test the substances for biological weapons. And on more mundane days, the staff of the Public Health Laboratory Division tests water pollution in the Potomac and helps to identify influenza strains that should be included in the next year’s vaccines.\n&gt; \n&gt; As a division of the District’s Forensic Sciences Department, the lab was rarely in the news.\n&gt; \n&gt; By comparison, the lab’s sister division, the crime lab, had to halt DNA testing in 2015, after questions surfaced about the accuracy of its work.\n&gt; \n&gt; The scandal forced out the department’s former director and D.C. Mayor Muriel E. Bowser (D) brought in Jenifer Smith, a former FBI forensics expert, to clean house and restore the lab’s reputation.\n&gt; \n&gt; According to two officials familiar with Smith’s rebuilding plan, as well as public budget documents from the agency, Smith’s top priority early last year was restarting DNA testing at the crime lab.\n&gt; \n&gt; In the year before it confronted Zika, the public health lab was shedding its most experienced staff — for a variety of reasons.\n&gt; \n&gt; Former director Alpha Diallo, a native of Guinea, left to fight Ebola in Africa. The lab’s head of virology, Anicet Dahourou, and its head of microbiology, Morris Blaylock, also resigned and took jobs with the CDC in Atlanta.\n&gt; \n&gt; In March 2016, with Zika as a looming threat, three of the lab’s six quality assurance jobs were vacant.\n&gt; \n&gt; Maurice Knuckles, who had directed the office a decade earlier, was brought back from semiretirement by Smith to run things on an interim basis, officials said.\n&gt; \n&gt; Blaylock, reached in Atlanta, said preparing for Zika in the early months of last year with a thin staff was “a mad scramble.”\n&gt; \n&gt; The District wanted to join dozens of states that were applying to the CDC for the authority to conduct their own Zika tests instead of shipping them off to the federal agency. To apply, the lab was sent a panel of blind tests by the CDC and had to replicate positive and negative results achieved at a federal lab.\n&gt; \n&gt; The D.C. health lab successfully did so and got permission in late May to begin its own Zika testing program, Tran said.\n&gt; \n&gt; Smith said the lab hired four people to conduct the tests and trained them for weeks before Zika testing was launched on July 14.\n&gt; \n&gt; Part of the preparation process involved setting up quality controls, testing procedures and what Tran described as a small “manufacturing plant” of solutions and coatings to conduct the tests.\n&gt; \n&gt; In an interview, Smith and Tran said it was unclear if the lab employees had used the appropriate dilution in the spring when the lab passed the CDC test.\n&gt; \n&gt; But Tran said that it is now clear that by July, workers had begun the lab’s Zika testing with an over-diluted solution.\n&gt; \n&gt; It was not caught earlier, Tran said, because even with a weakened solution, daily control tests still showed positive results, at least, until a final batch was mixed late last year.\n&gt; \n&gt; Blaylock said the loss of the lab’s virology director was a major gap, and any sustained campaign of virus testing would have exposed weaknesses in the team’s staffing.\n&gt; \n&gt; “We could deal with an emergency response, we could manage it for a short time, but anything long-term, it was going to wear down that team because it was so short-staffed,” he said. “I know they were trying to get personnel on board, I do know that was the primary challenge.”\n&gt; \n&gt; Smith dismissed the idea that the botched tests were the result of a newly hired staff or lack of seasoned leaders in key positions. “This is not an issue of staffing,” she said.\n&gt; \n&gt; **‘Something is wrong’**\n&gt; \n&gt; The faulty solution was not the failure point that Tran noticed in the District’s Zika testing procedures when he joined the lab late last fall.\n&gt; \n&gt; Concerned about the high number of negative results, Tran began double-checking the team’s math and found an error, he said. Lab workers had fumbled a formula to calculate test results, skewing some inconclusive ones toward negative results.\n&gt; \n&gt; “I started to investigate and the first thing I found was a really, a quite basic arithmetic error,” he said.\n&gt; \n&gt; That discovery led Tran to stop the testing and recalculate the score for the tests done since July.\n&gt; \n&gt; None of the recalculations resulted in a shift to a clearly positive result, he said. Tran was prepared to resume testing in the lab when a new problem developed with the daily control tests: “Now, we were getting no reaction through the plates and I said, ‘Something is wrong. . . . We need to do a deep dig and figure out what is wrong.’ ”\n&gt; \n&gt; On a conference call with the CDC’s Zika experts in December, Tran was stumped. The analysts had gone over all the other complicated calibrations and procedures and everything seemed right. Then one asked a basic question. What type of solution had the District purchased?\n&gt; \n&gt; Tran had never thought to check. “That was huge,” he said. “The dilution factor was a problem since the day we began.”\n&gt; \n&gt; Smith said that no one involved in the mistake still works at the lab, but she declined to say how many employees were affected or if they resigned under pressure. Bowser last week said no one had been fired.\n&gt; \n&gt; Smith said she thought the District’s trouble would someday be held up as an example of something more than a mistake.\n&gt; \n&gt; “We are going to learn from this; the field of science will advance,” Smith said. “This is a situation where you had positive controls working, but the test is at a level where it gave a different result. . . . It is a great example in the grayness of the world we work in. . . . This is not the instant pregnancy test, these are more complicated tests.”\n&gt; \n&gt; Tran said he knew the lab would attract intense scrutiny over the mistake but never hesitated to go public.\n&gt; \n&gt; “I knew what was going to be happening, but there was no other decision for me to make,” he said. “You need to give the best care because there is no cure for this.”\n \nsource: \n\n\n", "WHO | Zika situation report (31MAR16) ", "Prevent Aedes Mosquito Breeding ", "PLOS Neglected Tropical Diseases: Zika Virus Outbreak in Haiti in 2014: Molecular and Clinical Data | (25APR16) ", "Chris Christie's call for Zika quarantines is just as silly as his call for Ebola quarantines ", "Race for Zika vaccine gathers momentum as virus spreads ", "Australia pledges aid to help Tonga with Zika virus ", "Florida announces Zika case hundreds of miles from Miami ", "Zika Virus Outbreak in Rio de Janeiro, Brazil: Clinical Characterization, Epidemiological and Virological Aspects | PLOS (12APR16) ", "U.S. Scientists Are Starting From Ground Zero With The Zika Vaccine ", "Elements of transgenic disease-vector control (Part 1: setting the scene) ", "Association between Zika virus and Guillain-Barre syndrome, which is marked by rapid muscle onset weakness. Serious cases of this disorder can lead to paralysis. ", "Zika: 2.6 Billion People Could Be at Risk, Scientists Say ", "Before you panic:  ", "Fear of Zika Virus Is Putting a Damper on Destination Weddings ", "Uganda Discovered the Zika Virus. And the Solution for It. ", "WHO | Damn the mosquitoes! Full speed ahead! (15MAR16) ", "Rio Olympics 2016: South Korea unveils 'zika-proof- uniforms ", "Help Zika!7 months pregnant wife 10 miles from Wynwood, Miami. In need of a mosquito repeller expert. Hi Reddit, as you may have noticed there were cases of Zika in Miami, me and my wife who is 7 months pregnant are 10 miles from Wynwood and as you may know Florida these days is very humid and hot ambient also our house is not that well insulated so we occasionally see mosquitoes, need some help with the following.\n\nBest ways to repel mosquitoes indoors that are preggie-safe?\n\nWould a standing fan help prevent bites at night while sleeping?\n\nThis one i believe is important, which % of deet repellent should i buy for me and my wife?\n\nWould a mosquito zapper really help?\n\nAnd any other advice you may have I really need some help as soon as possible so thank you in advance for the help.\n", "Zika virus-microcephaly connection hunted in Brazil ", "What you need to know about the Zika virus ", "Zika vaccines work in monkeys, boosting hopes for people ", "Brazil opens probe as cases of Zika babies defy predicted patterns ", "Zika virus: Mosquitoes now spreading the disease near Miami's Little River neighborhood ", "ECDC: Association of Zika virus infection with Guillain–Barré syndrome (Dated: 02MAR16) ", "Zika virus's other looming threat - CNN.com ", "For Pregnant Women | Zika virus ", "WHO | Zika Outbreak: who is Global Emergency Response Plan (updated 03MAR16) ", "Inovio Pharmaceuticals and GeneOne Life Science Receive Approval for First-in-Man Zika Vaccine Clinical Trial | (20JUN16) ", "UN Readies Nuclear Solution to Destroy the Zika Virus ", "Controlling Mosquitoes at Home (28APR16) ", "There is \"accumulating evidence\" of a link between the Zika virus and two neurological disorders, microcephaly and Guillain-Barre syndrome, a senior World Health Organization official said on Friday. ", "Spectre of Ebola haunts Zika response ", "Scientists call for intensified research on Zika and microcephaly ", "Reporting change, rising cases vault US Zika pregnancy cases to 279 | (20MAY16) ", "Zika’s frustration: After you travel, you will not know if you do not have it ", "WHO | Zika situation report (21MAR16) ", "Genetically modified mosquitoes for Zika fight worry Floridians ", "Zika virus gene sequence decoded by China ", "Huge study: Of 12,000 pregnant women with Zika, NONE had a baby with microcephaly ", "Zika Has Been in Brazil Longer Than Anyone Thought: Study ", "UW-Madison researchers to study Zika virus in monkeys ", "Background: Zika virus outbreak on Yap Island, Federated States of Micronesia. **Zika virus outbreak on Yap Island, Federated States of Micronesia.**\n\n**Authors**: Mark Duffy, Tai-Ho Chen, W Hancock, Ann Powers, Jacob Kool, Robert Lanciotti, Moses Pretrick, Maria Marfel, Stacey Holzbauer, Christine Dubray, Laurent Guillaumot, Anne Griggs, Martin Bel, Amy J Lambert, Janeen Laven, Olga Kosoy, Amanda Panella, Brad J Biggerstaff, Marc Fischer, Edward Hayes  \n\nPublication date: 2009-06-10  \nPubMed ID: 19516034  \nDOI: 10.1056/NEJMoa0805715  \n\n\n* In 2007, physicians on Yap Island reported an outbreak of illness characterized by rash, conjunctivitis, and arthralgia. \n\n* Although serum from some patients had IgM antibody against dengue virus, the illness seemed clinically distinct from previously detected dengue. \n* Subsequent testing with the use of consensus primers detected Zika virus RNA in the serum of the patients but no dengue virus or other arboviral RNA. \n* No previous outbreaks and only 14 cases of Zika virus disease have been previously documented. \n* We obtained serum samples from patients and interviewed patients for information on clinical signs and symptoms. \n* Zika virus disease was confirmed by a finding of Zika virus RNA or a specific neutralizing antibody response to Zika virus in the serum. \n* Patients with IgM antibody against Zika virus who had a potentially cross-reactive neutralizing-antibody response were classified as having probable Zika virus disease. \n* We conducted a household survey to estimate the proportion of Yap residents with IgM antibody against Zika virus and to identify possible mosquito vectors of Zika virus. \n* We identified 49 confirmed and 59 probable cases of Zika virus disease. \n* The patients resided in 9 of the 10 municipalities on Yap. Rash, fever, arthralgia, and conjunctivitis were common symptoms. \n* No hospitalizations, hemorrhagic manifestations, or deaths due to Zika virus were reported. \n* We estimated that 73% (95% confidence interval, 68 to 77) of Yap residents 3 years of age or older had been recently infected with Zika virus. Aedes hensilli was the predominant mosquito species identified. \n* This outbreak of Zika virus illness in Micronesia represents transmission of Zika virus outside Africa and Asia. \n* Although most patients had mild illness, clinicians and public health officials should be aware of the risk of further expansion of Zika virus transmission. \n\n2009 Massachusetts Medical Society\n\n^Information ^presented ^in ^point ^form ^for ^easier ^dissemination  \nsource: (", "Zika Virus Health Information Resource Guide | U.S. Dept of Health &amp; Human Services ", "Texas reports first local Zika case of 2017 | (26JUL17) ", "Zika outbreak: Where is the virus spreading? ", "2018 Case Counts in the US | Zika Virus | 09APR19 ", "Locally Transmitted Zika Virus Infects 41 in Singapore ", "More bug spray, less dining al fresco planned in Zika zone ", "Rapid spread of emerging Zika virus in the Pacific area ", "Traveling to Thailand - No Children Yet  This may address the questions you have, (\n\nAdditionally there is this:\n\n&gt; Travelers considering pregnancy:\n&gt;\n&gt;* Before you or your partner travel, talk to your doctor about your plans to become pregnant and the risk of Zika.\n&gt;\n&gt;  * Wait before trying to conceive.\n&gt;\n&gt;  * 3 months after you return (or from the start of symptoms) if you are a man or a couple traveling together\n&gt;2 months after you return (or from the start of symptoms) if you are a woman and your male partner does not travel\n\nAs a layperson with interest in the matter, but no professional or specialized knowledge on the topic, it is my opinion that if in similar circumstance, when planning the pregnancy, both of us would undergo ( as a component of the general blood testing.  \n\n\n\n\n\n\n\n\n\n And, though apologies if it is stating the obvious, as zika is carried by mosquitoes make sure you do all you can to avoid being bitten - sprays, nets at night if they are recommended for the area, long sleeves etc. Protects you from more than just zika, too! \n\nEnjoy the holiday. Hi, Canadian government still says to wait 6 months for both of you after your travels. New stats indicate that it is probably leaving your body system after 3 months but just to be sure, you should continue to use birth control. Enioy your trip!", "Calls for Rio Olympics to be moved or postponed because of Zika virus ", "CDC scientist challenges accuracy of Zika test | (29SEP16) ", "Interim Guidance for Interpretation of Zika Virus Antibody Test Results | (31MAY16) ", "Colombia's First 'Probable' Microcephaly Case Is Reported ", "Health advisories in Zika-affected countries may have prompted more women to seek abortions ", "Zika virus: Latin America’s ills compound crisis ", "Cities, associations can protect residents from Zika ", "CDC expects Zika transmission via mosquitoes in U.S. ", "ZIKA - Temephos and Pyriproxyfen among others thoughts ", "Zika virus: Visitors to the Dominican Republic account for more than a fifth of the travel-related infections in the United States ", "Zika persistence in semen (&lt;10 or &gt;93 days) ", "RPT-Zika virus may hide in organs protected from the immune system ", "Ohio Department of Health confirms first case of Zika in Ohio ", "The Zika Virus and Brazilian Women’s Right to Choose ", "More Zika in the US as RNA vaccine gets funding ", "First pregnant woman in Austria tests positive for Zika ", "Pandora's box: how GM mosquitos could have caused Brazil's microcephaly disaster ", "Insight - Doctors puzzle over severity of defects in some Brazilian babies ", "is there REALLY a ZIKA EPIDEMIC in PUERTO RICO? ", "WHO | Zika virus and potential complications: Questions and answers (22MAR16) ", "America, unlike Congress, cannot take a vacation from Zika virus (KCStar editorial) ", "Brazil authorizes forced entry to private property to fight Zika ", "Peru finds local Zika cases; report supports complication links | (03MAY16) ", "Utah caregiver may have contracted Zika from man who died | Summary &amp; Links |(18JUL16) ", "Zika Thailand confirms 2 cases of virus-linked microcephaly ", "Mutations Acquired Trans-Pacific May Be Key to Changes in Zika Severity ", "No One Knows Who Is Blocking US Funding For Zika Treatment ", "Pregnant women warned against Zika travel: Public Health England has strengthened its advice on Zika, saying pregnant women should postpone non-essential travel to areas with disease outbreaks. ", "Children Who Get Zika After Birth Tend Not to Fall Seriously Ill, Study Finds ", "Zika Virus has it is first case in New Zealand  ", "PAHO - Zika Epidemiological Update | (28AUG17) CIDRAP summary in comments  &gt; **Small Zika increases noted in a few Americas countries**\n&gt; \n&gt; Mexico, Belize, and Costa Rica are among the few Americas countries reporting small increases in Zika virus activity, the Pan American Health Organization (PAHO) said in its Aug 25 epidemiologic update.\n&gt; \n&gt; In Mexico, the number of Zika cases rose alongside increasing dengue activity between the middle of April through early July. A little more than half of the confirmed cases so far this year are from three states: Nayarid, Tamaulipas, and San Luis Potosi. The number of confirmed cases in those states are higher than reported in 2015 through 2016.\n&gt; \n&gt; Tamaulipas borders counties in Texas where state health officials recently expanded Zika testing recommendations. It also borders Hildago County, where a local Zika case was recently confirmed.\n&gt; \n&gt; In Central America, slight increases in Zika cases were reported in Belize and Costa Rica between the middle of May and the middle of July. Elsewhere, sporadic cases continue to the reported from the Caribbean region, with cases declining in Puerto Rico over the last 10 weeks. In South America, cases are decreasing in most countries except for Ecuador, which saw activity increase early in the year and has reported nearly 300 suspected and confirmed cases per week over the past few months.\n&gt; \n&gt; PAHO said since late 2016, no new countries or territories in the region have confirmed new local Zika spread. One more country—Guyana—joined the list of countries reporting Zika-linked birth defects.\n&gt; \n&gt; Aug 25 PAHO Zika update ( (  \n&gt; Links are to auto download .PDF files.\n\n", "Possible case of sexual transmission of Zika virus ", "How a small Florida town is standing in the way of stopping Zika in the US ", "Greg Rutherford freezes sperm over Olympics Zika fears ", "How quickly will zika spread in Texas? (Travel) I am trying to get pregnant and am contemplating a trip to Austin in May. So...should I definitely uncontemplate? Or will it be cool enough until then that the virus likely will not spread North from the border until summer? I do not know much about how it is spreading and how far North it will get? - clueless Canadian Aedes mosquitoes survived in the Washington DC sewer system continuously for four (4) years which tempers considerations of seasonal factors.  DC has a far harsher winter than central Texas. \n\nIn May, Austin experiences daily temperatures ranging from lows in the lower 60's to highs in the mid 80's.  As you will likely be acclimatized to far cooler weather, doubt you will be inclined to wear full length pants and long sleeve shirts.  Both first line defense precautions.\n\nLong term health considerations, for both parents and children are unknown at this time.  The short term effects are known but not sufficiently understood. \n\n\n\n", "It is in the USA now...and it is an STI... ", "Beautiful Zikr La Ilaha illAllah Ya Hayyu Ya Qayyum by Qamar Zaman Untal...  ", "Caribbean Public Health Agency I noted  a lot of information  about  Zika for mostly the U.S   but there  is information  about  the Caribbean  which has many cases of Zika. This I  think should be shared.", "Zika virus: Mutated strain caused spike in brain defects in newborns ", "Zika virus infection – Saint Vincent and the Grenadines ", "FDA Research To Help Speed Development Of Zika Virus Vaccines And Therapeutics ", "ECDC - Zika Risk assessment ", "Addressing the Threat of Zika on the Ground in Puerto Rico | (02MAY16) ", "Whole-Blood Testing for Diagnosis of Acute Zika Virus Infections in Routine Diagnostic Setting | 22APR19 ", "Health News: Important Facts about the Zika Virus ", "Why Zika Is So Dangerous During Pregnancy ", "Banner Message Changes have been made to provided better information ", "Brazil's Zika virus outbreak worse than believed ", "Experts admit they know little about Zika virus as they gather to trade notes ", "Infant outcomes among women with Zika virus infection during pregnancy: Results of a large prenatal Zika screening program | (27JAN17) CIDRAP summary in comments  \n\n&gt; **US study: Only 0.2% of pregnant women infected with Zika while traveling**\n&gt; \n&gt; A study yesterday in the American Journal of Obstetrics and Gynecology found that 0.2% of US women they screened contracted Zika after traveling to endemic areas while pregnant.\n&gt; \n&gt; To conduct the study, Dallas researchers screened 14,161 pregnant women for travel to a Zika-affected country from Mar 14 to Oct 1, 2016. Four percent (610) of women reported such travel, and tests showed evidence of possible Zika virus infection in 29 (5.3%), thus the prevalence of asymptomatic or symptomatic Zika virus infection among pregnant women was 2 in 1,000. The vast majority of women (97%) with Zika had traveled to Central America.\n&gt; \n&gt; Researchers said that none of the 391 babies they analyzed from travel-affected pregnancies showed any signs of Zika infection, microcephaly, or reduced head circumference.\n&gt; \n&gt; This is one of the first prospective studies to measure risks for pregnant travelers. Babies born to women who contract Zika while pregnant can develop microcephaly, a congenital deformation that leads to small head circumference and developmental problems.\n&gt;  Great news", "Another Reason To Fear Zika: Mosquito-Borne Virus Mutates Quickly ", "More Zika mosquitoes found in Miami Beach | (03OCT16) ", "Track the Zika Virus Live Help Update the Map ", "Zika virus in Europe: Experts warn not to underestimate threat as mosquitoes become active this summer ", "Live Zika Map ", "Cape Verde Zika virus matches Americas' strain, threatening Africa |(20MAY16) ", "WHO | Zika virus situation reports - Zika virus, Microcephaly, and Guillain-Barré syndrome (31MAR16) ", "NIH officials accelerate timeline for human trials of Zika vaccine, saying they will now begin in the summer ", "Zika expert: ‘Microcephaly may just be the tip of the iceberg.’ ", "Zika ", "Zika virus: Scientists 'on the verge' of linking disease to paralysing Guillain-Barre syndrome ", "Zika tied to major eye defects in babies with microcephaly, study finds ", "A New Study Finds Wide Range of Zika Damage to Babies ", "CIO of Boston Children's on Zika virus tracking technologies ", "Scientists use 3D-printed ‘mini brains’ in Zika research ", "6% of U.S. kids born to Zika-infected moms have birth defects, CDC study finds | CBC News ", "Zika Linked to Guillain-Barré Syndrome, Study Finds ", "Zika Virus Birth Defects May Be 'Tip of the Iceberg', Experts Say ", "One Gene Mutation May Cause Zika's Devastating Birth Defects  Well written article, recommend reading.\n\nArticle links:\n\n*Science* (\n&gt;\n&gt; **Abstract**\n&gt;\n&gt;Zika virus (ZIKV) has evolved into a global health threat due to its unexpected causal link to microcephaly. Phylogenetic analysis reveals that contemporary epidemic strains have accumulated multiple substitutions from their Asian ancestor. Here, we show that a single serine to asparagine substitution (S139N) in the viral polyprotein substantially increased ZIKV infectivity in both human and mouse neural progenitor cells (NPCs), led to more significant microcephaly in the mouse fetus, and higher mortality in neonatal mice. Evolutionary analysis indicates that the S139N substitution arose before the 2013 outbreak in French Polynesia and has been stably maintained during subsequent spread to the Americas. This functional adaption makes ZIKV more virulent to human NPCs, thus contributing to the increased incidence of microcephaly in recent ZIKV epidemics.\n&gt;\n", "Zika and Sexual Transmission | Zika virus (04APR16) ", "Florida to begin aerial spraying of insecticides to control Zika ", "Zika 'link' to paralysing myelitis, say researchers ", "Zika Posing a Crisis For Motherhood ", "Understanding updated Zika map Updated Zika map shows equal risk in United States, Central America, the Caribbean, and most of South America. However US doctors still advise not traveling to “Zika areas” if pregnant/trying to become pregnant. Why is there still a distinction between USA and the areas south of us if the map shows no difference? ", "Awareness of Zika Virus ", "FDA asks two Florida counties to cease collecting blood donations until epidemiological investigation is completed. Food and Drug Administration (FDA) has released new new donor screening guidelines for blood and tissue donations in several counties in Florida. \n\nThe Office of the ‎Florida Department of Health State Surgeon General has announced that it is conducting an epidemiological investigation into a number of non-travel related cases of Zika virus in several counties in Florida. These may be the first cases of local Zika virus transmission by mosquitoes in the continental United States. The counties have been requested by the FDA to cease collecting blood and tissue immediately until further information is gathered. \n\n(", "Everything You Ought to Know about Zika Virus ", "Zika outbreak in Puerto Rico grows, endangers pregnant women ", "Zika virus outbreak (2015–present) charted by country as of 30Jan2016 **(\n\n\nCountry     | Cases       | A or E^1 | Last Update\n------------|-----------|---------------------|----\nBarbados   | 3             | A  | 20-Jan-16\nBolivia       | 4\t| A  | 29-Jan-16\nBrazil        | 1,500,000| E | 30-Jan-16\nColombia   | 20,000\t| E | 30-Jan-16\nCosta Rica | 1    | A  | 29-Jan-16\nCuraçao    |1      | A| 31-Jan-16\nDominican Republic | 8 | A | 27-Jan-16\nEcuador    | 33 | A  | 29-Jan-16\nEl Salvador| 2,500| E | 31-Jan-16\nFrench Guiana| 15  | A | 29-Jan-16\nGuadeloupe| 1 | A | 21-Jan-16\nGuatemala| 68 | A | 29-Jan-16\nGuyana| 1 | A | 21-Jan-16\nHaiti| 125 | A | 29-Jan-16\nHonduras| 3,649  | A | 01-Feb-16\nJamaica| 1 | A | 30-Jan-16\nMartinique| 47 | A | 29-Jan-16\nMexico| 37| A | 04-Feb-16\nNicaragua| 31| A | 04-Feb-16\nPanama| 50  | A | 28-Jan-16\nParaguay| 6  | A | 03-Dec-15\nPuerto Rico| 22  | A | 05-Feb-16\nSaint Martin| 1  | A | 21-Jan-16\nSamoa| 3   | A | 05-Feb-16\nSuriname| 6   | A | 13-Nov-15\nThailand| 1   | A | 05-Feb-16\nTonga| 5   | A | 04-Feb-16\nU.S. Virgin Islands| 1   | A | 29-Jan-16\nVenezuela| 4,700 | A | 05-Feb-16\n**Total**    | **1,531,320**  | A&amp;E | 30-JAN-16\n\n1. (**A**)ctual or (**E**)stimated\n\n* *Note about Brazil:*  There are 3,718 cases and 38 deaths from microcephaly. \n\n* *Note on website totals versus the total shown here:* The total listed on the website is, \"est. 1.6 million+\", the total shown in the posting take the 'estimated' figures and considers them a usable figures. Hence the 68,680 difference.  \n\n* *Note about 'as of' date discrepancy:* The 'as of' date shown under the 'Last Update' column of the 'Total' row is 30 Jan 2016.  The discrepancy is between that date and dates in the 'Last Update' column falling after 30 Jan 2016. As seen with: Venezuela, Tonga, Thailand, Samoa, St. Martin, PR, Panama, Nicaragua, Mexico &amp; Honduras.\n30-JAN-16\n\n* Source: \n\n", "Puerto Rico adds more evidence that Zika burden tilts toward women | (11NOV16) ", "The Truth About the Zika Virus: Jon Rappoport on The Corbett Report ", "House Republicans unveil Zika funding bill ", "Study documents live Zika virus in urine and saliva | (27JUN16) ", "How quickly do test results come back from CDC? Has anybody been tested in the USA and received results yet? My blood was sent out 8 days ago and I am wondering when I should be prepared to hear the news. I have read estimates from 2-4 weeks but I assume the CDC is swamped and might take longer. ", "Zika virus infection – Trinidad and Tobago ", "‘Like it is been nuked’: Millions of bees dead after South Carolina sprays for Zika mosquitoes | (01SEP16) ", "CIDRAP News Scan for Jun 07, 2016 | Zika emergency panel | (07JUN16) ", "Baby born with Zika virus is medical mystery ", "WTF? CDC reports active transmission in FL, but still will not include US with other countries experiencing active transmission in 08/02 map ", "Study: Zika landed in Brazil 2 years before it was detected (24MAR16) ", "Positive results in phase 1 Zika vaccine trial |27NOV18 ", "Texas reports 2nd local Zika case of year; FDA OKs blood donor test | (06OCT17) ", "Concern grows at Catholic church's silence over Zika virus crisis ", "Mosquito forecast: Wet spring could fuel bug boom and Zika cases ", "SOME QUESTIONS AND THERE ANSWERS RELATED TO ZIKA VIRUS ", "Biology Of Zika Virus Infection In Human Skin Cells. ", "Pika animal model ", "Florida to release wave of modified mosquitoes | 20AUG20  Science!", "US Senate Democrats Demand Republicans Pass Emergency Zika Funds ", "U.S. Red Cross: Wait 28 days to donate blood after visiting Zika areas ", "Colombia warns of spike in patients with related paralysis disorder ", "WHO | Madagascar plague: mitigating the risk of regional spread | (NOV17) ", "Medical official: 'Zika virus is just beginning in the West' ", "Zika Virus AMA with Columbia Prof. of Epidemiology Stephen Morse - 01 Feb 2016 ", "WHO statement on the third meeting of the International Health Regulations (2005) (IHR(2005)) Emergency Committee on Zika virus and observed increase in neurological disorders and neonatal malformations | (14JUN16) ", "Colombian study bolsters evidence of Zika-GBS link | (06OCT16) CIDRAP summary &amp; related links in comment **Summary:**\n\n&gt; A study today in the New England Journal of Medicine shows more evidence of a strong link between Zika virus (ZIKV) and Guillain-Barre syndrome (GBS), while reports from Florida show that local transmission is still occurring in Miami Beach.\n&gt; Zika infection preceded GBS in many\n&gt; \n&gt; In today's study, Colombian researchers looked at 68 patients with confirmed GBS diagnoses from November 2015 to March 2016.\n&gt; \n&gt; The patients were treated at one of six university hospitals in Colombia, and nearly all the patients (97%) had limb weakness upon admission. Fifty-six percent had ascending paralysis, and 50% had bilateral facial paralysis.\n&gt; \n&gt; Among those tested with nerve-conduction studies and electromyography, 78% had the acute inflammatory demyelinating polyneuropathy subtype of GBS. Forty patients (59%) were admitted to intensive care units, and 31% of all patients required mechanical ventilation. Four patients died while in hospital.\n&gt; \n&gt; Of the 68 patients, 66 (97%) had symptoms of ZIKV infection 1 month prior to the onset of GBS symptoms, with an average of 1 week between Zika symptoms and GBS symptom onset. Of the 68 patients with GBS, 42 were tested for ZIKV using RT-PCR, and the results were positive in 17 patients (40%). Moreover, 32 of the 37 patients with GBS who were tested (86%) had evidence of a recent flavivirus infection, indicated by antiflavivirus antibodies. All patients tested negative for dengue virus (DENV).\n&gt; \n&gt; \"The increase in cases of the Guillain-Barre syndrome during the time of the ZIKV outbreak in Colombia and the absence of such an increase while DENV and chikungunya virus were circulating within the region in previous years provides epidemiological evidence of the link between ZIKV infection and the Guillain-Barre syndrome,\" the authors wrote.\n&gt; \n&gt; The authors suggest this study corroborates earlier studies from French Polynesia, which reported clusters of GBS after a 2013-2014 Zika outbreak. Like that outbreak, the researchers posit that the current Zika epidemic in the Americas causes neurologic symptoms of GBS immediately following infection with ZIKV. Thus Zika-related GBS follows a parainfectious pattern, rather than the classical post-infection presentation of GBS.\n&gt; Temporal Zika, GBS relationship?\n&gt; \n&gt; According to a commentary in the New England Journal of Medicine, the study provides some temporal evidence of Zika virus infection and subsequent GBS diagnosis. But, unfortunately, the study also highlights the difficulty in obtaining an accurate and timely Zika diagnosis.\n&gt; \n&gt; \"The difficulties in diagnosing ZIKV infection are borne out in this study, as only 17 patients had definitive laboratory evidence of recent ZIKV infection,\" wrote Jennifer Frontera, MD, and Ivan da Silva, MD, PhD in the commentary. \"As is true with most clinical studies, proving a causal relationship between ZIKV infection and the Guillain–Barre syndrome is challenging.\"\n&gt; \n&gt; Still, Frontera and da Silva—Brazilian clinicians who were not involved in the study—warn that more GBS clusters are likely to follow regions hit hardest by Zika in the coming months.\n&gt; Miami Beach sees more Zika\n&gt; \n&gt; In other Zika news, Florida Health, the state’s department of health, is reporting two more non-travel–related cases of the mosquito-borne illness today as the state prepares to face Hurricane Matthew. Both cases were acquired in the Miami Beach active transmission zone, one of the city's premiere tourist destinations. There are now 141 cases of locally acquired Zika in Florida.\n&gt; \n&gt; Florida Health also reported one new case of Zika in a non-Florida resident who visited Miami Beach, raising the total number of non-Florida residents who acquired the disease in the state to 17.\n&gt; \n&gt; Pregnant women are still advised to avoid all unnecessary travel to Miami Beach, and Florida Health reminded residents that Zika prevention was in their hands.\n&gt; \n&gt; \"The department urges Floridians to drain standing water weekly, no matter how seemingly small. A couple drops of water in a bottle cap can be a breeding location for mosquitoes. Residents and visitors also need to use repellents when enjoying the Florida outdoors.\"\n&gt;  \n\n**Links:**\n\n* Oct 5 NEJM ( \n \n* Oct 5 NEJM (\n", "Military discloses at least 11 troops infected with Zika virus this year ", "Zika Virus - Bill and Melinda Gates Foundation, The Rockefeller Foundat... ", "Zika Testing availability For work I am a pilot and travel extensively.\n\nI am currently on a week long trip in Anguilla which is obviously in the Zika zone. My wife is 14 weeks pregnant so obviously it is not ideal. \n\nI spoke with my doctor about getting tested when I get home but because of the holidays I did not speak directly with him and the receptionist did not know anything about the Zika testing protocol. I have an appointment with him next week for my annual physical so we will chat more then. \n\nI have taken a lot of precautions on the trip but still have a few bug bites but I do not have any symptoms.\n\nI do have a good friend who is an ER doc and he reached out to a pathologist who said that right now in our area (New Hampshire/Mass) the only people they can test are pregnant woman who have had a mosquito bite in the last 7 days. \n\nOnce I return from the trip we are aware of the protocol we need to follow at home to prevent transmission. \n\nDoes anyone know if different areas have a different testing standard or how they determine who to test? \n\nThanks! My wife is staying home instead of going to south Florida with me. Her doc does not want her exposed as she is mid first trimester now and would be beginning of 2nd during trip. I figure I will not be tested but we will have to exercise caution when I get back. We are in Alberta Canada.", "NIH Begins Study of Vaccine to Protect Against Mosquito-Borne Diseases | (21FEB17) summary in comments  &gt; **Multi-disease vaccine that responds to mosquito saliva enters phase 1 trials**\n&gt; \n&gt; AGS-v, an investigational vaccine that triggers an immune response to mosquito saliva rather than to a specific virus or parasite carried by mosquitoes, has entered phase 1 clinical trials, according to a press release today by the National Institute of Allergy and Infectious Diseases (NIAID).\n&gt; \n&gt; Rather than targeting one mosquito-borne disease, the vaccine aims to protect people from the bug's bites and in the process halt the transmission of Zika, dengue, or yellow fever.\n&gt; \n&gt; \"Mosquitoes cause more human disease and death than any other animal,\" said NIAID Director Anthony S. Fauci, MD, in the release. \"A single vaccine capable of protecting against the scourge of mosquito-borne diseases is a novel concept that, if proven successful, would be a monumental public health advance.\"\n&gt; \n&gt; The vaccine is made from four synthetic proteins derived from mosquito salivary glands. The proteins should induce antibodies in a vaccinated individual and cause an allergic response that can prevent infection when a person is bitten by a disease-carrying mosquito.\n&gt; \n&gt; Sixty healthy adults aged 18 to 50 will participate in the study, which is expected to be completed by the summer of 2018.\n&gt;\n&gt; summary source: ", "Brazilian Scientists ID 2nd Common Mosquito as Zika Source ", "'Part of the new reality': Despite confusion, Zika warnings are here to stay | (09JUN17) ", "More than 3,100 pregnant women in Colombia have Zika virus: government ", "Wolbachia Aedes Mosquito Suppression Strategy (Singapore) ", "Quest for Zika vaccine widens; Africa, Asia deemed vulnerable ", "Mexico reports 6 confirmed cases of Zika in pregnant women ", "Rory McIlroy Withdraws From Rio Games Over Zika ", "Zika virus: Director explains what CDC is doing - CNN.com ", "Aberrant NAD+ metabolism underlies Zika virus–induced microcephaly. Nicotinamide riboside supplementation increases the brain and body weight as well as improves the survival in ZIKV-infected mice. ", "How To? Zika Virus: Symptoms, Risk, Treatment &amp; Prevention ", "Public Health Surveillance: A Call to Share Data ", "Birth defects occur in 1 in 10 pregnancies with first trimester Zika infection ", "NELM - Persistence of Zika Virus in Body Fluids | (15FEB27) CIDRAP summary in comments  &gt; **Study reveals more on Zika persistence in body fluids**\n&gt; \n&gt; Researchers who monitored Zika virus persistence in different body fluids in a group of newly infected patients from Puerto Rico found that viral RNA lingers in blood longer than dengue and other flaviviruses and that for men, Zika RNA usually cleared from semen after about 3 months. Researchers from the US Centers for Disease Control and Prevention (CDC) and Puerto Rico published their findings yesterday in the New England Journal of Medicine.\n&gt; \n&gt; The team examined samples from 150 participants, including 55 men. Most were recruited during the first week of symptom onset. Researchers collected serum, urine, saliva, semen, and vaginal secretions weekly for the first month after lab-confirmed Zika diagnosis. Then they repeated sample collection at months 2, 4, and 6. All of the specimens were tested by reverse-transcriptase polymerase chain reaction (RT-PCR), and serum was tested by IgM assay. Patients who still tested positive for any type of specimen at week 4 underwent biweekly collection until results were negative.\n&gt; \n&gt; Zika RNA typically cleared serum within a median time of 14 days, with a 95th percentile time of 54 days, urine 8 and 39 days, respectively, and semen in 34 and 81 days, respectively. Few of the participants had detectable Zika in saliva or vaginal secretions.\n&gt; \n&gt; Most of the participants no longer had Zika RNA in blood at 8 weeks, which seems to suggest that the risk of intrauterine transmission in Zika-infected women who are trying to conceive at the end of the CDC's at least 8-week recommended waiting period is small.\n&gt; \n&gt; Few men in the study had detectable Zika RNA past 3 months, with the maximum time at 125 days. The clearance times were shorter than the CDC's recommended 6 months of condom use or abstinence from sex for men with possible Zika exposure.\n&gt; \n&gt; The group said the findings are preliminary and more study is needed, but the prolonged clearance in blood may have implications for diagnosis and prevention.\n&gt; \nsource: \n\n", "CDC monitoring nearly 300 pregnant women with Zika in U.S. states, territories ", "Argentine and Brazilian doctors name larvicide as potential cause of microcephaly ", "7th testing of AM10b ", "US and Brazil scientists team up for Zika fight ", "Is Zika a biological terror attack? Threat embedded in video from a year ago points to yes and raises many questions. Evidence and analysis. ", "Mexico confirms first case of microcephaly from Zika ", "Zika virus: WHO backs GM mosquito trials ", "US government approves 'killer' mosquitoes to fight disease | (06NOV17) CIDRAP summary in comment  &gt; **EPA approves Wolbachia-infected mosquitoes to curb disease threat**\n&gt; \n&gt; Though it has not formally announced its decision, the US Environmental Protection Agency (EPA) has cleared the way for MosquitoMate to release its Wolbachia pipientis infected mosquitoes to battle Ae albopictus mosquitoes and combat diseases like Zika, dengue, and yellow fever, Nature News reported yesterday in a news story. It said the EPA notified the company of its decision on Nov 3, which will allow it to release the lab-infected male mosquitoes in 20 states and in Washington, DC.\n&gt; \n&gt; According to the report, the EPA has restricted the release of the MosquitoMate mosquitoes to places with climates similar to where they were tested, which included Kentucky, New York, and California. Nature said the EPA's approval does not extend the use to southeastern states, which have large mosquito populations and longer mosquito seasons, because the company did not do field trials there.\n&gt; \n&gt; The company told Nature that it will start selling its mosquitoes in Lexington, Ky., its home base. Then as it scales up protection MosquitoMate will expand availability to other cities in the region, such as Louisville and Cincinnati. Potential customers include homeowners, golf courses, and hotels.\n&gt; \n&gt; Male mosquitoes infected with naturally occurring Wolbachia bacteria do not bite, and when they mate with female mosquitoes, the eggs do not hatch, a tactic that helps drive down local mosquito populations.\n&gt; \n&gt; In 2016 a World Health Organization expert group that assessed if any new mosquito control tools could be helped to curb the spread of Zika virus found that Wolbachia was one of only two methods that warranted careful pilot testing with rigorous monitoring.\n&gt; \n&gt; Nov 6 Nature News (\n&gt;___\n\n^(source: ", "PLOS: The Zika Pandemic (18MAR16) ", "More than 2,100 pregnant Colombian women infected with Zika virus ", "WHO scales back Zika public health emergency | (18NOV16) ", "Virologist sums up what we know about zika so far ", "Will the cold winter mean less Zika? Does the subfreezing weather in Florida and the subzero weather across the USA mean that Zika will retreat this year? Zika infected mosquitoes sewer system have survived in the Washington DC winters for several years. ", "CDC reports 7 more babies born with Zika defects | (24MAR17) ", "CDC whistleblower claims agency has been using wrong Zika test |(27SEP16) ", "Zika virus: Local transmission taking place in Miami Beach, Florida ", "Dominican Agency: 2 New Deaths From Zika-Related Syndrome ", "University Of Florida Awarded $1.7m To Study Zika In Haiti ", "Haiti is ill-equipped to take on Zika virus ", "Two Studies Strengthen Links Between the Zika Virus and Serious Birth Defects ", "Zika infection will be low from Olympics in Rio 2016. ", "Rubio endorses Obama’s $1.9B request to fight Zika ", "Our Reporter Visits The Lab Where The Pathogen That Causes Zika Virus Can Be Seen Up Close : Goats and Soda : NPR ", "CDC adds 2 destinations to interim travel guidance related to Zika virus | CDC Online Newsroom ", "Conspiracy theories muddy Zika public health message ", "Zika, Born in Africa, Does not Cause Birth Defects There ", "WHO | The History of Zika Virus | (10MAY16) ", "Science AMA Series: I am Catherine Spong—OB/GYN, acting director of an NIH institute, researcher, and mom of 4. Let us talk about Zika virus and why we need to study its long-term effects on pregnancy &amp; children infected in the womb. AMA! • /r/science ", "Zika virus implicated in brain infection in adults: French study ", "Evidence of Zika Virus Infection in Brain and Placental Tissues from Two Congenitally Infected Newborns and Two Fetal Losses — Brazil, 2015 ", "Transmission of Zika Virus Through Sexual Contact with Travelers to Areas of Ongoing Transmission — Continental United States, (04MAR16) ", "Zika strain in Singapore confounds experts | (15SEP16) ", "Amy S. Patterson: Learning lessons from Ebola outbreak (06APR16) ", "Zika virus: WHO declares global emergency ", "Study: 1st evidence that Zika may cause temporary paralysis ", "Puerto Rico Races To Stop Zika's Mosquitoes Before Rains Begin (article &amp; audio) ", "Can We Stop Mosquitoes From Infecting the World? ", "Ahead of Print - Whole-Blood Testing for Diagnosis of Acute Zika Virus Infections in Routine Diagnostic Setting - Volume 25, Number 7—July 2019 - Emerging Infectious Diseases journal | 22APR19 ", "Brazil Announces End of State of Emergency for Zika Virus | (12MAY17)  &gt; **Brazil declares end to Zika emergency**\n&gt; \n&gt; Yesterday Brazil's Ministry of Health lifted the state of emergency caused by the Zika virus, due to the country's dwindling case counts of the mosquito-borne disease.\n&gt; \n&gt; Brazil was the country hardest hit by the 2016 Zika epidemic, and continues to report the most cases of congenital birth defects, including microcephaly, associated with prenatal exposure to the virus. But this year has seen a dramatic reduction in case counts: From Jan 1 to Apr 15, the country reported 7,911 Zika cases. During the same time period in 2016, Brazil tallied 170,535 cases. That is a 95.5% reduction in cases.\n&gt; \n&gt; According to The Rio Times, there has also been a significant slowdown in the reporting of microcephaly cases in 2017. Only 230 cases have been confirmed this year. Since November of 2015, the country has seen 2,653 cases of microcephaly.\n&gt; May 11 Rio Times story\n&gt; \n&gt; *In other Zika news, researchers from the University of Wisconsin-Madison have demonstrated highly efficient mother-to-fetus transmission in four pregnant rhesus macaques who were injected with Asian-lineage Zika virus.* They reported their findings yesterday in bioRxiv, a prepublication Web portal for scientific studies.\n&gt; \n&gt; Three of the four monkeys had prolonged viremia, and all pregnancies had signs of first trimester fetal tissue damage. The authors say this work can help identify infection patterns in pregnant women infected with Zika.\n&gt;\n&gt; May 11 bioRxiv (\n", "Zika virus at the games: is it safe? Published: 10 May 2016 ", "CDC: Puerto Rico seeing mounting cases of Zika virus infection ", "US drops Puerto Rico swim training over Zika ", "Spread of Zika virus in the Americas ", "Officials: Aerial spraying cut Zika mosquitoes in Miami ", "Information regarding the Zika Virus ", "WHO statement on the second meeting of the International Health Regulations (2005) (IHR(2005)) Emergency Committee on Zika virus and observed increase in neurological disorders and neonatal malformations (09MAR16) ", "UK mosquito expert heads team to try to stop Zika virus ", "Can We Keep Zika Out of the US Blood Supply? ", "First report of Stegomyia aegypti (Aedes aegypti) in Mexico City, Mexico | (23JAN17) CIDRAP summary in comments  \n&gt; **For the first time, Aedes discovered in Mexico City**\n&gt; \n&gt; A new study in Medical and Veterinary Entomology describes the discovery of Aedes aegypti mosquitos, the vector that transmits Zika virus as well as dengue and chikungunya, in Mexico City. Previously, Mexico's most populated city was considered too \"high and dry\" for the mosquito. \n&gt; \n&gt; Aedes traditionally establish populations in regions located below 1,700 meters (5,600 feet) above sea level. Mexico City stands at an altitude of about 2,250 meters (7,400 feet) above sea level. In September 2015, during a routine entomological survey of the city, Aedes larvae were collected at the Casa del Peregrino (Catholic Pilgrim House) and a suburban train stop in the northern part of the city. Both sites are heavily visited by daily commuters, tourists, and residents of the city of 8 million.\n&gt; \n&gt; The authors suggest that climate change and rapid urbanization may be forcing the vectors to move northward and potentially spread diseases among populations with no local immunity.\n&gt; \n&gt; \"Climate change and increasing levels of urbanization put Mexico City at risk of becoming an area where dengue fever is present. Contemporary data on mosquito occurrence present a growing challenge to policymakers,\" the authors write.", "Level Of Alarm: Zika Virus Spreading Rapidly Around The World Has “Explosive Pandemic Potential” ", "WHO | WHO supports Cabo Verde in managing Zika virus (18MAR16) ", "Hillary Clinton Is Sending Aides to Puerto Rico to Take Zika Meetings ", "2 US military members get Zika virus, both recovered ", "Oxitec to release 200,000 GM mosquitoes weekly ", "A New Zika Treatment Could Come From Head Lice Medicine ", "So You May Have Zika: Interview with Nancy E. Dirubbo, DNP, FNP ", "Cayman To Use Genetically Modified Mosquitos To Stop Zika ", "First Zika virus case detected in India's UP state, says report | 24OCT21 ", "Zika linked to hearing and vision complications in adults | (08DEC16) ", "Preventive measures for mosquito-borne diseases ", "Can Google, with its big data, map and zap the spread of Zika? ", "NEJM | Zika Virus Associated with Microcephaly (10MAR16) ", "Increased Hospitalizations for Neuropathies as Indicators of Zika Virus Infection, according to Health Information System Data, Brazil - Volume 22, Number 11, November 2016 - Emerging Infectious Disease journal ", "Jon Rappoport's Blog | Zika: Who launched the fake-epidemic story in Brazil? ", "IOM: Migrants Must Be Included in Zika Virus Response Plans ", "Puerto Rico Braces for Its Own Zika Epidemic ", "Texas infant's death linked to travel-related Zika infection | (09AUG16) ", "Zika Virus in the Americas — Yet Another Arbovirus Threat ", "Zika Virus May Remain in Semen Longer Than Previously Thought ", "Severity of Zika outbreak explains microcephaly rate in Northeast Brazil | 14MAR19 ", "Zika virus: Florida Gov. Rick Scott lifts last active Zika transmission zone ", "Special Report: VSU researchers battle Zika mosquitoes ", "CDC funds Zika-risk areas as Puerto Rico reports microcephaly | (13MAY16) ", "Scientists unravel the genetic evolution of Zika virus ", "Some Zika 'firsts' as disease spreads across Caribbean | (22SEP16) ", "Data on Zika in mosquitoes suggest early presence in Rio | (20JUN17)  I thought zika was caused by the Monsanto Co. spraying their chemicals? ", "Antibodies Used to Treat Zika Virus in Pregnant Mice ", "Adelaide researchers' vaccine could be adapted to tackle Zika virus ", "Zika virus: Brazil journalist speaks out over microcephaly fear ", "Fact Sheets and Posters | Zika virus ", "Taiwan and Hainan at Risk of Zika Spread, Scientist Warns ", "Brazilian studies aim to unravel Zika's link to birth defects ", "Information for Parents | Zika virus (20MAR16) ", "Zika Virus Infection and Associated Neurologic Disorders in Brazil — NEJM | (29MAR17) CIDRAP summay in comments  &gt; Experts theorize why Brazil had fewer microcephaly cases in 2016 than 2015\n&gt; \n&gt; A new letter published in the New England Journal of Medicine attempts to explain why Brazil saw fewer babies born with microcephaly in 2016 as compared to 2015, despite more suspected Zika infections. The authors suggest that 2016's second wave of Zika infections could have actually been another flavivirus, such as chikungunya.\n&gt; \n&gt; Using data from two national databases, experts from Brazil and the World Health Organization (WHO) showed that in 2015 a spike in Guillain-Barre syndrome (GBS) was followed 6 months later with a spike in microcephaly cases. Zika infection has been linked to both diseases. But in 2016, a spike in GBS was not followed by a subsequent rise in microcephaly numbers. The authors suggest that chikungunya —not Zika—was causing the GBS in 2016, and Brazil only experienced a true Zika outbreak in the previous year.\n&gt; \n&gt; The authors posited two other possibilities for the lack of microcephaly cases in 2016: the women in 2015 suffered an unknown co-infection or co-factor that led them to have babies with microcephaly, or the fear of microcephaly and Zika infection led to more abortions and delayed pregnancies. But birth registry data are not yet complete enough to determine whether birth rates fell or abortion rates increased in 2016.\n&gt; \n&gt; \"Among these hypotheses, the first seems to be the most plausible — that is, both ZIKV and chikungunya viruses are important causes of GBS, but among the arboviruses circulating in Brazil, only ZIKV causes microcephaly and other neurologic disorders after infection during pregnancy,\" the authors conclude.\n&gt;\n&gt; Mar 29 N Engl J Med ( I have said it before - data from Brazil is highly suspect, and the link is still tenuous. There is been some better biomechianical data that is come out, and I am squarely on the fence now (vice unconvinced in the past), but the issue is that ignoring everything in Brazil does not yet provide robust info.\n **( **(", "UN to decide if Zika virus is a global health emergency ", "Nearly 200 cases of Zika in US; officials press for funds ", "Is the Zika Panic Overblown? ", "Zika is Spreading Rapidly in Puerto Rico, Officials Say ", "Container mosquitoes breeding in my backyard in Austin, Texas ", "Cuba reports first Zika virus case transmitted within the country ", "ZIKV RNA was detectable in semen at 181 days after onset. ", "Zika virus found in man in Indonesia ", "WHO | WHO confirms Zika virus strain imported from the Americas to Cabo Verde | (20MAY16) ", "Hello guys, I wanted to know more about zika but especially on if it goes away after days and if there are any people who experienced it in the past and how was your was it for you?  \"AM22 - Your post has been automatically removed because it contains no information.\"\n\n*I am a bot, and this action was performed automatically. Please (/message/compose/?to=/r/zika) if you have any questions or concerns.*", "“Like It is Been Nuked” — Millions of Bees Dead After Zika Spraying in South Carolina (with video) ", "Mosquito Hunters Set Traps Across Houston, Search for Signs of Zika | (24MAY16) ", "How to Prevent Zika Virus: 8 Safety Tips to Protection ", "Congenital Zika Virus Infection | Congenital Zika Syndrome Link to an autodownload PDF of the CDC report: (", "Zika virus case tally in Uttar Pradesh's Kanpur reaches 10, CMO confirms | 01NOV21 ", "Brainsy, Inc just launched Zika Virus Expert Calling Network, a knowledge-sharing hub where users can call and ask Experts about the Zika Virus. ", "Zika virus in the dock | Lancet ", "Ahead of Print - Variation in Aedes aegypti Mosquito Competence for Zika Virus Transmission - Vol 23, Num 4 - April 2017 - Emerging Infectious Disease journal | (01MAR17) CIDRAP summary in comments  &gt; **Scientists report varied Zika infection in Aedes aegypti mosquitoes**\n&gt; \n&gt; In a surprise finding, Zika researchers found that the African strain of the virus was more infectious than the Asian strain—which is responsible for the current outbreak in the Americas—and only Aedes aegypti mosquitoes from the Dominican Republic and not those from the United States or Brazil transmitted the Asian strain.\n&gt; \n&gt; The international researcher group, led by investigators from the University of Texas Medical Branch at Galveston, used Zika virus strains from Senegal (the African strain) and Cambodia and Mexico (the Asian strain). They fed Ae aegypti mosquitoes from the three countries blood meals from viremic mice and used artificial blood that contained one of the three Zika strains.\n&gt; \n&gt; The scientists found that, across all three mosquito populations, the African virus produced a significantly higher level of infection in the insects and a higher percentage of infectious saliva. They also found that only mosquitoes from the Dominican Republic transmitted the two Asian strains. The Cambodia strain was not transmitted at all by mosquitoes from Brazil after artificial blood meals, whereas 61% transmission occurred after a blood meal from infected mice.\n&gt; \n&gt; The authors concluded, \"Although some previous studies showed relatively low Zika virus competence in Ae. aegypti mosquitoes, raising questions about the role of other potential vectors, others have shown this species to be highly competent. We demonstrated that Ae. aegypti mosquito competency as a vector for Zika virus in the Americas varies greatly and depends on mosquito origin, Zika virus strain, and type of blood meal used.\"\n&gt; \n&gt; They added, \"Although regional origins of vector populations and virus strain influence transmission efficiency, Ae. aegypti mosquitoes appear to be competent vectors of Zika virus in several regions of the Americas.\"", "|^(Infection Type)|^(Travel-Related Infections of Zika) |^(Non-Travel Related Infections of Zika)|^(Infections Involving Pregnant Women)|^(Out of State Cases (not Florida Residents)^)|^(Total)| |:-:|:-:|:-:|:-:|:-:|:-:| |^(**Infection Count**)|**693**|**109**|**91**|**11**|**904**| ", "Honduras: Pregnant Woman Has Guillain-Barre, Possibly Zika ", "Had a question about Zika and was wondering if you guys could help I have been hearing a lot about the Zika virus and now that there are confirmed cases in the US I had some questions. My fiancee and I are going to be having children soon. We live in the north so it is not around here yet but I am worried about it and if either of us were to be infected, is there any way to beat it? Like if my fiancee got it, obviously we would not want to have children then but is this like other viruses where your body will eventually root it out and you will be fine again, or is this something that once she has would ruin our chances of having healthy children for the rest of our lives?\n\nSorry in advance that the questions is seemingly so obvious but I could not find that info anywhere. A lot of stuff talking about it and treatment but I could not find anything that specifically answered that.", "The CDC wants your semen (if you have had Zika) ", "With launch of big Zika pregnancy study, NIH seeks key answers | (21JUN16) ", "Zika Virus May Cause More Problems in Fetuses ", "“Everything we look at with this (Zika) virus seems to be a little scarier than we initially thought,” Dr. Anne Schuchat, CDC principal deputy director, White House briefing, April 11, 2016. ", "What does congenital Zika syndrome look like? | (23MAR17) ", "Jamaica reports its first case of Zika virus ", "WHO cites Zika funding gap, rejects call to move Olympics | (31MAY16) ", "What is Zika? 10 Facts on Symptoms , Prevention, Treatment of Zika Virus ", "CWEB.com - Exclusive Video and News of the Zika Virus and how it can Kill the whole Population. Win a Free Movie or a Concert Ticket When You Vote For the Celebrity or Movie We Review on CWEB. ", "1 Organ Holds the Key to Zika's Devastating Birth Defects ", "Zika caught 'killing' brain cells ", "Exclusive: Brazil says Zika virus outbreak worse than believed ", "Does this look like Zika in my eyes I had unprotected oral sex with a CSW. A little over 9 months ago. And my eyes look like they still have not recovered ", "3 Oregonians infected with Zika virus but U.S. threat slight ", "Study: Saliva spread of Zika possible but unlikely | (01AUG17) ", "Zika Communication Planning Guide for States | Zika virus (22MAR16) ", "WHO seeks $56 million for plan to combat Zika virus ", "Zika studies uncover early spread, factors fueling Florida outbreak | (24MAY17) ", "Persistence of Zika virus in conjunctival fluid of convalescence patients | (11SEP17) CIDRAP summary in comments  &gt; **Study: Zika virus can persist in tears for 30 days after illness onset**\n&gt; \n&gt; Researchers in Singapore found that Zika virus can persist in patients' tears for at least 30 days after illness onset, suggesting a prolonged potential for transmission from ocular discharges, according to an article published yesterday in Scientific Reports.\n&gt; \n&gt; The authors said transmission of Zika virus through tears is uncommon but was noted as a possibility in a previous case study. They also observed that ocular developmental anomalies have been reported in infants with Zika-related microcephaly in Braziland that two cases of Zika-associated uveitis in adult patients have been reported.\n&gt; \n&gt; For the study, the researchers collected conjunctival swabs from both eyes of 29 adult patients who had confirmed Zika infections in a Singaporean outbreak in August 2016. The swabs were taken 30 days after the patients' recovery. Eight of the patients had conjunctivitis and 3 reported eye pain, but none reported any vision problems.\n&gt; \n&gt; Using spiked samples, the team determined that their test (quantitative reverse-transcription polymerase chain reaction) was able to detect the virus at concentrations as low as 0.1 plaque-forming units, or 4.9 viral copies, per swab.\n&gt; \n&gt; Samples from 3 of the 29 patients were positive, with Zika RNA copy numbers ranging from 5.2 to 9.3. The patients were all women, ages 22, 47, and 52 years, though men outnumbered women (16 to 13) in the overall sample.\n&gt; \n&gt; Two of the three patients who tested positive had conjunctivitis and one had eye pain at the time of sampling, but the third had no evidence of conjunctival inflammation or pain.\n&gt; \n&gt; The authors said their findings signal that ocular transmission of Zika virus through contact with ocular discharge may be possible even in the late convalescent phase of infection. \"It is important to assure that samples of conjunctivae and tears are tested negative for ZIKAV in patients to ensure no risk of virus spread through casual contact,\" they conclude.\n&gt; \n&gt; Sep 11 Sci Rep (\n\n^(source: \n&gt; ", "Brazilian Researchers Find Evidence Zika Is Getting Worse ", "Tears and Bewilderment in Brazilian City Facing Zika Crisis ", "Zika situation report (07APR16) ", "Health officials say that Zika-related birth defects in U.S. has increased dramatically. ", "Zika Vaccine Still Years Away, W.H.O. Says ", "British firm Oxitec may have the solution to the Zika virus ", "Global distribution map of Aedes Aegypti mosquitos that transmit Zika virus. ", "How Zika spreads (and who is to blame) ", "Zika virus in the female genital tract | Summary in comments | (11JUL16) ", "Zika-Infected Babies Can Develop Microcephaly After Birth | (22NOV16) ", "Researchers Are Studying Twins for Zika Clues ", "CDC Adds Saint Lucia to Interim Travel Guidance Related to Zika Virus | CDC Online Newsroom (13APR16) ", "5 Things We Indians Need to Know About the Zika Virus - Awesome India ", "Testes para vacina contra zika podem começar them 18 meses - Saúde - Estadão Tests to vaccine against zika could start in 18 months ", "Zika Stocks To Watch; $AEMD, $BCRX, $CERS, $INO; Virus Continues Spread ", "CDC | Zika virus information ", "The Dangers of the Zika Virus - Microcephaly ", "Researcher continues grandfather's work on Zika virus ", "This Week in Zika: Clinical and Public Health Updates ", "Elements of transgenic disease-vector control (Part 2: altering the mosquitoes) ", "CDC: 3 babies born in US with birth defects caused by Zika ", "Zika virus may hide in organs protected from the immune system ", "Zika-hit Puerto Rico prepares to import all of its blood supplies ", "​Zika's threat to tourism adds to Puerto Rico's woes ", "Study Finds Increase in Temporary Paralysis Accompanied Zika Outbreaks ", "Dr. Campbell: Zika virus much worse than initially feared ", "Potential risks to public health related to communicable diseases at the Olympics and Paralympics Games in Rio de Janeiro, Brazil 2016 | (12MAY16) ", "Zika Patient Dies in Utah; 1st Related Death in Continental U.S. ", "Cuba deploys 9,000 troops in effort to ward off Zika virus ", "Zika Feared to Be Greater Health Threat Than Ebola ", "PLOS: Spread of Aedes aegypti and Aedes albopictus in the Black Sea Region Increases Risk of Chikungunya, Dengue, and Zika Outbreaks in Europe (26APR16) ", "What are the symptoms of Zika virus? ", "Brazil’s Abortion Restrictions Compound Challenge of Zika Virus ", "Want to repel mosquitoes? Do not use citronella candles | (16FEB17) ", "Bacteria shown to curb mosquitoes' ability to spread Zika | (05MAY16) ", "CIDRAP | Another case of local Zika infection confirmed in Miami | (04AUG16) ", "Slovakia confirms first case of Zika virus in country ", "Zika Virus 10 Killer Facts ", "The race is on to develop Zika vaccine ", "ZIKA now confirmed in Jamaica. ", "2019 Case Counts in the US | Zika Virus | 09APR19  Wow, how often is there good news in this subreddit???", "کولمبیا: تین ہزار حاملہ خواتین زیکا وائرس کا شکار ", "Arthrogryposis Multiplex Congenita ", "NextStrain - Real-time tracking of Zika virus evolution (31Mar16) ", "Another Caribbean island falls to the Zika virus ", "ECDC-Factsheet for health professionals (08MAR16) ", "Florida announces 10 new Zika cases; a travel advisory is expected ", "Zika Virus- Protecting Pregnant Women and Babies ", "Miami blood donations halted over Zika fears ", "Zika virus: Vladimir Putin orders Russian scientists to develop vaccine ", "Zika virus disease in the United States, 2015–2016 (Posted 18 February 2016) **As of February 10, 2016** (\n\n* As an arboviral disease, Zika virus is nationally notifiable.  \n* This update from the CDC Arboviral Disease Branch includes provisional data reported to ArboNET for January 1, 2015 – February 10, 2016. \n\n**US States**\n\n* Travel-associated Zika virus disease cases reported: 52 \n* Locally acquired vector-borne cases reported: 0 \n\n**US Territories**\n\n* Travel-associated cases reported: 1   \n* Locally acquired cases reported: 9   \n.\n\n**Laboratory-confirmed Zika virus disease cases reported to ArboNET by state or territory — United States, 2015–2016 (as of February 10, 2016)**\n\t\t\t\t\t\t\n|\t**States**\t|\t**Travel-associated**\t|\t**Locally acquired**\t|\n|\t:-\t|\t:-\t|\t:-\t|\n|\t|\t**cases (N=52)**\t|\t**cases (N=0)**\t|\n|\tArkansas\t|\t1\t|\t0\t|\n|\tCalifornia\t|\t2\t|\t0\t|\n|\tDelaware\t|\t1\t|\t0\t|\n|\tDistrict of Columbia\t|\t3\t|\t0\t|\n|\tFlorida\t|\t16\t|\t0\t|\n|\tGeorgia\t|\t1\t|\t0\t|\n|\tHawaii\t|\t4\t|\t0\t|\n|\tIllinois\t|\t3\t|\t0\t|\n|\tMassachusetts\t|\t2\t|\t0\t|\n|\tMinnesota\t|\t1\t|\t0\t|\n|\tNebraska\t|\t2\t|\t0\t|\n|\tNew Jersey\t|\t1\t|\t0\t|\n|\tOhio\t|\t1\t|\t0\t|\n|\tOregon\t|\t1\t|\t0\t|\n|\tPennsylvania\t|\t2\t|\t0\t|\n|\tTexas\t|\t10\t|\t0\t|\n|\tVirginia\t|\t1\t|\t0\t|\n|\t\t|\t\t|\t\t|\n|\t**Territories**\t|\t(N=1)\t|\t(N=9)\t|\n|\tPuerto Rico\t|\t1\t|\t8\t|\n|\tUS Virgin Islands\t|\t0\t|\t1\t|\n\n^source: ^  \n\n", "Miami Mother Copes With Zika-Related Effects In Newborn ", "Zika virus disease in the United States, 2015–2016 ", "WHO emergency vector control group meets in Geneva (14Mar16) ", "Question: Going to Aruba.. conceiving this year. Zika status? Hello Redditors, my husband and I will be going to Aruba for our honeymoon. We are also planning on going to Aruba. Please forgive me, I do not know much anything about the country and the status of the virus. My doctor advised me that if we are planning on conceiving this year we have to be aware of the potential zika virus. As far as I could see, there is currently no outbreak but what can we do to prevent from catching it? Your doctor told you to be aware of Zika while traveling to Aruba? There are zero zika cases on the island. Aruba has one of if not the toughest protocols against mosquitos in the entire region. Current CDC recommendations would be to wait 3 months after your travel to Aruba to try to conceive.  Check out CDC’s Zika Travel Information page:  Reccomend reviewing this: ( Do you have sources on this?  Would be interested in looking into the methods they employ. &gt;Do you have sources on this?  Would be interested in looking into the methods they employ.\n\nI could link the sources, but they would be in the local Papiamento unfortunately.\n\nBasically, they work very preventatively. Mosquitos only reproduce when it rains and there is standing water left everywhere in buckets, tires etc. Mosquitos only travel a few hundred meters from where they were born as well.\n\nKnowing all this, the government implemented a strict penalty system that if you have standing water around your property, be it private or business, you will receive hefty fines. As such the mosquitos do not get a place to reproduce and the amount of mosquitos are greatly reduced.\n\nBesides this, the government also sprays an \"environment friendly\" pesticide into the areas where they are known to reproduce(next to the lagoons for example). How environment friendly that really is is anyone's guess though.\n\nLast year there were zero cases of Zika registered on the island. &gt; Papiamento \n\nI can work with a good number of languages, so that should not be a problem.  Thanks for the links.  Presionou a miña capacidade de tradución ata o límite. As my results are limited, am going to leave to you to provides analysis summaries.", "Traces of Zika Found in Asian tiger mosquito in Brazil | (10APR17) CIDRAP Summary &amp; Links in comments  &gt; **Zika RNA found in Asian tiger mosquitoes (Ae albopictus) in Brazil**\n&gt; \n&gt; Zika RNA—but not live virus—has been found in Brazilian Aedes albopictus, or Asian tiger mosquitoes, a species that is more widespread in the United States than is Aedes aegypti, the chief transmitter of the virus, according to a new study.\n&gt; \n&gt; Researchers from the University of Florida and their counterparts in Brazil tested adult Ae albopictus mosquitoes that emerged from eggs collected in the wild in Bahia, Brazil, they reported yesterday in in the Entomological Society of America's (ESA's) Journal of Medical Entomology. They found Zika virus RNA in five male mosquitoes.\n&gt; \n&gt; \"Detecting Zika RNA fragments without finding live Zika virus suggests that either the female parent was not itself infected with live Zika virus or it was not able to transfer live Zika virus to her eggs,\" said Florida's Chelsea Smartt, PhD, in an ESA news release.\n&gt; \n&gt; \"Our results mean that Aedes albopictus may have a role in Zika virus transmission and should be of concern to public health,\" Smartt says. \"This mosquito is found worldwide, has a wide range of hosts, and has adapted to colder climates. The role of this mosquito in Zika virus transmission needs to be assessed.\"\n&gt;\n&gt; Apr 14 J Med Entomol (\n&gt;\n&gt; Apr 14 ESA (", "CDC and OSHA Issue Interim Guidance for Protecting Workers from Occupational Exposure to Zika Virus | (22APR16) ", "Web Portal of the Government of Saint Lucia (07APR16) ", "World disease experts to convene in Paris on Zika ", "Researchers Weigh Risks of Zika Spreading at Rio Olympics ", "Florida Has Officially Been Declared Zika-Free ", "REPORT from Physicians in the Crop-Sprayed Town regarding Dengue-Zika, microcephaly, and massive spraying with chemical poisons | Red Universitaria de Ambiente y Salud ", "Newborn with Zika is developing normally, Canada's chief doctor says ", "Department of Health Zika Update | (02MAR17)  &gt;**Florida confirms 3 more local Zika cases; CDC reports more birth defects**\n&gt;\n&gt;The Florida Department of Health (Florida Health) yesterday reported three more locally acquired Zika cases, all involving samples collected a few months ago.\n&gt;\n&gt;Two involve people who were sampled in October as part of an ongoing investigation, and Florida Health recently received confirmation test results back from the US Centers for Disease Control and Prevention (CDC).\n&gt;\n&gt;The third case involves an individual who did not have symptoms but whose blood samples tested positive for Zika virus in connection with donating blood in January. An investigation suggested the person has multiple exposures in Miami-Dade County and probably contracted the virus in 2016, though the case is considered the first local Zika case of 2017. Overall, the state has reported 277 local Zika infections. \n\nSummary from CIDRAP", "Countries and territories with autochthonous transmission in the Americas reported in 2015-2016 (  \n\n* (  \n* (  \n* (  \n* (  \n* (  \n* (  \n* (  \n* (  \n* (  \n* (  \n* (  \n* (  \n* (  \n* (  \n* (  \n\n", "Florida Department of Health Daily Zika Update ", "Zika reportedly now spreading in Miami Beach | (18AUG16) ", "Epidemiology of Pediatric Zika Virus Infections | (01NOV17) CIDRAP summary in comments  &gt; **Study: Half of Zika pediatric patients report only 2 of 4 main symptoms**\n&gt; \n&gt; A study today in Pediatrics analyzed data on all known (33) Zika infections in children in Miami-Dade County and found that almost half (16) of the children reported only two of the four main symptoms of infection.\n&gt; \n&gt; The study included children diagnosed as having Zika virus between Oct 15, 2015, and Mar 29 of this year. Twenty-seven cases (82.3%) were travel-associated. The median age of the patients was 11 years. Seventeen case-patients (51.5%) were boys, and 23 (69.9%) were Hispanic.\n&gt; \n&gt; According to the study, all 31 symptomatic children reported having rash, 25 (80.6%) reported fever, 9 (29.0%) reported conjunctivitis, and 7 (22.6%) reported joint pain. Sixteen cases (48.5%) reported two of four main symptoms, and 8 (24.2%) reported three. Among the 31 confirmed case-patients, 25 (80.6%) reported having both fever and rash.\n&gt; \n&gt; The authors concluded by emphasizing the need to test children for Zika if they have household members who are infected with the virus, especially if they exhibit fever or rash.\n&gt; \n&gt; In another Zika study published in the Proceedings of the National Academy of Sciences, researchers described mouse brain slice culture experiments that suggested that all Zika lineages have the potential to disrupt brain development.  \n&gt; \n&gt; In addition, Zika virus was able to invade brain cells at all stages of embryonic development.\n&gt; \n&gt; Nov 1 Pediatrics (\n&gt; \n&gt; Oct 31 Proc Natl Acad Sci (\n\n^(source:  Hey, that is my husband's journal article. Awesome sauce! ", "Coping with Microcephaly (small head at birth). ", "Does anyone know if Zika stays in your system if you have been infected? If one were to get bitten by a mosquito and get the Zika virus, does it stay in your system and always affect the chances of conceiving a baby with microcephaly?", "Obama Calls on Congress to Pass Zika Prevention Bill Before It Adjourns ", "(MMWR) Possible Zika Virus Infection Among Pregnant Women — United States and Territories, May 2016 ", "Do you know where the world's most dangerous mosquitoes live? (Aedes, Anopheles &amp; Culex mosquitoes) : infectiousdisease ", "Utah man may have contracted Zika from dying father's tears| (28SEP16) ", "In a Remote Ugandan Lab, Encounters With the Zika Virus and Mosquitoes Decades Ago ", "can zika be re-transmitted by other blood sucking insects? i understand that zika can be carried by aedes mosquitoes, and we now know zika can be transmitted human to human by blood sharing (transfusion, sex) but what about **other** blood sucking insects biting two or more people.  \n\nsay i am in canada where aedes mosquitos have not reached yet, but my neighbor was in haiti and got zika from a mosquito.  so now my neighbor is home, gets bitten by a native mosquito or flea up here, then it later bites me.  so can that native mosquito host my neighbors zika and give it to me once i am bitten by the same bug?", "Zika Virus in the Americas — Yet Another Arbovirus Threat | 18FEB2016 ", "Millions of GM mosquitoes could be released in Florida to combat Zika virus ", "More Zika-linked GBS cases expected in Puerto Rico | (25OCT16) ", "About 1 in 10 U.S. pregnant women with confirmed Zika infection had a fetus or baby with birth defects in 2016 | (04APR17) CIDRAP summary in comments  &gt; Zika birth defects noted in 1 in 10 infected US pregnant women\n&gt; \n&gt; Apr 04, 2017\n&gt; \n&gt; Of 250 pregnant women in the United States with confirmed Zika infections in 2016, 1 in 10 had a fetus or baby with Zika-related birth defects, the largest study so far of its kind has found, with levels similar to earlier reports from Brazil and French Guiana.\n&gt; \n&gt; The new information comes from a Centers for Disease Control and Prevention (CDC) registry for monitoring pregnant women who have potential Zika exposure. The findings also came with a warning that too few babies born with congenital Zika infections are getting the recommended brain imaging. CDC experts published their findings today in a Vital Signs report in Morbidity and Mortality Weekly Report (MMWR).\n&gt; \n&gt; At a media telebriefing today, Anne Schuchat, MD, acting CDC director, said most of the pregnant women were infected with Zika virus during travel outside of the United States and that the Zika threat is far from over. She said the CDC is still receiving about 30 to 40 reports of pregnant women infected with Zika virus each week.\n&gt; Higher risk in first-trimester infections\n&gt; \n&gt; Today's report covers 1,297 pregnancies with possible recent Zika infection reported in 44 states in 2016. The CDC said testing for Zika virus is complex, but of 250 women with confirmed infections, 24 (10%) had a fetus or baby with related birth defects. The level was even higher—15%—in women infected during the first trimester of pregnancy.\n&gt; \n&gt; Overall, there were 45 live births and 6 pregnancy losses in the pregnant women who had any lab evidence of possible Zika infections. Schuchat said the cases have links to travel to 16 different countries or territories.\n&gt; \n&gt; Peggy Honein, PhD, MPH, chief of the birth defects branch at the CDC's National Center for Birth Defects and Developmental Disabilities, said for comparison, a report in December from Brazilian researchers found about a 10% birth defect level in Rio de Janeiro pregnant women who had been infected in any trimester with Zika virus. And a report from French Guiana found that about 13% of babies born to women infected during the first two trimesters had evidence of brain abnormalities. \"We are seeing some consistency in the reports,\" she said.\n&gt; \n&gt; Schuchat said the number of affected babies and fetuses may be an undercount, because some likely went undetected, because babies either did not get the recommended evaluation or because some problems, such as developmental delay, do not surface until well after birth. \"We are still learning about the full range of Zika,\" Schuchat said.\n&gt; \n&gt; Zika's impact on babies and their families can be devastating, not only because of the heartbreaking physical effects, but also because of resources needed to care for affected babies. The cost of caring for a baby born with microcephaly is estimated to be $4 million, an amount that rises to $10 million for those who reach adulthood.\n&gt; Gaps in babies' medical exams\n&gt; \n&gt; CDC investigators also found that only one in four Zika-affected babies received recommended brain imaging after birth, a key to identifying problems and connecting babies and families to crucial medical care and support. Officials at the media briefing said the reasons are complex and not fully understood. Schuchat, however, said the recommendation for physical exam and tests for Zika-affected babies is relatively new, and many clinicians might not be aware of it and may not know the value of brain scanning.\n&gt; \n&gt; The report also noted a gap in testing newborns who have possible congenital Zika infections: one in three had no report of Zika testing at birth.\n&gt; \n&gt; She said though the condition is rare, pregnant women with possible Zika virus infection have been reported in 44 states, a reminder than a baby born with Zika-linked birth defect could occur nearly anywhere in the country.\n&gt; \n&gt; With a new mosquito season just around the corner and the travel season in full swing, CDC officials today urged pregnant women to avoid visiting areas with known Zika risk and avoid unprotected sex with a partner who has traveled to an area where the virus is spreading locally. They also urged health providers to educate families on Zika prevention, provide all needed testing and follow-up care, and support affected babies and their families.\n&gt; \n&gt; See also:\n&gt; \n&gt; Apr 4 MMWR CDC (\n&gt; \n&gt; Apr 4 CDC (  **(", "Telemedicine Project Adapted for Zika in Brazil ", "Health official: Zika not worry now for pregnant women in US ", "Background: Potential Sexual Transmission of Zika Virus (2013) **Potential Sexual Transmission of Zika Virus**\n\n**Authors**: Didier Musso, Claudine Roche, Emilie Robin, Tuxuan Nhan, Anita Teissier, Van-Mai Cao-Lormeau\n\nPMC ID: 4313657  \nJournal: Emerging Infectious Diseases  \nPublisher: Centers for Disease Control and Prevention  \nDOI: 10.3201/eid2102.141363  \n\nIn December 2013, during a Zika virus (ZIKV) outbreak in French Polynesia, a patient in Tahiti sought treatment for hematospermia, and ZIKV was isolated from his semen. ZIKV transmission by sexual intercourse has been previously suspected. This observation supports the possibility that ZIKV could be transmitted sexually.\n\nsource: (\n\n&gt; **Hematospermia**, the presence of blood in semen, is most often a benign symptom. Among men age 40 or older, hematospermia is a slight predictor of cancer, typically prostate cancer. No specific cause is found in up to 70% of cases.", "Study shows why neural stem cells might be vulnerable to Zika &amp; why it affects fetuses so badly ", "TP.HCM: Dịch Zika đã tấn công 176 người ", "Guillain-Barré syndrome – Colombia and Venezuela ", "Rapid risk assessment: Zika virus disease epidemic: potential association with microcephaly and Guillain–Barré syndrome, 3rd update 23feb16.pdf ", "Zika Virus as a Cause of Neurologic Disorders (11MAR16) ", "Is this the Aegypti? (I live in NY/NJ area) ", "WHO | Defining the syndrome associated with congenital Zika virus infection | (03JUN16) ", "Does Asia Have A Secret Weapon Against Zika? ", "Lee County sees sixth Zika case, more than 250 statewide (FL) ", "Zika virus could spread at 20 times current rate ", "CIDRAP summary &amp; links | CDC: Zika passed from woman to man via sex | (15JUL16) ", "Transgenic Aedes aegypti Mosquitoes Transfer Genes into a Natural Population | 10SEP19 ", "Zika Spread Confounds Scientists ", "Genetically engineered mosquitoes could wipe out Zika, but some in Dallas County oppose local trials | (14JUL17) ", "How do they know Zika is responsible for microcephaly? Has not the Zika virus been around for over fifty years without producing birth defects?  Why the sudden change?", "Media Advisory: NIH Seeks Research Applications to Study Zika in Pregnancy, Developing Fetus ", "Zika Virus in The Bahamas - Alert - Level 2, Practice Enhanced Precautions - Travel Health Notices | Travelers' Health | CDC ", "Seroprevalence of Zika Virus in Wild African Green Monkeys and Baboons | (09MAR17) | CIDRAP summary in comments  &gt; **Evidence of Zika found in up to 16% of African non-human primates**\n&gt; \n&gt; A study today in Clinical Science and Epidemiology measured the seroprevealnce of Zika virus in wild African green monkeys and baboons and found that up to 16% of these non-human primates had been exposed to the virus. The authors said their study will help provide more information about how Zika is spread among animals before it appears in human populations.\n&gt; \n&gt; Zika, a mosquito-borne virus, was first isolated from a captive rhesus macaque in Uganda in 1947. In 2016, Zika erupted in Brazil, causing the current epidemic that is been linked to microcephaly and other devastating birth defects.\n&gt; \n&gt; To determine the current prevalence of Zika in non-human primates in Africa, the researchers collected blood samples from 14 Chacma-Kind Of hybrid baboons from Kafue National Park in Zambia, 41 yellow baboons from Mikumi National Park in Tanzania, 25 African green monkeys (AGMs) from the Gambia, and 159 AGMs sampled from multiple sites across South Africa. They used deep sequencing on plasma samples to identify Zika antibodies.\n&gt; \n&gt; The authors saw no evidence of active infection in any animals, but antibodies suggested that Tanzanian baboons and Gambian AGMs had prior Zika virus infection. Sixteen percent of Gambian AGMs had Zika virus antibodies, and some were living in areas where no Zika virus had been detected in over a decade.\n&gt; \n&gt; \"We also saw evidence of ZIKV infection in areas of Africa where ZIKV has not been reported in humans or primates in over a decade, potentially pointing to a persistent and previously unrecognized reservoir,\" the authors wrote. \"Ultimately, we believe that the methods reported here will be useful for larger serosurveys of wild animals to more accurately determine the prevalence of ZIKV infection.\"\n\n^Source:", " Is Zika like HIV? In a sense, that once you get the virus, you can never again have unprotected sex without danger of spreading the virus to the partner and/or child. If I get Zika and I am not pregnant now, but what to be pregnant in 5 years, will my child get the virus? Once I get Zika, then can I ever have a healthy child without risk of Zika related birth defects? ", "WHO committee to weigh Olympic Zika threat | (06JUN16) ", "Zika Research Projects List - Published primary research studies and protocols (18APR16) ", "Here is What Zika Virus Infection Looks Like ", "Late sexual transmission of Zika virus related to persistence in the semen ", "CDC issues a Cuba travel warning over the Zika virus ", "Canada confirms its first sexually transmitted Zika case (25APR16) ", "Republicans in Congress Urge Women With Zika to Accept Microcephaly, Not Abortion ", "From 7 cases to 4 million: America at high Alert from Zika Virus :WHO ", "Single mutation tied to Zika's ability to cause microcephaly, GBS | (28SEP17) ", "Constant rejection trying to get Zika virus test ", "How Even You Can Have Success In Online Shopping ", "Travelers to Dominican Republic Lead New York City in Positive Zika Tests ", "Activist doctors groups behind conspiracy theories in Zika virus, Argentine pesticide birth defect scare cases ", "Texas Zika case may be the state's first, unsurprising local transmission | (28NOV16) ", "NY/NJ area Zika Updates I am monitoring zika news everyday and I will try my best to report any important information I find out with sources.\n\n**July 14**  \n  1. (  \n  2. It was ( however, aegypti or albopictus is still unknown.  \n\n**July 13**  \n  1. (\n\n**July 12**  \n  1. ( (    \n  2. (\n\n**July 6**  \n  1. I just called ( They do not mind to do zika testing for you even if you have not been to those countries or show symptoms. Will check this out.   \n  2. NY numbers update: 285, NY numbers update: 45   \n\n**July 5**  \n  1. It has been pretty quiet this weekend. No significant news for NYC area other than no Zika funding approved by Washington. I feel that they are keeping things on the DL. (  \n\n**July 1**  \n1. Five million NYC arrivals from Zika infected countries annually. (  \n\n**June 29**  \n    1. As of Tuesday (\n    2. It looks like cdc still has old data even though it says it was updated today. **There is a discrepancy of 88 cases.** Somehow, I do not trust the CDC that much anymore.   \n\n**June 28**  \n    1. (\n    2. (\n    3. (\n\n**June 27**  \n    1. NJ Bergen County mosquito control sprays your property for free. I imagine other counties will have similar programs.  \n    2. From talking with them: They do have mosquito monitoring, but they do not test for the virus itself. They do take note of Aegypti species during monitoring. The Asian Tiger starts to arrive in mid July, peaks in mid to late Aug and dies off in mid October. I got mixed messages if they were really geared up to test for Zika.  \n    3. They have no designated mosquito locations, rather they are sporadic. If people want a testing trap set up near their property they can get one.  \n    4. There have been about 100 women in Bergen county calling in and asking about mosquito testing and spraying.  \n    5. They have 2 types of sprays, adulticide which kills on contact and is temporary. The other is larvacide which is reserved mainly for swampy areas.  \n    6. (    \n  \n**Jan 20**  \n  1. (", "Dr. Frieden's Zika Letter: A False Alarm? ", "WHO | Dispelling rumours around Zika and complications | (29APR16) ", "‘Ground zero’ of the Zika virus ", "Congress’s Zika Fight Is Really About A Slush Fund To Combat Infectious Diseases | (29APR16) ", "Zika Virus and Birth Defects — Reviewing the Evidence for Causality (13APR16) ", "14 Cases Of Zika Virus Found In Kerala, India  Your post has been automatically removed because it has no content. \n\n\n*I am a bot, and this action was performed automatically. Please (/message/compose/?to=/r/zika) if you have any questions or concerns.*", "Scientists identify dengue antibody that protects against Zika | (26SEP17) ", "Does anyone have an estimate of the total number of Zika infections worldwide? Any links or quotes from a knowledgeable/fact based report would be appreciated. Thanks!", "As Zika looms, US health officials worry about the neighbours ", "Calling upon medical researchers in this Subreddit to keep in touch My name is Alberto. I am a professor of public health at Universidad Central de Venezuela in Caracas, and I am one of the moderators in this subreddit. I believe that thanks to the internet we can network and work together sharing information for research and publishing.\nIf you are interested. message me\nCheers.\n", "Florida probes four suspected non-travel cases of Zika ", "Zika travel once + for all ", "Local Zika transmission confirmed in Singapore | (29AUG16) ", "China's first Zika virus case confirmed, reports say ", "Mysterious and fast-moving, Zika virus has world’s health leaders scrambling ", "WHO | Dispelling rumours around Zika and microcephaly (07MAR16) ", "U.S. confirms Florida Zika cases are first local transmission in continental U.S. ", "Find the Insect Repellent that is Right for You | Insect Repellents: Reducing Insect Bites (01APR16) ", "Zika virus infection may prevent reinfection, study finds ", "Zika infections spread through California ", "Is Zika linked to a monkey die-off in Nicaragua? ", "Zika data point to sexual transmission in women | (27MAY16) ", "LIVE DE 500 HORAS JOGANDO E SORTEANDO 1000 MINECRAFT ORIGINAL AO VIVO  Boraa Venha\n", "What Are The Symptoms Of Zika Virus  Zika is a virus that is closely related to dengue. Learn about the symptoms of Zika virus, what to look for and what to do if you become ill.\n", "Zika raises profile of more common birth-defect virus | (05JUL16) ", "Mosquito responsible for majority of Zika infections found in Canada for first time | (22AUG17) CIDRAP summary in comments  &gt; Aedes aegypti found in Canada as firm reveals novel mosquito control steps\n&gt; \n&gt; Aedes aegypti, the mosquito that transmits Zika, yellow fever, and dengue, has been found for the first time in Canada. According to a report from the Canadian Broadcasting Corporation, experts believe the bug is becoming established in southern Ontario.\n&gt; \n&gt; The mosquito was caught in a trap just a week after the same area of Ontario announced the discovery of two Aedes albopictus mosquitoes, another type known to spread diseases to humans.\n&gt; \n&gt; An official quoted in the story said none of the Aedes mosquitoes tested positive for dengue or Zika, and cited climate change as the likely reason the sub-tropical species were found so far north.\n&gt; Aug 22 CBC (\n&gt; \n&gt; In other mosquito news, a California-based biotech company unveiled novel ways to control mosquitos this week during an annual meeting of the American Chemical Society. The company said climate change has encouraged mosquitos to breed in new climates, resulting in the need for a rapid response to growing insect populations.\n&gt; \n&gt; The company, ISCA Technologies, said more extreme storm events will increase flooding and pooling of water, excellent breeding ground for mosquito larvae. Three new techniques, including a formula that is used to treat floodplains before the rainy season, target mosquitos before they breed. According to ISCA, the formula relies on Bacillus thuringiensis israelensis, bacteria, also known as Bti, that kills mosquito larvae but is benign to the rest of the environment.\n&gt;\n&gt; Aug 23 ICSA Technologies (\n&gt;\n&gt; Aug 22 TDSHS Cyclospora (\n\n^(source: ", "Attack on myelin insulation involved in Zika deaths ", "Did Brazil, global health agencies fumble Zika response? ", "We are all summoned to battle Zika’s threat ", "First Zika Baby Born in NYC ", "Zika PSA ", "Large section of Miami Beach cleared of Zika virus ", "UofG AMA on ZIKA at Noon! ", "Olympic athletes warned about Zika ", "Zika Virus Infection with Prolonged Maternal Viremia and Fetal Brain Abnormalities (30MAR16) ", "HR mining helps athenahealth respond to Miami Zika alert ", "WHO statement on the second meeting of the International Health Regulations (2005) (IHR(2005)) Emergency Committee on Zika virus and observed increase in neurological disorders and neonatal malformations (08MAR16) ", "Harris County infant dies in first Zika-related death in Texas ", "Who is getting Zika virus in the US ", "CDC - Zika in the Americas Active Transmission Report (map) (  \n  \n^(\n\n\n", "International Zika Virus Registry: Protecting Identity of Patients | Contagion Live | (24FEB17)  Alice Panchaud, PharmD, PhD, clinical pharmacist and pharmacoepidemiologist, CHUV, Lausanne University Hospital, Switzerland, explains how the International Zika virus registry protects the identity of patients.", "In 2016, NICHD launched studies &amp; hosted a workshop to identify best ways to treat &amp; care for infants with Zika. ", "Venezuela Is a Ticking Time Bomb | RealClearWorld | (21FEB17)  excerpt:\n\n&gt; Blackouts resulting from a crumbling energy infrastructure are a daily occurrence. The death of newborns has become a common phenomenon, with one doctor saying “the death of a baby is our daily bread.” Infectious diseases once kept under control have surged. Cases of diphtheria and malaria are re-emerging, *and the number of Zika infections is estimated to be “nearly 700,000,” according to a Venezuelan health organization.*\n(emphasis added)", "Puerto Rico Braces for Wave of Mosquito-Borne Zika Virus ", "WHO | Zika situation report | (02JUN16) ", "Costa Rica Does anyone know prevalence rate in Costa Rica? \n\nMy fiancé &amp; I are going on honeymoon &amp; she is off the pill. Our plan was to be very aggressive with prevention methods, watch for symptoms, &amp; then get us both tested when we get back. If we had no symptoms &amp; were negative then try to get pregnant.\n\nWhat is your thoughts? Prevalence rate will not be relevant or helpful for you. There is zika in CR, except for in high altitudes. Your plan sounds sensible, but be aware false negatives have been an issue with public health departments. In addition, if one of you tests positive, you should have a plan for up to 6 months preventing possible transmission (ie barrier sex). \nIt is all about weighing risks. For what it is worth, If I were hoping to get pregnant in the next year, I would not be travelling to zika areas.\n\nsource: work for int orgs in this field. Thanks for commenting. I appreciate it. Since you are involved can I ask one more question? \n\nWhere would we go to get tested? Would her OBGYN be able to order those tests or do we go to somewhere else? Sure! Yes - obgyn can, in fact any primary care doctor should be able to. Might be worth scheduling an appointment with obgyn before you go to make sure you have all the latest up to date info on specificity of the diagnostic test (ie what are the chances of a false negative blood test that misses zika in semen) plus they can preschedule for the test on your return. Yeah we are def pre scheduling. &amp; we talked about our decision tree (for lack of better term). \n\nThanks for your info. If I end up with some other question can I ask you? \n\n&amp; thanks for not brow beating or anything. \n\n Of course. Balancing risks are always tough and involve very personal decisions. Good luck!  This was a very helpful answer. I have a similar question, involving my husband possibly taking a business trip to Costa Rica in two months, then weighing whether we would have to wait 6 months to try to conceive. Is the degree of risk still the same in Costa Rica as when you responded to this two months ago? (How does it relate to the risk in Brazil?) (I know it depends on luck and precautions and where you go in CR, but still--any kind of way to describe it?) \n\nI guess we are wondering whether there is any way for us to be sure enough via testing that he did not/does not have Zika that we do not have to wait the full 6 months? Sorry to be asking these questions, I know they do not have straightforward answers, I just cannot help but ask them.  Hi! So the CDC still classifies Costa Rica as a category 2 risk and advise that couples wait at least 6 months after travel. San Jose and Liberia (two main cities in CAR) are both in transmission zones. An important note is that even if local transmission rates have dropped, that is likely because of increasing local immunity which would not apply to travellers such as your husband, so it is still a risk. Unfortunately, negative blood tests do not mean there is not possible zika still in seminal fluids that could transmit to you (and potential baby).Testing semen and vaginal fluids for Zika virus is not currently available outside of the research setting.\n\nFurther, in a study released this week, zika infection is associated with decreased sperm count in men (returns to normal within a couple of months). This shows how much we are still learning about this disease and how it works. If it were me and my partner, he would not travel. If he legitimately had to, we would then use condoms for 6 months and delay pregnancy.\n\nI would highly recommend seeing your OB/GYN with your partner to discuss your options fully.  :)\n \nMore info here:\n Thanks so much for this answer! This is very helpful, especially the context about local immunity and the lack of access to a Zika semen test.\n\nMuch appreciated!", "Zika outbreak fuelled by mosquito control failure, says WHO boss ", "Zika virus in latin america: reproductive and health rights ", "Timeline of Emergence of Zika virus in the Americas (29APR16) ", "Mosquitoes test positive for Zika in South Beach ", "Our Fixation With Polio and Zika (Part 2 of Series) ", "Frightening images show the insidious way Zika appears to attack babies’ brains ", "Evidence that Zika causes neural stem cells to self-destruct ", "We Were not Prepared For Zika, Researcher Says. Here is Why ", "WHO/UNICEF Zika Virus (ZIKV) Vaccine Target Product Profile (TPP): Vaccine to protect against congenital Zika syndrome for use during an emergency | autodownload .PDF | (24FEB17)  &gt; **WHO updates Zika vaccine target profile, announces research grants**\n&gt; \n&gt; A World Health Organization (WHO) working group recently updated its Zika vaccine target profile, a document used to inform vaccine developers, regulators, and other stakeholders. The group published the first version of the profile in July 2016, and the revision takes into account new data from the past 6 months.\n&gt; \n&gt; The WHO has spelled out two scenarios for use of a vaccine: outbreak response involving mass vaccination campaigns targeting reproductive-age women and routine use in endemic areas that would target the general population.\n&gt; \n&gt; The 17-page document spells out the preferred and minimal characteristics for a vaccine for emergency use and covers indications (for people 9 years old and older) and contraindications (none in pregnant or lactating women). The preferred vaccine would be a nonreplicating one with no safety concerns for use during pregnancy, with the minimal characteristic a single-replicating vector platform with robust safety data or a live, attenuated platform with acceptable safety data. The profile also prioritizes a single-dose vaccine that protects for more than 1 year, can be co-administered with other vaccines, and has a shelf life of at least 12 months.\n&gt; \n&gt; In other Zika developments:\n&gt; \n&gt;The Pan American Health Organization (PAHO) and the WHO yesterday announced a joint initiative to support 17 new Zika research in Latin America and the Caribbean, according to a statement from PAHO, which is the WHO regional office. The projects range from identifying transmission risk factors to examining prenatal counseling. The research projects are based at academic institutions and nongovernmental organizations in Brazil (7), Colombia (4), and Peru (2), with 1 each in Honduras, Jamaica, Mexico, and Venezuela. Each group will receive up to $20,000 from the WHO small grants program.\n&gt; \n&gt;The US Centers for Disease Control and Prevention (CDC) recently released two Zika-related toolkits for health providers, one aimed at obstetricians and the other meant for pediatricians. The publication for obstetricians covers diagnosis, testing, and reporting, and the guide for pediatricians addresses identification of congenital Zika infections, along with diagnosis and reporting.", "Daily Florida Zika virus tracker | Total cases by county (as of August 18) | ", "Taiwan reports Zika in Miami visitor; Florida has 3 new local cases | (17AUG16) ", "Countries and territories with local Zika transmission (10MAR16) ", "Zika Update: Canada Develops Cheap Way Of Killing Mosquito Eggs Using Old Car Tires : News : Nature World News (11APR16) ", "It looks like a takeout container, but it might be our best bet to fight Zika. ", "Zika Epidemiological Update - 21 April 2016 | Zika virus (ZIKV) – Incidence and Trends ", "The Importance of Contraception to the Zika Fight ", "Brazil finds Zika in saliva, urine; expert warns against kissing ", "Aethlon Medical (NASDAQ: $AEMD) CEO Note: The Dilemma in Funding Zika and Other Pandemic Therapies ", "Funding to fight Zika is not a done deal, Senate leaders warn ", "Zika Virus Review by the NEJM ", "WHO | Zika situation report | (08DEC16) ", "Zika Now in Florida ", "PAHO Zika Epidemiological Update | (28AUG17) CIDRAP summary in comments - PAHO links to .PDF autodoanload ", "Updated: Transmission | Zika virus (05APR16) ", "Zika: Q+A with the infectious disease expert (01APR16) ", "Pregnant moms: CDC approved skin so soft with picaridin. Its on sale. ", "Why this Pharma company is not jumping on the Zika vaccine bandwagon ", "Zika virus has travellers trading in Caribbean vacations for ski trips ", "Zika Virus Surveillance Intensifying in the Americas, but Burden of Disease Still Unclear (26MAR16) ", "ECDC Reviews - An imported case of congenital malformation... ", "WHO | Maintaining a safe and adequate blood supply during Zika virus outbreaks, interim guidance ", "Health officials warn of potential Zika outbreak in Florida ", "Screening of Blood Donations for Zika Virus Infection — Puerto Rico, April 3–June 11, 2016 | (17JUN16) ", "Zika virus, travel, flu prompts Canadian Blood Services appeal ", "Ireland Reports First Cases of Zika Virus ", "Zika Virus Prevention: How is Zika transmitted? ", "Zika Virus Surveillance and Preparedness — New York City, 2015–2016 | (21JUN16) ", "Zika Causes Microcephaly, Is Linked to Nerve Cell Infection ", "Aedes mosquitoes entered California years before detection | (11AUG17) ", "The agonizing wait of an expectant mother with Zika: ‘Is my baby okay?’ ", "CDC Official Says Thousands May Have Arrived in US With Zika ", "Reporting on Zika When You Have Zika ", "Move complete, Codagenix takes aim at Zika - Innovate Long Island ", "World Community Grid: Your Spare Computing Power Could Help Fight Zika ", "Where Zika Could Spread Next ", "Researchers Discuss Zika’s Effects on Child Development at NIH Workshop ", "Zika: 7 New Cases Identified in South Florida ", "Poliovirus and Zika: What is Past is Prologue (Part 1 of Series) ", "South Florida cases suggest Zika now likely a part of our daily lives ", "Who thinks that will spread to more places ", "Zika spread confirmed in Miami Beach (updated) | (19AUG16) ", "1st Puerto Rico woman with Zika gives birth to healthy baby ", "​Venezuela says 3 dead from Zika virus complications ", "Description of 13 Infants Born During October 2015–January 2016 With Congenital Zika Virus Infection Without Microcephaly at Birth — Brazil | (22NOV16) ", "It is Official: Zika Virus Causes Birth Defects ", "\"WHO: No Zika Cases Among Olympics Attendees\" - Are we missing something..? ", "Thailand finds 33 new cases of Zika, says health ministry ", "Florida’s Feud Over Zika-Fighting Mosquitoes Heats Up ", "Zika virus: Floridians fear 'Pandora's box' of genetically altered mosquitos ", "Zika Virus Info and News - Android App - Download Now ", "Zika linked to brain infections in adults by French researchers ", "Zika virus: Inside Uganda's forest where the disease originates ", "Exclusive: Zika virus discourages many Americans from Latin America travel ", "Zika response in focus with new evidence of birth defect link ", "Brazil's mothers left to raise microcephaly babies alone ", "Miami residents fret over pesticide used to fight Zika ", "Phase 2 Zika vaccine trial begins in U.S., Central and South America | (31MAR17) CIDRAP summary in comments  &gt; **First phase 2 Zika vaccine trial begins**\n&gt; \n&gt; The National Institute of Allergy and Infectious Diseases (NIAID), part of the National Institutes of Health (NIH), launched phase 2 of their multi-site two-part DNA Zika vaccine trial, VRC 705.\n&gt; \n&gt; \"We are pleased to have advanced rapidly one of NIAID's experimental Zika vaccines into this next stage of testing in volunteers. We expect this study will yield valuable insight into the vaccine's safety and ability to prevent disease caused by Zika infection,\" said NIAID Director Anthony S. Fauci, MD. \"This trial marks a significant milestone in our efforts to develop countermeasures for a pandemic in progress.\"\n&gt; \n&gt; NIAID aims to enroll 2,490 healthy participants in areas with active or potentially active mosquito-transmitted Zika zones, including the United States and Puerto Rico, Brazil, Peru, Costa Rica, Panama and Mexico. This is the first Zika vaccine to make it to the second phase of human trials, which will gather more safety and immune response data, focusing on if the vaccine is effective when recipients are naturally exposed to Zika.\n&gt; \n&gt; The vaccine uses a small circular piece of DNA called a plasmid that contains proteins found in the Zika virus. When injected intramuscularly, the plasmid triggers an immune response to the mosquito-borne virus.\n&gt; \n&gt; Participants in the first part of the trial, designed to determine the optimal dose and injection site, will follow participants for 32 weeks. The second part, designed to assess protection after natural exposure to the virus, will follow participants for 2 years.\n\n^(source:  **( **(", "As Babies Stricken By Zika Turn 1, Health Problems Mount ", "NEJM - Cutaneous Eruption in a U.S. Woman with Locally Acquired Zika Virus Infection | (11JAN17) ", "Resident of Yolo County tests positive for Zika virus ", "Zika Virus Has Mutated and This May Explain Why It is Weird ", "CDC monitoring 320 U.S. pregnant women with Zika ", "French researcher says Zika link to Guillain-Barré Syndrome is ‘almost certain’ ", "The Zika Files: DEET is part of a binary chemical weapon targeting your brain (FULL) ", "Educational rap video about Zika Virus that my boss made ", "Brazil soldiers deployed to warn of risks ", "Animal study hints at Zika damage potential in adult brains | (18AUG16) ", "Zika: Arbovirus research; Semen virus count; low platelet counts| (21DEC16) ", "WHO: Zika virus ‘spreading explosively,’ ‘level of alarm extremely high’ ", "European Mosquito maps (ECDC) ", "Brain Damage in Zika Babies Is Far Worse Than Doctors Expected ", "Zika-carrying mosquitoes eluding control efforts in Miami ", "ECDC | Outbreak of Zika infection in French Polynesia | Historical reference from 14 Feb 2014 ", "1st U.S. Zika case transmitted sexually: Texas health officials ", "While Latin America struggles over Zika, Haiti faces epidemic with a shrug ", "Study shows how Zika virus could cause fetal brain defects ", "Zika virus: Brazilian survey calls into question cause of microcephaly ", "Pyriproxyfen &amp; microcephaly, paper discusses causal mechanism Paper discusses possible retinoid receptor activation as causal mechanism for microcephaly in Brazil. Possible Zika co-factor? \n", "Whatever Happened to Zika? ", "Virus Zika, datos importantes ", "Leading U.S. Doctors Urge Funding for Zika Fight ", "Zika Virus Is Serious (But It is Not Another Ebola) ", "How Best To Test For Zika Virus? (10MAR16) ", "Presence of Musashi binding elements in Zika and related Flavivirus 3'UTRs may indicate role on pathogenicity ", "As Zika threat looms, how pregnant women can protect themselves ", "Do you know these 20 facts about the zika virus? ", "Three Zika virus cases confirmed in Guinea Bissau ", "CDC updates Zika guidance for couples trying to conceive | (30SEP16) ", "CDC Declares Zika–Microcephaly Link Solid ", "Interim Guidance for Protecting Workers from Occupational Exposure to Zika Virus ", "The Washington Post: Zika is tied to second adult brain disease, deepening fears of virus’s unknown dangers ", "HHS sponsors new Zika diagnostic test, boosting national testing capacity | (12APR17) ", "What the Zika Crisis Means for Your Business - The ongoing Zika outbreak reinforces the need to establish corporate resiliency plans in the face of public health crises ", "Zika's spread in Brazil continues, but where else is in danger? ", "How Zika virus is affecting Caribbean travel ", "France records first sexually transmitted case of Zika in Europe ", "World Health Organization Chief Says Zika Risk Is Low at Rio Olympics ", "CDC identifies potential risk of Zika virus transmission since June 15, 2016, in Miami-Dade, Broward, and Palm Beach counties | (13MAR17) CIDRAP summary in comments  &gt; **Feds warn of Zika threat to sperm donations in 3 Florida counties**\n&gt; \n&gt; A more in-depth analysis of locally acquired Zika cases in Florida led the US Centers for Disease Control and Prevention (CDC) today to warn of a potentially increased risk to residents of Broward and Palm Beach counties, especially as it relates to donated semen, which can harbor the virus for as long as 3 months.\n&gt; \n&gt; In a statement and at a media briefing today CDC officials said its investigators, along with the Florida Department of Health (Florida Health), looked at local residents' travel patterns between Miami-Dade, Broward, and Palm Beach counties. The CDC said that, since Jun 15, 2016, residents of Broward and Palm Beach counties have been at a potentially increased risk, because they often move back and forth to Miami-Dade County, which was Florida's only transmission area. Also, some of the people in the region who were sick with Zika apparently did not travel to Miami-Dade County.\n&gt; \n&gt; The CDC's statement also appears to push back the start date of the risk period from Aug 1, 2016, to Jun 15, 2016.\n&gt; \n&gt; Denise Jamieson, MD, incident commander with the CDC's Zika emergency response and chief of the women's health and fertility branch in the CDC's reproductive health division, told reporters that new information found in the cases highlights the challenges of identifying the exposure source.\n&gt; \n&gt; Officials said residents of the tri-county area may not consider their movements between counties as travel to a risk area. Though the exposure locations are unclear for some of the patients who acquired their infections locally, CDC officials said that while Broward and Palm Beach counties have not been considered active local transmission areas, they are areas at increased risk.\n&gt; \n&gt; The increased risk is especially relevant for semen, because of viral persistence in that reproductive tissue, the CDC said. Unlike for blood donations, donated semen does not undergo a validated test to detect Zika virus, so there is a risk that some donations collected and stored at local tissue banks might still contain Zika virus.\n&gt; \n&gt; Federal health officials want to make sure women and couples are aware of the potential threat to semen donated over the past several months in the Broward, Miami-Dade, and Palm Beach counties and talk to their doctors before undergoing assisted reproduction procedures with donated semen.\n&gt; \n&gt; Peter Marks, MD, PhD, director of the Center for Biologics Evaluation and Research with the US Food and Drug Administration (FDA) said there are 12 sperm banks in the three-county area.\n&gt; \n&gt; There have been no suspected cases of Zika in Florida transmitted through donated semen, said Matthew Kuehnert, MD, who leads the blood safety task force for the CDC's Zika emergency response.\n&gt; \n&gt; Officials said the last locally acquired Zika case occurred on Dec 21, though Florida Health recently reported a few more cases that were confirmed in follow-up testing.\n&gt; \n&gt; See also:\n&gt; \n&gt; Mar 13 CDC ( **( **(", "NIH launches large study of pregnant women in areas affected by Zika virus | (21JUN16) ", "Texas Dept of State Health Services | Zika Virus Update | (27JAN17) ", "Zika virus: a previously slow pandemic spreads rapidly through the Americas (Published: 18DEC2015) ", "UMMS scientists offer first look at how our cells can ‘swallow up and quarantine’ Zika ", "Zika Virus Risk-Based Preparedness and Response Guidance for States | Zika virus (09MAR16) ", "WHO sets new guidelines on Zika sex; CDC reviewing its advice ", "Beenie Man Misses OVO Fest After Contracting The Zika Virus ", "Zika virus-like particle (VLP) based vaccine | (08MAY17) CIDRAP summary in comments  &gt; **VLP Zika vaccine successful in preclinical study**\n&gt; \n&gt; A novel virus-like particle (VLP) Zika vaccine elicited high titers of virus-neutralizing antibodies in mice, according to the vaccine's manufacturer, TechnoVax. The results of the study were published earlier this week in PLoS Neglected Tropical Diseases.\n&gt; \n&gt; \"The ZIKA VLP vaccine offers an effective and safe strategy to create a prophylactic vaccine that protects against Zika infection, as well as its serious effects such as microcephaly,\" said Jose M. Galarza, MD, TechnoVax chief executive officer said in a press release from the company.\n&gt; \n&gt; Though VLPs are identical to a virus, they lack the genetic ability to replicate. And because vaccines made with VLPs do not require attenuating a virus, they are touted for their safety profiles and immunogenicity.\n&gt; \n&gt; In other Zika news, a woman in the Washington, DC, area has Zika after being mistakenly told she was negative for the mosquito-borne virus last year. At the time of the testing mistake, the woman was pregnant.\n&gt; \n&gt; Four hundred tests from a DC-area lab were sent to the Centers for Disease Control and Prevention (CDC) for retesting earlier this year after it was discovered that technicians made an error when handling test samples. According to the Associated Press, it is not known if the woman's pregnancy was affected by Zika.\n&gt;\n&gt; May 8 PLoS Negl Trop Dis (\n&gt;\n&gt; May 9 TechnoVax (\n&gt;\n&gt; May 9 Associated Press (\n", "ZAP Summit Follow-up Teleconferences |(\n|-|-|-|\n|( • Marc Fischer, MD, MPH|PDF-25 Pages|\n|( • Dana Meaney Delman, MD |PDF-30 Pages|\n|(  - ( ( • John T. Brooks, MD |PDF-25 Pages|\n|( - ( ( | • Janet McAllister, Ph.D. | PDF-35 Pages | \n|( |  • Sonja Rasmussen, MD, MS,  • Janet Cragan, MD, MPH |PDF-31 Pages |\n|Health Messaging and Communication for Response to US Zika Virus Transmission ( - ( - ( - ( • (Intro) Chris Kosmos, RN, MS • John O’Connor, MS, • Molly Gaines-McCollom, MPH, • LCDR Sue Partridge, MPH, • Carina Blackmore, DVM, PhD, • Renay Rouse, BSc | PDF-35 pages| \n|( Pages|\n\n\n|reference|information|\n|-|-|\n|Audio |Links prompting a new browser tab to open and the audio to begin playing. \n||To acquire a copy of the MP3 file: Right click on the progress bar and select 'Save Audio As' from the drop down menu.|\n|Transcript|Links to begin autodownloading the associated file.|\n|English|Links to begin autodownloading the associated file in English.|\n|Spanish|Links to begin autodownloading the associated file in Spanish.| \n||Autodownloaded files may typically be found at C:\\Users\\&lt;username&gt;\\Downloads|", "Cases of Zika virus on the rise in Switzerland | (10MAY16) ", "US blood supply should be screened for Zika, FDA says ", "On the front line in Brazil’s war on Zika: ‘I felt I was in a horror movie’ ", "Zika: Florida Is Investigating Possible Local Infection ", "Chasing an epidemic: On the road with Brazil's Zika detectives ", "Suspending a chicken over your bed could protect against Zika virus and malaria ", "Hearing Loss in Infants with Microcephaly and Evidence of Congenital Zika Virus Infection | (30AUG16) ", "Zika Is Likely to Become a Permanent Peril in U.S. ", "Factbox: Why the Zika virus is causing alarm ", "Outsmarting Outbreaks: Using Genomics to Track Viruses - Kristian Andersen, Scripps Research (2019) Viruses are spread by airlines and cruise ships. A lot about zika, Ebola and a few other diseases and how and when they spread.  ", "Zika Virus: Why now and What will happened next ", "Researchers In Colombia Try To Determine If Zika Virus Is Linked To Guillain-Barre Syndrome : NPR ", "What Would It Take to Prove the Zika–Microcephaly Link? ", "First Outbreak of Locally Transmitted Zika Confirmed in Continental US ", "Devouring 1,000 Mosquitoes an Hour, Bats Are Now Welcome Guests as Zika Fears Rise ", "I think I have contracted Zika and now my left arm is getting numb. Ok so I am freaking out. I live in the tropics and my parents both contracted Zika (confirmed after tests). Now a week later I have the exact symptoms, mild to high fever, joint and body pains, red eyes and now today, my left arm is feeling tingly and numb. Right arm is perfectly fine. \n\nI am freaking out at the possibility I may be developing Guillain-Barré Syndrome. \n\nI am pretty sure I have experienced occasional numbness like this but not all day like this.  Yesterday I was almost 100% fine with no symptoms. Today it is like I am experiencing everything fully. \n\nShould I be freaking out about Guillain-Barré Syndrome?", "Senate Passes Zika Bill That Will Go Nowhere Fast ", "Wisconsin Department of Health Services | Zika Virus (31MAR16) ", "Zika hits home while Congress fiddles ", "Zika Fears Prompt 150 Public Health Experts to Call for Olympics to Be Moved From Rio ", "Zika vaccine race spurred by crisis and profit potential ", "C.D.C. Investigating 14 Cases of Zika Transmission Through Sex ", "Puerto Rico reports 1st death from paralysis linked to Zika ", "Geographic distribution of microcephaly cases by category in Brazil: interactive visualization ", "Seroprevalence of Zika Virus in Wild African Green Monkeys and Baboons | (09MAR17) ", "Zika Virus :: Washington State Dept. of Health ", "Zika has been linked to birth defects. Now it may be causing paralysis. ", "Zika threat has Canadian officials weighing blood donation restrictions ", "Zika Virus and Microcephaly infection in Brazil leads to Pregnancy Discussion ", "Crowdfunding to find new Zika virus drugs. Come help me with my project! ", "WHO | Zika situation report | (04AUG16) ", "WHO | WHO statement on the 2nd meeting of IHR Emergency Committee on Zika virus and observed increase in neurological disorders and neonatal malformations ", "Zika vaccine prevents pregnancy spread, testicle damage in mice | (22SEP17) ", "New Virus Breaks The Rules Of Infection ", "FDA expands Zika screening to all US blood centers ", "Evidence of Locally Transmitted Zika Virus Reportedly Found in Tourist Haven ", "Miscarriages reported in 2 U.S. women with Zika virus, CDC says ", "From Mosquitos to Humans: Genetic Evolution of Zika Virus (18APR16) ", "CDC | Facts about Microcephaly | Birth Defects | NCBDDD ", "The Caribbean Public Health Agency's (Android) mobile game Zap-a-'quito, short for Zap a Mosquito ", "CARPHA - Download the Clean Yard Poster (undated JPG) ", "Zika Virus Infects Human Cortical Neural Progenitors and Attenuates Their Growth ", "Prior dengue infection protects against Zika | 07FEB19 ", "Zika virus explained: What is it, where is it, and how does it spread? ", "Study confirms 4-fold rise in Zika microcephaly in Colombia | (12DEC16) ", "El Salvador confirms first Zika-linked birth defect ", "Interim Guidelines for Health Care Providers Caring for Infants and Children with Possible Zika Virus Infection — United States, February 2016 ", "Baby with Zika-linked microcephaly born in New Jersey| (01JUN16) ", "Should pregnant tourists avoid Disney World now that Fla. mosquitoes carry Zika? ", "Are Culex Mosquitoes Potential Vectors of the Zika Virus? (02MAR16) ", "SHOCK: Texas Medicaid prescribing women and children toxic mosquito repellent with DEET to 'protect' against Zika - NaturalNews.com ", "International mission convened by PAHO visits El Salvador to exchange experiences and support the response to Zika (08MAR16) ", "Lab study reveals Zika damage mechanism in fetal brain | (06MAY16) ", "Brazil Zika virus: 'War' declared on deadly mosquitoes ", "New mosquito trap smart enough to keep just the bad bugs | (16FEB17) ", "zika dataset request Any data would be helpful but links to any databases or datasets would be awesome.\n\nthanks all", "HIV Infection &amp; Zika Virus | (26APR16) ", "Women infected with Zika should continue to breastfeed: WHO ", "Louisiana Investigates Two Suspected Cases Of Zika Virus In People Who Traveled To Caribbean ", "Zika-killing mutant mosquitos approved by FDA ", "New US mosquito maps show potential hot spots for Zika, other diseases | (21SEP17) ", "Case-control study finds more evidence of Zika-GBS link | (31AUG17)  &gt; &gt; **Colombian case-control study builds support for Zika-GBS link**\n&gt; \n&gt; On the heels of similar findings from Brazil last week, a case-control study from Colombia found more evidence of a link between Zika illness and Guillain-Barre syndrome (GBS) and a much higher incidence of the condition in older people.\n&gt; \n&gt; Researchers from Colombia and their collaborators at the US Centers for Disease Control and Prevention (CDC) reported their findings Sep 4 in the Journal of the Neurological Sciences.\n&gt; \n&gt; They interviewed and tested 47 patients with GBS who were reported to health officials in Barranquilla, Colombia, from Oct 1, 2015, to Apr 2, 2016. The team compared the findings and incidence with two age-range matched controls from the same neighborhood as each GBS patient.\n&gt; \n&gt; Incidence of GBS was 10 times higher in people age 60 and older compared with those younger than 20. Last week's Brazilian study also found that the incidence was 10 times higher in the oldest group than in the youngest group.\n&gt; \n&gt; The Colombian study also found that those with suspected or probable Zika disease also had higher odds of developing GBS. In addition, the researchers found that, similar to reports from other regions, peaks in Zika disease and GBS coincided.\n&gt;\n&gt; Sep 4 J Neurol Sci ( \n&gt;&gt;____\n&gt;&gt; ***Abstract***\n&gt;&gt;\n&gt;&gt;**Background**\n&gt;&gt;\n&gt; &gt; An outbreak of Guillain-Barré syndrome (GBS), a disorder characterized by acute, symmetric limb weakness with decreased or absent deep-tendon reflexes, was reported in Barranquilla, Colombia, after the introduction of Zika virus in 2015. We reviewed clinical data for GBS cases in Barranquilla and performed a case-control investigation to assess the association of suspect and probable Zika virus disease with GBS.\n&gt;&gt;\n&gt; &gt; **Methods**\n&gt; &gt; \n&gt; &gt; We used the Brighton Collaboration Criteria to confirm reported GBS patients in Barranquilla during October 2015–April 2016. In April 2016, two neighborhood and age range-matched controls were selected for each confirmed GBS case-patient. We obtained demographics and antecedent symptoms in the 2-month period before GBS onset for case-patients and the same period for controls. Sera were collected for Zika virus antibody testing. Suspected Zika virus disease was defined as a history of rash and ≥2 other Zika-related symptoms (fever, arthralgia, myalgia, or conjunctivitis). Probable Zika virus disease was defined as suspected Zika virus disease with laboratory evidence of a recent Zika virus or flavivirus infection. Conditional logistic regression adjusted for sex and race/ethnicity was used to calculate odds ratios (ORs) and 95% confidence intervals (CIs).\n&gt;&gt;\n&gt; &gt; **Results**\n&gt; &gt; \n&gt; &gt; We confirmed 47 GBS cases. Incidence increased with age (10-fold higher in those ≥60 years versus those &lt;20 years). We interviewed 40 case-patients and 79 controls. There was no significant difference in laboratory evidence of recent Zika virus or flavivirus infection between case-patients and controls (OR: 2.2; 95% CI: 0.9–5.1). GBS was associated with having suspected (OR: 3.0, 95% CI: 1.1–8.6) or probable Zika virus disease (OR: 4.6, CI: 1.1–19.0).\n&gt;&gt;\n&gt; &gt; **Conclusions**\n&gt; &gt; \n&gt; &gt; Older individuals and those with suspected and probable Zika virus disease had higher odds of developing GBS.\n&gt;&gt;\n&gt; &gt; **Key points**\n&gt; &gt; \n&gt; &gt; *We confirmed a Guillain-Barré syndrome (GBS) outbreak in Barranquilla, Colombia, during October 2015–April 2016. A case-control investigation using neighborhood controls showed an association of suspected and probable Zika virus disease with GBS.*\n&gt;&gt;\n&gt;\n&gt; Aug 31 CIDRAP News story (\n&gt;\n&gt;^(source: \n&gt;", "Should I use protection with my girlfriend who just went to Costa Rica ", "What could go wrong? Genetically modified mosquitoes to swarm Houston in latest Zika hoax lunacy… ", "Zika’s persistence in the eye may play a role in spreading the virus, study finds ", "84 Pregnant Women in Florida Have Tested Positive for Zika Disease ", "News - Zika epidemic in the Americas and Caribbean as of 24 Feb 2016 ", "BioCryst's Zika drug shows promise in mice ", "WHO | Zika situation report | (25AUG16) ", "Zika Virus - Situational Awareness Products - both National &amp; Subnational Below are links to information provided by the ( showing national and subnational information about Zika, Dengue and Chikungunya viruses in the Americas.\n\nFrom now forward this information will be found in the Zika Wiki's\n\n* **National**  \n\n|| Date | Region - Title |\n|-|:-: | :- | -|\n|| 16MAR16 | ( |\n|| 26FEB16 | ( |\n|| 24FEB16 | ( |\n|| 03FEB16 | ( |\n|| 03FEB16 | ( |\n|| 03FEB16 | ( |\n|| 01FEB16 | ( |\n|| 30JAN16 | ( |\n|| 30JAN16 | ( |\n|| 30JAN16 | ( |  \n\n.  \n\n* **Subnational**  \n\n|| Date | Country -Title |\n|-|:-: | :- | -|\n|| 16MAR16 | ( |\n|| 16MAR16 | ( |\n|| 04MAR16 | ( |\n|| 04MAR16 | ( |\n|| 26FEB16 | ( |\n|| 26FEB16 | ( |\n|| 26FEB16 | ( |\n|| 24FEB16 | ( |\n|| 24FEB16 | ( |\n|| 24FEB16 | ( |\n|| 19FEB16 | ( |\n.  \n.  \n\nWould like to extend our thanks to ( for bringing this information source to our attention.   \n\n**ReliefWeb** has been the leading source for reliable and timely humanitarian information on global crises and disasters since 1996.  \n\nReliefWeb is a specialized digital service of the United Nations Office for the Coordination of Humanitarian Affairs  (OCHA).  \n\n **ReliefWeb;**  **Informing humanitarians worldwide with Timely Reliable Humanitarian Updates**\n\n\n\n\n", "CDC issues historic travel warning over Zika in Miami ", "CDC probing possible first Zika case from US mosquito bite ", "CRITICAL DETAILS ABOUT YOUR BLOOD AND SWEAT—AVOIDING ZIKA ", "Yale study looks at how Zika can infect a fetus ", "First Commercial Zika Test Gets FDA OK ", "Daryle Koltays microcephaly/zika message. ", "Zika Travel Information | Travelers' Health 27MAR19 ", "Zika - Caribbean Public Health Agency's Information source ", "If we can raise $2,500 for zika prevention I will wax my chest on video. ", "Florida health department: 16 Zika virus cases statewide, all travel related ", "Zika Virus Persists in the Central Nervous System and Lymph Nodes of Rhesus Monkeys ", "Zika Virus Outbreak Prompts CDC to Activate Highest Emergency Ops Level ", "Zika in India ", "Any Kind of Sex Can Spread Zika, CDC Says in Updated Guidance ", "CDC - Mosquito (Aedes aegypti) life-cycle (05APR16) ", "Texas Adds Three Counties to Enhanced Zika Testing Recommendations | (24AUG17) CIDRAP summary in comments  &gt; **Texas adds three counties to Zika testing recommendation**\n&gt; \n&gt; The Texas Department of State Health Services (TDSHS) today added three counties to its enhanced Zika virus testing recommendations for pregnant women as well as people with rash and other symptoms of the disease.\n&gt; \n&gt; The new counties include Kinney, Maverick, and Val Verde counties, all in the southern tip of the state on the border with Mexico. They join six other counties that are already recommended for enhanced testing: Cameron, Hildago, Starr, Webb, Willacy, and Zapata.\n&gt; \n&gt; There is no evidence of ongoing Zika transmission anywhere in Texas, but the TDSHS said climate and geography in the nine counties are at higher risk for Zika spread by mosquitoes and that reports from Mexico show transmission is still occurring in some of its states, including some at the US border.\n&gt; \n&gt; Also today, the TDSHS updated its advice for testing pregnant women in the high-risk areas, urging providers to test them 3 times rather than 2 during pregnancy, consistent with a recent recommendation change from the US Centers for Disease Control and Prevention (CDC).\n&gt; \n&gt; The TDSHS warned that Texas is entering peak mosquito season, and it warned people to protect themselves from mosquito bites by consistently wearing repellent, wearing long sleeves and pants, and using air conditioning or making sure door and window screens are intact.\n&gt; \n&gt; So far, Texas has only reported one local Zika case this year, an individual from Hildago County whose illness was announced at the end of July.\n&gt; \n&gt; Aug 24 TDSHS (\n\n^(source: ", "Why Zika Is This Year’s Scary Virus ", "Bug spray bound for Haiti to fight Zika virus turned away at MSP ", "Harvard group is developing a portable, low-cost test for Zika that would allow rapid testing without specialized lab equipment. ", "Zika triggers declaration of emergency in Puerto Rico | (12AUG16) ", "Zika Virus Testing. How Ordering Online Helps? ", "Brazil declares war on the mosquito transmitting the Zika Virus and MIT has the plan to kill the mosquitos quickly ", "Zika virus infection – Viet Nam (11APR16) ", "Zika unlikely, but not impossible, in Wisconsin this summer ", "Zika virus could become 'explosive pandemic' ", "Article covering vital aspects of the Zika Virus ", "CDC Concludes Zika Causes Microcephaly and Other Birth Defects | (13APR16) ", "A peptide-based viral inactivator inhibits Zika virus infection in pregnant mice and fetuses | (25JUL17) CIDRAP summary in comments  &gt; **Peptide treatment for preventing Zika spread promising in mouse study**\n&gt; \n&gt; A research team from China today reported promising findings for a synthetic peptide that that inhibited Zika infection in pregnant mice, which might be useful for preventing birth defects in offspring. They published details of their experiments in Nature Communications.\n&gt; \n&gt; The peptide they tested, called Z2, was made from the stem region of the Zika virus envelope protein. The researchers noted that peptide drugs are receiving more attention, because they are thought be safer and less expensive to develop than small-molecule or antibody-based antiviral treatments.\n&gt; \n&gt; First, the team determined that Z2 could inactivate Zika virus, based on in vitro studies in three different cell lines. In the second part of their study they experimentally infected pregnant mice, then administered Z2 or phosphate-buffered saline. Investigators monitored the penetration of the treatment in maternal organs in the developing fetuses, while also assessing the safety of Z2.\n&gt; \n&gt; The researchers found that Z2 can penetrate the placental barrier and enter fetal tissues and blocked the vertical transmission of Zika virus. Based on monitoring of weight and observations, they saw no adverse events in mothers or pups.\n&gt; \n&gt; They concluded that the drug could be considered for preclinical development.\n&gt; \n&gt; Jul 25 Nat Commun (\n&gt; \n____\n^(source: ", "Homegrown Zika raises more questions about the evolving risk ", "On the Seasonal Occurrence and Abundance of the Zika Virus Vector Mosquito Aedes Aegypti in the Contiguous United States ", "Why killing mosquitoes is not enough to deal with Zika virus? ", "Wynwood A ‘Ghost Town’ As Spraying For Zika Continues ", "India Acknowledges Three Cases of Zika Virus ", "YOUTUBE CHANNEL ", "What We Know So Far About Sexual Transmission Of Zika Virus ", "Sex May Spread Zika Virus More Often Than Researchers Suspected ", "Neurodevelopmental Abnormalities Associated With In Utero Zika Virus Infection | 06JAN20 ", "Florida officials go into damage-control mode over Zika ", "Fears grow amid Brazil’s Zika crisis ", "Aumenta el riesgo de muertes por abortos clandestinos por miedo al zika en América Latina ", "CDC | Areas with Zika | Zika virus ", "Newborns with NAS reflect growing local health crisis ", "Why America’s Top Health Official Is Worried About Zika ", "UN Asks Critic to Join Zika Group but Then Revokes Invite | (14JUN16) ", "Fight against Zika virus makes Haiti key battleground ", "Colombia: 3,177 Pregnant Women With Zika; No Microcephaly ", "Will Zika become the 2016 NTD of the Year? ", "CDC Information Feeds as of: 18 February 2016 (links to CDC Websites and PDF documents) \n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n**Note:** Parts of the information above will be included in the ( \n", "Does Zika infect your semen permanently? Cause if it does......fuckkkkkkkk mosquitos! ", "HAN Archive - 00402|Health Alert Network (HAN) | (05MAY17) ", "Purified Inactivated Zika Vaccine Candidates Afford Protection against Lethal Challenge in Mice ", "Malaysia confirms first case of Zika infection ", "Baby with microcephaly from Zika virus born at New Jersey hospital ", "Experimental Zika virus infection of Jamaican fruit bats (Artibeus jamaicensis) and possible entry of virus into brain via activated microglial cells |04FEB19 ", "New Virus Breaks The Rules Of Infection - A Multicomponent Animal Virus Isolated from Mosquitoes • /r/infectiousdisease ", "Zika virus turns deadly in Venezuela because of acute medicine shortage ", "New Zealand investigating possible sexual transmission of Zika virus ", "Colombia confirms first three deaths of patients infected with Zika virus ", "Congress Is Told U.S. Needs More Money to Fight Zika ", "CDC Zika Travel Information | (12MAY16) ", "1st baby born in N.J. hospital with Zika-related birth defect ", "Zika virus – 04 February 2016 Interview with Dr Claudia Nunes Duarte dos Santos who is lab was the first to isolate ZIKV in that region of Brazil. ", "명절맞이∥역삼오피∂특가event∂udaisoØ4//ＣØＭ』강남오피》》》광주오피 유다이소 ", "TIL 80% of Zika patients have *no* symptoms--pregnant women do not even realize they have been infected until they give birth to a baby with birth defects ", "U.S. FDA says engineered anti-Zika mosquito environmentally safe ", "Zika affected woman's brain and memory, doctors say ", "Real-time analysis of Zika virus evolution ", "The Emerging Zika Pandemic - Enhancing US Preparedness ", "Brazil Confirms More Infant Brain Damage Cases Related to Mosquito-Borne Zika Virus ", "Officials warn of rampant spread of ‘head-shrinking’ virus in US territory Puerto Rico ", "Ebola Crisis Might Hold Clues for Fighting Zika Virus ", "Study hints at greater Zika sexual transmission threat to fetuses | (25AUG16) ", "Treating Women with Zika: A Frontline View from an OB-GYN in Miami ", "Community Work: A Key to Zika Prevention in Colombia (14MAR16) ", "Microcephaly/Zika virus ", "Local Zika outbreaks in United States 'likely': US official ", "Transcript for CDC Telebriefing: Zika Summit Press Conference (01APR16) ", "WHO | Zika virus Fact Sheet (English) ", "What is really scary about the Zika virus are the things we do not know ", "Could man-hating microbes help fight off the mosquitoes that carry Zika? ", "Zika Virus in Rio: Doctor Treating Infants Says 'This is Scary' ", "Zika linked to hearing and vision complications in adults | (09DEC16) ", "Palm Beach County has first case of locally-acquired Zika virus ", "Indian Company Has Build Vaccination For Zika Virus. ", "Another Zika case reported outside Miami's transmission zone ", "South America sees Zika rise; study estimates US disease cost | (28APR17) ", "CDC update: 147 Zika cases in U.S. ", "Diseases like Zika and Ebola know no party affiliation…but public health responses do ", "Researchers report new Zika complication ", "Zika could be carried by NZ mosquito ", "Officials: Zika spread through sex by man with no symptoms ", "Journal of Korean Medical Science | First Imported Case of Zika Virus Infection into Korea | (27MAY16) ", "Update: Interim Guidance for the Diagnosis, Evaluation, and Management of Infants with Possible Congenital Zika Virus Infection | (20OCT17) CIDRAP summary in comments  &gt; **CDC updates guidance for babies born to mothers with possible Zika exposure**\n&gt; \n&gt; The US Centers for Disease Control and Prevention (CDC) announced today that it has updated its clinical guidance for caring for babies born to mothers who may have been infected with Zika virus during pregnancy. The update, which appears today in Morbidity and Mortality Weekly Report, includes the latest scientific information since the August 2016 release of earlier guidance.\n&gt; \n&gt; Though Zika illnesses have declined since 2016, cases are still being reported, and the CDC urged clinicians to remain alert to the threat and to closely monitor babies who had possible congenital exposure to the virus.\n&gt; \n&gt; CDC Director Brenda Fitzgerald, MD, said in a statement today, \"There is a lot we still do not know about Zika, so it is very important for us to keep a close eye on these babies as they develop.\"\n&gt; \n&gt; New guidance defines three groups of infants, based on their symptoms or lack of symptoms, plus the mother's exposure and lab findings. The recommendations also contain new information on follow-up care. For example, some types of screening (ie, thyroid and hearing at 4 to 6 months) are no longer recommended, due to a lack of data on whether they are needed. On the other hand, guidance expands the list of potential problems in babies already known to have birth defects, to include breathing difficulty, swallowing difficulty, and hydrocephaly.\n&gt; \n&gt; The CDC emphasized that because complex services are needed to care for infants with Zika-related birth defects, care should be given by a multidisciplinary team and an established medical home.\n&gt; \n&gt; Oct 19 (\n&gt; \n&gt; Oct 19 (\n\n^(source_ ", "PAHO launches Zika virus research database ", "WHO | WHO Director-General briefs the media on the Zika situation (22MAR16) ", "ZiBRA project: Road-trip through Brazil to collect and sequence Zika virus genomes ", "Warming linked to spread of zika virus ", "Zika is just one flight away from these 57 countries ", "500,000,000 people world wide have been infected from mosquito's as of January 2019 ", "Two studies highlight risk of fetal Zika damage (related links in comments) | (14DEC16) ", "Researchers detail features of congenital Zika syndrome ", "Meet London's Zika virus busters who are on the verge of creating a vaccine | London Life | Lifestyle ", "Maternal Zika Virus Disease Severity, Virus Load, Prior Dengue Antibodies and their Relationship to Birth Outcomes Zika Severity and Birth Outcomes | Clinical Infectious Diseases | (23MAY17) CIDRAP summary in comments.  &gt; **Zika severity not linked to defects, prior dengue infection**\n&gt; \n&gt; A new study in Clinical Infectious Diseases showed that Zika severity, prior dengue infection, and viral load did not affect pregnancy outcomes in mothers who contracted the disease.\n&gt; \n&gt; Researchers have posited that congenital Zika syndrome, a constellation of defects and deformities—with microcephaly being the most severe—is connected the severity of maternal disease, or to the presence of previous flavivirus antibodies, which enhance Zika virus in a pregnant woman.\n&gt; \n&gt; To test this theory, researchers followed 131 Zika-positive pregnant women. Fifty-eight of them (46.4%) experienced abnormal outcomes, including 9 fetal losses (7.2%). But they found no associations between disease severity and abnormal outcomes, disease severity and viral load, viral load and adverse outcomes, or existence of prior dengue antibodies (88% of the women had previously had dengue infections).\n&gt;\n&gt; May 23 Clin Infect Dis (\n&gt; \n&gt; In other Zika news, researchers have used elevation as a proxy to predict the likelihood of Ae aegypti–transmitted diseases, concluding that there is a low potential for mosquito Zika transmission above 2,000 meters in the Americas. The study was published yesterday in PLoS One.\n&gt; \n&gt; The researchers looked at 16 countries in the Americans with local Zika transmission, finding that above 1,600 meters, less than 1% of each country's total land area could host Ae aegypti mosquitoes. The findings align with US Centers for Disease Control and Prevention travel guidance.\n&gt;\n&gt; May 24 PLoS One (\n\n^(source:", "Two new Zika vaccines 'show complete protection' in lab tests ", "Zika virus could spread to Europe in coming months, says WHO ", "Rio de Janeiro Reporting Two Suspected Zika Cases EVERY HOUR ", "Efficacy of Some Wearable Devices Compared with Spray-On Insect Repellents for the Yellow Fever Mosquito, Aedes aegypti | Journal of Insect Science | (16FEB17) ", "Low Zika risk for travelers to Olympics in Brazil, study finds ", "Modeling Zika Virus Infection in Pregnancy ", "Zika Virus in India - Alert - Level 2, Practice Enhanced Precautions | 27FEB19 ", "Dogs cannot get or transmit Zika virus ", "In medical mystery, caregiver gets Zika from man who died ", "Zika mystery deepens with evidence of nerve cell infections ", "Medical minute - Zika Virus (video) ", "The best bug sprays to fend off Zika virus-carrying mosquitoes ", "Utah resident is 1st confirmed Zika-related death in US ", "Zika virus pregnancy case confirmed in Spain - first in Europe ", "Genetically Engineered Mosquitoes Tested To Fight Zika : NPR | Shots ", "Low Risk for International Zika Virus Spread due to the 2016 Olympics in BrazilZika Risk During the 2016 Olympics, Brazil | (26JUL16) ", "Expression Analysis Highlights AXL as a Candidate Zika Virus Entry Receptor in Neural Stem Cells (30MAR16) ", "Zika strikes overseas U.S. troops ", "Zika Virus in Malaysia: First Case of Zika Virus Confirmed in a Pregnant Woman ", "White House to convene Zika summit next month ", "Why do people only care now this is old news? ", "Zika infection may affect adult brain cells ", "Looking for Info: Zika &amp; Guillan-Barre Syndrome Hi /r/zika, I am getting married in the summertime and our ideal honeymoon destination is in Central America.  I have a good friend who is a registered nurse who warned me about a possible link between Zika and the triggering of Guillan-Barre Syndrome, which is a brutal disease where your own immune system destroys your motor nerves.\n\n\n\nAlthough there seems to be a minimal genetic heritability for Guillan-Barre onset, my grandfather was stricken with the disease; he became completely paralyzed quite literally overnight.  Naturally, I am a bit concerned about anything that is going to increase my risk... and from what I have heard adding Zika to the mix results in a **40x** increase in risk!  \n\nI am hoping that you good people can help me to find some information, otherwise we will probably end up honeymooning in Siberia!   ;)", "Honduras suspects first case of microcephaly in pregnant Zika patient | (10MAY16) ", "Pregnant Zika Victims Will Be Given Access to Abortions At Sea ", "Lancet | Epidemic preparedness: why is there a need to accelerate the development of diagnostics? | 11DEC18 ", "Study suggests Zika mosquitoes can spread 3 viruses in 1 bite | (19MAY17)  *Points raised in CIDRAP's article*\n\n&gt; **Aedes aegypti mosquitoes can spread 3 viruses**\n\n&gt; * Aedes aegypti mosquitoes can transmit Zika, Dengue &amp; Chikungunya simultaneously (but is probably extremely rare) suggesting coinfections (Zika &amp; Chikungunya) may be more common than thought.\n&gt;&gt; *\"Dual infections in humans, however, are fairly common, or more common than we would have thought.\"*\n\n&gt; * Mutation in the Asian-lineage Zika strain made it more infectious to mosquitoes\n\n&gt; * Zika, Dengue &amp; Chikungunya viral load are carried in the midgut of the Ae aegypti mosquito.\n\n&gt; * When the viruses resided in the mosquito midgut at the same time, a dominant virus did not emerge or outcompete the others. The viruses become established and replicate in the midgut.\n\n&gt; * So far, there is no evidence that human coinfections with the viruses are more severe, but, published findings have been contradictory. Coinfections might be underdiagnosed.\n\n&gt; **Mutation may enhance Zika spread**\n\n&gt; * Spontaneous mutation promoted both Zika infectivity &amp; prevalence in the mosquitoes, which could have enhanced transmission during the recent outbreaks in the Americas.\n\n&gt; **Northern establishment of Ae albopictus**\n\n&gt; * Ae albopictus mosquitoes can spread Zika and other related diseases, but they do not live as close to humans as their Ae aegypti counterparts.\n\n&gt; * Ae albopictus was first detected in Connecticut in 2006 (northern extent of range), not appearing again until 2010.  Lab tests identified two arboviruses in the mosquitoes, ( (only two known human cases) and ( suggesting the species poses a disease threat to humans.\n&gt;\n&gt; **Also See links**\n&gt;\n&gt; * May 19 Nat Comm (\n&gt;\n&gt; * May 19 CSU (\n&gt;\n&gt; * May 17 Nature (\n&gt;\n&gt; * May 18 PLoS Negl Trop Dis (\n&gt;\n\n\n\n", "Can Zika Trigger ADE? New Research Shows How Antibodies Stick To and Block Zika Virus | 11MAR21 ", "Dramatic Increase in Cases of Zika in United States ", "Zika virus impairs growth in human neurospheres and brain organoids ", "C.D.C. Urges Pregnant Women to Avoid Travel to Olympics Over Zika Fears ", "UTMB scientists uncover how Zika virus causes microcephaly | (17FEB17) CIDRAP summary in comments  &gt; \n&gt; \n&gt; \n&gt; **New studies highlight Zika's spread, microcephaly**  \n&gt; \n&gt; Three new studies published today look at how Zika spread so rapidly in the Americas, and why and how the virus causes significant brain damage and microcephaly in children.\n&gt; \n&gt; Authors writing in bioRxiv, a preprint server, generated 100 Zika virus genomes in an effort to understand how and why the virus spread so rapidly in 2015 and 2016.  They found the samples had great genomic diversity, and dating analysis showed that four clades of the virus circulated in early- to mid-2015, a full year before the first detected case in several countries, including Peru and United States (in Florida). The study highlights the difficulties of Zika surveillance in countries where other flaviviruses also circulate.\n&gt; \n&gt; A cell-culture study in Stem Cell Reports helps explain why Zika virus can cause microcephaly, or small head circumference, in infants. Scientists from the University of Texas Medical Branch at Galveston (UTMB) said that microcephaly occurs when the Zika virus attacks a developing fetus's stem cells. The authors discovered that the Asian, but not African, lineage of Zika viruses causes the stem cells to stop proliferating in the developing fetus.\n&gt; \n&gt; \"We discovered that the Asian lineage Zika virus halted the proliferation of brain stem cells and hindered their ability to develop into brain nerve cells,\" said Ping Wu, MD, PhD, senior author on the study and UTMB professor in the Department of Neuroscience &amp; Cell Biology, in a press release from UTMB. \"This difference seems to be linked with a Zika-induced change in global gene expression pattern, it remains to be seen which genes are responsible.\"\n&gt; \n&gt; Finally today, JAMA Pediatrics published the results of a September 2016 workshop sponsored by the Eunice Kennedy Shriver National Institute of Child Health and Human Development and the National Institutes of Health to identify the key components of caring for children born with Zika-related microcephaly and other complications.\n&gt; \n&gt; Many children, experts agree, may not have microcephaly at birth but may develop neurologic disorders because of prenatal Zika infection. Further study will be needed to anticipate and predict outcomes for children who were exposed, the experts said.\n&gt; \n&gt; Feb 20 bioRxiv (  \n&gt; Feb 20 Stem Cell Reports (  \n&gt; Feb 20 JAMA Pediatrics (  \n\n\n\n\n\n\n", "Zika Can Be Transmitted by Female Mosquito to Her Eggs, Study Says ", "New discovery means more U.S. states will face a risk from Zika ", "Zika Virus May Threaten Blood Supply, Say Officials in Texas (26APR16) ", "Bharat Biotech says working on two possible Zika vaccines ", "Zika virus: Epidemiological surveillance of the Mexican Institute of Social Security | 11FEB19 ", "UN - Upholding women’s human rights essential to Zika response ", "Dengue virus infection may cause severe outcomes following Zika virus infection during pregnancy | 08FEB19 ", "What is Ivermectin | A historical documentary of Ivermectin | runtime: 23:25 |11DEC21 ", "Vital Signs: Preparing for Local Mosquito-Borne Transmission of Zika Virus — United States, 2016 (01APR16) ", "Zika Virus Outbreak Updates: Pregnant Woman in Puerto Rico Diagnosed With Virus ", "Zika vaccine shows promise in mice, lifting maker Inovio ", "Nearly half of Americans mistakenly think Zika is fatal (it is not) ", "Interview with MMWR editor on how CDC creates Zika medical guidelines for doctors and patients. ", "Number of pregnant women with Zika infections increases ", "First baby born with Zika-linked microcephaly in New York tri-state area ", "WHO update on Zika in India: hope this serves as an alarm to prioritise health security and take urgent and unprecedented actions ", "Ahead of Print -Inactivation and Environmental Stability of Zika Virus - Volume 22, Number 9—September 2016 - Emerging Infectious Disease journal - CDC ", "Zika Map | Virus &amp; Contagious Disease Surveillance ", "Who will Zika virus be an occupational hazard for? ", "Zika: A Bane for Travellers and A Boost for Travel Insurance Companies ", "Fort Collins CDC branch is 'ground zero' for Zika virus research ", "CDC Issues Updated Zika Recommendations: Interim Guidance for healthcare providers caring for pregnant women with possible exposure to Zika virus; Interim Guidance for the prevention of sexually transmitted Zika virus ", "Probable non-vector-borne transmission of Zika virus, Colorado, USA. - PubMed ", "Brazilian state suspends larvicide which doctors have linked to Microcephaly ", "More Evidence Links Guillain-Barre Syndrome, Zika Virus ", "New microcephaly subreddit I created a new subreddit r/microcephaly recently if anyone wants to check it out.", "Tens of thousands of babies may be born with Zika disorders: Study ", "DNA-based Zika vaccine showed protection from infection, brain damage and death | (10NOV16) ", "CDC awards $16 million to states and territories to fight Zika | (02AUG16) | CIDRAP Summary in comments ", "Pregnancy Outcomes After Maternal Zika Virus Infection During Pregnancy -\u0080\u0094 U.S. Territories, January 1, 2016â\u0080\u0093April 25, 2017 ", "Zika Virus: U.S. Military Offering to Ship Pregnant Employees Out of Affected Region ", "Nota técnica sobre microcefalia e doenças vetoriais relacionadas ao Aedes aegypti: os perigos das abordagens com larvicidas e nebulizações químicas – fumacê (Brazilian Portuguese) ", "Zika Virus Infection Among U.S. Pregnant Travelers — August 2015–February 2016 (04MAR16) ", "Napak Halat Aur Jagah Par Allah Ka Zikr Karna Chahiye Ya Nahi By Adv. Fa... ", "Zika Mosquitoes 'Could Reach Europe By Plane' ", "Zika Virus Linked To Another Neurological Disorder Akin To Multiple Sclerosis (11APR16) ", "Florida Zika cases a 'game changer' that puts pressure on Congress to act ", "Ahead of Print -Zika Virus Infection and Prolonged Viremia in Whole-Blood Specimens - Volume 23, Number 5, May 2017 - Emerging Infectious Disease journal ", "Scientists' path to usable Zika vaccine strewn with hurdles ", "Florida Gov. Scott pushes for Zika money ", "Switzerland introduces Zika-related blood quarantine ", "More Than a Million Moms At Risk of Zika, Study Finds ", "Science AMA Series: I am Stephen Morse, a Professor of Epidemiology at Columbia University’s Mailman School of Public Health. I work to understand the factors leading to emerging infectious diseases like Zika, and can answer your questions on the current outbreak. AMA! • /r/science ", "Can Zika Account For The Missing Babies? | (12APR17) links in comments  (", "Where can I find the latest Zika data? Hei gang,\n\nMy girlfriend and I are trying to conceive and in the process of figuring out where to go on holiday in April.\n\nI have looked at all the big health organizations and their more recent data on Zika worldwide is from 2019.\n\nIt seems ridiculous to me to make a decision based on 2 year old data.\n\nDo you know where can I find more updated figures per country? Not sure what data they are using, but here is CDC’s Zika travel information page. Says it was updated May 22, 2021.   Thanks for the reply!  \nThe map is still based on 2019 data but maybe the list of countries is updated. Still the best one can find.", "Florida Confirms First Cases of Zika Caught From Local Mosquitoes ", "Directors of WHO and PAHO met with Brazilian President to discuss the response to zika | 23FEB16 ", "Highly Efficient Maternal-Fetal Zika Virus Transmission in Pregnant Rhesus Macaques | (12MAY17)  &gt; In other Zika news, researchers from the University of Wisconsin-Madison have demonstrated highly efficient mother-to-fetus transmission in four pregnant rhesus macaques who were injected with Asian-lineage Zika virus. They reported their findings yesterday in bioRxiv, a prepublication Web portal for scientific studies.\n&gt; \n&gt; Three of the four monkeys had prolonged viremia, and all pregnancies had signs of first trimester fetal tissue damage. The authors say this work can help identify infection patterns in pregnant women infected with Zika.\n&gt;\n&gt; May 11 bioRxiv (", "First Reported Case Of Tourist Contracting Zika In Miami ", "Travelling to Brazil - Long term consequences for future pregnancy Hello! My friend is travelling with his girlfriend to brazil on vacation. Is it correct that after 8weeks she should be fine and his sperm will be fine after 62days? In case of symptoms no pregnancy should happen within 6months?\n\nIs there something I am missing? I could not figure out if the virus is surely not latent and once infected is a thread for the rest of your life! Because in case after infection nothing remains in your body it would be even beneficial for future pregnancies because then exposure would not be dangerous anymore.\n\nCould you please confirm that my research is correct so far? I only find mass of material regarding a current pregnancy but nothing regarding the long term future!", "Peru reports first patient carrying the Zika virus ", "More evidence of Zika, GBS link found in Puerto Rico | (17OCT17) ", "Zika Virus Targets Different Primary Human Placental Cells, Suggesting Two Routes for Vertical Transmission |CIDRAP Summary in Comments | (18JUL16) ", "Zika May Be Transmitted by Oral Sex, Scientists Find ", "While Brazil Was Eradicating Zika Mosquitoes, America Made Them Into Weapons ", "Bacteria-Infected Mosquitoes Could Slow Spread of Zika Virus ", "Immunity induced by Domain III of Zika virus vaccines The flavivirus envelope protein domain III (EDIII) was an effective immunogen against dengue virus (DENV) and other related flaviviruses. Whether this can be applied to the Zika virus (ZIKV) vaccinology remains an open question. Here, we tested the efficacy of ZIKV-EDIII against ZIKV infection, using several vaccine platforms that present the antigen in various ways.", "WHO Beefs Up Zika Advice for Travelers ", "Paper on GMO mosquitos ", "American Samoa Says It Has 205 Suspected Cases Of Zika : The Two-Way : NPR ", "Sex ban recommended for British tourists in Florida after Zika outbreak ", "New estimate puts Zika microcephaly risk at 1% to 13% | (26MAY16) ", "CDC awards $2.4 million to five jurisdictions to fight Zika | (02SEP16) ", "Zika Defense: Crushing Zika with Evolution ", "Notre Dame prof finds Zika-related mosquito far from tropics ", "cjvjvhhjk ", "How Zika Spreads ", "1st confirmed case of Zika virus in Ontario, province says ", "Interactive Dashboard for Monitoring Microcephaly cases and Zika Virus transmission in Brazil ", "Zika Virus May Have Entered Brazil Via 2013 Soccer Tournament, Genetic Study Reveals ", "Guillain-Barré Syndrome outbreak associated with Zika virus infection in French Polynesia: a case-control study ", "Aerial Spraying for Zika Stirs Controversy in Miami Beach ", "Sexual Transmission? Hello all-- I am supposed to go to Mexico for a few days next week.  However, my wife is currently 10weeks pregnant.  If I come back, is there a chance of me passing it on to her and putting her in harms way?  I have read about a few people who had the virus show up in their semen so I would like to get the facts if anyone knows.", "Computational Modeling Reveals Zika Virus' Affinity for Brains ", "As US Zika cases slow, CDC expert urges vigilance (01AUG17) ", "Travel-Associated Zika Virus Disease Cases Among U.S. Residents — United States, January 2015–February 2016 ", "HHS awards $2.6 million to DiaSorin Group to develop rapid, high-capacity Zika diagnostic laboratory test. | HHS awarded DiaSorin Group $2.6 billion to develop a rapid serologic diagnostic test for Zika to test 120 samples at a time and give results in an hour. ", "Reported Distribution of Aedes (Stegomyia) aegypti and Aedes (Stegomyia) albopictus in the United States, 1995-2016 (Diptera: Culicidae) | (09JUN16) ", "A comparative analysis of Chikungunya and Zika transmission ", "New research suggests anti-viral role for aravive biologics' anti-AXL candidate against Zika virus | (10JAN17) ", "Following New Non-Travel Related Zika Case in Palm Beach Co., Gov. Scott Directs DOH and Education Leaders to Partner on Zika Preparedness | (08AUG16) ", "Health Official Warns Zika Could Spread Across U.S. Gulf ", "CIDRAP | CDC: Zika passed from woman to man via sex | (15JUL16) ", "Zika and you ", "Section of Miami Neighborhood With Local Zika Transmission Cleared: Officials ", "Senators ask CDC, DHS for 'estimates' of threat posed by Zika virus ", "NASA Has Released This Zika Forecast Map for the Summer (28APR16) ", "Zika Virus Linked to Paralysis Disorder in U.S., CDC Says ", "Zika Virus: CDC Warns Spring Travellers ", "Zika Early Symptoms: Warning Signs That You are Infected And What To Do ", "Colombia declares much-feared Zika crisis over as infection rate plummets ", "List of Possible Zika Birth Defects Grows Longer ", "Florida Zika Virus cases rise to 12; mosquito that carries virus common in state ", "Houston Prepares Now For Zika's Potential Arrival This Summer ", "WHO panel: Risk of Zika spread from Olympics very low| (14JUN16) ", "Concern in Haiti Over Emerging Condition Linked to Zika ", "Ahead of Print -Time Lags between Exanthematous Illness Attributed to Zika Virus, Guillain-Barré Syndrome, and Microcephaly, Salvador, Brazil - Volume 22, Number 8—August 2016 - Emerging Infectious Disease journal | (03MAY16) ", "Prevalence and Clinical Attributes of Congenital Microcephaly — New York, 2013–2015 | CIDRAP summary in comments  &gt; \n&gt; **Studies highlight microcephaly data, Zika spread by breast milk, saliva** \n&gt; \n&gt; Though Zika outbreak developments have tailed off in recent months, research activity to better understand the risk and spread continues at a brisk pace, with a research team from New York today reporting on baseline microcephaly findings and other groups reporting on the virus in breast milk and in oropharyngeal secretions.\n&gt; Microcephaly baseline findings\n&gt; \n&gt; One of the challenges in assessing the link between Zika and microcephaly has been a lack of good information on background estimates for the birth defect. Researchers from New York and the US Centers for Disease Control and Prevention (CDC) recently calculated the background level for that state, using data from 2013 to 2015 before imported cases began to appear in the United States. They reported their findings in the latest issue of Morbidity and Mortality Weekly Report (MMWR).\n&gt; \n&gt; Two surveillance sources identified a total of 529 suspected microcephaly cases in New York from 2013 to 2015, of which 499 met the case definition. The state's overall prevalence was 7.4 per 10,000 live births, similar to national estimates for 2009 to 2013. For severe microcephaly, the prevalence was 4.2 per 10,000 live births.\n&gt; \n&gt; A substantial number (42%) did not have any known maternal or fetal risk factors. When the team looked at severe microcephaly cases, they found that a higher proportion of affected infants were born to Hispanic and non-Hispanic black mothers, which they said needs more investigation about risk factors and disparities.\n&gt; \n&gt; They concluded that the New York prevalence estimates for severe microcephaly will help researchers more clearly estimate the risk of Zika virus.\n&gt; Case reports shed light on Zika in breast milk\n&gt; \n&gt; Scientists have been trying to gauge the risk of human-to-human Zika spread through different body fluids, and a case study of four Zika-infected mothers from Brazil suggests that transmission to babies through breast milk may not be an efficient route. Researchers published their findings in an early advance edition of the International Journal of Infectious Diseases.\n&gt; \n&gt; Despite evidence Zika in the mothers' blood and urine samples, along with the presence of viral shedding, no illnesses developed in three of the breastfed babies, though one had a fever and rash that were linked to a chikungunya infection.\n&gt; \n&gt; One breast milk sample from one of the mothers yielded infectious virus.\n&gt; \n&gt; The team said Zika transmission by breast milk is still questionable, and it might be less efficient than human-to-human transmission by other body fluids.\n&gt; Saliva spread real but risk appears low\n&gt; \n&gt; Zika can be transmitted through the oropharyngeal mucosa, but the risk appears to be low, based on experiments with macaques by researchers from the University of Wisconsin. They reported their findings yesterday in bioRxiv, a prepublication Web portal for scientific studies.\n&gt; \n&gt; Application of high doses of Zika virus to the tonsils of three macaques resulted in a positive blood tests by 2 days after exposure, similar to earlier findings on subcutaneous exposure.\n&gt; \n&gt; Three more monkeys were infected by the subcutaneous route to serve as saliva donors to allow testing of exposure to oral secretions by different routes: conjunctival, tonsils, and nostrils. Seven animals repeatedly exposed to the saliva from the Zika-infected macaques did not become infected.\n&gt; \n&gt; Researchers concluded that though there is a risk of infection by the mucosal route, the risk of exposure from people with typical infections is low.\\\n\nsource: ", "Pandora's box: How GM mosquitos could have caused Brazil's microcephaly disaster ", "China confirms first case of Zika virus: Xinhua ", "Sex’s role in spreading Zika raises new worry ", "Zika Study Could Help Overcome an Obstacle to Vaccine Research ", "Central Floridian- got stung by big mosquito ", "Congenital Zika Syndrome Results in Auditory Complications | Contagion Live | (24FEB17)  Viviane Boaventura, MD, PhD, researcher, Fiocruz-Bahia, Goncalo Moniz Institute, Brazil, discusses her research regarding impaired hearing function due to congenital Zika syndrome.", "How Floridians deal with Zika ", "Update On The Fight Against Zika ", "Zika is expected to infect 1 in 5 Puerto Ricans, raising threat to rest of U.S. ", "NIH workshop identifies complex health problems among Zika-affected infants ", "Experts probe Zika mosquito control, more microcephaly ", "CDC - Zika in the US cases (map) ( \n\n^(  \n", "Zika may linger in semen long after symptoms fade: doctors' report ", "Health experts: Zika threat is serious and getting bigger ", "Here Are The Mosquito Repellents That Can Best Protect You From Zika Virus, According To Consumer Reports ", "Zika virus in the Americas: Early epidemiological and genetic findings (24MAR16) ", "Cancun ", "Theranos Reportedly Pulls Request for Zika Test Clearance After FDA Inspection ", "NYU Medical Expert Demands Brazil Delay Olympics over Zika ", "Zika virus arrives in Thailand: medical advice for travellers ", "What Are the Implications of Prolonged Zika Virus RNA Shedding? | Contagion Live | (25FEB17)  Marta G. Cavalcanti, MD, PhD, physician at Infectious Diseases Clinic, Hospital Universitario Clementino Fraga Filho, UFRJ, Brazil, discusses how the period of RNA shedding correlates with the severity of complications associated with mono- or coinfection in Zika patients.", "Zika virus in Singapore: unanswered questions | (17MAY17) CIDRAP summary in comments  &gt; **Report describes rapid Zika spread, impact of control steps in Singapore**\n&gt; \n&gt; In the first-of-its-kind comprehensive review of a Zika outbreak in Asia, researchers from Singapore yesterday reported how easily the virus can be introduced and spread even when vector control programs are good, adding that response measures had a measurable impact on curbing the disease. Writing in The Lancet Infectious Diseases yesterday, the team described an outbreak that began in August 2016.\n&gt; \n&gt; From August through November 2016, Singapore confirmed 455 Zika cases, with the outbreak occurring in an area at high risk for dengue transmission and near a construction site where control of mosquito breeding was difficult. During the first phase of the outbreak, health authorities isolated sick patients in the hospital in an attempt to prevent the virus from spreading, but it had already moved into the local mosquito population. Officials then focused on community engagement and vector control.\n&gt; \n&gt; The team estimated that after authorities implemented response steps, over a 4-week period the reproductive number (R0) declined from 3.62 to 1.22.\n&gt; \n&gt; Phylogenetic analysis of human and mosquito Zika strains showed little diversity and found the virus was distinct from other Asian strains, with the most common ancestor from May 2016. Analysis suggests at least three separate importations, but only one lineage caused the large outbreak.\n&gt; \n&gt; The investigators concluded that prompt national action involving many sectors can help curb the spread of the virus and that lessons learned in Singapore's outbreak might be useful for other countries.\n&gt; \n&gt; A related commentary by two experts from French Polynesia and the United States said the Singapore findings raise several questions, such as why the virus sparked an outbreak in 2016 when it had been in Asia for decades and why Zika appeared to be more contained than dengue virus.\n&gt;\n&gt; May 17 Lancet Infect Dis (\n&gt;\n&gt; May 17 Lancet Infect Dis (\n&gt; I am a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n-  ](\n\n(#footer)*^(If you follow any of the above links, please respect the rules of reddit and do not vote in the other threads.) ^\\((/r/TotesMessenger) ^/ ^(/message/compose?to=/r/TotesMessenger))*\n\n(#bot)", "Study links pesticide used to fight Zika in Florida to health impacts in Chinese babies ", "Surgeon general: ‘We are going to run out of funds’ for Zika ", "Scientists Push Back Against A Viral Conspiracy Theory About Zika ", "Zika Virus Increases Concerns About Employee Safety ", "Traveling to Puerto Rico on March 9th with gf. Should we cancel our trip? We are 25 years old and plan on taking the next step soon. Kids maybe around 27-28. Is this trip worth it? ", "El Niño may be helping spread Zika virus, here is how ", "US Urges Aerial Spraying Amid Jump in Puerto Rico Zika Cases ", "Zika virus found in woman's vagina for weeks ", "What Happened In French Polynesia In The World's Biggest Zika Outbreak Before Brazil ", "Zika in Texas? 'We have the perfect storm to allow virus to flourish' ", "Why the U.S. Has a Limited Arsenal to Fight Zika Mosquitoes ", "New York City Wages War on the Zika Virus ", "What are the odds of getting Guillain-Barre from a Zika mosquito bite? Can anyone comment on this with a source? \n\nI have heard now that Zika can lead to brain damage in adults. Bullshit or an actual possibility?\n\nTrying to decide whether to cancel my trip due to this public health epidemic...", "Zika highlights role of controversial fetal-tissue research ", "Wolbachia Field Trial | (18APR17) ", "WHO: Zika Sexual Transmission Is Unexpectedly Common ", "Cuba reports remarkable success in containing Zika virus ", "Zika virus in the female genital tract | (11JUL16) ", "Two studies highlight risk of fetal Zika damage | (14DEC16) ", "El zika, Brasil y la OMS Por todos es sabido que el zika está dando más de un quebradero de cabeza a la comunidad internacional, sobre todo a los países suramericanos. Una de las principales razones es por la supuesta relación que tiene con problemas neurológicos en niños cuyas madres fueron infectadas durante el embarazo. \nEl gobierno brasileño ve clara la relación y lo grita a los cuatro vientos pese a no haberse confirmado si eso es verdad o no. De momento, solo 17 niños con microcefalia se vieron expuestos al zika cuando estaban en el vientre materno de manera oficial. La Organización Mundial de la Salud dice que todavía no se puede hablar de dicha relación de forma contundente. \n¿Cómo no faltar a la verdad (como periodista), cuando el gobierno del mayor país de América del Sur te asegura por activa y por pasiva que el motivo de que estén movilizando un país entero es cierto y no desacreditar a una organización del calibre de la OMS?", "Why Zika is a ticking ‘time bomb’ for Latin America ", "Scientists assemble Zika virus mosquito genome from scratch | (23MAR17) ", "2 Biotech Companies Lead the Race to Develop a Zika Vaccine ", "Chinese Scientists Decode Gene Sequence of Zika Virus ", "WHO | Zika Outbreak: who is Global Emergency Response Plan (04MAR16) ", "Zika crisis: WHO rejects 'move Rio Olympics' call ", "Zika virus found in Florida blood bank, mosquitoes ", "The Native Wolbachia Symbionts Limit Transmission of Dengue Virus in Aedes albopictus | 27DEC19 ", "Zika’s spread cannot be stopped, study argues, but it will burn out in 3 years ", "Sanofi launches hunt for Zika vaccine as disease fears grow ", "Countries that have past or current evidence of Zika virus transmission (as of December 2015) (map only, no article) ", "Microcephaly – France - Martinique (01APR16) ", "Doctors Fear Zika Is A Sleeping Giant In Haiti ", "New Zealand Zika numbers balloon ", "Zika and the Risk of Microcephaly | (25MAY16) ", "Indian biotech firm says it has developed 2 vaccines for Zika virus ", "Zika alarm sparks run on supply of scientific virus samples ", "Zika Virus Infection Among U.S. Pregnant Travelers — August 2015–February 2016 ", "Zika will cost LatAM $3.5 billion this year ", "How an urgent care center missed my Zika diagnosis and is now trying to charge me for it. Xpost r/offmychest ", "Prepare for ‘Guerrilla Warfare’ With Zika-Carrying Mosquitoes, Experts Warn ", "Zika outbreaks most likely to hit eight countries in Asia, Africa ", "Elderly Zika patient in Utah may have infected a family contact ", "Zika virus likely to blame for Romeoville woman's miscarriage ", "Super-vaccine to prevent Zika and dengue fever is on the horizon ", "Zika virus: Why men need to worry ", "CDC investigating 14 new potential cases of sexually transmitted Zika ", "Researchers unveil first human-made Zika virus clone | (16MAY16) ", "quitarse el Zika y Chikunguña ", "Zika has crossed the Rio Grande ... now what? ", "Is it true that Brazil started a DTAP vaccine program for pregnant women ten months before the microcephaly outbreak? I have read this online, but the source was not trustworthy...", "WHO: Array of Zika birth defects equals new syndrome | (03JUN16) ", "Awareness on Zika Outbreak! ", "Uncovering How Zika Causes Microcephaly ", "CDC Reports 234 Pregnant Women in U.S. with Zika ", "W.H.O. Recommends Contraception in Countries With Zika Virus ", "Texas State Health Officials Urge Zika Testing in Rio Grande Valley | (03OCT16) ", "Estimating Contraceptive Needs and Increasing Access to Contraception in Response to the Zika Virus Disease Outbreak — Puerto Rico, 2016 (01APR16) ", "These US cities are most at risk for Zika this summer. (But do not panic.) ", "As Zika looms, US health officials worry about the neighbors ", "6 percent of pregnant women with Zika face birth defects ", "Oh Good: Congress Cannot Even Agree to Protect the US From Zika ", "Why The Low Zika Numbers In Haiti Might Be Wrong ", "Doctor: Zika Virus Likely Causing Brain Damage Worse Than What You are Told ", "New doubts on Zika as cause of microcephaly ", "Study links Zika virus to joint problems in babies ", "Zika virus: Baby born in Spain with microcephaly, first in Europe ", "Zika App Developed for Olympics ", "Another New Zika Case Found in Florida ", "With Wyoming showing two (2) cases in this reporting period, Alaska now remains the last state without sign of Zika infection. ", "Florida’s Zika outbreak was expected—Puerto Rico’s was not. ", "US politicians are failing in the fight against the Zika virus in the United States ", "Zika Virus Preparedness Market ", "In Miami, Facing Risk of Zika With Resolve but Limited Resources ", "CDC announces $16 million for states' Zika efforts | (02AUG16) ", "Postmortem Findings for 7 Neonates with Congenital Zika Virus Infection - Volume 23, Number 7 - July 2017 | CIDRAP summary in comments  &gt; **Postmortem findings on 7 Zika infants show microcephaly, other issues**\n&gt; \n&gt; In a study yesterday in Emerging Infectious Diseases, results of postmortem examinations of seven babies born in Ceara, Brazil, highlight microcephaly and other major defects. The babies were likely exposed to Zika virus through their mothers during the first trimester of pregnancy in early 2015.\n&gt; \n&gt; The babies died 30 minutes to 6 days after delivery, and cerebrospinal fluid tested positive for Zika virus. Only one of the seven neonates suffered from intrauterine gross restriction, but six had low brain weight for their gestational age.\n&gt; \n&gt; Six of the babies also had obvious microcephaly, and all had several neurologic malformations, including calcifications in the brain stem and thinning of the parenchyma.\n&gt; \n&gt; Besides brain malformations, all seven neonates had pulmonary hypoplasia, and several had small lungs for their respective gestation ages. The authors concluded that the lungs were damaged when the central nervous system was attacked by the Zika virus.\n&gt; \n&gt; \"In addition, variable liver damage, a finding commonly seen with infection by other flaviviruses, was found in these neonates,\" the authors concluded. \n\n^(source: ", "Looking At Zika In French Polynesia, New Study Makes Case For A Link To Guillain-Barre : Goats and Soda : NPR ", "Health Officials Concerned over Possible Homegrown Zika Case in Nuevo Leon ", "What Can We Learn From Outbreaks of HIV and Zika?  I am a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n-  (\n\n(#footer)*^(If you follow any of the above links, please respect the rules of reddit and do not vote in the other threads.) ^\\((/r/TotesMessenger) ^/ ^(/message/compose?to=/r/TotesMessenger))*\n\n(#bot)", "Mosquito-Disseminated Insecticide for Citywide Vector Control and Its Potential to Block Arbovirus Epidemics | (18JAN17) CIDRAP summary in comments  \n\n&gt; **Larvicide reduces 80% of Aedes in Brazilian city**\n&gt; \n&gt; A study yesterday in PLoS Medicine shows that the larvicide pyriproxyfen (PPF) greatly reduces the number of adult Aedes mosquitoes, the vector that transmits Zika, yellow fever, and dengue.\n&gt; \n&gt; Aedes mosquitoes are notoriously hard to control, as they tend to live indoors and can concentrate in urban populations. Most insecticides only produce a transient reduction of adult populations, and breeding sites can be hard to target. To counter these factors, researchers used adult mosquitoes to disseminate particles of PPF to breeding sites.\n&gt; \n&gt; From February 2014 to March 2015, researchers working in Manacapuru, Brazil, measured mosquito populations throughout the city. Beginning in March 2015, they placed plastic cups containing PPF and tap water in 100 dwellings and analyzed mosquito populations after 5 months of citywide PPF dissemination, 3 months of focal PPF dissemination around Aedes-infested dwellings, and 3 months after dissemination ended.\n&gt; \n&gt; According to the study, the number of Aedes juvenile samples decreased by 79% to 92%, and mean adult Aedes emergence fell from 1,077 per month at baseline to 50.4 per month during PPF dissemination. The emergence of young female Aedes mosquitoes dropped by 96% to 98%.\n&gt; \n&gt; \"Mosquito-disseminated PPF has potential to block mosquito-borne virus transmission citywide, even under adverse scenarios,\" the authors write. \"Our results signal new avenues for mosquito-borne disease prevention, likely including the effective control of Aedes-borne dengue, Zika, and chikungunya epidemics.\"\n&gt;\n&gt; source: ", "I got infected with Zika. Here is my video diary about symptoms and diagnosis process. ", "Drug Targets for Ebola, Dengue and Zika Viruses are Found | 13DEC18 ", "Evaluation of Convalescent Whole Blood for Treating Ebola Virus disease in Freetown, Sierra Leone | (18NOV16) CIDRAP Summary in comments ", "Intrexon May Be on Path to Cure Zika Virus ", "Zika Virus Caught in the Act in Baby's Brain ", "Department of Health Daily Zika Update | (10AUG16) ", "Why the Zika virus is causing alarm ", "'Scarier than we initially thought': CDC sounds warning on Zika virus ", "Kenya threatens to pull out of Rio Olympics over Zika threat ", "Promising low-cost point-of-care ZIKV diagnostic works without electricity ", "Florida governor criticizes Washington for lagging in Zika fight ", "CDC analysis of data from US territories finds serious birth defects in about 1 in 12 fetuses or infants of pregnant women with Zika infection in the first trimester | (08JUN17) ", "ECDC - Zika epidemic in the Americas and Caribbean as of 24 February 2016 ", "CDC: Zika-infected couples should postpone pregnancy ", "Natural bacteria could wipe out dengue-carrying mosquitoes, Australian research suggests | 04OCT21 ", "WHO | Fourth meeting of the Emergency Committee under the International Health Regulations (2005) regarding microcephaly, other neurological disorders and Zika virus | (02SEP16) ", "Another American Zika Birth ", "¿Empieza la fase de descenso del zika en Cali? ", "CDC warns more U.S. cities could face Zika threat ", "Reuters Health News Summary -Zika mosquito's habits force new strategy by U.S. cities, states ", "Question about rates of infection from symptomatic and asymptomatic males. The CDC gives different recommendations for symptomatic and asymptomatic males. If symptoms present then they recommend waiting 6 months after symptoms begin to engage in unprotected sex. If no symptoms present then they recommend waiting just 8 weeks. Given that just 20% of people show any symptoms, can we infer that asymptomatic males haves have less of a chance of passing on the virus? Or that it moves through system faster? Any insights on these different recommendations would be greatly appreciated.\n\nCDC Recommendations pasted below. (Source: \n\nIf the male partner has been diagnosed with Zika or has (or had) symptoms, the couple should consider using condoms or not having sex for at least 6 months after symptoms begin.\n\nIf the male partner does not develop symptoms, the couple should consider using condoms or not having sex for at least 8 weeks after the man returns.", "Rapid risk assessment: Zika virus disease epidemic: potential association with microcephaly and Guillain–Barré syndrome, sixth update | (23MAY16) ", "HHS ships blood products to Puerto Rico in response to Zika outbreak (07MAR16) ", "Zika virus may cause long-term memory damage, similar to Alzheimer's disease ", "White House to use Ebola money to fight Zika ", "1 in 10 Pregnant Women With Zika Had Babies With Birth Defects  **(", "ZAP Summit Follow-up Teleconferences | Zika Virus Disease Surveillance in U.S. States | Presentation autodownload 25 page PDF | (08JUN16) ", "Zika - The Basics of the Virus and How to Protect Against it | Auto-Download PDF - 2 Page Poster | (16MAY16) ", "More data show Zika viremia in mothers, fetal infection link | (07DEC16) ", "The day Zika deal died: A cautionary tale of congressional gridlock ", "WHO | Dispelling rumours around Zika and microcephaly (09MAR16) ", "Two cases of mosquito-borne Zika virus confirmed in Queensland in 24 hours ", "Zika: More than two billion people at risk of catching virus around the world, study shows ", "WHO | Zika virus infection – Netherlands - Bonaire and Aruba ", "How do I know if I get Zika and should terminate my pregnancy if I was bitten by a mosquito at Cancun resort during first trimester? I was staying in the Cancun resort for 2 days in 12/2019 and was bitten a couple of times in resort territories ( 7 pm near ocean and 9 am near palm trees) before I started to use repellent, and I was 3.5 weeks pregnant back then. \n\nHow many chances my baby will get infected by Zika and how do I confirm that? Should I consider termination? I am 21 weeks pregnant now.", "Zika Infection Transmitted by Sex Reported in Texas ", "\"It just takes your breath away\": Zika virus' impact in Brazil ", "Genetic sex change for mosquitoes could stop the spread of Zika ", "America has two potential Zika vaccines ready for human trials ", "Zika mRNA vaccine enters clinical trial; Angola reports cases | (10JAN17) ", "CDC study estimates 20-fold increase in certain types of birth defects in pregnancies with possible Zika infection compared with pre-Zika years | (02MAR17) ", "Buzz off: breakthrough technique eradicates mosquitoes | 17JUL19  I wonder then why SIT done in two test areas in Singapore are part of three dengue clusters. It looks like there is still some fine tuning required. What they describe as a *'breakthrough'* has been, and immho, continues to be a work in progress for more than the last 5 years. \n\nFirst heard of in from Australia where a local initiative (successfully) tested the process.  \n\nIt is been monetized in the US though I doubt the mosquito control industry will implement the process as it will eliminate a significant portion of profits. Work in progress since decades. Yes, SIT was and is very successful with insects having a low replication rate. Mosquitoes do not fall into this category. &gt;*The IIT method involves a bacteria called Wolbachia.*\n\nThe work I was citing was that focused on Wolbachia. They try to make the insects sterile with this bacteria. Yes, I know. It works.  \n\nYou appear to be well versed in these matters.  Are you in located in south east Asia?  I have a pointed reason for asking. You are right. I also have known the people who succeeded with SIT on insects with a low replication rate. They tried hard to repeat this success with mosquitoes but failed. I just wonder why 'younger' scientists ignore this. Wolbachia works mosquitoes. \n\nIf you could post links about SIT, at least the Readers will become aware. For the start:\n\n\n\n\n\n\n\nSingapore's Wolbachia program:\n\n\n\nThen the current dengue outbreak in Singapore:\n\n\n\nThree dengue cluster overlap with the two trial areas. &gt; How does SIT work in mosquito control?\n&gt;\n&gt; • Female mosquitoes will only mate with male mosquitoes once in their lifetime. If lab reared sterile\nmale mosquitoes are released into an environment with wild females and they mate, the female\nmosquitoes will not produce viable offspring. This will reduce or eliminate the local population\nthrough successive releases.\n\nHave not before seen this fact put in such simple to grasp terms.  Coupled with the *\"males do not bite\"* phrase completes the concept. \n\n_____", "Zika funding to be split among CDC, NIH, emergency fund ", "14 cases of Zika virus reported in Florida ", "Report: aedes albopictus can carry Zika, but it is not yet known whether it is an effective transmitter of Zika ", "10 Solid links between the Zika Virus and Neurological Defects ", "Puerto Rico declares Zika outbreak over; CDC maintains travel warning | (06JUN17) ", "CDC: To avoid Zika exposure, consider no sex ", "WHO | Zika virus classification table | (13APR17) ", "Zika Virus - Everything you NEED to know! (CNN Video) ", "Mapping global environmental suitability for Zika virus ", "Argentine and Brazilian doctors suspect mosquito insecticide as cause of microcephaly ", "Zika Virus Outside Africa - Volume 15, Number 9—September 2009 ", "Are other countries besides Brazil experiencing high rates of microcephaly? ", "Nearly 72 000 cases of Zika in Colombia since October ", "WARNING!! On this site a lot of people who want to find a sexy adventure ", "New Virus Breaks The Rules Of Infection • /r/zika ", "Biosafety Guidance | Zika virus (16MAR16) ", "Sexual Transmission Is Just the Latest Zika Surprise ", "Colombia warns on Zika baby risk ", "WHO updates Zika vaccine target profile, announces research grants | (24FEB17) ", "La OMS declara el Zika emergencia de salud pública internacional ", "Singapore | National Environment Agency| Zika ", "CDC director visits Puerto Rico, warns of Zika crisis (08MAR16) ", "World Community Grid: Ready to take on Zika! ", "The 3.8 Å resolution cryo-THEM structure of Zika virus ", "Puerto Rico could see hundreds with Zika birth defects, CDC says ", "Risk of Zika-related microcephaly: stable or variable? | (21JUN17) CIDRAP summary in comments  &gt; **Study: First Zika microcephaly wave in Brazil was outlier**\n&gt; \n&gt; About 70% of all Zika-related microcephaly cases in Brazil resulted from the first wave of infections in 2015, according to a study yesterday in The Lancet by Brazilian researchers who describes the two major waves of Zika infections and the ensuing microcephaly incidence.\n&gt; \n&gt; The study is based on data obtained through the Brazilian Ministry of Health's surveillance systems from Jan 1, 2015, to Nov 12, 2016, and shows two distinct waves of Zika infections: An initial wave in late 2015 in the northeastern part of Brazil was linked to 70.4% of microcephaly cases documented in 2015 and 2016, while a second wave in 2016 dispersed across the whole country accounted for the remaining cases.\n&gt; Very high rate in NE Brazil\n&gt; \n&gt; The researchers found a total of 1,950 Zika-related cases of microcephaly in 2015 to 2016 in Brazil. At the height of the first wave in 2016, peak monthly occurrence was estimated at 49.9 cases per 10,000 live births. During the second wave, the estimated monthly peaks varied from 3.2 cases to 15 cases per 10,000 live births, or at most less than a third of the rate during the 2016 peak.\n&gt; \n&gt; This is the first study that looked at the microcephaly cases in terms of regional differences, the authors said. They added that the results, taken with data from other countries battling Zika, provide more evidence that the first wave in Brazil was an outlier.\n&gt; \n&gt; But there are no clear answers yet as to what caused the increase in microcephaly cases. The authors said, \"The marked variation in the frequency of infection-related microcephaly across regions and time is puzzling.\"\n&gt; \n&gt; In a commentary on the study, two UK experts expand on the data: \"The difference in the association between Zika virus and microcephaly in northeastern Brazil and the rest of the country—which the authors do not present—would be more than 100 times greater.\"\n&gt; \n&gt; \"Other cohorts assessed in other regions of Brazil and Latin America will provide further robust evidence on whether variations exist in risk, and if so, why,\" said Laura C. Rodrigues, PhD, and Enny S. Paixao, MSc, of the London School of Hygiene &amp; Tropical Medicine. \"Could it be because of severity of Zika infection, viral load, or cofactors (the most popular being previous or co-infection with dengue)?\"\n&gt; Placenta testing for Zika evidence\n&gt; \n&gt; In other Zika news, a report today in Morbidity and Mortality Weekly Report (MMWR) describes the usefulness of testing placental and fetal tissue for Zika virus after a live birth. The study is based on tissue specimens from 627 completed pregnancies that involved possible maternal Zika virus exposure from the 50 states and Washington, D.C., that were submitted to the Centers for Disease Control and Prevention (CDC) in 2016 for testing.\n&gt; \n&gt; These specimens included placental tissues from 546 live births and placental and fetal tissues from 81 pregnancy losses. \"Among live births, placental tissue RT-PCR  provided confirmation of recent maternal Zika virus infection for 47 (10%) women who otherwise did not have a definitive diagnosis,\" the authors said.\n&gt; \n&gt; The authors write that testing the placental tissues for Zika virus can offer a definitive diagnosis that separates Zika infection from other flaviviruses, or if the mother's test results are inconclusive.\n&gt; \n&gt; \"Tissue analysis can be valuable when maternal serologic testing either cannot differentiate between Zika virus and other related flaviviruses, or has been conducted &gt;12 weeks after possible maternal exposure, and infant Zika virus testing is not definitive, negative, or not performed. Tissue analysis provides another opportunity to confirm maternal Zika virus infection, which can be important to both families and health care providers,\" the authors concluded.\n&gt; \n&gt; They add, however, that a positive placental specimen does not differentiate between maternal or congenital infections, making prenatal testing still the most valuable tool in the management of pregnant women with possible Zika exposure.\n&gt; \n&gt; See also:\n&gt; \n&gt; Jun 21 Lancet (\n&gt; \n&gt; Jun 21 Lancet (\n&gt; \n&gt; Jun 23 MMWR (\n&gt; \n\n^(source: \n\n", "Zika virus 'scarier than thought' says US ", "You can get alerts on any locally acquired vector-borne cases of Zika reported in your state by the CDC. (x-post /r/YSK) ", "Advice for people living in or traveling to Wynwood, a neighborhood in Miami, FL | Zika virus ", "What it would really take for GMO mosquitoes to stop Zika ", "Zika Virus Spread Symptoms Diagnosis and Treatments ", "Malaysia records first locally transmitted case of the Zika virus ", "Brazil reports explosion of dengue, a bad omen for spread of Zika virus ", "Zika virus (\"...for health professionals\") New Zealand Ministry of Health (updated: 07Mar16) ", "zika ", "Surge of Zika Virus Has Brazilians Re-examining Strict Abortion Laws (NYT from Recife) ", "Before America Wanted to Eradicate Them, the U.S. Military was Weaponizing the Zika Mosquito ", "The green tea molecule EGCG inhibits Zika virus entry — ScienceDirect ", "Belize Jan 2022 will be 2 months pregnant Hi all- I am going through ivf and about to transfer. When I told my doc I was planning on going one month after on a vacation to belize ( ambergris caye) she strongly advised not to because it was a “purple country”. Is Zika still bad in belize? Is it still a risk? If I do not transfer now I would have to wait 3 months. Question: If having to go the IVF route to achieve pregnancy. Why would you introduce any risk factor into your having a successful pregnancy and bringing forth a healthy child?\n\nRegarding Belize Zika risks:\n\n&gt;*\"Pregnant travellers should seek counselling from a travel medicine specialist and carefully consider the risks associated with travel to this country. \"*\n\nFollowing the advice of your healthcare provider would be prudent. Yes these are good points!", "PAHO Urges Work to Control Mosquitos in Fight against Zika, Dengue, Chikungunya ", "WHO | Zika situation report (5 Feb2016) ", "Zika virus infection – Peru (21APR16) ", "Zika Map | Virus &amp; Contagious Disease Surveillance | (13MAY16) ", "What is being done to fight the Zika virus? (60 Minutes Coverage) ", "WHO | Pregnancy management in the context of Zika virus (02MAR16) ", "WHO Zika App Launched for Healthcare Workers ", "Zika virus spreading rapidly across Puerto Rico ", "Why Scientists Hope To Inject Some People With Zika Virus ", "White House: Preparing for and Responding to the Zika Virus at Home and Abroad ", "Can genetically modified mosquitoes snuff out the Zika virus? ", "We are Canadians planning at trip Oct 24 - Nov 24 to S. America. We plan to start trying for kids in Janurary 2020. Is this a bad idea? I have heard if you go to Zika zone you should not get pregnant for 6 months - 1 year.  Should we delay conceiving for another year if we go on this trip?\n\n&amp;#x200B;\n\nWill be likely going to Chile, Uruguay, Paraguay, and Bolivia ( may provide some of the answers to your questions. You may find some of the answers to your questions in (", "States worry they do not have money to fight Zika ", "CDC: Zika could affect 10,000 pregnancies in Puerto Rico by year's end ", "Brazil Using Sweaty Billboard to Fight Zika Virus - TheConTech.com ", "Military Freezing Mosquitoes to Guard Against Zika Virus ", "Brazil confirms Zika infection from a blood transfusion ", "WHO: \"Very low risk\" of Zika spreading from Rio Olympics ", "What Threat Does Zika Pose to the United States? ", "2009 Study Finds Approx. 25,000 Cases of Microcephaly in the US per year--before the Zika virus ever spread to the US. ", "U.K. to Spray Planes on Routes From Zika-Affected Countries ", "NIH | Zika Infection Is Caused by One Virus Serotype | Summary in comments ", "Guillain-BarrĂŠ Syndrome Associated with Zika Virus Infection in Martinique in 2016: A Prospective Study | (20JUL17) CIDRAP summary in comments  I know I am late here, but based on what you have posted here, Zika still seems to be a real threat in Martinique. Can I ask why Martinique and Guadeloupe have been removed from the CDC zika risk map? Is it under reporting or? I have been looking at zika free warm weather winter destinations and Martinique and Guadaloupe are the only Caribbean destinations listed as no known risk, despite being surrounded by zika in every other country. A lot of nations do not have the resources to determine the extent of issues being faced.  They look instead to larger nations and international orgs with deeper pockets to provide information. The result is often people asking specific questions can not find the answers sought.  The onus is on the person to do the research and determine the best course of action for themselves and their families.\n\nThanks for looking to r/Zika, here is what been found:\n___\n\nwho is ( for Latin America and the Caribbean can provide information but only on the larger nations of the area.\n___\n\nThese were the first two items listed from a search within the WHO site for ( \n\n* (\n* (\n\nAn indicator of Zika activity in those areas. \n___\nHere is the link to the who is (  (downloads as: zikasitrep10Mar17-eng.pdf) \n\nMartinique and Guadeloupe are listed as Category 1 countries meaning there is *new introduction or re-introduction and ongoing transmission* as well as being included in Table 4, listing, *\"Countries and territories that have reported Guillain-Barré syndrome (GBS) potentially associated with ZIKV infection.\"*\n____\n\nWith the prevalence of inter-island travel and neighboring countries reporting incidents of Zika infection.  Concluding Zika is on Martinique and Guadeloupe, is logical. \n\nThe north Atlantic Hurricane season runs from June 1 to November 1.  Though likely past the worst of it, this years hurricanes have already had a significant impact on the Caribbean.  Physical damage aside, any mosquito abatement programs previously in place are not likely to return until infrastructure damage is addressed.   \n___\nIf you are not familiar with GBS the NIH link immediately below provides a good over view and if interested in reading about it from a perspective, I have linked an year+ old post at the top of r/Zika. \n\n(\n\nIf you have any additional question, let us know.\n Thank you for taking the time to reply. I figured as much, but it just seems odd to be completely left off when so many people rely on the CDC map for travel guidance. I am not worried about pregnancy, and would never risk it if I was, but I do not feel completely safe going and trusting in the 8 wk after visitation recommendations either. And given the resrarch into GBS that you have posted, not aa many people are as worried about GBS as they should be. So much seems unknown. Thanks again. It seems you are single handedly holding this sub down. ☺  Another perspective on the matter is mathematical.  80% infected with Zika never know it.  Only 1 in 5 become symptomatic. Only a small percent of those, a very small percentage, incur GBS.  What it comes down to is a line from (  \n\nTaking weather into account, the islands may be open for business and tourism is their business so they will work diligently to restore the revenue stream.  Expect that to be significantly more than getting the beer cooler running and making sure mess is out if sight. Visitors will likely be warmly appreciated and seeing the recovery process could be interesting.  Am interested in what you decide, lemme'kno.  \n\nThe moment of Zika has past, may seem to be the primary poster but am playing in a largely empty venue. \n\n\n\n Yes, the Caribbean is my magical happy place. The devastation is heart breaking. Luckily you will have to beat people to keep them away from that beautiful turquoise blue water. I am confident it will not take long for people to start venturing back. We will probably end up in one of the Out Islands of the Bahamas. Exuma or Eleuthera, though technically not Caribbean, are definitely Zika positive. We are traveling with a toddler in tow, and the Out Islands are very family friendly without being too reliant on resorts. My research into Martinique was purely based on curiosity, and lead me down a research rabbit hole. Although it is definitely on the list to visit in the future. Thanks again for your help. ", "Video: Preventing Zika virus ", "What is it like to be pregnant and infected with the Zika virus? ", "How long can zika live on sheets, towels, etc if there is semen or blood on them? ", "Yale team discovers how Zika virus causes fetal brain damage ", "Living With People They Bite, Zika Mosquitoes Hard to Fight ", "BIOLOGY OF ZIKA VIRUS INFECTION IN HUMAN SKIN CELLS ", "Zika Virus May Have Spread To Common Mosquito  ", "WHO | Zika situation report | (18NOV16) ", "Haiti finds case of microcephaly linked to Zika virus ", "ProMED-mail post | MALARIA (02): ODOR TRAP, NEW CONTROL TOOL | (11AUG16) ", "Zika Virus Causes Unforeseen Brain Damage to Fetus ", "Google Builds Open Source Tool to Combat Zika ", "Why the Olympics Actually Will not Cause Zika to Spread Everywhere ", "Bring home ZIKA!!! ", "Community Work: A Key to Zika Prevention in Colombia (16MAR16) ", "Zika fears to earn big payday for condom makers - NaturalNews.com ", "Zika linked to hearing loss in infants | (30AUG16) ", "Florida declares new Miami neighbourhood as Zika zone - Health ", "How a Medical Mystery in Brazil Led Doctors to Zika ", "The Zika Virus Family Tree: What Are Flaviviruses? ", "A global defence system to fight virus threats is urgently needed ", "Millions of GM mosquitoes to fight Zika virus in Caymans | (04MAY16) ", "Experts probe Zika links to microcephaly in 2 more nations ", "Sanofi halts work on Zika vaccine amid federal funding cuts | (05SEP17)  ^excerpt:\n&gt; **Rocky vaccine landscape**\n&gt; \n&gt; After a surge of activity in the Americas, ***Zika activity has dropped off sharply this year***, after tearing through populations who were not exposed to it before who now are thought to have some protection based on herd immunity.", "WHO declares Zika virus global health emergency ", "'Pandemic' Asks: Is A Disease That Will Kill Tens Of Millions Coming? : Fresh Air NPR - Podcast (37:43) aired 22FEB2916 ", "Scientists uncover how Zika virus causes Microcephaly ", "For Brazil's rich and poor, Zika virus presents two different realities ", "Chile reports its first sexually transmitted Zika case ", "Democrats assailing GOP over failure to pass Zika funding ", "Southern Europe risks Zika outbreaks this summer ", "In India, Zika test kits to hit market by March, cost pegged at Rs 5,000 ", "Brazilian study sheds new light on Zika neuro complications in adults | (14AUG17)  (", "Planning a wedding in Key Largo, FL for June 2017, should I be worried about the spread of Zika there by that time? I know almost nothing on Zika. I just looked up the warning area by the CDC in Florida. I am about to book the venue for my wedding but had recent doubts because a friend told me about Zika in Miami. Is it likely to spread more / spread south? Should I consider having my wedding somewhere else? Any and all comments welcome :) ", "General info on the Zika virus on wikipedia ", "CDC Reports First Zika Infection Between Gay Couple ", "Zika Can Spread Sexually From Women to Men ", "Drug cures Zika-induced microcephaly in animals injected with human neurons ", "My wife is 12 weeks pregnant in Florida She has the option to live in the mountains of western Maryland. The bad thing is she would take my 5 year old out of pre-k, be gone from me, etc. We are not the types to overreact, but were wondering if we should play it safe? The mosquitos do not get to us for awhile (out of season) so we have time to see how the outbreak will play out. \n\nWhat would you do?", "Geographic Variability in Zika-Related Birth Defects Baffles Scientists ", "Zika Situation Report: Zika virus, Microcephaly and Guillain-Barré syndrome (19 February 2016) ", "Zika’s structure has been revealed, bringing scientists closer to a vaccine "]