["Wiggly mover, wiggly sleeper😻😻😻  Follow me on Instagram (", "This little grey boy, Benji, most likely has CH, but that does not stop his brother from loving him as much as I do! Two of my four foster kittens! Benji is being adopted by my boyfriend so he is going to an amazing home! Any tips on how to support his needs?  Yay baby wobblers! The best thing you can do is let him learn :) As much as you may want to scoop him up and give him kisses every time he beefs it, it is best to let him correct himself and develop those muscles to compensate for his clumsiness!\n\nBeing a kitten, he is already very clumsy, so chances are high that he will get better as he grows! Sooo adorable! Totally agree with the previous comment - let him learn and wobble in a safe environment (of course no stairs or sharp corners nearby!) As he gets bigger, his muscles will strengthen and he will gain more stability. They are incredibly sweet cats, and the bond you develop with them is pretty darn strong as they rely on you for assistance, you are there to help them up if they tip over, etc. Lots of close contact. My CH baby (well, almost 8 months old now!) runs the house, and tells my other 2 non-CH kitties what is up 😼 She can manage stairs with supervision, uses her litter box like 'normal'. She does not let CH hold her back in any way. For litter, you may want to try the pellet kind (Yesterday's News or similar) as many CH cats lie down in their box as they are using it, and the pellets will not stick to their fur. You may need to cut down the front portion of a litter box so Benji can easily access the box without having to try to climb over the side of it (foam pipe insulation easily covers the rough edge created when you cut the side down). He will probably be able to graduate to a normal box when he grows and his little legs get longer. Keep some moist cat-safe wipes on hand, so you can wipe him down after litter box accidents, or food accidents (he will for sure tip over into his food at some point haha!)   Congrats to your BF on the new addition! 🐱 That sweet little blep I would check some of the more recent posts for some good pieces of advice. It may help you quite a bit. Such a cute little wobbler! Aside from what the other comments said, having area rugs or carpeted rooms are great for CH cats, as they can usually stabilize themselves better. Or at least mine has an easier time lol. Oh, and maybe get lots of toys they can play with while laying down! So happy for his new addition to the family!", "Wobbly in slow motion. Meet Flounder, our adopted kitten.  Hi gorgeous Flounder! That name is amazing! What a gorgeous boy! Omg what a cutey!", "Special platform for while eating? I am in the process of adopting a cat with mild CH, and one of the things they talked about is how he does not eat a lot because he has a hard time standing and eating, and he gets really sick if he does not eat food that is up on a platform for him.\n\nHearing this, I went home and  designed a \"platform\" (for lack of a better name) that he could rest his weight on while standing and eating. Has anyone tried something similar before? I am sure I am not the first one... \n\nHe is still pretty young (11 months) so it seems like now would be a good time to get him used to this sort of setup, but I wonder if maybe this is one of those classic beginner mistakes? I have never had a cat with CH but im pretty handy and want to at least try to make things easier for him to do on his own. I will always be there to help him but like, maybe it will give him a confidence boost if I get him a setup where he needs me a little less?\n\nI know it is important for him to build his muscles, but I also feel it is more important for him to be able to eat all his food comfortably. I am more than happy to help him build muscle in other ways, and it can be something we slowly try to work towards him not needing as well, but for the time being it seems like building this is a good idea.\n\nWe also already have tons of climbing stuff because our other cats LOVE climbing so once I make those a little safer for him, he will have plenty of exercise options.\n\nSorry for rambling a bit, I am very excited to take him home tomorrow, he is such a sweet man ❤\n\n\nEdit: also, I saw many people saying not to have your CH cat outside ever, and I was curious as to why. I like to walk my cats in a stroller, and i find it is a very good bonding opportunity for me and the cats. It would be a shame to leave him out BUT his well being comes first. I know I probably sound crazy but I love my cats and they love basking in the sun so sometimes on sunny days I take them to a quiet park and they take a nap in the stroller... Congrats on your new wobbly angel! \n\nI know he will have an amazing home with you just by how much you care and how much you are thinking ahead. \n\nTo start yes absolutely a platform could help. It really depends. At 11 months and a mild case he probably has certain ways he is begun to compensate and attempt to stabilize. A structure to assist in a less exhausting mealtime is a great idea and definitely will not hinder any exercise or strength building. Some people have had success with almost small mini feeding stalls with the bowl on one end. With my little guy I just have a nice firm grippy rug under his bowls and he loves being able to anchor his claws in and eat without any assistance. \n\nPlaying with him is really how you will help him build strength and confidence. My guy Hermes LOVES fetch so I promote that daily. Wands can be fun and interactive for them on the carpet or on a big bed  \n\nAs for the outside thing that is just because of their inability to fend for themselves and escape danger in an emergency. Under supervision it is totally fine. Just stay away from rough concrete, gravel, pavement, because they can really rub their legs and paws raw. Hermes loves his outdoor time.\n\nLet me know if you have any questions, good luck! A platform will only help. He cannot build muscle if he is not getting enough calories to grow. Meeting his basic needs should not be a physical therapy exercise. \n\nAs for the outside thing, being restrained in a stroller should be fine as long as he cannot get out. When they say “no outside” they mean do not let your cat be an “outdoor cat,” as in do not be an irresponsible idiot and let your cat free roam, destroy native wildlife, and get hit by cars and attacked by wild animals. This is true for ALL cats but especially for cats that are physically handicapped and cannot escape or defend themselves.", "30 Tips To Boost Your Mental Health ", "My moderate-severe foster Anastasia is going to be adoptable soon 🥺  Look that look of love. I do not know how you could let her go, even if it is to a good home. I know it. Her sister is moderate but is not nearly as affectionate. I will miss her severely when that time comes, but I have four cats of my own and had just graduated college a year ago. I wish I had the funds, but I foster failed one too many times already 😅 she also hates other cats, including her sister at times 🤦‍♂️ You are a good person. She is lucky to have learnt what love is from you! Aww thank you 💕💕", "My moderate-severe foster Anastasia is going to be adoptable soon 🥺 ", "CBD I know pet specific CBD oil is used for animals with seizures. Has anyone tried this for their CH kitty? Mine is moderate/severe and has very bad head tremors. Definitely should talk with a vet about this. I am not sure if it translates to cats, but I think there is been some studies about using MCT oil for seizures in dogs, so that may be another option to explore. Again, should definitely talk with your vet before trying things. Anything to do with the neurological system makes me nervous personally! Talk to your vet. CH is not curable and does not have anything to do with electrical activity. The way cannabis works in epilepsy is that it slows electrical activity in the brain.\n\n*Source - I am a human with epilepsy Thank you guys! I will keep him exercising and playing for now to increase his balance", "Advice for introducing CH cat to dogs I work in rescue and we currently have 3 CH babies that need homes and I have always wanted one! I do have a 7 month old puppy who is energetic, is good with our current cat, but likes to play a bit rough with her. My current cat does not mind but I would be worried she would be too rough for a CH kitten. Have any of you all introduced your CH cat to a puppy, or have experiences with CH cats and dogs?", "Richter enjoys fishing out some snacks from this puzzle! ", "Husky with CH I think my husky had a seizure this morning. Has anyone else had this happen? He is 11 years old so he is not a young pup but it is hard to talk to anyone about because of his condition. He looks fine to everyone else but I can tell something still just is not right. I am no vet so the first piece of advice I would give you is to take him to one ASAP. Seizures could be so many things and none of them are good. Some are definitely less serious than others like dieting problems, but it could also be anything from that to a brain tumor. Take your dog to a vet, let them know he had a seizure, they will probably want to x Ray the dog if not give him an MRI (not sure as I said I am no vet) but from that point what is wrong and what your options are should be clearer. Thank you! He has an appointment but they did not seem to think it was that serious and will not see him until tomorrow.  He regular Vet was not in the clinic today and the lady I spoke with told me everything I was describing was “normal” for his condition. How is your pup doing? Has he had any more seizures? Thank you so much for asking! He is doing very well. He was a little unsteady the day after and had trouble coordinating his movements but after helping him and exercising his legs he is back to normal like it never happened. So glad he is doing better. I cannot imagine how scary that must have been. We had to say good bye to one of our cats that we had for most of his just under three years of life and now I panic with every thing that they do.", "Adopting two wobblers I have adopted two brothers with ch and get to take them home next week. Any advise on a first time ch cat mom? My advice is to be patient with finding out what works for them! We adopted a wobbler that we thought was a mild case, but she is actually pretty severe—could not climb into or out of a normal litter box and could not stand up to do her business. We had a looooootttt of accidents and did a lot of trial and error with box types, litter materials, etc. It was frustrating, but we gave her time to acclimate and “tell” us what worked for her.  Try out different styles of litter boxes,  my ch kitty has a favourite corner style allowing him to eliminate with ease.   Be slow with changing foods as changing foods sometimes gives my guy the runs ; which means baths.    Be cautious with different wet foods too.    If they are still young I would recommend giving baths regularly to get them use to it.  I am so happy I did that as now he actually enjoys baths.    Water dishes! Make sure you find one that works and your kitty is able to drink water out of it.    I use sleepy pod food / water dishes due to the fact they are soft and prevents teeth chipping as well they stay on the floor and do not slide.        Lots to ch kitties on Instagram to build a community- I echo the importance of litter boxes and patience.  Our two had a fair amount of accidents and oftentimes fell into their elimination while trying to exit the litter box (one also lays down to eliminate).  We ended up constructing a custom litter box using a Rubbermaid tub and it was a game changer (you can look them up online).\n\nI could not be happier with our decision to adopt CH kitties.", "How does CH affect eyesight? We have a new cat with suspected but not confirmed CH in what seems to be a mild form, from what we have read. But while we have seen that it affects eyesight, there is little to no clarification of that part.\n\nHe seems to be lacking depth perception, when chasing a laser he will mostly attack the air between him and the dot, I am not sure if this is expected or not? Umm I dont know if it affects eyesight because I am not a vet. But it very much does affect their ability to move jump and chase things. The part of their brain responsible for fine motor skills is not fully developed, but I am sure you already knew that. It is more than likely that your cat can see the laser its brain just cannot do the things required to make the cat go and catch it. If I were you I would take the cat to a vet so that they can test it for blindness. Much luck and love for you and your little wobbler. He is going for his first vet visit soon so I will bring it up, thanks.\n\nHe was a stray domestic cat we got from a shelter a week ago, settled in within about 5 minutes when we got home, such a friendly wobbly guy :) From what I have seen, CH does not affect eyesight. It does definitely seem to affect the depth perception though! My Richter and a number of other fosters we have had usually have poor depth perception, but not all :) If you shine a light in his eyes and see his pupils dilate, then that is a pretty good indicator that he can see. Keep us updated! Our kitten will launch himself across the room like a freakin antelope to get a laser dot. My little Pomeranian Nala has pretty bad depth perception with her CH, she needs assisted water  drinking where I literally have to hold her head in her water bowl for her to drink other wise she just hovers over it licking the air. \nShe does not do this with food though and can get her head right in and eat. Her head tremor is pretty bad too which would not help but yes I have also queried eyesight too. \n\nIt does effect there sensorys too I heard but unsure in what way with eyesight.", "Hermes conquering the stairs! ", "CH Cats and Anesthesia Hi!\n\nI found a kitten outside while I was working in October and he seemed weird to me, I have done some research and I found out he may be struggling from Cerebellar Hypoplasia because he couldn´t balance well and was falling all the time. And although my boyfriend´s limit was one cat and we already had one (\"healthy\") cat at home, I decided to take him with me. Now my boyfriend loves him as much as I do, he brought lots of joy into our lives and I am sooo glad I didn´t leave him outside, I knew he may die there quite easily (falling, other animals, other cats, injuries...), and I just couldn´t leave him there. I am such a cat lover, and I also work as a cat sitter, so that may say it all, but this is the first time I actually take care of a somehow disabled kitty.\n\nHe is about 6 months old now and our vet suggested neutering him. He is an indoor cat, but you never know what can happen... But he also told me there is a greater risk that something bad can happen during the operation. Are CH cats really at a bigger risk of complications with anesthesia than cats with no condition?\n\nTL;DR: A CH cat adopted me. Is anesthesia safe for him? Anecdotal only, your vet knows more than I do but I know of one ch kitten who died getting neutered but he was much younger, barely six weeks so that may have contributed. I have two ch cats now, one minor one severe and they are both neutered and doing fine. I adopted my kitten from a shelter, which means he cane to me already with all his shots, treatments, and neutered. As long as the kitten is old enough to go under I would say it should be fine. I have heard it is good to “test “ anesthesia on cats though? Because something bad COULD go wrong with any procedure. Whether it be a wrong dosage or the cat is not healthy in other areas. The biggest recommendation is to avoid ketamine during sedation as it can cause their recovery to be rough. They are already wobbly and they can wake up dizzy and disoriented. \nOtherwise they are not really at a higher risk than other pets under anesthesia. My Ch cat went under for his neuter and came through just fine. Make sure you trust the vet doing the procedure. My vet is a little pricier than most but they are very competent and have reassured me through all of his medical issues. The only type of anesthesia not safe for CH cats is ketamine. Most vets do not use ketamine anymore except as a last resort for pets resistant to other anesthetics, but if a CH cat were to accidentally receive ketamine, there is no way for them to wake up from the anesthesia and they would die. I recommend having your vet add ketamine to your pet’s list of allergies.\n\nAnother safety consideration for anesthesia is your pet’s body weight. CH kitties are often smaller and have delayed growth since they are not able to exercise their muscles well in kittenhood while they figure out how to consciously coordinate their movements (since the cerebellum would usually coordinate muscle memory, but it is underdeveloped). So sometimes vets prefer to delay spay/neuter surgeries for CH kittens until they meet a certain weight threshold. Keep in mind that the stress of a spay/neuter surgery is far less than the stress of going into heat and potential pregnancy/birth, so it is very important to have a CH cat spayed or neutered.\n\nOther than that, any other contraindications to anesthesia would come from separate health problems not related to CH. Our CH kitty Tesla (they/them) also has epilepsy and has actually tolerated anesthesia better than any other cat I have owned (all of whom are larger than Tesla, who weighs just 6 pounds full-grown.) Tesla actually had an intestinal obstruction (from eating a Thai chili-spiced almond, because they are adventurous like that) that had to be removed by emergency abdominal surgery, and then required second surgery seven months later for a complication during healing (a blood vessel grew back around the intestine and caused a second obstruction). Both times, they were ready to come home from the vet a full day earlier than expected, as they came up out of anesthesia easily and were stable right away. Your CH kitty might surprise you with how resilient they are!", "Whisker injury? I have a kitten with moderate CH. We have hardwood floors, and while we did buy rugs to help the little guy, it seems he still will accidentally slam his head against the hard floor. I have noticed that some of his whiskers have broken off. Is that normal? Do you think it is causing him a lot of pain? Losing whiskers here and there is normal but if your cat is missing a lot of whiskers that could certainly be an issue that you should seek out a Veterinarian for in my opinion. My ch kitten (now a robust, handsome ch cat) had a few of his whiskers seem to snap clean off. Once he found better ways to get around (i.e leaning against walls while he walks) his whiskers grew back and stayed there!", "shark tries to rip off diver's head ", "Awww my baby after tooth surgery fell asleep in her supper 😻😋😆  I relate to your baby so much I know me too, never have I felt so in tune with her 😆😻 Aw man, poor babe! One of my girls had 22 teeth extracted, so she sends her sympathy!", "Hermes would play fetch all day if he could  What an amazing puss!  Best cat ever!!! Wow he is so cute!!! Love his little face.", "Advice needed for a CH cat with a front leg injury We recently adopted our cat with CH and she is obviously not too steady on her feet. Unfortunately she is recently had a freak accident (got her claw/paw stuck in a radiator) and she is currently wearing a bandage around her front leg to fix her dislocated paw. She could walk around unassisted previously, however with the bandage up her whole leg she is really struggling to walk without us holding her up (and keeps flopping forward as she does not seem to want to put any weight on the bandaged leg). \n\nHas anyone had any experience with a CH cat that is recovering from a leg injury that could give advice for how to make the next week with the bandage on any easier?", "I MacGyver-ed a raised weighted dish for my CH baby  nice.  I have been looking or a 2.5 or 5 lb plate like from a gym.  I am going to glue a plastic bowl on it. Great idea!!", "my wobbler will be getting fixed soon and im quite nervous! I am a member of a few CH groups on facebook and have seen how the knock-out meds can effect them and it kind of scares me! I have a super great vet that does research on everything and would never touch my cat if he was not confident Nico would be alright, but i am still a paranoid mom lol. I have put it off as long as i can but i know he will live a better life if i do this. How did your CH'ers do when getting fixed?", "Meowy Hissmas from Noodles the CH cat! Also occasionally known as Noodle Claws-the-not-so-jolly-fat-man.  Merry Christmas Noodles! ⛄", "Meet my beautiful Valerie 😻 ", "There is a lovely kitten with CH available at the Putnam Humane society in New York. ", "My CH kitten Chickadee scooting around ", "Who said disabled cats cannot be models?  What a pretty kitty! 😺 Gorgeous! A very good study of light 😍 Beautiful!  What a kitty! So handsome!", "Look like CH?  Did not seem to be able to write on my original post. I noticed when my cat was a kitten he had some jerky head movements. These seemed to settle. Today however they were very bad, particularly as he began to walk. Could he have mild CH? Is it sometimes hardly present? But then more so? I am no vet. That is who I would ask about this, but also post a longer video of his movement. From what I do understand about CH even in its milder forms it is very noticeable, and mainly affects your cats gait. From this video it does not look like it but if you want to send me a longer video of him walking, and do not mind waiting a week I could show it to my cats vet and see what she thinks cuz he has an appointment on the 26th We have shown it to a vet and also taken him to a vet. The vet said she could not say what it was and to observe him and see if it continues, if it does he will be assessed for epilepsy or a brain tumour among other things. When we took him to the vet he did not exhibit this behaviour and was judged neurologically normal. However when back home it continued in a milder form before ceasing, at least for now. Hmm yea it may not be CH hopefully it is not any of those other things either but it definitely is not CH as the shaking symptom does not stop due to the part of the cats brain responsible for movement not being fully formed. So you can Def cross that off the list as the impaired movement would never go away and be noticeable from birth.", "Mold on silicone bowls. Is it a normal issue? Hello furens, ive been keeping an eye out for raised soft bowls for our kitty so that ge wont hurt himself. But we were too late, hes already seemed to have chipped his top fangs (what a bad mommy). So im looking online to order something asap. I found a really nice elevated bowl set in chewy that has pop up silicone bowls but a lot of the reviews say mold starts to grow and its hard to get out. Is it a bad product or is this just a downside to having a ch kitty who needs a silicone bowl? We use these  (  :) The foster of our CH kitties said to put it on top of those cat scratchers. It helps raise it :) I bought the silicone raised bowl set I was talking about and honestly.. It hasnt even gotten mold on it yet. But they also dry it out in a day so I rinse them out or fully clean them really often. That Is good! We havent experienced any mold with our bowls either. We have two CH kitties and only one of them needs it raised since his is worse We feed wet food in a silicone bowl and wash twice weekly. We have been using this method for a couple years now and never had any mold. I ended up buying two sets of bowls bor both my cats and I havnt noticed mold on their water bowls. I am why a lot of reviews said they got mold after a week or so... Probably people who never washed their bowls. I notice that if we forget one of the twice weekly washes, a little slime starts to form on the bottom of the water bowl, and I imagine that gets worse after another week. Sounds like it is a “people being gross and not washing their cats’ water bowls” problem and not a “silicone bowls are more prone to mold” problem. You do not see people using silicone bowls for children complaining about the bowls getting moldy.", "When I get birthday prezzies that are actually for Valerie shes a very happy girly 😻😆🎁 ", "CH Hope’s story has gone internationally viral viral thanks to Reddit. ", "My handsome 11 year old CH kitty, Simba, sporting goods new Christmas collar! ", "Makō and his big sister Toki, really starting to form a nice bond. He is had to be extra gentle with her as she has cerebellar hypoplasia (wobbly cat syndrome) and cannot really defend herself so has been a bit of hard work 😅. Super proud of them both. ", "My wobbly cat, who CANNOT walk, just took an unbelievable lunge at her sister! ", "Mama Wont You Be My (documentary) ", "Karma - CH Kitten avail for adoption (Los Angeles) Hey Animal Lovers.  A very special CH kitten is available for adoption and looking for his forever home in the Los Angeles area. \n\nKarma's playtime is pretty much the cutest thing you have ever seen because, unbeknownst to him, he has a condition called Cerebellar Hypoplasia or “Wobbly Kitten Syndrome”. He is perfectly healthy, active, extremely affectionate, and his lack of coordination and balance will melt your heart in an instant. (Check him out in action in the YouTube link below). \n\nIf you are someone who spends a lot of time at home, looking for a loving unique kitten sidekick, Karma is the guy for you. Especially if you have another animal for him to play with, and/or are interested in adopting him with another kitten. \n\nHe is available for adoption through (\n\n(", "Sad kitty wants to sit in the window sill... Has anyone found a way to safely let their kitty get up to the window sill? Originally P'yan had no interest. But now that its getting more lively, and he sees my older cat doing it, he wants to get up there and sit with her and watch the birds outside. I can see the gaers turning in his little head whene he puts his paws up on the sill, hes really been trying to figure out how he can get up there. I need a way I can let him bask in the sun up there but also maintain my own privacy with the curtaind and blinds closed. Ive tried having a cat tree but it makes it difficult to close the blinds and curtains. My most severe ch kitty loves to watch out the window, but he cannot get around at all by himself. I cut one side off a box and moved a little table over in front of a window. That way he can lay on a blanket in the box, with a clear view out the window. I do not have to worry about him falling because the other 3 sides of the box are still there. That might work for you, depending on how mobile your kitty is. Also, people make fun of me for this, but I put birds or squirrels on YouTube and he loves watching those. Lol. That is SUCH A GOOD IDEA!!! Thanks. I am going to use it. Glad I could help!!! I have 3 ch kitties so I have figured out a lot of safe ways to do things. Lol That could work! I used to have his cat tree there but I needed the cat tree out of my room because I have \"no cat zone\" pets. My other cat sits in the window when im supervising so something like a box would probably do us well. My kitty gets around very well and can use a short cat tree safely. I do that to both my cats.. And I end up being the one paying attention to them lol Thanks for sharing!", "Do not think twice If you are contemplating going into the world of owning a CH or wobbly kitty, do not think twice! Our two sister CH girls are the BEST THING that ever happened to us. We would go to the ends of the earth for these little blessings and hate to think of the day when they are gone. Oh, P.S., we are so glad that the shelter mandated that they be adopted together. We see how much they play together, \"fight\" and cuddle with each other. It was the BEST DECISION! Hell yeah! Wobblers are so amazing. They are the most determined cats I have ever experienced! You cannot tell them they cannot do anything 🤣 My kid has CH...I was so glad that reddit had an area, I forgot that it is more common in animals than people...I see a similar determination in my kid Wait, what? There is CH in people?? If so, I had no idea. Yeah, right cerebellum cluster of cells didnt differentiate in utero, it looks in brain scans like a dime sized cluster emanating from the left cerebellum but it never split off and grew. My kid has delays, but (thankfully) no seizures; has learned to walk, and responds to swim therapy and music. Oh wow. Thanks for explaining that. I have a nursing background and cell differentiation has always fascinated me. I am sorry that your child has that, but I see that they have a great mom. Hugs to the both of you.", "I thought it could be useful to post this here as well, hope you guys like him  not sure what nappy band wrap thing means but there are dog diapers and dog training pads available.  Yes I do like him, please give him a pet and a treat for me.  Good luck.  got to get back to work.  damnit. he is the derpiest derp that ever derped, except for my CH kitty!", "Just adopted my two boys, Ragtime and Lindy Hop. Lindy Hop has a very mild case, Ragtime is more severe.  Two beautiful wobblers! Thanks for loving them! Good on you for adopting two together!! It is so special to adopt a bonded pair. Be patient with them and give them lots of love 🥰", "Pen Ideas Looking for play pen ideas either DIY or Amazon/chewy? Thank you!", "Our wobbler Mona Sammich, deeply confused by the spider web and leaf outside her window ☺️  She is beautiful I named my little wobbling girl Death Lord Such a cutie! Thank you! :)", "Photographing a wobbler in three easy steps!  ", "Meet our new CH kitten, Geddy. He is fairly mild, and a complete cuddle bug! So glad to have him as a part of the family.  Hi Geddy! Nice to see you. Magnificent! He is wonderful!", "My handsome 11 year old CH kitty, Simba, sporting his new Christmas collar!  Could U tell Simba I would die for him and pay for his college Message has been relayed 😂 Looking so handsome 😍😍😍😍", "My kitten has a wobbly head, worsens when she is trying to focus or is scared. Could this be CH?  Your cat should be evaluated by a veterinarian asap. If this is CH it is an atypical presentation. Typically it does not just affect the head. And often it is more of a chicken pecking motion when eating vs a side to side motion. Thanks. Im planning on scheduling a visit to a veterinarian neurologist tomorrow. It does appear to be CH, but a vet will be able to test to rule out any viruses! Be aware that some vets view neurological conditions as a poor quality of life and recommend euthanasia. Ive been to the vet and they ruled out Feline leukemia and viral infections or ear infections. They recommend I visit a neurologist. But her quality of life is just fine shes extremely active and it doesnt seem to interfere with her life at all. That is great! She may just be very mild. She is adorable! Thank you! Im thinking to take her to a neurologist anyway just to get an official diagnosis since Im worried. Wish me luck!!", "Wobbles is wonky no matter what he does.  Say Hi to Wobbles for me and give the big W a treat for me too!  Our resuced CH is named slingshot.  Wife and I added the following:  Slingblade, shakes the kitten, wobbles, and Usian Bolt when it is dinner time (do you think he is faking it?) - me, charlie - wife.  Thank you for taking care of that kitty Wobbles said *uncoordinated scurry, uncoordinated scurry, flop* “meeeeOOWWWWW”", "My 4 year old rescue boy Weeb always comes in for Huggins!  Beautiful boy 😸 He is so gorgeous! Hug him from me, please 💕 CH cats are the best kind! Oh my goodness. I am in love with your Weeb! What a sweet boy! Precious ❤️", "Just adopted a CH kitten, any tips for making her life the absolute best would be appreciated!  Her name is McNulty, and she is had a rough go of it so far. Slow to grow and almost lost an eye at one point. But she is the sweetest and very rambunctious! Absolutely adorable!  🥰 how severe is she? Some basic tips I can think of would be rugs or carpeted areas, cat cleansing wipes for when she falls and gets messy, and I found putting the litter box against a corner helps by giving them something to lean against. She is fairly mild, you really only notice it if she is playing. The house is mostly carpet already but the litter in the corner is a great suggestion The Cerebellar Hypoplasia Cats &amp; Kittens Facebook group is super active and helpful! Welcome to the wobble family! My best advice is to let her fall over and correct herself to build muscle where she needs it. I would also lightly suggest removing her collar until she gets a little older, just because kittens can get it snagged easily when playing and cleaning. Better safe than sorry! The collar came off right after the picture actually... I noticed it bothering her while she eats. We are going to get some breakaway collars for her! Good idea!", "Kicking while sleeping question ", "In which Mr. Flops follows the dog around the park.  Look at him go! We have the same harness! Me too! Me too lol 😆 Must be the cerebellar harness lol 😻😻", "Wanted to post this here for anyone that has any advice on my new little wobbler💕 ", "My cat seems to be having seizures or muscle spasms, the doctor does not know what is wrong has anyone else experienced this with their cat? If so is it harmful or preventable  That looks like a seizure.    :(  had a cat with seizures : started when she was 16. She ended up living to 20 with phenobarbital.  Takes a couple months to get on the right dose level but it was able to keep them under control. He is only 2 or 3  I was just stating age to give hope that it will be ok.    She had no neuro issues, but ch cats do.       I think seizures in ch cats are common.   Life with ch cats . Com has good resources for seizure ch cats.   \n\nHave you shown your vet this video? Yes, they did some tests and he seems to be alright.\nthanks for the website I will check it out If your vet could not see there is something wrong, you need a new vet. I have the same situation going on with my cat. Theyre like muscle spasms that make her flop around. I know they are seizures. I have gotten blood work back and it came back normal. \nCould you give a quick update on what happened after and how you are cat is doing? He also got blood work that came back as normal,\nIt all started after he got scared and ran off of a little chair he likes to sleep on, he has cerebellar hypoplasia on his back legs and lower body so when he fell he twisted his back in a really painful looking way...I have been massaging his little  back which seems to work...I wonder if he may have injured his back and it cramps up like a charley horse and he seems to be aware when it is about to happen and usually runs up to me \n\nToday I was giving him a massage and I hit what felt like a really nasty little knot and he seemed  to recoil for a brief moment into the position and facial expessuon he has during his attacks.\n\n\nI feel like the attacks are more frequent now but that could be because I am home more often to see them these days. Thanks for responding! At least we can be home more to monitor these things a little better than usual. My cat only has her little seizures at night and they only last between 10-30 seconds. She has a vet appointment next week. \nI know  vets cant recommend CBD, but I decided to give it a try after her third episode. They do not happen every night anymore. We are down to 2 a week, which I think is totally amazing and worth others trying it. I got mine off amazon. Its called Pet Hemp Oil for dogs and cats. I give it to her twice a day mixed into her food. Sometimes I will put a few drops on some treats throughout the day. Yeah, I got some cbd for my cat too, it does not seem to be having much effect though maybe I need to up his dosage", "Meet Winston!! He is a little over 1 year old! He has mild CH. He is an absolute cuddle bug!! All he wants to do is be held and be around his people. We absolutely love our little man! Love to all of the CH families out there!!!  Hi Winston!! What a cutie! 🐱❤️ My mild CH girl Sailor says hello! Thank you!! Hello Sailor! Such a cute name! Well hello there, Winston. You are handsome. I like your face and whiskers.\n\n/I am typing what our mild CH kitty Dolly tells me to write you. Thank you! And hello Dolly! Welcome!! Tons of wobble love headed your way! Thank you!! Greetings from Michigan Winston. My little wobbly lady, Death Lord, is almost a year old. She sends much love to Winston. He looks absolutely adorable!!", "Clumping on butt or poop tracking, what litter (box) to use? My seven-month CH cat tends to fall over and roll around in her box. We currently have a low-walled box in a corner of the room, so walls on two sides. We started with traditional clumping clay litter, but after one incident of clumped litter all over her rear half, we switched to pine pellets. This solved the clumping problem, but now she is tracking her waste all over the room. \n\nWe are trying to find a middle ground here. Does anyone think non-clumping clay litter would work in this case? Any other suggestions? Anything is appreciated You are definitely going to want to get a litterbox that is enclosed. Like a two piece one that has a little hole that your cat can crawl in and out of something like (\nI initially had an open litterbox when I first rescued my wobbler. That did not last long as she would get cat litter and poop absolutely everywhere around the litterbox A.K.A the carpet.\n\nAs for litter it really depends on the severity of the cats condition. Mine is pretty moderate she has noticeable intention tremors. Her head Bob's with almost every motion, and she cant run or jump at all. I personally use that fresh step crystal cat litter it comes in like a blue plastic sack. I think that litter is pretty good in regards to tracking and dust as I usually dont find any litter outside of the box. Be careful about what kind of box you get btw in regards to how high the entrance is. You may need to make or buy some kind of ramp so your cat can access it. I hope I was able to be of some help. Feel free to PM me if you have any more questions and best of luck to you and your kitty cat. Thank you! We are going to look for a litter box like that (with a lower entrance, most likely) or make one ourselves. Do you have any thoughts on a narrow box with high walls? I was thinking that if there was not enough room for her to fall to the side, instead being propped up by the high walls, it would help with rolling in the waste. \n\nHer condition is moderate, she can stand still enough to eat and drink from her bowls, but she has trouble standing in the box (probably due to not having high walls). I was thinking about switching to non-clumping clay litter because the pine pellets do not allow her to really cover the solid waste, but it would not clump to her if it is wet and she sits in it. Any thoughts on that? Thanks again. We are using Okocat clumping litter(Your pet will love this Okocat Original Premium Wood Clumping Cat Litter, 13.2-lb box: ) - it does not stick to her fur and she does not track it everywhere. We had the same issue as you with clay based litters and have gone through a lot of different litter box set ups until recently (our CH cat is now 2)\n\nAlso bought this litter box(Your pet will love this Good Pet Stuff Hidden Cat Litter Planter: ) fairly recently and it is really great for CH cats - really roomy and it being covered helps too Thank you! It seems both of you are having success with that type of box, so I will definitely get one. \n\nDoes that litter allow for the solid waste to be covered up? The problem we are having with the pellets is that they do not bury solids well, even though she is doing her best to cover it with the pellets. Thank you! It seems both of you are having success with that type of box, so I will definitely get one. \n\nDoes that litter allow for the solid waste to be covered up? The problem we are having with the pellets is that they do not bury solids well, even though she is doing her best to cover it with the pellets. Sounds similar our CH cat - moderate, will eat/drink standing but always lays down in the litter box. The entrance does look high on this one from the photos but she seems to get out of it pretty gracefully. I think you would be ok with a narrow one - had Breeze prior, which worked well (and that is quite narrow).\n\nOurs has actually never been able to cover her solid waste but our non CH cat sometimes does it for her if he is feeling nice - so yeah can be done with this litter no problems\n\nGood luck!! Sounds similar our CH cat - moderate, will eat/drink standing but always lays down in the litter box. The entrance does look high on this one from the photos but she seems to get out of it pretty gracefully. I think you would be ok with a narrow one - had Breeze prior, which worked well (and that is quite narrow).\n\nOurs has actually never been able to cover her solid waste but our non CH cat sometimes does it for her if he is feeling nice - so yeah can be done with this litter no problems\n\nGood luck!! Thanks! Hopefully this new high-sided box will do the trick, but we will see (and smell) in the morning! I have had really good luck with a Booda Clean Step litter box. It is completely enclosed with a ramp that leads up to a good sized litter area. My floppy boy uses it just fine.\n\nI have experimented with a few kinds of litter, and while we both like pine pellets the best, you might also try grass seed, walnut shell, or wheat litters. I have two non CH cats but one is notorious for having poopy paws  and also tracking litter everywhere but that has been nearly 100% fixed after switching to Fresh Step Clean Paws. They have a few varieties of Clean Paws including an unscented version. Hope that helps. Thanks, I will look into it! Thank you, I will check out those alternatives!", "Noodles to the rescue! ", "My cats not using her litterbox Yeah title. I have tried getting her a different one without a lid. She still will not use it. She used to use this letterbox that was covered and had a little doggy door. But I noticed that one day when I went to clean it. It was spotless and the area behind and around it were covered in cat urine. I got her a new one without a door and lid, its just open, and she still will not use it. What can I do? Is the entrance low enough? She might be having trouble getting in. Otherwise, cats start going outside the box for a lot of reasons, from UTIs to just being stressed out. Nothing wrong with a vet check just to confirm she is not sick. Were there any other factors that changed recently (New pet, New roommate, different litter, changed box location, cat feeling sick, etc)? Cats will not typically change litterbox behavior unless something is going on to cause it. Sometimes, you have got to just keep trying things to figure out what is not working. Could be the location of the box or the type of litter. My CHer will only use a clean box (because he falls to the side). You should use an enzymatic foaming cleanser on the area nearby and possibly get more boxes and a few different types of litter for the kitty to try. I am dealing with similar issue but I think it is because they are kittens and other cats used to live here. We have been experimenting with box placements and stuff.", "CH Hope having a ball  Omg just so happy Ch pets have more fun than non ch pets. You cant tell me otherwise.", "He attack and snack  Krem was found in the loft of a barn. He is about two and a half months old. So much energy. If anyone has any toys they can recommend, my hands would love a break from being chomped and scratched. He seems to have more energy than our other boys ever had. My CH boy really likes his toy fish, it is motorized and he is already killed one. The other regular cats I know do not care for it but he loves it We have one of those. I forgot to charge it back up. He loves his too. His brothers think he is weird for playing with it but then they have to join in after a while.", "Our beautiful boy crossed over the rainbow bridge yesterday after almost twelve wonderful years. I will miss him so much, but I am glad he is not suffering anymore. Goodbye my Simba Bears, mommy loves you to the moon and back.  Very sorry for your loss 😔 What a sweet little face 💙 He must have been the sweetest little boy.  What a darling face.  I am so sorry for your loss. Rest In Peace little one. 💕🌈", "My little friend cannot stop bonking his head! I have a cat with severe CH, he is almost a year old. His name is Bacon. He is gotten better with balance and walking, he can even jump up on the couch on his own. The problem is his tremors, he tries to lean against walls whenever possible to make balancing easier and his shaking causes him to bonk his head several times rapid fire style against the wall. He always seems fine afterwards, and he has not had a concussion (yet). Are there any soft foam helmets for animals with CH? Or are there any better options?", "Ralphee and pup friend max! Wakaleo video featuring Ralphee kitten with CH ", "This little girl is so happy, I just wish she would wear a helmet!!!  Hahahahaha! Oh man, she zoomin'! that is about where my kitten is.  except when it is feeding time, then he becomes usian bolt", "Ch cat very aggressive, afraid he will hurt himself/also want him to be happy \nI have got a 3 year old male cat with cerebellar hypoplasia. He used to be very amicable, loved other people, and was curious/playful about other cats. Rather abruptly, he became downright hostile to anyone or anything that is not me. He will not retreat either. He will just attack. He attacks everyone, and growls and hisses. I had a roommate give him treats every day for a year and he would still attack her and was never comfortable with her.  I started fostering some kittens in the hopes that he would warm up to one of them. Even when I keep them separated, he gets very agitated. He will figure out where they are so he can attack them. Like if I have the fosters in the bathroom and I go to the bathroom he will run in to attack the kittens. He does not really like to play. \n\nIt is already an issue because I love him and I want him to have a happy life. It is compounded by his cerebellar hypoplasia because when he goes to attack things he often takes some nasty falls and I am worried he is going to hurt himself. \n\nHe never attacks me. Not even a hiss or scratch. He is always affectionate towards me.\n\nHe is been to the vet and they said everything’s fine. I do not have enough money to pursue another opinion. Anyone have any ideas? Oh gosh. I am sorry to hear that he has been having some issues! My own wobbler is absolutely terrified of anyone other than me. It is so strange! My husband, who fostered Richter with me since he was a couple months old, has been nothing short of an angel to him, but still he makes a mad dash away at light speed the minute he comes in the room :( I half wonder if he *sees* something? I am unsure. \n\nI have started him on CBD oil and it has honestly helped with his anxiety. I have considered getting him started on fluoxetine at a very low dose, but I am keeping up with the CBD each night at dinner time. Maybe that could help with your boy?\n\nIs he neutered? He is neutered. It is so strange that they are so particular. Mine is named widget :). But widget used to be very social very easygoing. I will try cbd . It is also crossed my mind that maybe he is in pain because of an injury or a chipped tooth. The vet said his tooth is not chipped enough to cause pain and that the rest of him looks fine, but I cannot think of any other explanation for his behavior. Makes me sad :( I would maybe get a second opinion! A chipped tooth can very well cause pain. I feel like some vets do not really understand wobblers that well. \n\nDoes he have all his claws? Yes he has all his claws. I will see if I can find a good vet for a reasonable price. Thank you ❤️❤️ Keep us updated!", "One of the best things I have done is getting a buddy for Artie. Here they are Artie(right) and Smudge(left). The best friends.  I did the same thing and ended up with 3 wobbly boiis 😂 \nI went to get flancoho a friend and his friend ended up having a brother I could not not take. Best decision ever", "Shiro, our suspected mild CH 7 months old kitty. Will not know for sure until we can afford the MRI though! Glad to know there is a reddit for him too  Welcome Shiro!! 😍😍😍 Thank you! 😻 If his other diagnostics are normal, you may not have to do an MRI. CH can be made as an assumptive diagnosis if blood work and other tests are normal. Props to you for wanting to do an MRI but I do not think most owners get them for their CH cats. Thank you, I will talk to my vet about it. We have insurance but we do not really know how much it will cover and it is damn expensive lol", "The best way to keep him from falling over while eating is to have him lay down lol  I do not know how true it is, but we have been about our CH lab that lying down while eating is not so good for her digestion, so we got her a raised bowl and now she stands quite well while eating. Could be worth checking with someone. He looks lovely though! Weve tried a couple raised bowls.. He ends up flipping over. This seems to be the safest way for him. We had that to begin with and just sat with her while she ate with our hand resting on her bum so she did not flip. It took a couple of weeks of doing it, but she learnt to steady herself and now does OK. If she is tired she is not so good though. Please do not take this as me saying you are doing something wrong, they are all different and need different things. Just sharing what I have done, which obviously will not work for everyone. He is obviously happy and that is the main thing! I took no offence at all! Thank you for any advice really. :) He is such a handsome boy! He looks so much like my boxer gal who passed a few years back. Give him some pats from my CH kitty and myself:) Yeah, our CH kitties, Oopsie and Daisy, eat laying down. We got them the silicone eating bowls that infants use when eating so food does not spill.", "cat wheelchairs I have been trying to price wheelchairs online for my severe CH kitty, and the ones i see are normally around $200-$300(I cannot do that for a while). My dad tried to make one with pvc pipe but my cat did not like it at all lol. I just wanted to ask where others got their wheelchairs from, or those that made their own if they have a guide they followed to build it. thank you to anyone that can help", "Meet Nacho (Orange) and Taco (Black/Tux)! &amp;#x200B;\n\n\n\n(", "Picked this 14 week old CH puppy up from the shelter yesterday. They were going to euthanize him. But now he has a chance at life with our rescue! Meet Keanue!  Good job! It is uncommon to see CH in dogs, so I am always excited to hear when they get good homes 😍 Thanks! I just wonder how many are euthanized and rescues are never contacted. The symptoms are so close to distemper that I am sure it is misdiagnosed.", "CH does not stop this little gremlin from getting into trouble. Meet Bailey! And make sure to scroll through the pictures!  Omg same. For not being able to walk my cat can sure climb like it is nothing. I once came home to find him in the closet on the top shelf..", "My kitten has a wobbly head. Is this CH? ", "Hermes is committed to catching his butterfly toy! 😺🦋 ", "Phillip  phillip", "Hermes having the best time ever with his flopping fish toy 😻🐟  My ch kitty also LOOOOVES his floppy fish. It is the best.  Any other toy recommendations ?  Happy wobbles Hermes!! 💕💕💕 Oooo my kitty is a bit more noticable in his wobble and I think a floppy fish would be really funny to see him play with lol Actually there are a few toys from OurPets that he absolutely loves that are awesome for less mobile kitties and are very stimulating!\n\nLike this one I actually bought a second one of:\n\n", "In serious need of help I have previously posted about my boy on here struggling to walk. As of now he has completely given up on even trying to stand up let alone try to walk. He seems happy as he will purr and try to play but he will not even attempt to stand he will just flop over and lay on his side. Also with not walking he cannot use the litter box and will just randomly go wherever he is laying without notice. He still has mobility in his legs but I do not know what to do to get him back on his feet. He is almost a year old at this point. Please help", "I needed to share this sweet collage of little Jack-Jack cuddling her daddy. She is kind of his spitting image! 😍☺ Disclaimer: Daddy is now a neutered boy! 😂 ", "Our partially blind CH girl likes the tunnel! 🎉 (New adoption 😊) ", "Can you guess what happened to get 5 teeth extracted and an almost 1,300$ vet bill today? ", "It is my beautiful Simba's Gotcha Day. Eleven years ago this amazing boy came into my life and showed me the joy of owning a CH kitty! After a battle with pneumonia and asthma earlier this year, I was not sure we were going to make it to this day, but here we are against all odds! Happy Adoption Day! 💙  Happy gotcha day, Simba!! 👏🏻👏🏻👏🏻👏🏻👏🏻", "Two Cerebellar Hypoplasia Golden Retrievers meet and get to play for the first time.  Watching ch pets flop around like fish and having a blast doing it is the best thing I could ever watch", "Dinner time is ALWAYS fun with our little CH kitties, Oopsie and Daisy!  Holy smokes are they gorgeous! Those names are adorable 🤣 Thank you so much!!! When we adopted them, their names were Coffee and Donut (I guess because of the Siamese colors), but we wanted to pick an appropriate name for them....and we have good senses of humor, so we wanted something more appropriate to a wobbly kitty. We thought of \"Topsy\" and \"Turvy\", too, but liked Oopsie and Daisy better! They are the light of our life! Would not want a regular cat now after these two balls of fun! Oopsie has even gotten quite adept at leaning on the wall and carefully climbing up the stairs! Great job, Oopsie! We have a wobble boy named Richter, so I totally get the draw of finding a themed name 🤣 I love them!!! I have 3 ch kitties myself, only one of them gets around as well as yours, it is the best thing ever to see😊 Thank you, but trust me, the only reason they are doing that well is.....FOOD!!!!! \n\nThey bite it A LOT but have also learned how to lean on walls and walk better that way. So smart!!! Haha. Richter. Like Richter scale? I named mine P'yanchuzhka and he goes absolutely nuts when its food time. He pretty much does backflips to the bowl 😂 Yes! He is severe 💕 A him a hug for me. Haha. I know. All they have to do is hear the plastic bag crumpling and they go nuts. We accidentally left the bag on the floor one day and Daisy sat there and ATE THROUGH the bag of food (which is a thick, TOUGH bag) throughout the night and found her having a binge party with the food!", "I bought stairs so Mr. Flops could get up and down from the bed easier. He loves them! Alas, they are not fool proof.  So great! I love carpeted stairs for wobblers. It gives them a nice sense of independence!", "To bathr or not to bathe. My wife noticed our 6 month old is having trouble cleaning himself and has a little bit of an odor. We are going to start giving him baths. He seems to enjoy bath time. Was curious how many other people have to bathe their kitties and how often. ", "Just had to put down my CH baby, Geddy, for an unrelated health issue. My heart is in tatters, but he has inspired me to help other CH kitties in need. He was not here long, but he has inspired so much good.  I am so sorry for your loss.  That is exactly my CH kitten we have had for 2.5 months, his name is slingshot, slingblade, charlie, wobbles, shakes the kitten (after bobcat goldwaith in shakes the clown).  We are still figuring out how to build a litter box and constucting a food bowl that is going to work.  Thank you for taking care of Geddy and future thanks for the next CH kitty you help.  God bless you and I do hope your pain passes quickly. Thanks. It is funny - I just got off the phone with the vet, and everyone there was rooting for him. The receptionist even told me how when we took him in to get looked at, he just curled up and slept in her lap for her lunch and how all the people at the clinic loved his amazing boldness and character. She was upset to hear we had to put him down.\n\nHow old is shakes the kitty (10 points on the Bobcat Goldwaith reference)? I made sure to get a shallow box, then built a gradual rise under that to get him in the litter box. And make sure you have a good layer of litter down. That could help if he is mild to mild-moderate.that was with a standard box. \nI also found a fountain was ideal for our dude re: drinking he would rest his chin on the lip and go from there. I hope that helps, and thanks for the love. Thank you.  He will be one year in April.  He is on the shy side of moderate, so about a 4 on the shakes scale.  have the low box, trying to figure out how to attach highsides and build the ramp.  A redditor is building a metal feeder that I will line with rubber.  Anything we have or I that have seen cat feeder-wise for CH is just a cat food catapult waiting to happen! It absolutely is, but that is the joy of CH kitties. But yeah, raised is good. I look forward to seeing your progress! That is awful...I am so sorry. Just know that you gave him all the love you had. He will reach out to you in ways you will not expect, I promise. Oh, he got in there deep. We are already looking at adopting another CH kitty in the future. There is something so pure about them. \n\nMy husband and I are both trying to look at it this way: Geddy was not here long. We provided him with all the love and care he could receive. They are fairly sure it was FIP and he was showing both neurological and respiratory symptoms. It was not curable and we know that - but now, it has lit a fire in us to help these beautiful, sweet wobbly cats in the future. Oh I HATE fip. I have fostered a kitten who had it and it is never a good thing :(\n\nI am glad to hear that losing him did not stifle your drive to love these wobblers! There is a pureness to these CH cats. It is their love and determination that really lets them wobble into your heart. \n\nFIP is an unfortunate thing. They say he already had it by the time we took him in. The worst part is that there is really not all that much you can do. We are just glad we gave him a loving space for the last part of his life - my friends rescued him from a nearby trail. As much as I am upset now, I would not trade the experience for the world. \n\nThank you for your support. &lt;3 Every wobbler I come across is so special in their own way. We foster flunkied our wobbler, Richter. His back end was so weak and thin since the people who had him from birth just carried him everywhere and never let him walk by himself. He is much stronger now, but he is still very splooty 🤣 A Good on you for working with him. It is amazing how resilient they are. I love him so much 💕💕💕", "Our happy 8yr old boy Bob!  OMG!!! Is he a boxer mix?!? He looks so much like my boxer who passed. Please give that good boi all the pets and treats from me and my wobbly boi, Noodles! He is a pitty/American bulldog. Lmao noodles! He is so sweet!", "Long Term Injury? Hi all! I am very lucky to have a cat with moderate CH named Bronson. I am worried about when he jumps down from my bed. It is typically not graceful at all- he lands on basically any part of his body except his paws. I am worried that over time it could cause some sort of bone or brain injury. Is this something I should worry about? I mean, no because that is life with a wobbler, and yes because broken bones, chipped teeth, sprains and concussions are a real risk for them. I would advise getting some pet stairs. They will save you both a world of hurt.", "I fashioned Jack-Jack a bedside bassinet out of a suitcase. It is equipped with her toys, her little tablet (my old phone), and a built in heating pad to keep her warm through the night. ❤  Aww, such a cozy little setup! Jack-Jack is a sweetheart 🐱❤️ Thank you! Here is a photo of her from the front!\n\n SO CUTE!! 💕 What does she like to watch on the Tablet? The “TV for Cats” videos on YouTube are awesome!", "Welcome to CerebellarHypoplasia! After searching about reddit for a wobbler community, I thought about creating one. Please feel free to post pictures, stories, or videos of and about your wobbly family. \n\n\nIf you are unsure if your pet has CH, check the wikipedia page in the sidebar and do some general googling and research. CH is generally easy to diagnose, but always consult your veterinarian if you have any questions or concerns!\n\nI would like this sub to be available to everyone who may need advice, hints, tips, and hacks to help make life with wobblers stress-free and fun. If you have any ideas that have worked for you and your wobbler, feel free to share them! \n\n*Example:* \"Having a high-sided litter box allows wobblers to lean up and stable themselves.\"\n\n\nThis subreddit is not restricted to CH cats. Wobbly dogs are also very welcome! This is a brand new community, but I hope that it will grow and teach more people about how special wobblers are :)", "My CH Kitty Soufflé (aptly named since she is sweet but falls easily!) wanted to tell you something and say hello!!  Omg that name is PERFECT Adorable! Love her name. I just got a CH kitty and his name is also a food, Flancoho which is just flan cake. Flan for his wobbliness.  I love cats with food names.", "Re-homing a CH cat My mom is moving into assisted living, and she has a 13 year old CH cat who is basically been just pottying anywhere he likes for years. We clean up after him several times a day. He cannot move to the home with her and I have a fully carpeted apartment that I do not own.\n\nI think he would do fine with someone who was home a lot and had a tiled area to keep him in. But what are my chances to find someone like that? Does anyone know any special needs cat rescues? I live in Ohio but I would drive him anywhere to give him a chance on a good home. \"Well-intentioned\" friends have been suggesting I put him down ☹️ he is otherwise in good health for 13 he is just a wobbly boy!! Search social media for groups, search for special needs specific rescues, etc. There are definitely groups out there that take on cases like this. It is going to take a lot of phone calls and internet time but you can do it! \n\nTabby’s Place in NJ, Catsbury Park in NJ - far away from you, but maybe they know people further west. They are where I would start if it were me. Inbox me if you need help with your search ❤️ Thank you so much. Just the encouragement means a lot to me right now!! 💕 Ugh I know people who put down their old dog because they wanted to go on vacation and didnt want him dying later when they werent home. I miss that little guy. Everyone is so quick to kill old animals that are healthy.", "Flounder, the wobbly foster!  Oh my GOD! I LOVE FLOUNDER! Gorgeous! Absolutely love the name too! Go Flounder! oh my gosh too cuuute! ahhh! &lt;3", "Our CH sisters looking like the ying/yang symbol; it is like they mold one into another ", "Oh nos :/ the straw was scary ", "My ch cat started a major head tilt for no apparent reason? She is turning 2 in May and all of a sudden, she is tilting her head dramatically to the left. I have brought her to the vet and they did all the tests they could that have to do with something that would cause head tilt, but everything came back 100% normal. She has a minor case of cg, so she can still run. Sometimes when she gets going, she will accidentally run into something. Could she have run into something a little too hard?? I am really concerned that we are missing something.", "Hope, A CH Rescue  Beautiful puppers!!! Thanks! She is got heart. I have met Hope when I husband and I stayed at Horse Creek Stable B&amp;B. She is amazing!!! I remember the visit and your blog. They are my parents. She is all grown up now and the queen of the castle...if only in her own mind. So good to hear!", "Pirate bro kitty helps clean lil sis with Cerebellar Hypoplasia. They stopped so I could get this sweet picture. Hope you like it as much as I do! ", "My older boy is thrilled to have babies to take care of🥰 2 severe CH and 1 moderate, I am obsessed with them💖  Ahhh what an adorable trio! 🐱🐱🐱 Thank you🥰 This picture is AMAZING! Thank you!!! They are amazing cats💖", "Advice for gaining weight/muscle? I have a one year old CH kitten who I love immensely despite constantly needing to hold her up while she is in the litter box. But she is very skinny and I am struggling to get her to gain weight. I feel like if she had more muscle strength it may help offset her wobbles, because right now she falls over constantly and really struggles to get back up. She has a healthy appetite and loves the wet food we give her, but i just cannot get her to put on any weight, and seeing her constantly stuck trying to get her feet back under her breaks my heart. Any advice?? My kitty does not have serious CH so he is able to get back up and use a box fine. But I have noticed he seems pretty skinny too compared  to my non ch cat. My non ch cat is kind of chubby but she does not play as much as my ch kitty does. Um wondering if the way they hold themselves causes their muscles and bones to grow differently resulting in a different body shape than we expect. Your kitty should be lean, so somewhat muscular but with no ribs or hip bones visible or easily felt. I think that might change with the way our cats hold themselves. My first thought is you could try physical therapy? But the best way would probably be using water for them to walk in but I mean,  we are  talking about cats here so idk how well that would work. You should also ask your vet to check for parasites if it seems like she is eating well but not gaining weight. Mine (female, about a year, nearly severe) was pretty skinny, but we got her up to a healthy (according to vet) weight by feeding her a can and a half of the big cans of Hills science diet per day. It seems like a lot, but CH cats probably use so much more energy moving around, they need the extra food. I do not know about muscle, but mine has gotten pretty strong just by playing chase with the feather toy and by climbing up on her ottoman Thank you I will try that out, really appreciate it! No problem, best of luck!", "My CH kitten wobbles and falls often so we made him a helmet. Introducing Archer, the cat in the hat!  Good idea! I am sure he will grow stronger so he will not have to wear it all the time. Kittens are already so clumsy!", "Artie lives his bananas! ", "Anyone using the breeze litter box system? It seems like a good option so that the urine drains away quickly. Just unsure how those pellets will work with my guy. Wanted some opinions if they are out there. I have used it in the past with one of my non-CH cats. It worked really well keeping the smell down, but I disliked how often I had to change the urine pads. It ended up being a lot more expensive than regular litter. I have since switched to pine pellets and I like it a lot better. We use pine right now but he is a messy boy. Tracks even the low tracking litter and somehow manages to get clumping litter stuck to him daily.", "Any tips/products for messy eaters? My CH kitten (?, seven months) tends to make a mess when she eats, especially with wet food. I use a silicone bowl on a rubber mat, both placed against a wall so she can lean on something. She throws her food with her mouth as she yanks her head back up to chew, which gets it on the wall, the floor behind her, her fur, etc. It is not a huge problem or anything, but I was wondering what advice you all might have. \n\nThanks in advance! Maybe water down the wet food so it is more a soup than pate? That way she laps it up instead of trying to chew it.\n\nEdit: typo Interesting idea, I will see if she likes it. The only problem I see is her knocking her bowls. She typically spills some water throughout the day, so she will probably also spill some soup The ezpz silicon suction bowl has been life changing for us. It sticks on a hard surface and has a flat mat bottom to help reduce messes. Awesome, I will check it out! Maybe put some sort of rubber non slip stuff under the bowl? Definitely do this. Best purchase I have made. They have a pet version too(under a different brand), where the water and food are on one silicon mat. But you can just get 2 separate ezpz bowls. I actually do this for all my cats as they get a lysine supplement for feline herpes and one has bladder crystals.  Just adopted my first CH cat last week.  He struggles a bit with his dry food but finishes his “soup” every time.  He does have a more mild case so it may be different for your girlie.", "Tips/training to make litter box trips shorter? We have a 1-year-old CH girl, more on the severe side. She can go about her daily functions independently, just with lots of tumbling. The real problem is the litter box. \n\nThrough lots of trial and error, we have settled on an igloo-shaped box (with front door flap removed) and non-clumping clay litter. She relieves herself while lying on her side. We think that the reason she so frequently gets feces on her back paws/legs is because she spends minutes trying to cover it after she drops it, falling all over the place in the process. We wish she would just do her business and wobble out, but she is a cat and cannot understand my pleas. \n\nLately we have been reaching in and taking her out once she is about a minute into her covering ritual, but we are worried that this might scare her into holding it in. It is also imperfect because we can never be sure she is completely finished. \n\nWith all that exposition out of the way, what do you all think of our current tactic, and how could we encourage her to make her trips quicker and easier? Something different that worked for mine is putting soft cloth down in the box rather than litter. Less mess and I wash it like cloth diapers. He only goes #1 in it though and uses a regular box for #2 which your baby might not be able to do. I have had similar issues and have just accepted the  fact that the solution lies in cleaning them. So I use cat wipes for most of the cleaning stuff but on the more severe poop messes I use warm water and dawn dish soap. Now fair warning cats hate bath but luckily due to how hard it is for our kind of cats to move it is not too much of a hassle.  With my ch kitty who is also severe I found that worlds best kitty litter is the best .  It absorbs it super fast, and clumps but does not stick to him. It is also very lightweight so when he attempts to bury his business ( which just consists of him hitting scratching the side of the little box) it naturally covers it up some. I also have had to find the sweet spot in amount of kitty litter. With more than normal litter to assist in his poor attempts.    Natures miracle makes the best wipes too for easy clean up.   And sadly. Just staying on top of cleaning.    I found that he only likes one of the 5 boxes we have and it is a tall bottomed corner litter box , so I just clean that one 2-3 times a day.    \nGood luck ! Yeah we have been using damp paper towels for spot cleaning, but my girlfriend will get in the bath with her when she (the cat) really needs one Thanks, I will check out that litter! I do not have any magical solution unfortunately. My moderate CH senior had to lay down on potty pads to do his business by the end. But World's best and Dr elsey's litter have been my favorites for most cats and both clump and cover well. \n\nYou mentioned that you are worried about her holding her waste in if you keep having to pull her from the box. Is she toy or food motivated? Maybe if you distract her and try to lure her out of the box area with something positive it would be more of a redirection?\n\nThis might sound silly but you could try making your own litterbox? I have do not it by taking a large plastic storage container, and cutting down part of one of the sides (pad the cut edges too). Maybe she would be more inclined to lean on a flat wall than a curved one, and maybe she will not need to cover her poop as much when the smells are not trapped inside? Also then if you do have to pick her up out of the litter box, it would not be as sudden since it is got and open top. All great ideas! I was thinking of making my own box, something with high, flat walls that are narrow enough that she cannot fall over sideways. It would have entrances at both ends so she can enter/leave through different ends and not have to turn around. Any ideas for that kind of construction? All great ideas! I was thinking of making my own box, something with high, flat walls that are narrow enough that she cannot fall over sideways. It would have entrances at both ends so she can enter/leave through different ends and not have to turn around. Any ideas for that kind of construction? I have had a similar problem with my cat in the past as well. She would dig and dig for too long after doing her business, I ended up with the theory that because she was in an enclosed litter box the smell was lingering even though the poo was buried the smell was still there so she was continuing to attempt to hide the smell. Removing the cover of the litter box mostly solved the problem although she still likes to kick a lot of litter out of the box. She doesnt stay in there after she finishes burying her business except sometimes she digs near the business and does not bury it well so its not a complete solution but still a massive improvement. I have had a similar problem with my cat in the past as well. She would dig and dig for too long after doing her business, I ended up with the theory that because she was in an enclosed litter box the smell was lingering even though the poo was buried the smell was still there so she was continuing to attempt to hide the smell. Removing the cover of the litter box mostly solved the problem although she still likes to kick a lot of litter out of the box. She doesnt stay in there after she finishes burying her business except sometimes she digs near the business and does not bury it well so its not a complete solution but still a massive improvement. If you uncover the litter box the smell will dissipate faster after she has completed her business and her instinctual urge to dig will be satisfied more naturally and quickly as soon as the scent of her poo or pee is covered. The enclosed box traps the smell even after they have completely buried their waste and their instinctual urge to cover their smell is more slowly satisfied. Keeping it clean is also helpful, but I would bet you are already on top of that if you are here on reddit asking for advice. If you uncover the litter box the smell will dissipate faster after she has completed her business and her instinctual urge to dig will be satisfied more naturally and quickly as soon as the scent of her poo or pee is covered. The enclosed box traps the smell even after they have completely buried their waste and their instinctual urge to cover their smell is more slowly satisfied. Keeping it clean is also helpful, but I would bet you are already on top of that if you are here on reddit asking for advice. a All great ideas! I was thinking of making my own box, something with high, flat walls that are narrow enough that she cannot fall over sideways. It would have entrances at both ends so she can enter/leave through different ends and not have to turn around. Any ideas for that kind of construction? Hmmm.... This would be easiest to draw but imagine were looking at a storage bin and we label the sides a-d starting at the top and  going clockwise. I was thinking you could cut a hole on side b, and side c (but near the corner of c and d). Or cut the shortest sides off completely if it is sturdy enough. Not sure if you would be able to find a narrow enough bin though. Sorry I do not have any better idea of how to do that, but great idea about 2 points of entry though!  We have been contemplating something that sounds like that, but we also run into the problem of finding one narrow enough. Maybe the could attach something solid on the long inner sides to narrow it further Yeah that is probably the best thing you could really do in terms of keeping kitty clean. It does not really fix the problem of like cat getting poop on the floor, but I also have a kind of solution. So idk how much you watch your cat use the bathroom, but I have this pretty big rubber matt under my cats litterbox. So what I do whenever Death Lord, my cat, uses it as soon as she comes out onto the rubber matt I lift her up to inspect for poop, I am the poop inspector. If she is clean I do not deploy the wipes if she is had a particularly wicked poop I can then get her to either the sink or wipes since I am already holding her. Now idk if the job of poop inspector sounds like the solution for you but fair warning, you might accidently get poop on yourself, and yes I have accidently gotten poop on myself. Also I just want to say that its super mega cute that your gf bathes with your cat that is wholesome as fuck. I would not recommend interrupting kitty's litter box habits. My CHer suffers from chronic idiopathic FLUTD, and letting him be totally comfortable in the box is vital.  I would focus more on a litter system that will help her stay clean while allowing her to do her thing.\n\nI have seen people recommend putting something in the middle of the box that they can lean on, so she can stand while doing her business. I have not tried it myself, but it might be worth a shot?", "Our CH sisters looking like the ying/yang symbol; it is like they mold one into another  A I love them! They are so pretty💖 Thank you!", "Dr Leo spaceman vs sharpie. One of his favourite toys to play with is just a pen. He is the best wobbly kitty  Nice to see a familiar face! I am Weeble and Friends from insta! I am new here! Hi!!   Good to see you", "He was so proud to pee in his big brothers litter box, until he fell on his face🤣  He just wanted to show off his gymnastics skills 🐱❤️ 10s across the board! Aw butters. You did good. 😹 Such a good job until the ending...sweet little buddy!!", "My tiny dancer  Oh my God 😍😍😍😍😍 Thank you so much for taking care of this angel 🖤 Oh my!! My heart swells.", "me watching your yoga videos on instagram ", "The Return of Flounder ", "This is how my VERY severe ch boy watches birds when he cannot safely be in a window. YouTube bird watching is his new favorite hobby😊  Oh my gosh hes a real life baby He definitely is, he is my forever newborn baby💖 Oh my gosh he is gorgeous and this is the sweetest thing! Please pass on pets and kisses ❤️ Of course I will💖 Thank you! Oh my goodness! What a good idea! Plus, I love the little toys that you have hanging there for him. I might just steal your idea! 😇 I hope your baby loves it as much as mine does💖 We adopted two Siamese sisters with CH. I am sure that BOTH will love it! Yay! It is great that you adopted both of them😊 Last month I adopted a moderate CH boy and his severe sister. Fredo (my boy in the video) is so happy being a big brother. I think it is really good for them to have siblings 💖💖💖 Oh, for sure! We went to the Humane Society on a whim, just to look at dogs! Well, \"somehow\" we ended up in the cat area of the Humane Society. I swore that I did not want or even like cats, because I am a big dog person. But, the moment we saw those two wobbly kitties we were enthralled! Because of their condition, and the fact that they are sisters, the Humane Society required that they BOTH would have to go to the same home. So, now we were not even going to get one, but TWO animals! While it was a bit of a shock, we were all in. And, let me tell you, the fact that they have each other is the sweetest and craziest thing. They fight and play and chase each other around, but then you will find them snuggled up one right into the other one and you know that they really like each other, too. We named them Oopsie and Daisy 😆 and Oopsie will cry out for her sister if she cannot find her and goes into another room. These babies STOLE MY HEART.💗💗 I love that!!! They were obviously meant to be your babies💖 I was the same way, I was always a dog person, until I got my first CH cat. I have definitely become a crazy cat lady, only special needs cats though. They definitely have my heart!!! I love the names you chose, very cute💖💖💖 Feel free to let me know if you have any questions about taking care of them, I have learned a lot about them and I have gotten the best advice from other CH parents😊 That would be great and much appreciated. I signed up for a CH Facebook group that had a fantastic litter box idea that we used and it turned out great. Wish I knew how to post a photo right here to show you. I have learned so much from a group there! I do not know how to post a picture in the comments either but I would love to see them😊 The litter box can be a tricky place for the CH cats, I am glad you have found something that works for them. One important thing I have learned is to make sure I am not using a clay based litter, many of the clumping litters are. If they lay down to go, or fall on their face, they can accidentally swallow some. The clay cannot be digested and turns into a dangerous clay ball in their stomachs. I had never thought about anything like that, there are so many things I did not think about at first. Lol I learn new things all the time about these amazing babies💖 I was able to find a link that includes the option that we went for: \n\nOurs is the one (I believe that it is the second one shown) where you buy a LARGE Rubbermaid storage container and took a rotating saw to one side. We quickly ended up modifying to add a bigger lip to the entrance as Oopsie would lay down inside and her pee would spray out the side because the lip was so low. I took a thick cardboard section that I measured and cut to add just a little more height at the bottom without compromising a low edge for them to climb in. After cutting it, I wrapped it several times in duck tape to make it waterproof and then used more duck tape strips to tape I from the inside. Nice! I might end up doing that for the kittens when they are full grown. Right now they use the one shown in the link that is a triangle box, it is sides are high enough for them to lean on, for now at least. Lol. The little girl is more severe, but she is so careful she never gets messy, her brother, Ollie, spends so much time trying to dig on the sides to cover it that sometimes he falls on it. Lol\n\nFredo, my very severe boy, uses a regular litter box because I have to take him to it and lay him in it anyway. I am just happy he is learned to go when I put him in the box!!!\n\nAlso, with the kittens in the triangle box, I rolled up a towel in front of it to help Basil get in. It is amazing how well she does without actually walking at all. She is trying though and I think she might one day😊", "Digit (2 yrs old) is from the Humane Society. She used to hardly be able to walk well, sit, play, or climb. She now can \"run\" (more like bounce) to her destination! She has come so far with learning how to function! She is very well trained, and listens like a dog. ", "When floppy kitters wants to play fetch, hilarity ensues. ", "CH Foster gone to his Furever home ", "Maybe unrelated to CH (?) But his poopies are a bit off P'yan has been doing really well the few mo ths weve had him but suddenly he started pooping out side of the box. I assumed it was because I didnt clean it (low key depression is ruining how good a mom i am) but my other non CH cat will still go in the box regardless. I had literally just fineshed cleaning one of the boxes out and P'yan comes to pee in it and then right after he goes into a spot I noticed he had pooped earlier today and poops again. On the floor. Even though the box was relativly clean (cant switch out litter because covid). His poo is also strange to me.. Its almost slimey and lighter in color than I asume it should be. Its definitely a red flag poop to me but idk when we will be able to see a vet with all these quarenteens... I would check with your vet (maybe a phone call?) about the consistency question, but I have a possible answer about pooping outside the box.  My CH kitty sometimes falls over when she is trying to use the box.  I have even seen her fall out of the box.  Because of this we often see her poops just outside the box (basically wherever she has landed when she tips over). Im asking my bf if we can make a vet visit but we dont even have a vet anymore and are trying to find an affordable one. But that is definitely the 1st thing I thought to do so its the plan. Was just hoping for insight. I am not sure if its problems using the box, since he normally uses it just fine but he does tip over a lot. Im using boxes as make shift hoods for the boxes so he has something to lean on (and because cats are stinky lol). He goes out of his way to poop in a corner 😔 This could be a sign that he is not feeling well, sometimes cats will avoid the box if it hurts when they go and look for a less painful spot. Mine did this before being diagnosed with bladder crystals and it complete resolved once he felt better.  Definitely worth a call to a vet.  Some vets will work with you in discounts or if there is a vet school nearby that can sometimes be an affordable option. He actually stopped doing it recently. We made some changes to his litter box and bought a bigger one Glad to here it is improving!", "my wobbly boys. they make me happy everyday and have so much personality. i will be building my first kitty wheelchair soon for my little one!  How exciting! Make sure to update us on the wheelchair! Such long legs! Beautiful kitty. They are the best! I have 3 wobbly boiis myself.  So sweet and silly", "Advice on litter box for severe CH kitten Hi all! I just adopted Baron von Bean. I call him Baron or Barry.\n\n\n\nI just brought him home. He has severe CH or a similar congenital mobility disorder; the vet was not sure. His back legs are barely functional. He can get around, but he falls over a lot, and it takes him a while to get from A to B. The nice thing is that because he cannot move fast, he cannot bonk his head and run into it things at high speed like some CH cats. \n\nAlthough I had a mild CHer for years, this is obviously a whole new ball game. So I will be happy to tap into your vast expertise on how to care for a severe CH kitty. \n\nMy primary concern, of course, is the litter box. They told me I may have to use potty pads unless I can get some kind of very flat, wide litter box, which I do not have yet. I am trying to avoid the \"diaper solution\" if possible. And of course I want to get him invested in using a litter box — any kind — as early as possible. That way, as he gets older and better able to get into the box, he will already have a habit of preferring litter. \n\nAny tips and links you can impart would be greatly appreciated. 😻 I am committed to doing whatever it takes, but obviously, I would prefer not to destroy my carpet in the process! I live in a small studio apartment, so I do not have a lot of area to work with, and I would really like to solve the \"potty problem\" fast and effectively. Also, if you know of any other Facebook, Reddit, or web groups that might help, let me know! Thank you for adopting this baby💖 I have had litter box issues with my cats too. I found a litter box on chewy, but it was a couple years ago. It has a low and slanted entrance, it also has extra high sides. It helps my severe girl because she can get in by herself and lean on the side to stand up while she goes. \n\nMy VERY severe boy cannot get around at all by himself, he used to just pee wherever he was. I do not want a pee smelling house. Lol. I got him used to peeing in the box by laying him in there, on his side, any time I thought he might need to go. \n\nIt took a while, I would play games on my phone and stuff waiting for him to pee, and I would pick him up and give him treats as soon as he did go. Eventually he learned to pee in there and knows that is what it is for. He gets so excited with himself and it is adorable.\n\nDepending on your kittens abilities, maybe something like that would work? I do not know how to ad a picture or video in the comments, but my cats have an Instagram page and I had put a video of how he uses the litter box on there. It was a while ago, but it is still on there. If you wanted to look for it, it is \n\nI know it was around Christmas time when I had posted it, white cat with black shirt on. Yes, these cats have definitely turned me into a crazy cat lady😊 Thanks for all that info, and thank you so much adopting your special kitties. I will check out your Instagram videos. It is encouraging that you were able to train your boy to use the box that way. Who says says cats cannot be trained! So far Baron has gone in his little carrier; I put some litter in there as a makeshift box until I could make one, which I have done: \n\n That one you made is great! My little girl is only 6 1/2 months old, by the time she is full grown she might need extra high sides like that. I will definitely keep in mind what you made! \nI adopted her brother with her, he is moderate so he walks around well in his cute wobbly way. Unfortunately he is also the one who makes the most mess with the litter box, he spends so much time in there trying to (unsuccessfully) bury his mess, that he ends up falling in it. My boy also sometimes falls in his, too. But I am just ecstatic that he uses it at all and I do not have to put diapers on him. Exactly!!! That is a very good thing! Much easier to clean up where they fell in some poo, than keeping diapers on them! You can also get a 'jumbo' Nature's Miracle disposable litter box and cut an entryway in the side with a box cutter, leaving only about a 1/2 inch lip. They do sometimes kick litter out and track it, but it makes it very easy to get in and out. Yeah, my boy often kicks litter out and sometimes even pees or poops a little outside of the box, so I keep a cardboard \"welcome mat\" at the entrance. That way it stays off the carpet.", "Any advice for my lil guy still struggles walking.  It will just take time, they will get stronger and learn to adapt as they get older. I recommend keeping food/water dishes against a wall (so they can lean on it while they eat) and getting a litter box that is enclosed/has high walls. A heavy food dish will help your cat not push it around as much. Get a feather toy or something else that you can pull around, chasing the toy will help them learn and get stronger. You can use pool noodles to pad furniture like table legs, just cut them vertically so you can place them around the leg and use a zip tie to secure it. Best of luck!", "Does anyone else carry there wobbly kitty in a sling? Just made one out of a bed sheet for our Flounder ", "CH friendly food bowl? We have got a wobbly one who always seemed to step on the lip of her dry food bowl, flipping the bowl and sending kibble everywhere. We tried a \"spill proof\" bowl that has a shape like this: /\\_/\\  \nShe cannot flip it any more, But the inside of the bowl has sloped walls like a half pipe, so when she accidentally kicks it, the food uses the walls as a ramp and it still goes flying. Any suggestions? It is been 3 years for me. They will always find a way to make an absolutely horrendous mess She is around 8 now, she was fine for the longest time, then suddenly decided to yeet her food across the room. She is always been a troublemaker so I am not terribly surprised Check out Neater feeder on amazon. I have one and it works great for my CH boy I made a raised food bowl using a full can of cat food as the base for weight, (I will make a post bc I cannot describe it) my cat still occasionally flips it but it is less likely. I also put it right against the wall, which helps too. Here is what I made, hope this helps.  We use a raised food bowl. She struggled to use it only the first two or three times as it meant standing differently from how she was used to, but picked it up very quickly. Have you tried the toddler bowls that have suction cups on the bottom? Nope, I will look into them though! Thanks ", "Best litter tray for a wobbly cat? I am looking for what kind of litter trays are best for cats with CH. I would also love any recommendations for giving them an easier time in general, thanks! My cat really likes this ( and uses it no problem.\n\nAs for other advice: \n\n( are your friend! \n\nFloppy cat is still a cat, so make sure there is some sort of soft landing for when they fall off the window sill.\n\nIn my experience, regular cat trees are not great for wobblers unless they are buttressed for extra stability.  And make sure there is a soft landing for when they fall off.  I ended up building a cat spot by smushing a cat tree into a corner, adapting some cube storage shelves for cat use and pressing them into one side, and getting a thick dog bed for the floor on the remaining side.  When I figure out how to upload a picture I will show it to you. I use plastic storage bins without the lid and cut out a square opening in the side. My wobbly girl is able to lean against the high sides to keep her balance when she goes to the bathroom this is the answer I have got a tiny ch babe right now and the best thing we have used so far is a cardboard box cut to about 5” tall, with a 7ish inch long cutout that goes only as high as the litter is deep. So that is her entry, and it is about 1.5” tall. We will probably go the storage tub route when she gets bigger. I put a step stool in front of a storage bin for the CH cat to get into, since I have 3 normal cats that usually could just hop right in", "Litter box help Seeking help with litter box usage.\n\nI have had my kitty Alice for a few months now and there is been some medical issues to address which are now all seemingly taken care of. The problem is she still will not use the litter box. She did have a UTI (and I am honestly not sure how long, the woman I rescued her from had 0 money for medical care and she had no medical history prior to the year this woman had her) but that is all cleared up, as are the ear infection and teeth issues. As far as the vet can tell there is no medical reason for it. Her CH is not a super severe case. She almost walks as if she had socks on her back feet. Just a really wide legged stance.\n\nI have a litter robot for my other two cats but I also kept a wide, lower sided litter box that I know she can get into. But she does not even try. She just goes straight for the carpet. And while of course I am not thrilled either, I can tell my boyfriend is really starting to lose patience with the situation. Understandably so, no one wants their room to smell like cat pee all the time. And I have a poor sense of smell so half the time I do not even know she is done it or if I have cleaned it good enough.\n\nAny suggestions for getting a wobbly kitty to use her litter box instead of the carpet? Better litter suggestions? Better box? I will try anything at this point. I am willing to go the diaper route if I have to but for her sake I would rather not. Maybe try a different cat litter. Some are very fussy to the feel/texture of certain types of cat litter on their feet. My cat has the same issue, and I am using a senior cat pan. It is made specifically for senior cats so it has low walls and an entrance lip that is even lower. A box surrounding it so he kicks less litter out and has something to lean on. But  because of his wobble he struggles just to squat and stay balanced (his case is very mild and walks normally, can even use a cat tree almost as good as my normal cat). As soon as he loses balance, he just thinks he cant do it there and goes on the floor. Sometimes if cats have an issue with going, (whether that is physically tripping, or having a medical issue like constipation) they attribute it to the box and wont go. \n\nI placed down puppy pads near the box and whenever he decides to not use the box, he goes straight to the puppy pad. Idk how, but he just knows to always go on the puppy pad if there is one available. Same. Puppy pee pads next to the litter box Helped a ton, even when she did not want to get all the way in the litter box she still walked next to it.\n\nI tried everything — attractant, lower litter box sides, dif litter. Other thing that helped was physically putting her in the litter box after every meal when she would normally want to go, and try to retrain her to go over there.\n\nGood luck! I had not thought of the puppy pads, that is a great idea thank you! I did just order a senior cat litter box too so hopefully that helps too.\n\nI will definitely be trying both out. I had not even though of puppy pew pads, that is such a good idea. Thanks!\n\nI will also try putting her in after she eats/drinks. Hopefully that helps.", "Revan eating dinner is an extreme sport.  Watching our CH girl eating her wet food is the best part of any day. My kitty eats just like this, too!  Just out of curiosity… my kitty, I have come to find out, was born without a gallbladder.  Have you heard of any other CH kitty with this condition? I have not! Revan has his first vet checkup tomorrow so I will ask about it. We are also pretty sure he is deaf but I do not think there is any correlation. Our kitty is deaf as well."]