["Insurance denied Sprycel, says have to try Gleevec first Title says it all. My wife’s insurance denied the doctors recommended drug (Sprycel). Insurance says we are only eligible for Sprycel if we prove adverse effects or non-effectiveness of Gleevec. Very frustrating. They said a two week trial of Gleevec would be sufficient. Anyone had this issue? I had the exact same thing happen. I got my Dr to write a note justifying why I was on Sprycel along with the risk if I were to switch to a 1st gen drug. I had to go back-and-forth with them over a few weeks, so if you are getting your initial Rx, you might have to play their game so that you can at least have something. Same thing happened to me. My dr had to appeal to the insurance. I think they did a peer to peer. It was my initial rx, so it did take longer to get the meds. I got a couple months worth of 100mg", "Tasigna Doesnt Seem to work Hey maybe some of you can help me! \n\n\nabout me: 24 years old, Male, Diagnosed With 84% BCR ABL 9 Months ago.\n\nMaybe some of you can help me.\n\nI was Diagnosed 9 Months ago put on 600mg Tasigna and after this my BCR-ABL evolved Like this:\n\n3 Months: 1.6\n\n6 Months: 0.8\n\n9 Months(Yesterday): 1.7\n\n \n\nBecause of this counts i have a few quetions:\n\nThe increase seems pretty high, my Doc assumed i didnt Took all my Tasigna pills, which isnt the Case because i never forget one. Maybe i Took Them Like 20 Minutes later then normal Here and there.\n\nMy doctor wants to try another 6 weeks before we Switch to a different drug.\n\n \n\nSo my Main questions are:\n\nIs that a typical Case of a Mutation?\n\nIf Nilotinib Doesnt do the Job, would it make sense to do a Mutation Analysis, because Nilotinib works against Most Mutations, the Other TKIs dont?\n\n \n\nI am very scared of a Transplantation and hoped i can keep my CML under control With TKIs. Maybe some of you have experienced similar Change in bloodwork, or Heard it from Others.  I do not have any answers for you, as I am relatively new to all this (diagnosed January this year), but I wish you all the best and hope your numbers come back down quickly. Thanks Sarah, i Wish the Same Thing for you! When I was diagnosed (2010) my doctor told me there was 3 prescriptions we would try before transplant. Tasigna was the first one I tried and it worked for me. Gleevac would have been the second option and I now honestly cannot remember the third. I always said I had 3 strikes before I was out. I was just lucky enough to hit a home run on my first swing. \nTransplantation is a very scary thought. I would talk to your doctor about other prescription options. It is ok to be scared. But keep your head up. Do not let this beat you. If you need support or have any questions feel free to DM. You had a good response to Tasigna. 84% is a high starting point and the drop after 3 months is definitely what you want to see. The ups and downs are pretty normal, it is a rollercoaster for many of us. Some get lucky and see a sharp drop and it never spikes again, but everybody handles the TKIs differently and some of us get levels that bounce around a bit. The big red flag of a mutation is if it trends upwards over multiple tests. There is a mutation test they will do probably on your next draw.\n\nTry not to stress! If you do have a mutation you have other drugs to switch to. Imatinib (Gleevac) is a first gen drug so they will likely try Dasatinin (Sprycel) or Bosutinib (Bosulif). Both are very good and actually have less side effect concerns than Nilotinib (Tasigna). And even if you try both of those and they do not work, there are clinical trials going on for Ponatinib (Iclusig) and ABL001. You have lots of options, but make sure you are seeing a CML specialist and not just your local oncologist.\n\nI hope that gives you some comfort. The fact that you responded to the TKI at all means you have options. Reach out if you have any questions or want to talk! I am managing 6 years now... Got it when i was 32 years old... \n\nFirst started off with Gleevec, but with these pills i have had a lot of side-effects that were not pleasant... Also, the test-scores were not that good, like yours... Low, but not enough.\n\nAfter two years i got the opportunity to switch to Sprycel (Dasatinib) and this got my scores waaay down.. Around 0.001. No side-effects! I also could choose Nilotinib, but my current medication let us me take de pills after dinner, as i was used to with gleevec. Hence my descision for Sprycel.\n\nI hope you can switch meds, it was a tremendous help for me.\n\nStay strong, you can get this under control!  \nFeel free to message me. I have had months where its increased, so I would not worry per se unless it showed consistent increase over 6-9 months. But just personal opinion, talk to your doctor about it. From what I got it is not a science (how it goes up and down) that is completely understood, and so there are some things like that that happen. I am in a very similar boat as you in age and number progression. Know you are not alone. If you can keep us updated on your progress, I would greatly appreciate it. There is also ponatinib to try as well (I think that one covers all mutations as well). I also had a very good experience with dasatinib, just posted the full story on this subreddit. Sprycel is nice because it is only once per day and you can take it with food, making life very easy. I had no side effects.", "10+ years after diagnostic of chronic myeloid leukemia - cured (31M) \nHello all,\n\nHere is a quick and happy story for everybody who is dealing with CML.\n\nI was diagnosed as a healthy 21 yo with the following symptoms: bone pain, tiredness (&lt;7g/dL hemoglobin), huge spleen (22cm), and white blood cells through the roof (&gt;400k).\n\nI had the typical chronic myeloid leukemia with BCR-ABL mutation, with intermediate Sokal score (not very relevant wrt modern treatments performance), and lowish blast percentage (5 or 6% I believe).\n\nI was put on hydroxyurea for a few weeks before being treated with dasatinib (sprycel) 100 mg / day. I also had EPO shots for the first few months to prop up my red cells and hemoglobin.\n\nI took dasatinib for 8+ years. I tolerated the drug very well and had absolutely no side effect besides headaches the first couple weeks.\n\nI reached cytologic response quickly, but it took a few years for me to reach MMR (major molecular response). My BCR-ABL levels kept decreasing for a few years, then stayed stable at a very low level (deep response, about 4.5 logs). They are still at this level today.\n\nWith the agreement of my hematologist, I attempted to stop the treatment after ~8.5 years. According to studies, you have better chances of successful treatment cessation after at least 8 years of treatment, with about 50% success. Note that complete molecular response is better but not required for treatment cessation. I was monitored very closely and my BCR-ABL levels stayed the same, with no relapse. It has been more than two years and I have not relapsed, so I am considered cured even though I must still be monitored. In the unlikely event that the leukemia comes back, dasatinib should still work on me.\n\n-\n\nTo everyone being diagnosed, what I can tell you is that this disease is extremely treatable with modern treatments, which are also very well tolerated and nothing like a typical chemotherapy. You will very likely live a long an healthy life. Take your drug everyday without fail (I probably missed it a handful of times in 8 years). The drug will keep your disease under control, but it takes a lot of years for the leukemia stem cells to lose their potency enough so that you can try to stop treatment. The drug does not kill the stem cells, but only prevents them from multiplying.\n\nIt was a tough experience when I got diagnosed, but as soon as I saw the success rates of the drugs I got very hopeful quickly. First two years were the worst with the waiting for blood test results, and bone marrow biopsies which suck.\n\nI am writing this because it has been 10 years, and because my wife just has been diagnosed with Hodgkin lymphoma, which sucks but it is also quite treatable so we are hopeful. I thought it was a good time to send good vibes in the internet with my happy-ending leukemia story, and hope to write another one in 10 years for my wife.\n\nGood luck to all, do not hesitate to ask me questions. Good report. Thanks.\n\nAfter 7+ years, in July I experienced serious dasatinib side effects that led me to a week in the hospital, a thoracentesis and a pericardiocentesis. They took me off dasatinib immediately. Yesterday I got the call from my doctor re the latest BCR-ABL indicating my leukemia is undetectable (as it has been for quite a while).\n\nShe noted, as you did, that the success rate of going off the meds in such cases is about 50% so we will see. All other meds, while effective, are a concern for me because they also may lead to pleural effusions and pericardial effusions. Thank you I  think I really needed this message today. How long did it take for you to get diagnosed?? And when did they start you on hydroxyurea? I have been diagnosed just this week witha WBC count 500+ but I have not received any prescription for anything yet. I was wondering why they would diagnose me but not prescribe me anything to control my wbc count..weird &gt;pleural effusions and pericardial effusions.\n\nYes indeed, this is *the* shitty possible side effect of sprycel, which can come at any point during treatment, even after years. \n\nHope you will be in the good half and will be able to stay off drugs. After 7 years and with a complete response still, you have very good chances.\n\nI believe they can also restart sprycel at lower dose in case of relapse after treatment cessation or after side effects, like 20 mg / day for example, but I am not up to date with the latest research on CML. When dasatinib was first tested they were giving 70 mg twice per day and there were lots of pleural effusions, but after they realized that lower doses work as well and cause less side effects. I do not remember the details exactly, but it took a month after the first blood test to have me started on sprycel (dasatinib). \n\nThe wbc count is not really a problem in itself, and it is not surprising that they are not in a big rush to have you started on drugs.\n\nIIRC, Hydroxyurea is used to clean the blood and reduce the number of white cells to acceptable levels, and only then you will be in a good state for starting tyrosine kinase inhibitors (sprycel, gleevec, tasigna etc...).\n\nThe only \"risk\" at this stage is that you can break down the white cells too fast which can be dangerous because of too much cell waste in the blood, but it is quite rare and hydroxyurea should take a few weeks to get this number down slowly, while your doctor is monitoring you.\n\nDid you have a complete diagnostic with bone marrow biopsy and confirmation of a typical BCR-ABL Philadelphie+ CML ? I have heard of cases in which Sprycel was restarted at lower doses or even taken intermittently. Thank you for sharing your positive story! Congratulations!! I had 200-300 wbc and my spleen had swelled up, which I felt (like a balloon type sensation) and went in and got diagnosed etc. Personally that makes me feel like it is kind of weird but I guess it is different from person to person (and who knows how long my wbc count was high for anyways I guess). I am so happy for you. I am on year 3 of treatment. Currently on 20mg of sprycel per day because I had bad side effects on any higher doses. I have tried other medications but my body would not tolerate them. \nAny continual muscle or joint pain after stopping treatment? Im wondering what pains are here to stay and what are from medications. Thank you. \n\n&gt; Any continual muscle or joint pain after stopping treatment? Im wondering what pains are here to stay and what are from medications.\n\nI actually did not have muscle or joint pain during treatment, or not enough to be significant. I am pretty sure it will be reversible though. My WBC was 325k when I first went to the hospital. Hematologist prescribed me hydroxy urea  and allopurinol right away, and sent me home. The allopurinol helps to flush the cell waste is how I understand it, along with drinking lots of water. \n\nI am assuming you have met with a hematologist/oncologist? I am far from an expert but I think urea is the standard practice initially. WBC needs to be lowered to prevent other complications. In my case I have retinal hemorrhages caused by sludgy blood being pumped through the miniscule blood vessels in my eye. \n\nHem suspected right away that I had CML based on my WBC count alone. But it takes a bone marrow biopsy to confirm. Have you done one yet? It took me 3 weeks from my first visit to be officially diagnosed, though my hematologist suspected all along that it was CML. Thanks for sharing your story, and all the best to your wife. It is great that she has someone like you in her corner to navigate these times. \n\n I am 33 and my journey officially begins today, with 100mg dasatinib. Ph+ confirmed yesterday. Right now my wbc is at 51.0 and my platelets are at 571 I am still waiting on Sprycel they have it being delivered to my doorstep which I think is dumb . Ahh ok, maybe at 51k your doc did not think the hydroxy urea was necessary?\n\nWhat country are you in? I am in Canada.  The pharmaceutical company is giving me a one month bridging plan while I wait for approval through insurance., and they said it would be delivered to my house. Once I have approval it will be stocked at my local pharmacy.\n\nKind of a pain,  Maybe they will not need to deliver it every time for you in the future. I am in the USA sadly. I am sure you heard how things can get here....Its still fairly early I just got the diagnosis and so much is going on with it at once \nTbh this doctor feels like I am the first person he is dealt with having this ..especially so young I just turned 27. Thank you ! You will do very well, I am sure of it. My father(50y) was just diagnosed with CML, chronic phase(WBC 183k, Ph+, BCR ABL 100%, 3% blasts). He started taking Imatinib 400mg(Glivec) from yesterday after a week on hydroxyurea and allupurinol.\nI have observed no side effects till now.\nEverybody is shocked because my father was very healthy and fit with no prior medical condition whatsoever.\nCan you give any advice on how to approach, diet tips or any other things to keep in mind , because you have prior experience?\nThanks in advance To be honest, at 50 your likelyhood to get a cancer is quite far from zero. This leukemia comes at random, there is no risk factors involved other than bad luck, and age.\n\nRegarding diet and tips, my main one would be to get into the mindset that this disease will have to be treated like a chronic disease, more so than like a cancer.\n\nHe will just have to take a pill everyday, the disease will be under control, side effects will be limited, and his life will keep going on with almost no change. Expect the first year to be a bit stressful with the frequent testing to see how good gleevec works to take control of the disease, and to get used to the treatment. After this first 1 or 2 years, life will really be back to normal.  \n\nThe words \"leukemia\" and \"cancer\" are scary, but with these modern treatments it is really not as bad as it sounds. Just a chronic disease ;) If you are not regularly seeing a hematologist/oncologist early in your diagnosis then you really should. \n\nI know it is tough, I see my doctor for probably five to ten  minutes every week for the last three weeks since I was doagnosed. So many questions and so little time. Just hang in there, and know that in the future you will be back to living a normal life like so many others with this disease. \n\nI am only a few years older than you. CML does not seem to discriminate by age. Thanks for your advise. I hope my father responds to the treatment.\nBest wishes to you as well. I hope so too. It is by far the most likely outcome.\n\nOn a last positive note, if the Glivec does not work well enough or if the leukemia becomes resistant to it, there are lots of other options which are actually more potent than Glivec and work very well too, and it is the same type of drug with little side effects.\n\nAlso, the fact that your father is Ph+ and only 3% blast is good, the first thing means that the Glivec should work and second means it is early / chronic stage, which has almost no impact on life expectancy. Yeah, the doctor also told us that we have hit a lottery in the sense that we were able to detect this accident in a very early stage, thanks to a full body checkup.The real challenge will be  social, because here in India people still associate all cancerous diseases with genetics and are not aware that not all of these happen because it runs in the family, but because of spontaneous unknown reasons.\nNevermind. Thanks again Do you pay for sprycell I have a whole bunch of spycell they swicth me to someting else i had been stock pilling and now itdont work im immune to the med Thank you, but I stopped taking sprycel 2.5 years ago, do not need it anymore. K sorry to bother you How is fertility? Are you able to have kids after chemotherapy is finished? Fertility is not affected. These treatments are not chemo but are \"targeted therapy\", which is less damaging and should not affect fertility. For women, carrying a baby should not be done under treatment I believe, at least for Sprycel, but for men I know that some babies have been made while under treatment. About bone marrow biopsies… how often do you have to have those?  I was diagnosed less than a month ago, so just curious. I do not have them anymore. \n\nIn the beginning, I had a few of them: one at diagnostic, 3 months 6 months 1 year, something like that. \n\nThen, the main control they do is a special type of blood test where they mesure the number of cancerous markers vs normal markers, because there are so few cancer cells that this exam would show nothing.", "When do side effects show up for TKI ? My wife started Gleevec 4 days ago. She has no side effects currently other than her stomach feeing queasy. Are side effects immediate or do they appear at a later date? Either. Some can show up months later and some right away. My mom has been hospitalized for pleural effusiona that showed up months later, had skin rashes show up weeks later, and have GI issues immediately. Been on gleevec for almost 5 years without any problems. Gleevec warrior here. Going 6+ years now. I got the queezy stomach thing too, showed up almost immediately. I also had aches in my joints in the beginning, but I have gotten used to it and now I hardly notice it. Medical weed definitely helps with the nausea.. CML patient on Gleevec for \\~4 years now, previous Sprycel when diagnosed in 2014.  Cramping is the biggest quality of life metric I try to manage with supplements and water intake.   Some days are better than others.  My last BCR put my at .005 where previous test at me at .000, my access to engaged care providers in Hawai’i is limited at the moment so I am watching this to determine if my body is not responding to treatment.\n\nMy biggest concern at the moment is my ability to receive medications in the event our infrastructure fails.   \n\nMy Stanford Oncologist mentioned they are looking at asciminib (new) and how it could be used in combination with other treatments to eventually stop all treatments.  But it is not an active study now. \n\nI recommend setting up google alerts that email you when CML or relevant information is mentioned.  I have one setup for CML and CRISPR and mRNA. \n\nFrom what I have read, TKI medications can increase cancer risk for some people.  Its worth understanding as you plan your treatment options. Thanks for comments everyone. I appreciate it. Minor side effects started after a few days. I ended up having more and more creep up over the weeks and months. Hope she doesnt get anything more than what she is experiencing. Started a couple of days later for me. Gleevec gave me an ongoing queasy stomach but the constant nausea is what gets me most. I had sprycel for 8 years, no side effects (31M). These drugs are well tolerated, especially for younger people. I just posted my story in this subreddit. Hoping for the best for your wife on Gleevec, these drugs work very well.", "BOOK┨ONLINE \"I Served the King of England by Bohumil Hrabal\" book look review finder ebook italian ipad ios ", "Sad that this is even needed ", "CML journey Hello! I am an 18 year old with CML and was diagnosed about 3 months ago. My life has been flipped upside down but it is starting to get better. I just wanted to post on here too hopefully make connections with other people that also know what it is like to have this. Feel free to reach out at any time! Welcome to the group. I am late 30s and was diagnosed 3-4 years ago. Hope your journey goes smoother than a lot of the people on here. Luckily it does not seem like a death sentence anymore. Thank you, sorry to hear. Yea I am really glad for that haha 30ish, was diagnosed about 2 years ago. Ph+ 50’s. Diagnosed 20 years ago. Feeling great. So many options for TKI’s now. \nWhat med are you taking?\nHow did you feel? Sorry to hear that. I also have the Philadelphia chromosome Right now I am taking sprycel and only experience some side effects like an upset stomach every once in a while but besides that I feel fine. Thankfully I have been able to return to working out and playing soccer. Oh you are so lucky not feeling many dude effects. I get them ALL 😭😭\n\nWelcome to the fam! Haha thank you for the welcome! Sorry to hear about the side effects, hopefully they get better eventually. I am about to be 35, just diagnosed, going to the oncologist next week hopefully. Your comment really made me feel better thank you.", "Study for patients who traveled to any other country for cancer treatment Hey,\n\nI am looking to have a discussion with any cancer survivors or their care givers who have traveled to another country from Thailand/Indonesia/Malaysia/Philippines/Vietnam for Leukemia or Lymphoma treatment.\nIt will be a paid discussion (100 USD) as it is for a research study.\nIf anyone is interested please do contact me on ", "Anyone diagnosed based on high basophils? My bloodwork came back abnormal and going in for some more tests but I am worried because MCHC is low and basophils / bilibutrin are high, and I have swollen lymph nodes all over and chronic pelvic hip, femur, arm and sternum pain that I thought could be arthritis but my autoimmune / rheumatoid tests came back normal. Unless you are an expert in biological fields I would not bother trying to self-diagnose (i.e. for CML) unless something is way off like 5x the high value and is obviously very high. Since otherwise we have no basis to even know what is a normal value, how those ranges were calculated, the statistics behind it, etc. Lots of values are benchmarked, as we (as a society) do not understand the human body completely yet. For example, what would you think your blood test values would come back with if you had a moderate cold, and on what basis?\n\nTalk to your doctors about your results. Keep a healthy (if you stress out it will affect your health worse) level of concern and make sure that no balls get dropped and they follow up with you. That is all you can and should be doing. There are all kinds of things it could be. Excellent comments.", "Does anyone else experience this?? I have been treated for CML for 11 years using Tasigna. I am finding, lately, that my body cannot process stress. Not everyday stuff, big stressful situations. I shake, blurred vision, dizzy and have trouble thinking, reading and speaking. \nAnyone else? What do you do? I have tried everything... I did feel like my vision was affected on it. I also had terrible Charlie horses in my calfs most nights or early mornings. \nI am on sprycel now and do not experience those as much. I have been trying to take Claritin every morning and magnesium at night. That may be helping. I have only been on two years. So you are still actively taking it? As opposed to the whole take it for 3-5 years after MMR and then you can stop. From reading others' experiences it seems either the medication itself, the psychological effects of living with CML, or a combination of both ramps up anxiety in a lot of people. I personally have had the pleasure of experiencing full blown panic attacks from things that I would have considered normal work stressors in the past. I thought I was having heart problems but nope, just massive anxiety. Actually identifying it for what it is has helped me a lot personally, but I still have days where I know I am going to be fighting an invisible beast.", "BCR Abl1 increasing after booster? I am sick with worry. I had my blood test done in my BCR ABL1 went back up to 0.14 which technically takes me out of remission. I was at .03 a month before. I had the booster shot ( but was given the full dose not the half dose cuz of chemo) maybe 8 days before my blood test and I am wondering if that had anything to do with it. I am religious with my medication. I work out daily. I have no vices. The rest of my blood work looks perfect so I am worried if I might have mutated or if this is a reaction.\n\nHas anyone else experienced this? I am just trying to have some answers as my doctor does not want to say anything until I do another blood test a month from now.", "BOOK┢FULL \"Heir to the Empire by Timothy Zahn\" portable windows iBooks fb2 price without registering ", "Exaustion? Any other cmlers experience exhaustion? It is gotten to the point where I am having a really hard time getting through the day. Starting the day is pretty disheartening,  do not even feel like I have the ability to get out of bed. I am taking 70 mg of sprycel,  and have been in it since December of 2015. I eat extremely well, no sugar, no processed food,  raw veggies,  fish, eggs etc. I exercise daily, have put on 30 pounds of mostly muscle in the last 4 months.  I am frustrated. Extremely frustrated. It was not like this before, but up until a couple months ago I was taking opiates for bone pain, and they may have been masking my exhaustion. Now that I am off them, it seems unless I drink a bunch of coffee, I cannot fuction. Feel like I have done everything possible to remedy this problem on my own,  to no avail. Any thoughts would be appreciated. Much love.  Talk to your doctor about it. \n Sorry to hear about your experience. Unfortunately exhaustion and fatigue are common side effects of TKIs. I take Tasigna 300mg twice a day and fatigue had become part of my life.\n\nWould changing TKIs be an option for you? Due to extreme side effects some patients have changed their TKIs. Best to speak to your doctor on how to up your energy levels and if changing meds can be an option.\n\nAll the best! ", "Dasatinib and insurance. CML - After 8 years. I recently turned 26, and opted for continuation of coverage in the state of New York. I was assured, multiple times, that my prescription drug coverage would continue; however, I was not recently taken off my coverage for reasons that I do not know. Somehow, I still retain my health insurance - so I can continue seeing my team of physicians - however, I no longer have the prescription drug portion of my insurance.\n\nI am enraged, but, between fight or flight, I will go with fight. I have been doing well, I have experienced no symptoms, even when I was first diagnosed (Other than general tiredness). As such, I am at a loss at how I will continue to get Sprycel (Dasatinib) 50mg, which I have been taking for 8 years. \n\nI am afraid my condition will worsen at this point. In turn, I am exploring all options. \n\n1) Does anyone know of any insurance plans in New York that could cover the cost of Sprycel, at least in part?\n\n2) If that fails, has anyone used Invista (Dasatinib), the generic version, from India? If all else fails, I will travel to India to get the medication I need. \n\n\n\nI would appreciate any and all advice and help. Thanks. Furious right now. When I had insurance/financial challenges getting Sprycel, there were a couple of approaches (which I eventually did not need). There is a co-pay assist or something like that. There are also programs available for people under a certain income threshold.\n\nI am not good at these things but I would start by contacting your specialty pharmacy. Ask them about programs. Then contact the manufacturer and ask them too. A good oncologist's team should be quite aware of options too. Adding a second comment. You may be able to go without meds. Other people on here have recently told their story of successfully getting off Sprycel. At the end of August, serious side effects forced me off Sprycel. We are trying to see if I can be successful without it. I am told that it is about a 50% chance for those with a strong history of MMR. Here you go...\n\n\n\nA Google search shows a lot of support sites but I was worried about posting a sketchy one. More...\n\n I second this. \n\nAlso, is there a NY State insurance agency you could call about having your drug plan dropped? Your best bet would be to have the insurance situation corrected. Push the bureaucracy as much as you can, using the nicest, kindly tone. \n\nI have tremendous sympathy and share your rage: a health insurance system should not be able to drop critical coverage. (Just went through a horrible 15 day period to get my husband’s Medicare Plan D  back after it was dropped. He is on Sprycel and $220,000/year was impossible. He made over 20 phone calls, always polite and kind to the person on the call, and pressed his ‘cancer’ treatment need. That bureaucracy finally responded and reinstated him.) Yea the US health care really gets me going sometimes (in the way that stuff like this happens and you really have to fight and put a lot of time into something when it should not be so stupid). That being said, I am quite thankful for all the research, and hopefully the high cost of of healthcare in the US is furthering that. I have been in contact with the NY Department of Civil Service to try to get the issue resolved over the past 2 weeks, but I keep getting sidestepped, and sidetracked. It is only today that they informed me that I do not have prescription drug coverage, but that \"they are working on it.\" I am inclined to believe that they are not working on it, and I will have to figure things out elsewhere. \n\nThank you for your advice, though. I will try to remain persistent. Good luck, thanks for the information. I hope that it goes well, please do post your progress. Well, that is the issue. I currently do not have a specialty pharmacy because it was removed from my health insurance. While I have health insurance, I do not have prescription drug insurance. I did not even know that prescription drug insurance was separate from health insurance now. The system is so rigged and corrupt. Thanks for the help. I believe that you still technically have a specialty pharmacy. They are simply the ones that provide the Sprycel whether it is covered by insurance or not.", "CML newbie Hi everyone. I was diagnosed with CML about three weeks ago. I was tired and went to the doctor to get it checked. He found that my platelets were at a staggering 3,479,000. After about a week and a half (after a bone marrow biopsy) they found them at 3,900,000. Which they considered freakish 😬.\n\nCurrent meds 3 weeks in:\nDasatinib x 100mg\nHydrea x 3000mg (taken throughout the day)\nProgout x 1 tablet\n\nI am also on an antibiotic due to the left side tonsil becoming inflamed (with all the glands on that side of my neck). \n\nI wait every week for the next blood test, hoping that my platelets have dropped and the Dasatinib begins working. \n\nI am a female of 38, a teacher who was weightlifting and keeping fit 6 times a week until this all occurred. Now I am suffering side effects of the medication I am on.\n\nSide effects:\nFluttering heart occasionally \nI have been getting a temp (not sure if it is medication or my throat)\nAnd I have this AWFUL rash, which concerns me but might be normal, over a lot of my body which itches and is so hot to the touch.\n\nHoping someone will reply and tell me this is all normal, that everything is okay and that I will be okay. So sorry you have had to experience this. I too am young and exercise frequently. I was diagnosed in September 2020. The drugs for CML are great and most people do very well. If you have any questions feel free to ask. Thank you. I am thinking I will feel well enough to exercise again once my Hydrea has been reduced (and hopefully stopped). Your message gives me hope that I will have some semblance of my life before this discovery and intense medication regime. Would love a friend who is going through this too as it is hard for people around me to understand and I am always like \"is this side effect normal? Or should I be heading to the drs?\". Hi there, I also take Sprycel 100mg and have similar side effects. Sprycel can cause heart issues so you should see a cardiologist annually. I get the heart palpitations mostly when I am stressed but there are no real issues causing it. I also got a rash and it ended up being a reaction to certain soaps and deodorants. Play around with your shampoo, lotions, etc and see if you find the cause.\n\nI absolutely hate the phrase “the new normal” but these meds can absolutely change the way your body responds to things. It takes some time to figure it all out but once you do it gets a lot easier. Forgive yourself if some days you just cannot do what you used to.\n\nReach out with any questions! Join the facebook group “CML Survivors”, it is a huge resource. Awesome, thank you so much for the advice. I have begun going back to unscented everything and just waiting to see what happens. I will definitely check out that group too! The heart thing they keep checking. It is like I have gone for a run, and then it stops after a minute and goes back to normal. Welcome to the club. Sorry about your diagnosis. Hope things improve. I am on dasatinib also. So far I tolerate it ok but my platelets did drop drastically on it. I got a rash from bosulif. Wonder if the rash is from the antibiotics since that can be a side effect of those also. \nI was a healthy and active person too until some really bad side effects that started last year. Hoping to get back to the gym soon. \nThis group is amazing at lifting you up and getting you answers. My wife is on a Facebook group for CML and that is another great resource. Let me know if you have any questions. Fuckin'-A, man. I got a rash, man. Fuckin'-A. I would reach out to your doctor about the rash. My mom had that and had to go off Gllevec. She has now been on it for a year successfully because when she restarted she did a desensitizing protocol. Ooh thanks for letting me know, I am a little concerned because I am insanely itchy. Pretty different circumstance, I was diagnosed at 7 and have lived with it till now 21 (M). But usually once you have settled down with the drugs and platelets have gone down you will not even know you have it. I exercise heaps and live a very normal life, only difference is we take a drug every night. Good luck with joys of CML, wishing the best for you and your recovery. I had the rash before the antibiotics. I think it could be all the Hydrea (hydroxycarbamide - 6 tablets a day) I am taking too that is making my rash worse. Lol, glad to know it is not just me. Was it all over your body too? Thank you for your message, I am (im)patiently waiting for the day when everything settles a bit. I am fortunately in this situation too. Female diagnosed at 19 and almost 28 now. I have run 2 marathons since my diagnosis I so it is definitely possible to get back to a normal routine once you find a responsive medication. Wishing you the best! Thank you - also marathons? You are amazing! Thank you 😁", "Log reduction - explanation Hi !\n\nMy wife had her second BCR test - first test it said that her International Scale (%) was greater than 10%. \n\nSecond test the international scale % is 6.17 and it states a log reduction of 1.2. \n\nShe has been on Gleevec for approximately 70 days now and her CBC has normalized. \n\nCan someone be so kind to explain the log reduction to me? We will not see the doctor for three weeks. \n\nThank you! ( see the table near the bottom. Though it seems like they are not starting from an initial cell count at diagnosis, just from overall all the cells (i.e. you were already at log reduction 1 or so at the first test as close to 10% of the cells were bad cells which is as if 90% were removed). Though I am not sure if that is exactly the right context. But basically just a different way of measuring how much the bad stuff is removed. If you hit 1% you are at log reduction 2 etc.", "One of my favorites, wanted to share with you all! ", "HappyHappyJoyJoy HappyHappyJoyJoy 🍰🍾! Celebrating my first r/cake day, one week shy of my seven-year CancerVerserary! Lots to dance and sing about..go hug your loved ones, and tell those you like, exactly that. Those that rub you a lil the wrong way, imagine they are rubbing a knot out 😄! That is awesome and makes me hopeful in my own journey! Well done 😁 Thank you. It has indeed been a journey, but well worth every day. \nBlessings Be, Sarah ✨.", "Becoming more wobbly Anyone else experienced weight gain on Sprycel (100mg). I cannot seem to shift this gained weight and it is slowly but steadily going up.\n\nIf you have, any tips to help? Me too. I have gained 40lbs. Cannot seem to shake it Damn it, I was hoping there would be some awesome advice to stop the gain lol\n\nOh well, guess I will have to get used to being chubby. Better than dead! Sorry 😐 I had a little success going vegan. It is hard to maintain though with a chef partner. I loss 8 lbs in a month. Came back though as soon as I stopped  I have been vegetarian for 24 years, (vegan for 9 of them) still fat lol", "Survey opportunity Researchers at the University of Virginia are conducting a study to investigate the impacts of the COVID-19 pandemic on those with chronic health conditions. If you would like to participate, please fill out this survey: ( The survey will take about 5-10 minutes of your time. If you choose to provide your contact information, you will be entered in a raffle for a $50 Visa gift card. You can also sign up to participate in an interview at the end of this survey. If you complete an interview, you will receive a $25 Visa gift card.", "1 ", "Hello everyone. Been lurking in here for the past month, some of the post's here have really helped me with my recent news. I have recently been diagnosed with PH+ CML. I am going to go through the VA for treatment. I live in Tucson and fortunately we have an awesome VA hospital here. \n\nI am about to turn 34, male. The doc is going to try and get the VA to approve Bosutinib, if they decline for the money we will try Gleevec. Either way I am happy to be alive and trying to look on the bright side. I am told I am in the Chronic phase. Only found out something was wrong by my annual physical. Blood work was off. WBC were 30K plus. They did the CBC, they tell me a bone marrow biopsy is not necessary at this time. I am not really good at all the technical details but I will try and answer all questions. Happy this sub exists. Hope all of you have great holidays and we all feel better.", "How many of you were exposed to radiation prior to your diagnosis?  I had Radioactive Iodine-131 for my thyroid at 19. I was diagnosed with CML at 29. Even another woman at my oncology clinic went through the same treatment for her thyroid and has CML.    \n\n\nPerhaps it is just a coincidence, but always worth mentioning. I bumped into someone last night who is mother was diagnosed with CML recently and works in a clinical procedural area that uses radiology a lot.  I was diagnosed after working for a few years in an Operating Room that used radiology regularly.  I am a IT person, so my exposure occurred when supporting providers during surgery when a computer issue arrises.  \n\nI suspect my CML was triggered by this work and I am curious what others have noticed. I have cml but I was not around radiation, at least not that I am aware if. I did work pest control for a few years but that was years before my diagnosis. Has anyone run into any data on possible environmental triggers.  Cancer.org simply says Radiation exposure, age, and gender are the primary risk.  I worked around X-ray machines.  I am curious what other environments CML patients have  in common. 150 mCi of radioactive iodine post thyroidectomy in 2000.  CML dx in 2018.  . I have heard some many things can trigger the Philadelphia gene to trigger but they were all hypothetical. At one conference, I had heard that they even thought it could be linked to high levels of stress. Went near some hot cells a few times during work, but my radiation records were supposedly nil. I was never issue a radiation monitor, no idea what my life time exposure was.  My time in the or around active equipment was limited, and lead was used.  To my knowledge that is the only radiation I have been exposed to outside of an X-ray. \n\n9k new diagnosis caused by general radiation exposure in medical settings?  Idk. \n\n9k a year and no major advancements with CRISPR I got a lot of X-rays before my diagnoses but idk if that would be enough radiation to cause cml There is at least one study linking benzene exposure to significantly increased risk.   \n\nI have wondered about my RAI exposure, but given the 18 year span, I certainly have my doubts.", "First day on Tasigna Hi everyone, I was just recently diagnosed with CML and will be starting with tasigna 300mg twice a day.\n\nIt has been rough these past few weeks. I have tried working from home but it was so hard to concentrate so I asked for some time off to be able to psychologically and physically adjust from all of this.\n\nI have so many medications now aside from nilotinib (tasigna). I have 3 hypertension drugs (nebivolol, losartan and almodipine), drugs for blood flow and the heart (trimetazidine, digoxin, sulodexide, pentoxifylline, aspirin), drugs for my kidney (ketoanolgous), immune suppresant (mychophenolate mofit), a statin (atorvastatin), pain meds (prednisone) and hydroxychloroquine.\n\nIn a span of a few weeks, I am overwhelmed with all the new medications I have to take. Although, I was able to adjust to the weekly visit with the doctor.", "Booster shot for covid Anyone get the booster shot yet???? No.\n\nI read that the booster is offered 8 months after the second shot so I am a long way from that. Also apparently CML did not qualify me for an early shot for at-risk peeps which suggests to me that I will not qualify for the booster as an at-risk person. Also for the same reason I was only able to get vaccinated in April/May. My mom got it on Sunday. Her first two doses were in March I think. She was sick after both dose 2 and 3 (fever, vomiting, flu like symptoms). I believe she got Moderna.\n\nETA: she has CML, is on Gleevec, and is undetectable. Really?  Any type of Leukemia should qualify you. That is what I thought but I even called in to check and was slotted in with the general population. So I just got number 3 today, no side effects yet. Waiting for them for tomorrow. I got my first at the end of December before I was diagnosed with CML, the got covid three weeks later and got my second dose two weeks after that in February.  Was diagnosed with CML end of March, started bosutinib mid April. Also a nurse myself so hoping this helps me stay safe while working with sick patients. I just got my third dose yesterday. Hitting me pretty hard. Got it yesterday at noon. Started to feel achey last night and hit me while I was sleeping. Body aches , chills and fever today. Hope that means it is working ! How has cml treatment been going for you so far? Not so bad. I get a bout of diarrhea once a week or so and that is it for side effects. Some joint pain in my ankles and feet. Otherwise the medicine is doing it is job, I dropped from 35% at the beginning of treatment to .5% after 3 months. I just take it easy now so I do not get over tired. That it does! You want an immune response so your body can recognize it in the future. Hope you feel better! ", "BMT and CML Does everyone get sent to be matched for a BMT for \"just in case\"? Or is there something their not telling me? BTW, I am in Australia. When I was diagnosed, all of my siblings were tested to see if any were a match if I needed it. Also seemed like a “just in case” option. They did a bone marrow biopsy for diagnosis but never suggested anyone get tested to be a donor. I am in the USA. Oh cool, seems like it can just be a standard procedure then. Thank you. Cool, thanks for replying. Hopefully I will not need it 😁 Same here.  Straight to the pill.  Nothing about a BMT at all.", "Bosutinib and Fertility I(25f) was diagnosed almost two years ago (a month into the UK lockdown so that was fun), was put onto 400mg imatinib, then switched onto 500mg bosutinib about a year later because imatinib stopped working.\nNow about 9 months after having started on bosutinib my period's stopped. My cycle is usually about 23-26 days and I am now on day 44 of my current cycle. I have also now taken 3 pregnancy tests and they are all extremely negative.\nNeedless to say, I am pretty upset about it. Especially after all the condescending doctors told me how unlikely it would be for my fertility to be affected by these drugs. And eventually being told that, at this point, I would be able to pause my treatment to have a child if I wanted (not that I do currently but I was going to make the use of the option later).\nI have spoken to my haemato-oncology nurse about it and she is putting it down to the treatment. She is emailed my consultant about it and if it continues much longer I am going to be referred to a gynaecologist.\nI was wondering if anyone else has had this happen with TKIs and could let me know what their experience was.\n\nTLDR: my fertility seems to be being affected by bosutinib, anyone have this happen to them?", "Tasigna to Sprycel 31 y/o male here, been on Tasigna going on 4 years,  new insurance will not cover it so being switched to Sprycel. Not too keen on having to switch from a drug I have been doing great with all these years to one I know nothing about. Anyone on Sprycel care to share some experiences? Thoughts? I have been on Sprycel since my diagnosis in March. I went from 40% BCR/ABL to under 0.1% in about 6 months, so it is effective for me! I had some pretty bad leg pain, headaches, and extreme fatigue at the beginning. I also became neutropenic and had a case of shingles. My doctor lowered the dosage because of the neutropenia. I am doing very well on the lower dose and have not felt any side effects in months.\nI totally understand the nerves about changing treatment. My doctor is considering starting me on a different drug to try to reach undetectable status faster, and the idea of starting something new has me very anxious. Good luck to you! Thanks for the info. I hope all the best for you as well! Going To try to stay positive and hopefully any kind of issues or side effects will not be too bad, if any. Hello ❤️ I have been on Sprycel since March 2018. The worst / longest lasting side effect has been skin related; rashes, boils, bumps acne and infections. It is a constant issue. But, I am grateful for the drug. It has kept me alive. I am looking ahead to TFR hopefully soon, but there are no clinical trials in Canada at the moment. This!!! The bumps and boils I sometimes get, so painful and annoying. I spoke to my specialist and they thought this reaction was unusual, but on reddit it seems quite common. I did not get them for the first six months, then as my neutrophils got higher I got them. \n\nI should hopefully be trialling TFR in the next few years and I am looking forward to it 😀 I was on tasigna for a few years but side effects made me switch to sprycel about a year ago. I get a lot more muscle pain and headaches. I am on a really low dose to see if that will help minimize the issues I am having. \nIt is tolerable and better than the side effects from tasigna or bosulif for me. People on forums mentioned taking Claritin every day as well as magnesium supplements to help with the muscle pains and aches. That may be helping a bit. \nMy skin is super sensitive to sun light right now and I burn very easily. Never had to use much sun screen in my life until last year. \\*I am not a doctor—so please consult your oncologist before making any moves\\*  \n\n\nI really struggled with the acne and skin bumps after using Sprycel for 3 years. I tried *everything* with little success. Finally got a referral (and approval from my oncologist) to see a dermatologist that had a background in treating other cancer patients. She put me on a topical prescription-based cream (Erythromycin/Benzoyl peroxide topical gel) that has completely changed my skin in the last month and a half. I used to get horrible cysts and incredibly painful islands of acne on my cheeks, neck, shoulders, and back. Now I just have a few small \"blemishes\" that are not painful and seem to resolve themselves fairly quickly. The scarring has even gotten much better!  \n\n\nI do not want this to sound like a miracle but did want to at least share it with you all. It is made my life better and has helped my confidence dramatically. Plus, my skin just feels better overall. Hope that low dose helps minimize those side effects. I never had issues with Tasigna. We will see how Sprycel works-- hopefully I will not notice a difference. Thanks yall for all the information I have been on it for 2 months now, 100mg.\n\n-First few days I had headaches. Nothing terrible, I did not even bother to take OTC medication. Have not had any since.\n\n-I am not one to have acne usually, I have had a few pimples since.\n\n-I have a bit of a rash/red bumps on my chest but it does not itch or bother me. \n\n-My platelets were down in the first few weeks. Around 100 so not terribly low. They were back up to 120 at my last appointment. Since you have already been on other TKIs myleosupression will probably not be an issue for you. \n\n-My bilirubin was high last draw, but again that could be my body getting used to the TKI.\n\n-My blood pressure is high but I tend to blame that on my anxiety and being newly diagnosed. \n\n-My hematologist said that 20% of patients can have plural effusions, fluid in the lungs. This can happen at any time during treatment. From what I have read you will know if you have this. Shortness of breath on exertion/exercising, and then it can be drained in a fairly simple procedure. Shitty side effect of dasatinib..\n\nFrom what I have read the drug is pretty well tolerated. Sucks that you have to switch but try not to worry about that. I fear everyday that my response to TKIs will be suboptimal, but you are thankfully past that point already 😁. You will do great! &gt; TFR\n\nWhat is TFR? Hey man thanks for the info. Yeah, I think I am just going to see it through and just hope for the best. Since I have been on Tasigna for so long hopefully this change will not cause issues.  Best of luck to you man! Treatment Free Remission. \nIf you can reach a level of undetectable cancer cells (MMR - Major Molecular Remission) for a minimum of 3 years, you may be able to go off the drug completely. It is new, and not yet widely practised, but promising results :) That is awesome! Thx for sharing. It seems like the skin issues are pretty common with sprycel 🤔. I also saw a dermatologist last year but what he prescribed did not work well. I cant tell you what it was cuz I do not have the container anymore! Me too! There are no trials in Canada at the moment :( and doctors are not very keen on “experimenting” with dosage I have found…\n\nYes, skin issues seem to be a big one with sprycel!", "*nsfw* 1 year F*** Cancer Party August 6, 2020 “You have chronic myeloid leukemia. I am sorry. We need you to come to the hospital.” \n\nWorst day ever. You all, unfortunately, understand that sickening, horrifying feeling of hearing those words. I spent the next 6 months very sick. Sprycel and I were not friends. My levels kept dropping, could not keep anything down, could not fall asleep or stay awake. I was so scared that this was going to be the rest of my life. \n\nFast forward to now, I have been on bosutinib since January, things are still not great but they are so much better! I decided to throw a “Fuck Cancer” year diagnosis-aversary party. We did a spin class (theme song: Bad Blood lol) and then I threw a pool party for my friends and family after. It was AMAZING. \n\nLooking back to this time last year, I did not know what this meant for my life. What even is chronic cancer?! Old men get this? I am a 30 year old woman… what the fuck?!\n\nAfter I got on the right TKI,  I was able to get medically cleared to scuba dive again. I can actually finish a spin class, paddle board, and am working on hiking, but let us be real, I have never been great at hiking. I still sleep a lot but it is manageable. Things definitely are not back to normal but they are a hell of a lot better than they were and they are only getting better. \n\nI have always been a little extra but I think this was worth it. There were maybe 30 people that showed up throughout the day (vaccinated, outdoors, do not come for me.) \nI know this is a crazy disease but it does not have to stop you from doing fun things and being super extra occasionally. Hopefully this helps! If anyone wants to chat, please feel free to reach out ❤️  Wow, I was diagnosed with CML 12 days after you- 45 days after my 30th birthday. I am glad you are experiencing success with this TKI and I love the party idea- i think i may steal it for a future win :) My husband got diagnosed June 3rd of this year. He is 37. The only symptoms he had was being tired but who is not? His showed up in routine blood work. I am glad you are doing better! Nice pics by the way! I got a couple shirts saying Fuck Blood Cancer to support my husband. Philidelphia +? Yes I would love to connect! Totally feel free to do it, it was therapeutic and fun. I am so sorry. It is really terrible news. I hope things go well for you both. I am starting sprycel tomorrow after stalling as much as I can tbh. I am terrified but your post made me feel better that this can be my future too. I will also be 30 for my diagnosis anniversary! \nSending internet hugs!! Have you ever been on nilotinib (Tasigna)? Sounds like a lot of fun. Me and my family always do a cancerversary which is basically the same thing I appreciate it! You as well! You have got this. It may not be easy, but you have got it. One of the things that helped me, especially in the beginning is keeping a detailed journal of everything. When did I eat? Get sick? Take chemo? Take other meds (zofran, anti-diarrhea, THC, etc.) Sleep, etc. That really helped me communicate better with my doctor in the beginning. And do not be afraid to advocate for yourself, you have to. &lt;3 I am glad I am not the only one. I thought I was crazy, haha! I have not, but I have a good friend on it. She likes it, but my doc decided to go with dasatinib and bosutinib. Is that what you are on? Yeah. I have been on only it so I will not be able to compare unfortunately. In general the side effects do not seem too bad, but I think it has been exacerbating the slightly highish blood sugar and poorish circulation in my extremities so occasionally I will wait up with numbness esp if I elevate them or sleep on my hand etc. Idk if the ones you are on have it, but there is the no eating 2 hrs before and 1 hr after taking it, which is just something to be managed (but is slightly annoying I suppose). Otherwise, hit MMR after around a year after diagnosis and just kind of in a cruising pattern currently. I have never even thought about this. Thank you so much! I will definitely do this. Every time I see my doctor my brain is so fuzzy about what I have been experiencing. Sprycel was fantastic for me for 7 years. It could be awesome for you.", "Life expectancy with CML &amp; retirement planning My best friend was diagnosed with CML when he was 27. He was put on Sprycel for it and it is well controlled. He is 31 now and just graduated with a master's degree and gotten his first professor job. He is setting up retirement planning and I am not sure what to tell him. I am certainly not going to advise that he aggressively save for retirement when he may not live long enough to get to traditional retirement. In addition to this, we live in the US, so treatments cost a lot and we are looking at ACA repeal being a very real possibility. What good will it do him to save money only to have to spend it on medical bills? His doctor let us know in the beginning that chemo basically causes cancer and many who have cancer asa child or young adult will often get cancer again in 25 year increments. Who knows what the chances are for the next cancer he will get, or how much money it will drain from him to treat that one.\n\nI have not been able to find a lot of information on long term life expectancy studies. I am guessing that is because up until recently with the advent of gleevec and the next gen meds, life expectancy was less than five years without a stem cell transplant and not great even after that. Does anyone have any guidance on this? Hey -\n\nIf your friend continues on a good path, they could very well live to a normal life expectancy. Theres no evidence to suggest otherwise so there would be no reason to not prepare for something like retirement. They just need to make sure they take care of themselves and keep things like their liver in good health.\n\nAlso, while there is evidence that TKIs cause secondary cancers, it is only in a very small percentage of people. It was unwise of the doctor to suggest a TKI could cause another cancer down the line due to age. The general population have just as much chance of developing cancer as someone with CML. Good answer. CML arises from a single mutation—random chance of those in anyone, at anytime. Most people have survived with TKIs controlling their CML for going on 20 years. There is no evidence that this pattern would change over 40+ years (at least not yet).  \n\nThe cost of the drug (which largely goes to profit for the pharmaceutical companies) is the biggest risk and that is a political issue.  Until the US govt starts negotiating drug prices, the cost is likely to continue to rise. At $200,000 a year now for Sprycel, patients are dependent on insurance/charitable subsidies to cover the majority of the cost. Should the ACA protections for preexisting conditions go away, your friend will have fewer choices and will likely need to stick to his existing job so he does not have to make an insurance change. With all the advancements in medicine, tell your friend to save for a wonderful retirement. Stay optimistic. That goes a long way even if there is some doubt in the back of your mind. I have a lot of future plans and do not plan on letting this current cancer or the potential future ones stop that. I think it is important to have good life and health insurance as well as a retirement. It looks like I got it wrong. It is not due to the TKIs, but there is a higher risk of secondary cancer in CML diagnosed patients just because of the CML. It seems particularly higher in men, which may be why the doctor mentioned it. The below article talks about this study.\n\n \n\n\nRegardless, it seems like he should be mostly out of the woods since the highest risk is within the 5 years after diagnosis. It is good to know that he can plan for a normal life expectancy. This is the biggest worry but he could stash his extra money in his retirement accounts and it would be untouchable in the event of medical bankruptcy being necessary. He loves his job and works for a university so I am sure he has no problem staying there as long as possible. Thanks for the reply! Those are good considerations. Interesting, I did not know this. Hopefully it is again only a smaller portion of people overall.\n\nAnyway I hope your friends treatment continues to go well for many years! Chances are your friend will live long enough to retire. The odds are good and he should be planning for retirement. Of course there is no guarantee but there is no guarantee for a healthy person either. You could get hit by a bus tomorrow. That does not mean you should not plan for the future today. I was diagnosed with CML in 1999. Doing quite well and expect normal life span. Did they even have TKI's back then? I am glad you made it long enough until the first generation TKI's are out. How much does he pay for sprycel ived had cml for someting like seven years give or take and i might could help with stuff if you can make contact in better way", "BMT Donor For A CML Recipient, Please Educate Me I am a 31 y/o male and recently came up as a bone marrow transplant match for a 45 y/o CML patient (both American). I completed the (surgical) harvest a few days ago. It is my understanding that shortly after she receives the transplant, there will be an opportunity to exchange anonymous letters. \n\nIn preparation for any communication we may have, I have been trying to learn more about CML. From what I gather, it seems to be very treatable with meds. Does this mean that the recipient is likely in the later stages of the disease or is a BMT more common than I have come to understand? Additionally, If you have experienced this or have any advice regarding what I should include in my letter (understanding that no ID info can be exchanged for a year), I would love to hear it! \n\nThank you! I wish you all health and happiness! I would assume that if the patient is getting a bone marrow transplant that they did not respond well to medications. For example, my mom has CML and has had bad side effects to three of the five medications on the market. These side effects are so bad that she has ended up in the emergency room and is not able to take these medications. The other two medications on the market have side effects of sudden unexplained death. Luckily, through my own research (not her doctor), I found a protocol that seems to be allowing her to take one of the original medications without side effect. Fingers crossed it continues to work. While for most people CML is treatable with medication, some people have these horrible side effects to the medications like my mom had or some people do not improve on the medication. Thank you for being a donor. You are saving someone is life. I am really sorry to hear about your mom's struggles. I appreciate the effort it takes to sift through all the information out there to be an advocate for yourself and your loved ones! She is lucky to have you! It makes a ton of sense that everyone would have different experiences with these different meds. I am well aware that even if the meds work fine, the price gouging is a \"side effect\" of its own. I hope your mom's stability lasts and that she is able to get better asap. Thanks for your insight and kind words! Effectively, now most CML patients are treated with one of several meds available, but that is not an option for some of them because they do not respond well to the drugs or have other conditions which make bone marrow transplant a better/the only viable option. In any case, the receptor of your bone marrow will be passing through a difficult time, even more difficult than what patients which respond well to meds experience. However, if she reacts well to the transplant, she might not depend in the future of the costly meds that most CML patients need. Thank you for your donation.", "My dad got diagnosed with CML today, I have some questions please. I am living in a very far country than my dad currently lives. I called him today and he told me that he is diagnosed with CML and they will take a biopsy sample today.\n\nI have many questions and need help,\n\n1- He said his white blood cells are 350% higher. I assume that is around 39k. Is this chronic level?\n\n2- Why do they need to do the biopsy test? Is it still not confirmed? Can it be more severe?\n\n3- Will he take the tki lifetime?\n\n4- In the recent years, he usually felt fatigued and always wakes up at night, feeling skin rashes etc.. will these symptoms be less?\n\nI wish all of you get well and be in excellent health. From what I was told, the biopsy confirms the diagnosis and other stuff. You may want to call the LLL and they can give you some good info on CML. My prior symptoms went away once I started the medicine, but it does bring some new symptoms with it. To answer \n1: hard to answer based on your data. Check more info here: \n\n2: the high white bloodline count with some specific characteristics is merely a very good indicator, not proof. They need the bone marrow to look for the so-called Philadelphia chromosome, that is the actual proof.\n\n3: tki will be either years or lifetime, impossible to say at this point. Assume lifetime.\n\n4: hard to answer Thanks so much,\n\nThe doctors did not say in which phase my dad currently is in. They already gave him the TKI and he will have to take it daily for around 1-2 months and they said the will transfer all his details to the cancer center and they will follow up with him.\n\nBone marrow results not yet came.\n\n\nHe had an enlarged spleen which made him have difficulty in breathing and some pain in the left shoulder from the pressure on a nerve.\n\nI would conclude that he is either chronic phase or accelerated since he started TKI, right?\n I hope the results came out to be something it is treatable and he is doing well with the TKI..! Thanks so much for asking, he is in the accelerated phase and he started taking TKI Sprycel 100 mg since day 1 until today. Side effects are strong but he is adopting. Best wishes your way and your dad...! I was diagnosed as CML and now on Sprycel 100mg. The side effects subsided after the first week and a half though I do feel quite fatigue time to time... I really hope the best for your dad's response to the drug.  Wishing you a very fast and successful recovery. All the prayers for you from my deep heart. ", "Has anyone tried importing Veenat 400 directly from India? Can you please share your recommended shops. I am scared of getting scammed online. I need the meds for my partner diagnosed with CML. The meds are expensive in the Philippines.", "Puffy Face - Imatinab 400mg Hello - my wife is about 7 months into treatment with Gleevec (400 mg). The most common side effect (which was totally expected) is the puffy eyes and a bit her cheeks. Does anyone have any suggestions how to treat this other than drinking a lot of water? Sleeping upright perhaps? \n\nThank you in advance!", "Acne type eruptions on dasatinib I have been on dasatinib since January. Now all of a sudden I have these blind pimples on the back of my neck. I also have a few on my scalp. Anyone else have this? My husband is dealing with the same thing.  He got prescribed some cream to help with it. He is been on his chemo since June. Thanks for your reply, I knew it must be related. So annoying though! You are welcome. My husband is self conscious about it. He is never dealt with acne. He was getting bumps and boils on his body too. I have been dealing with this too. Occasional acne was normal for meal but not this. I have been on bosutinib since April and have had a break out since mid July. Annoying being 40. Hi, do you happen to know which cream he was prescribed? Retin-A and strong Hydrocortisone! The Hydro is for his body boils. Same here, the occasional one and nearly 40. It is incredibly annoying to deal with and sore. Never had this issue on dasatinib, but I get it on my arms really badly with ponatinib. My hem/onc said to use acne face wash on it, but that has not really worked Thank you, I will get some Retin-A stuff, already got the hydrocortisone. You are welcome! Let your doctor know you are having these problems! Yeah, at the moment I am using bactroban, to kill off and little infection as my neutrophils are not the highest. I think mine her 0.8 last week. My platelets are also chronically low, so when I pop them (I know I should not, I just cannot help it), I have huge bruises Yeah mine were practically non existent at one point, but now I am sitting around 1.0 - I do not have a problem with platelets though now (thank god), they were once at 3,900,000 now at about 140,000 (normal yay) When I relapsed, mine were 1.7 million. I had to undergo leukopheresis and I clogged the machine! Now they constantly downtrend and I have been getting weekly transfusions for the longest time. The past two weeks have been the first time I have not and they have been hovering around 20,000 It is crazy what your body can do to you. They were going to send me to machine, but then they just decided to bomb it all with hydrea (do not recommend lol) I have been on dasatinib 140mg since February, almost immediately got these all over my face and on my shoulders and back. Super painful. My primary care doc recently prescribed me doxycycline, i am almost finished with the first round and they are almost gone completely. Good luck- this was one of the more annoying side effects of sprycel Thanks for replying. I knew they must have been medication related but wanted to check there was not anything else underlying it all. I went months not considering sprycel could be the culprit. You are much more wise asking around! Thanks 😊 Yeah, so I am also getting boils too now! Going to go to the chemist this morning to sort it out! My husband just seen a dermatologist. And they are going to prescribe him some body wash and cream. They took a biopsy of his sores to find out what was going on. Good luck! I am new to the forum and I am currently going through all the posts and found this one and immediately identified! Thank you for this - I am on Dasatinib 70mg and have had the same issue on my chin for the past 5 months - tried every lotion, cream and topical I could buy but they always appear without fail. I have now upped my water intake and it seems to be helping to clear them up. Cool, I am glad something is working for you 😁 Yes me too! Exactly what you describe. They come and go since I started Dasatinib in March 2018. Painful! It is so good to know you are not the only one", "Fertility Preservation My partner (28f) recently got diagnosed with CML.  She has not started TKIs yet, but we are thinking about and exploring all of our options.  We would like to have kids one day, so we are interested in fertility preservation options like egg freezing or embryo freezing.  The tricky part is, my understanding is that some women are able to get off of TKIs after 3 years or so and enter into treatment free remission (TFR) and are then able to have kids with no negative effects.  Obviously, this would be ideal.  However, if we are not lucky ,maybe she will need to be on TKIs indefinitely or other treatments will need to be used that will negatively affect her fertility permanently.  \n\nWhat have other people done this or similar situations?  Does anyone have input or experience to share?\n\nThanks! Hi! I (27f) was diagnosed with CML when I was 19. Been on TKIs (nilotinib) for most of that time. About 2.5 years ago I went through the egg freezing process. Although I was not close to having kids, I worked with my doctors and decided it was a good back up to have if natural conception did not work or was not feasible with treatment.\n\nThe process was not all too bad and I am glad I did it when I did. The only drawback was cost as I was not approved by my insurance but there are organizations that help cancer survivors with this process. \n\nAnyway I still have not decided if/when I will need them but I am glad to have viable eggs from when I was 24.\n\nHope this helps! You might want to ask in r/infertility. I have found that sub really helpful. It is great that you were able to secure that back-up option!  Do you mind if I ask a few follow up questions?  Answers however many or few you would like.\n\n1) To confirm, you were able to have eggs harvest after you had been on TKIs, is that right?  \n\n2) Did you stop your TKI process in order to harvest the eggs?  If so, how long were you off TKIs?\n\n3) Was it difficult to find a Hematologist / Oncologist and fertility clinic that was able &amp; willing to work with someone diagnosed with CML?\n\nThanks for the information!!  I sincerely appreciate it.  Hope you have a good rest of your day. Will do, thank you! Not at all!\n\n&gt;To confirm, you were able to have eggs harvest after you had been on TKIs, is that right?\n\nCorrect. At that point I had been on TKIs for almost 6 years, and they were still able to get 15 healthy eggs.\n\n&amp;#x200B;\n\n&gt;Did you stop your TKI process in order to harvest the eggs? If so, how long were you off TKIs?\n\nYes. I was off my meds for about 2 weeks and after I got a CBC done to check if there was any increase in WBC, thankfully there was not. After I resumed my medication with no problems.\n\n&amp;#x200B;\n\n&gt;Was it difficult to find a Hematologist / Oncologist and fertility clinic that was able &amp; willing to work with someone diagnosed with CML?\n\nNope! I have been a patient at Memorial Sloan Kettering and they have fertility specialists in the hospital that deal with this all the time. They made the referral to a reproductive endocrinologist and I began the process. They were extremely helpful also in working with the Livestrong foundation which helped me get the fertility drugs for free- highly recommend reaching out to them if you are in the US (not sure what they do internationally) as it saved me a good chunk.\n\nHappy to answer any more questions you may have either here or in a pm! In addition to the great comments here, there is a huge FB support group, ( that might have some good inputs as well. &gt;endocrinologist\n\nThank you so much for the information! I may shoot you a PM later if I think of any more questions &gt;md4nb\n\nHey! Follow-up question for you.  My partner went ahead with egg harvesting and she unfortunately experienced really bad Ovarian Hyper Stimulation Syndrome (OHSS) as a complication of the subcutaneous injections hormones.  It could have been a random coincidence, but I thought I would ask - Did you experience OHSS or any other complication / side effect from your egg harvesting?", "Apply for COVID19 financial aid ~ $250  Hey friends! If you have not, apply for financial aid, donated graciously by the Leukemia &amp; Lymphoma Society. Received my letter and just wanted to share, hoping to help some other hapless souls out there. I know we are high risk so that puts a lot of us out of work on the front lines. Keep being safe and I hope other can benefit from this too! It really only took me like 10 minutes to fill out online.\n\nUgh I sound like one of those pyramid schemey friends on Facebook, but just wanted to spread the love. Thank you so much! This is incredible!", "Question for anyone on sprycel regarding pregnancy I had my bone marrow biopsy last Friday, not to bad, not to fun either but oh well. The doc confirmed I have CML and have to wait 6 weeks for the proper diagnosis from my biopsy. He placed me on sprycel and explained a few side effects but not much. My question though, and forgive me for being so long winded here, my wife and I have been trying to have a baby for the better part of a year, 1 year in January, to no avail sadly. We have been doing some research on sprycel and found that it can lower my sperm count and some sites mentioned it would be best to avoid conception while I am on sprycel. I have also seen sites that say go ahead and conceive away. Does anyone have any experience on here with this topic?  My husband was on tasigna when we conceived. I know it is not exactly what you are asking about, but it is another tki. It was a very uneventful, easy pregnancy and we now have a healthy 20 month old. We went to MD Anderson a few months before the pregnancy and asked them about it and they gave us the green light to go ahead.  That is comforting to hear that, even if it is not the same medicine. I would take uneventful over the alternative m, anytime haha. I was told that I could not have children while taking the sprycel because it would cause birth defects", "newbie here: checkin' in with my latest news Diagnosed in 2014 at which point I started on dasatinib. This summer I had serious side effects: pleural effusion and pericardial effusion. Both required procedures: thoracentesis and pericardiocentesis.\n\nOff all CML meds for now. Not worried (mostly because of personal growth efforts). Scheduled to see my doctor soon.\n\nA bit concerned about other TKI meds as effusions are an issue with all and some have more serious side effects than dasatinib.  As my CML has been undetectable for years, maybe I will be lucky to tolerate staying off all CML meds. Maybe.\n\nI wonder if BMT is available (i.e. both offered as a treatment and covered by insurance) as a last option. I expect that I have a long way to go before that would be a consideration. It sucks you had to go through all of that. Hopefully all of us that are off meds can keep it that way! Thank you. FWIW, my mom had pleural effusions on Sprycel and now has been tolerating Gleevec for almost two years. We did a desensitization protocol to Gleevec where we started at extremely low dilutions of Gleevec and worked our way up to 300 mg/day. The article that discusses the protocol was called \"Desentization to imatinib in patients with leukemia\". (There is another article too but I cannot recall the name or which protocol we ended up using). Hope you find something that works. Thank you!", "Fluid retention in the legs on dasatinib Hi I am just wondering if anyone else is experiencing fluid retention in the legs on dasatinib (I am taking 100mg a day). Also, what you have done to ease it. Are you on a diuretic? No, but I am considering asking for one Yep.    It is an ongoing struggle.   Diuretics help.   Losing my gut would likely help even more to improve circulation. Thank you for your advice - I am definitely going to be asking about it because I am all normal up top and then my legs sometimes look like they should be on someone else ha ha. I had that problem when I was on dasatanib. It would come and go randomly. Elevating my legs seemed to helped slightly. Never tried diuretics though. Glad I am not the only one! Thanks for your reply 😁 Yeah, actually its becoming a real problem. I have bursitis in my knees. My knees ache terribly, as well as my hips and thighs even sometimes. Oh you poor thing. Makes me realise how my complaints are so minimal. Hope the issue resolves itself or gets better. Have they offered you some kind of treatment? Im honestly at the point where I have stopped telling them things. They do nothing to help me at all medically to treat these symptoms. I used to atleast get pain medication. Apparently I moved to a place(VT) where opioid painkillers are never prescribed anymore. I complain about my fatigue and they tell me to eat more red meat and liver. Im 33, in fantastic shape, and eat steak for breakfast regularly.  I have been asking for 3 years for a testosterone panel. Just a blood test to see if its low. And they havent done it. Im at my wits end with medical \"professionals\". I do better treating myself. Its been 5 years, and they have done NOTHING for me. Actually I lied, they have done one thing. They have ignored me.\n\nIm at the point where I have done so much research in the medical field looking for solutions and answers, that my friends actually come to me for medical advice. Some of them call me \"Dr. myname\". But I  cant get a medical professional to listen to me. Not being listened to I would the worst. \nI am not saying vegetarianism is a way to go, but I want to tell you a bit about my possibly coincidental story. I was vegetarian for 24 (since I was 12) I started eating meat for a year (because I was weightlifting and people convinced me my gains would be slowed). After eating meat for a year, they discovered I had Leukaemia moving at a very fast pace (chronic to accelerated within a year). Prior to this I would never had any cml markers. I immediately went back to vegetarianism, also taking dasatinib. My energy levels are good, and apart from the fluid retention I am relatively well. I discussed this with my docs who dismiss that this drastic change in my diet would have any difference although it just seems too coincidental. Thanks for listening to my rant and thanks for your response! I am so grateful for the scientific breakthroughs and medical experts who have created all these TKI's to treat people like you and I. I am so grateful for it. However, my face to face interactions with people who would consider themselves well meaning and compassionate have been very disappointing.  I report my leg pain and fatigue every time I get blood work done which is every 3 months. It feels like groundhog day. I tell them what is going on, and they look at me with a look that you might give a hurt animal. But never do they offer any solutions. I treat myself. And I shouldnt have to.\n\nI defnetly have considered going full vegetarian, though Im pretty close to it. I only eat unprocessed food, very little bread etc, veggies are eaten raw when possible, but I havent cut out red meat. Part of the reason is they have been insistent that I get more vitamin A, even though my vitamin A levels are fine...Its very confusing.  Also, im almost 190 and have very little body fat and am 6' tall. I require a lot of fuel to keep my body going. I can literally eat 2 steaks, 2 heads of broccoli, an avacado and quinoa and rice for breakfast. I used to order 12 eggs and 6 peices of bacon after going to the gym. My appetite is solid, diet is well rounded. But I really could consider your suggestion and go full veg. I really appreciate your response and hearing your experience. Much &lt;3 Sounds like your diet is pretty good 😁 Also, feel free to vent. Sometimes you just have to, and it is better chatting with someone who understands what you are going through (others with the same condition). I was weightlifting 6 times a week, but I am now changing that up. The aching and recovery is a bitch. I have taken up yoga again after a good 6 years of not doing it and lots of walking / jogging on my treadmill after work at night to see if I will start feeling better. That Is so funny, because I ran into the exact same problem. Actually Ill be honest. When I first got back to the gym, I accidentily over did it with pullups, too many reps, and 3 days later was in the hospital with rhabdomyalysis.\n\nIt was super weird, the workout was something I had done plenty of times before.  Ever since I have wondered if it had something to do with dasatanib. And after that I  noticed much more pain in my joints to the point where I stopped going to the gym all together. It took SO long to recover from even just basic workouts. And the pain got worse and worse. I am not sure how to approach exercise now, I do yoga as well, but not at a level where it challenges my body enough to be good exercise. Its more a meditative thing. But I have done yoga that is pretty extreme, maybe that is a better options than a bunch of reps in the gym. I am thinking the same! My wrist joints were killing me and my recovery time has been making it not worth it. I am currently looking after a back/neck injury from my last workout! Even yoga at the moment (holding the poses etc) can get very uncomfortable, but I am sticking with it to retain some body conditioning. Recently started Sprycel (140mg) after 6 years on Tasigna.  My feet have swollen and are itchy as hell.  Calves are pretty tight, too.  Last time I used a diuretic my kidneys crashed. Mine has eased quite a bit now. Especially since I stopped weightlifting. I think it is a combination of that and getting used to my medication. I also found out I am in MMR so yay!!! Congrats!  Glad your are responding well.  Dasatinib/Sprycel is powerful stuff. It certainly is", "Neutropenia sucks I should be grateful, and I am somewhat, but having practically no white blood cells and low everything else is taking the joy out of my life. \n\n\"Stay away from people. No sex. No salads. Raised temp go straight to urgent care\" \n\nI have had so much time off I barely know my students (I am a teacher) and feel bad about it. \nThe medication is working well for my CML but I have to stop my dasatinib for a week so my body can recover. \n\nTell me this is normal, because it is driving me nuts. The loss of control over my life makes me sad.\n\nRant over. Unfortunately some of us do not tolerate the medication as well as others. I am alive thanks to the different TKIs but dealing with lots of issues with side effects. \nMy oncologist finally decided to keep me on a very low dose of Sprycel (20mg) because my platelets and pancreas cannot tolerate any higher dose. \nI love working and consider myself a workaholic but have been unable to work for months due to ongoing issues since last year. It does suck to feel like I have to baby my body and feeling like the things that gave me joy are not in the equation for now. \nI am married with kids so they are my major sense of joy and purpose for now. Hoping to get back to some semblance of normal and my doctors think I can at some point. \nI still have sex and eat salads. Hope you can at least get some joyful activities back in your life soon. I am hoping my doctor will consider a lower dose. I am grateful that it is been working (dropping from 55% bcr-abl to 15% in just a month). \n\nI also hate being a sulk about it all. The loss of control over my life is definitely not something I am used to. I know neutropenia will be a temporary thing for me - but damn, talk about taking a the good stuff away! \n\nI hope you get towards a sense of normality too, just as I hopefully will (and sooner rather than later). I was off and on dasatinib for 6 months and it was awful. I switched to bosutinib in January and have had a much, much better time. Good luck! I hope things are going better for you now. Yeah I am heaps better. The Hydrea I would been on was the one that really killed them all. They are back to better levels now and I am feeling good 😀 I am glad to hear that!! My son tried imanitib, with blacktea 5x a day starting. his BCR-ABL dropped from 84% to undetectable (0.003%) in 1.5yrs. The doctors forbid originially but.. since the result is undeniable.. he let us continue. now lower the dosage to 2x a day, and start trying white tea. That is awesome about your son! Lucky I am a tea drinker, hopefully mine will be undetectable one day 😆 well, what i learn is the antioxidant in tea help kill the leukemia cells and prevent the ROS to develop into multi different mutations. I try use black tea which must be drank within 5 minutes from brewing in about 80c (i use ice even to get the time right). it seems that theres lot of study about that and I am happy it worked for my son. Hope this will help u thru ur journey. Good luck Thank you - I will try it", "BOOK┣DOWNLOAD \"في الحب والحياة by مصطفى محمود\" portable selling txt thepiratebay finder review ", "Pleural effusion on sprycel My mom who is 58 and was diagnosed with CML 20 months ago has a pleural effusion. She has about 3 liters of fluid around her left lung only. She is been on sprycel for about 18 months after having an allergic reaction to gleevec. The pulmonologist seems to think it might be another cancer rather than a reaction to the sprycel because it is such a delayed reaction and it is only in one lung.  Anyone have experience with pleural effusions on sprycel?", "Intro + symptom management pre-treatment? Hey all. My name’s Alyssa, I am 31, and I was diagnosed with CML in July. I am hopping on here because I am in need of building community and connecting with folks along the way. Please count me as a +1 in your corner to support you!\n\nI am starting treatment here soon (imatinib)—but it is hung up with insurance. In this waiting period, I have had a flare up in my leg bones and joints that is left me bed ridden for 24 hours. I was not anticipating this happening before treatment/side effects (but I am learning so much these days).\n\nI connected with my team/nurses and I am taking Claritin and Aleve to manage the pain. I am going on another night of laying in bed. I know it is an elementary question, but does anyone have any tips or ways to manage your flare ups? I am trying to figure out how to keep this in check before treatment. Thanks for the help in advanced, I appreciate it! Hi Alyssa. Nice to meet you. My apologies for any bad English. English is not my first language.\nDespite everything happening right now, I hope you are okay. You will will be okay eventually. But it will take time to adjust and accept the changes in your life. \n\nTo be honest I do not know if I ever contributed to this sub, but I will do my best to help you. I was diagnosed in October 2016 and started Imatinib at the end of the month. In February 2018 I switched to Dasatinib (Sprycel).\n\nI actually never had the symptoms you are describing. Nevertheless I was bed ritten. A one hour simple and easy walk had to be divided with 2 breaks of 15 minutes. Apart from other symptoms, I was extremely tired and had pains through my entire body. During the weeks before I started with Imatinib, I usually tried to take it easy. The simply walk as I describe here above was the only thing I could and would do. Nothing more. But there were times I was feeling better and I felt I could do more. During those times I took the opportunity to do some more. Nevertheless, in my experience, you will never know when suddenly the tiredness will hit you. In your case the pain flares\n\nMost of the time I would lie in bed trying to read something, play a video game or watch tv. Sometimes I would simply lie in bed and do nothing. It depended on how I felt. My attention span was short and I decided to go with it. If I only could read 5 minutes, at least I would have read 5 minutes. Thank you so much for your reply, it means a lot. The adjustments are a definite full-force, all at one kind of gig. Despite everything, I am doing okay! \n\nThis is really great insight. Not quite knowing when the flare ups or symptoms occur is something I am learning. I am adjusting from a very active, 4x a week workout routine to pausing more and listening to my body. \n\nI am starting to get comfortable in bed! Similar to you, I switch between reading, TV, meditating, laying down—whatever works to keep me distracted. I think between physical symptoms and managing emotions from the diagnosis it is going to take time to keep adjusting. I appreciate your help! Before I was diagnosed, advil seemed to work the best for me. Thank you! I am going on day four here and switching up what I can to manage it. I do not have anything to contribute as my wife just started her treatment for CML last month on imatinib (31 also!) but best of luck Alyssa and I hope you feel better soon. Thank you so much! I am thinking about and sending strength to your wife, you, and your family as you navigate this! Also I had to deal with all the insurance complications as well. It is quite annoying that we have to navigate this administrative stuff while dealing with a cancer diagnosis but it is what it is. Sending you strength too and hope you can start your Gleevec soon. Let us know how it goes with you. The insurance aspect has been so challenging! I feel for everyone that goes through that. I ended up creating a comprehensive document to keep tabs of everything (call log, questions, symptom tracker, milestones—you name it). It is felt like a full time job balancing with everything else. I am getting my imatinib today and will start tonight! I am very anxious...but hopeful to take a step forward in this direction with treatment. Good luck let us know how it goes. How many mg? The bone pain is pretty common with CML, but no specialist I have ever talked to will link the two. NSAIDs like Naproxen/Aleve and Advil/Ibuprofin seem to work best for relief. I have read lots of Claritin success stories too but it never worked for me. There is a huge CML Facebook group that you should join. A lot of good info share there. Thank you! I am starting on 400mg. Thank you so much! I did find that Facebook group and I have been reading a lot. Over a week later and I am finally out of the woods for now. The Aleve did okay and Claritin did not seem to do much for me either! I think that is what I am learning—everything’s so different for all folks. I appreciate your insights! Same for my wife. I am wishing all the best! I know I am a stranger on Reddit—but if your wife is ever looking to connect I am more than happy to. I know my husband is experiencing this journey too in different ways. It is a lot to navigate at this age. Hi! I am 32 and was diagnosed a year ago. I am so sorry you have joined the worst club. I am on Celebrex for my joint and bone pain. It helps a lot but I do not love the nsaid and it hurts my stomach sometimes. I am not sure if you are in legal state but Mary Jane has been my best friend for the last year. I would love to connect! I feel like there is so much I wish someone would have told me as a 31 year old going through this last year. Oh, Elizebeth! I am so sorry we are connecting like this and that you are navigating this in your early 30’s too! I would so appreciate connecting. :) Thank you. I will let her know! Good luck with your first day of taking the drug. Man that really sucks sorry to hear that. Aw, thank you—I made it through! Finally made it out to take my pup for a walk. Hi lyss how did your first week go on Gleevec? Oof—I am having a rough time so far. Feeling the spectrum of side effects and mentally having a hard time. I had blood labs this morning and there is hope to see that progress is being made! Pain for gain I guess. :) Hoping to get through these first few months and balance out a bit. \n\nThank you so much for checking in! How is your wife doing with treatment? Thinking about you all. My father(50y) started imatinib today. Did you observe any side effects?\nAny advise for my father from your experience?  I know that each person has a different experience with side effects! Here is what I encountered. The first two weeks were the most challenging—bone and joint pain, fatigue, nausea/unsettled feeling, loss of appetite, night sweats. The bone pain was the worst in my legs and I could barely manage to get around or get out of bed. They were restless at night and I could barely sleep. After those two weeks and working with my team, I am out of the woods with a lot of the side effects! I mainly only feel fatigue. My appetite came back, my leg pain subsided, night sweats started going away. I am wishing your dad strength as he starts his treatment! It is a journey but you start to get into a routine. Thinking of you all. Thank you for advise and best wishes.\nBest wishes to you as well Primary side effects for my wife is the muscle cramping and some puffiness around her eyes.", "Research interviews for CML I work for a market research company. We are going to be hosting virtual interviews for individuals with CML. The results of this virtual study will enhance the materials and information available to individuals with CML. You would be compensated for your time.\n\nYou can email me directly at  if you are interested. My best wishes to you all. I know this is a small sub, and I hope you each have a strong support network.\n\n", "Bone Pain? Hey. Anyone experienced bone pain from taking sprycel (dasatinib)? I usually never forget to take my medication, but when I do miss a day, the next day (after taking meds), my bones really ache. I am 38, healthy and fit, but feel defeated at times. Bone pain is a super common side effect of either CML or the TKIs. Some people say Claritin helps them but I have to use NSAIDs on bad days. Most oncs will not acknowledge it for some reason but it is a common enough complaint on the FB group. Bone pain for me was from CML once I started Sprycel it went away I think of it as pain in my “long bones.” I have not noticed the onset of the discomfort after missing a dose, but can tell you when my body is clearly getting tired. I experience the most bone and muscle pain when I am exhausted or have not drank enough water over a few days. \n\nI am 31 and also pretty healthy and fit other than the CML. I really understand the frustration. It is by far, my least favorite side effect. Hot showers or a heating pad/electric blanket seem to help me the most. I have been on sprycel since October 2017, still get bone pain every so often, typically in my back/hip/leg. Sucks, but it is better then being stuck in the hospital or dying.", "Advice finding specialist May be a long shot but looking for a good physician hematology / oncology who specializes in CML. I am in the los Angeles downtown area. Any advice or resources in order to find a good doctor. My current doctor does not answer my question and visits are very short, always seems to be in a rush . Check out cedar Sinai. They have a CML specialist on staff and he is amazing about answering questions and alleviating concerns.", "Omicron Persei 8 - Merry Christmas TL:DR my family are being jerks about covid and cancer \n\nI have 3 Pfizer covid shots and am doing quite well with all my blood levels but I am really scared of getting covid. I have asked that we take the at home rapid tests day of, try to limit exposure, and not invite a bunch of random outsiders (we live in a tourist town and often have a house full of folks that do not have families in town). Apparently, that is too big of an ask and I need to “get over it.” My uncle unloaded on me today about how I go to the store and to get my eyelashes and brows done, so how dare I ask people to change their behavior for me. My mother in law told me that I needed to give it up and that I was being dramatic. \n\nI am feeling very heartbroken that my family is so oblivious to how scary covid is, how crazy this new spike is, and that I am still in active treatment.  I really thought I was being reasonable with my asks. I spent so much time and money getting them all thoughtful gifts and I honestly want to throw them all away. I missed Christmas last year and was so excited to see everyone. 💔\n\nOn top of it, I scuba dive and have to pass rigorous tests because of CML every year to keep diving. Covid could be devastating for me, even if it is a mild case. All I asked for were reasonable precautions we should be taking anyway, in my opinion. Anyway, I figured you all might understand my frustration, I might end up with a “cough” tomorrow and skip the whole weekend. \n\nI hope every has a merry Christmas if you celebrate, I hope we all have a happy and healthy(ish) New Year. \n\nEnd rant.", "I have got alot less patience these days ", "A newcomer: My father, 71, was recently diagnosed. Is there anything I can do? Although he lives 3,000 miles away, I am wondering if there is anything I should know. \nThanks  3,000.0 miles ≈ 4,828.0 kilometres ^(1 mile ≈ 1.61km)\n\n\n\n^(I am a bot. Downvote to remove.) \n\n_____\n\n  ^| ^( ^| ^( ^| ^( ^| ^( ^| ^( ^|", "STUDY ON CANCER TREATMENT IN SINGAPORE Hey,\n\nI am looking to have a discussion with any cancer survivors or their care givers who have traveled to Singapore for Leukemia or Lymphoma treatment.\nIt will be a paid discussion (100 USD) as it is for a research study.\nIf anyone is interested please do contact me on ", "What TKI are you on and what has your experience been like? I am trying to learn more about different TKI options and people's experience with them.  I have found some posts here and there scattered between this CML forum and the main Leukemia one.  But it would be great to have a one-stop spot for TKI information and experiences.   \n\nMy partner's stats are: 28f and 350k WBC at diagnosis, Ph+ CML, initially started hydrea (hydroxyurea), and is now on Sprycel (Dasatinib) 100 mg.  Side effects experienced include but not limited to: fatigue  (I feel like I could write a book on the topic of side effects, but will hold off going into more detail to see if this thread catches any traction first.)\n\nLet me know what you all think! \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n( I was diagnosed July 2019 at the age of 31m. My WBC was around 35k. They started me on Imatinib which got my numbers and spleen back to normal, except for my platelets which kept dropping. They then switched me to Bosutinib to see if that would help with platelets which it did not. Also, my BCR-ABL1 numbers were not dropping like they should which is also why they switched me to Bosutinib. The switch in TKI did not work so in March of 2020 I had a bone marrow transplant which got rid of the CML, but I am still recovering from that. As a preventative measure they had me start Ponatinib. My current BCR-ABL1 is 0.000%, so it is working!\n\nAs for side effects, when I was on Imatinib and Bosulif I would get a very mild, hardly worth mentioning stomach ache, but nothing really more. I did throw up twice in the first month of taking Imatinib. No side effects this far.\n\nEdit: I voted “Other” Diagnosed 10 years ago this month. Am 42. Started with 400mg of gleevec. Tolerance of the side effects is good. Needed to get bumped up to 600 mg and reached MMR really quickly. Have since plateaued and likely will not reach CMR, but all is good. My oncologist and I are happy with this 400 mg imatinib (Teva brand) for 3 years. I have almost no side effects accept I think I am more tired than I should be but then I am about to turn 55 so maybe that is it. Oh, also have the puffy eyes thing a lot of people have but I do not care about that kind of thing. \n\nIt is been a slow process but I am getting closer and closer to undetectable. Diagnosed a few months ago at 31, been on gleevec but likely switching to Sprycel in a few weeks due to side effects of gleevec. First month was bone pain that left me unable to walk for a week, now it is a myriad of stomach issues, brain fog and fatigue. Bosulif made me break out in a full body rash and I was so nauseated all the time. Could not keep any food down. That happened within the first week or week and a half on it. \nTasigna caused severe muscle pain and fatigue, which is could deal with mostly. But it also caused issues with pancreatitis. Had it four times I think\nI am on sprycel now and it is ok. I feel like I get mood swings on it and bad headaches. Diagnosed July 2019, 38f. I take 100mg Sprycel. The first 2 months I suffered from bad headaches and debilitating fatigue. The kind of fatigue that could not even get better by sleeping 14 hours a day and taking two naps. I started working from home before it was cool because I did not have enough energy to go to the office every day. The fatigue got a bit better after a while but I still never felt 100%. Maybe 90% on a good day but 80% most days. My brain feels like it is full of cotton until I get some exercise. I woke up with a very puffy face every day and the skin on my face would break out in eczema. \nMy numbers went from 100% to 0.81% after 3 months then 0.0037% after a year so it is incredibly effective. \n3 months ago I cut down to a half dose (50mg) and felt amazing! I had so much energy and very few side effects. Unfortunately my numbers went up slightly (0.0078%) so I am back on a full dose at least every other day. \nIt sounds counterintuitive but exercise helps with the side effects. Is clears out the cobwebs and gives me a boost of energy. \nThe drugs out there are amazing and we are so lucky they are available. When I am feeling low struggling with the side effects I remember it is better than not having the medication. \nGood luck to your partner. She is going to be just fine. My mom has been on dasatinib 100 mg daily for over 5 years. Make sure to watch out for side effects before it is too late. She developed severe bilateral pleural effusion that required drug discontinuation. For over 2 months she is still producing lots of fluid that required chest tubes. She will soon get a blood exam to determine new drug and treatment. Just replying to add that I spoke to my haematologist today and he is happy for me to stay on a half dose indefinitely! I may never achieve undetectable status, but if a half dose keeps it at bay and gives me a great quality of life that is a win! I am so pleased.", "Does anyone feel like they have a constant mild hangover? I have been on dasatinib for ~5 months and have been pretty much side effect free the whole time.\n\nFor the last three days I have had mild nausea and fatigue, nothing debilitating. Temperature is normal, took a rapid covid test and it was negative. \n\nI know this is a common side effect for all TKIs, but is it alarming that it would happen out of the blue like this after 5 months?\n\nI do not see the hematologist for another 3 weeks, and I also do not know the results from my first PCR test at 3 months. I was told I would be called if there was anything out of the ordinary, and never received a call.", "Any Vets with CML? Other users recommend this community and others to post in for my husband.  He was recently diagnosed a month ago with CML and starts treatment this week with chemo orally. He is looking for support from other Vets as well. Thank you! USAF, '79-92.  Diagnosed in 2015.  Been on Nilotinib/Tasigna which recently became ineffective.  Been switched to Dasatinib/Sprycel.  My wife turned to a FB group which has been an occasion source of info (I do not do FB).  Hang in there. My husband starts Sprycel next week. I am worried about the side effects and pray he does well on it. I am trying to find people my husband could talk to for support especially other Vets. I appreciate it! US Army 1986-1996. Started Imatnib in March. Good luck to you all. Thank you! How are you doing? Blood counts are normal. I find out next week if the treatment is working. \n\nAs for the medication I seem to be doing ok from a side effect POV. Mild but tolerable nausea. Some changes to taste. That is good to hear! My husband goes back Aug 6th to get blood work done to find out how his blood count it. He is been on his medicine for 3 weeks. Just got my 3 months results and I am on track!  Good luck to your man! Awesome!!! That is wonderful to here!! Sending good vibes your way that you continue doing well on it! Thank you!", "Help with Paper Hi all! I was recently diagnosed with CML a month ago and was hoping to conduct an informational interview with someone who also has CML for one of my school papers. If this is not the right place to ask, I would appreciate any resources/support groups I could reach out to! TIA I have cml, I was diagnosed three years ago. What would you like to know? Hi, thank you so much for replying! Do you mind if I PM you tomorrow with a set amount of questions? Sure, go for it I have CML and would happy to help also. I was diagnosed about 2.5 years ago", "I decided with my oncologist yesterday to move forward with a bone marrow transplant, in about two months. Do any of you have any experience? What am I to expect? Anything I can do to prep or make my experience at all better? Any and all information/advice is welcome and helpful. Thanks in advance!  I would look for a Facebook group for these types of questions, this group is pretty quiet and Facebook has larger, more specific and active groups for support  I do not have any advice myself, but I wish you the best of luck. I would love here an update on how it all turned out. All the best. 🤞🏼🤞🏼 Good luck to you! All my best. I too would like to hear the outcome and how you are doing. I know this group is very quiet so I hope you find some advice in the link the other poster gave. Again good luck ! Thank you. I will do my best to try and remember to update. Thank you. I will do my best to try and remember to update. I will check it out. Thank you! Take care of yourself. That is the most important thing. Happy holidays. I hope you have a blessed one. I had a BMT nearly 20 years ago.  It was when Gleevec first came out and was not available for patients who were doing ok on Interferon, which I was.\n\nSome general things to think about, because chances are a lot has changed in 20 years.\n\n*  I got dressed in my own clothing each day.  I wanted to be sure that everyone saw me as a person, not just a patient.\n*  I tried to be the first one up on the unit, so that housekeeping would clean my room first.  I may sound like a crazy person here (I probably was), but I felt like in case they did not clean the water each time, I wanted to have the freshest water (OMG-typing this out really makes me feel like I was crazy).  I am sure they used clean water for everyone.  Do not get me started on the maintenance people that wanted to clean something in the ceiling.  I was like, nope, not happening in my room.  No telling what is going to drop from the ceiling into my room.  You are just SO immunocompromised.  Advocate for yourself.\n* I am not sure if/how much chemo you have had already, but at some point, your hair will mostly fall out.  I had them shave it off when it was falling out, because the hair was EVERYWHERE.  I embraced this new look and felt like it was the absolute least thing I needed to worry about at this time.\n* You and some family members might think that since you have all of this down time in the hospital that you will finally be able to read a book, get caught up on a Netflix series, etc.  But, I found that I could not concentrate for any amount of time.  I could chat with people, read a short article in the newspaper, but nothing much more than that.\n* I took a LOT of walks.  Every day, several times a day.  I just wanted to feel normal.  On my unit, there were also kids.  I befriended one little boy and we would walk to each other's rooms and \"pick each other up\" for a walk.  He might stop to puke in his bucket, then we would continue on our way.  So, take lots of walks, meet other patients.  They might not be there the same length of time as you, might be more/less sick than you, but it passes the time and is good for the soul.\n* When I walked alone, I had a mantra.  I think it was something like, I am getting better, my body is healing, I am happy.  I said it literally thousands of times to myself.  It felt meditative as I walked around.  Keeping a positive attitude is so important, even when things get difficult.  \n* Best of luck to you on your BMT journey.  Please keep us updated on your progress. On more thing....if you like sports, you might be there for the NCAA tournament.  No better time to get to watch a ton of basketball games day and night!  Fill out lots of brackets/get into some bracket pools and it might help pass the time! This is all great advice! Thanks so much! I will try to put it into practice. I was hoping to work remotely a little in the hospital, but if my experience is like yours I will not feel up to it. But we will see.  And glad you are doing well 20 years after BMT! I will try to keep you all updated.", "Costs of gleevec or generic of imatinibum what is the cost of Imatinibum in USA? Is there any insurance that covers the cost of treatment? I have SelectHealth (Utah) that covered it after my deductible. Plus the company that makes imatinib wrote off my portion of the deductible so I did not have to pay anything. The cost differs depending on your insurance negotiated price. Last I checked (2017) the standard dosing schedule costs about $180k for Gleevec and the generic is not that much better, like $140k? \n\nThe bulk of the cost will be absorbed by insurance and you would only be eligible for their copay assistance program if you have commercial insurance anyways.", "Personal Trainer Loves Anal With Asian Wife - Kaylani Lei ", "Fascinating article on the price of CML treatment drugs and what is driving their cost. (Also full of interesting facts about the disease.) ", "BOOKᕀFREE \"Fire from Heaven by Mary Renault\" iBooks fb2 cheap mp3 flibusta how download authors 27109", "Boyfriend (22) got CML Hey, my boyfriend got the diagnosis CML three weeks ago. It was a shock because he was still looking healthy and it was just a conicidence it was discovered.\nThe blood values are quite good now because he got Imantinib. Has someone experiences with this drug?\nI just want to ask for one who I can talk to, who had a similar situation.\nHow is your life with this illness? As a sick one or a relative...\nWe are just a young couple (20+22 years old) and do not know how life will go on now...\n\nTHANKS already for your answers!\n\nLove,\nBavarianHistorian My CML story is quite different. I will say that the outlook for CML patients is outstanding. The treatments are highly effective -- often with minimal side effects or less.\n\nIt is \"cancer\" but I encourage you to not be intimidated by that word. Hi!\n\nSorry to hear...\n\nI was diagnosed in 2014 (at the age of 32). I have taken imatinib as my first treatment for CML. But later on (4 years) i have switched to dasatinib because the side-effects were to severe (imo). Gotten cramps, diarhea, painfull joints... Just not a good feeling at all. \n\nAfter the switch to dasatinib  all of those side-effects were gone.\n\nNow, seven years since diagnose, i am enjoying life as before. No problems with the CML here, other then having to checkups every 3 months. \n\nJust this april i was diagnosed with Lymphoma. Another type of cancer, but this time in the lymph nodes. Having dealt with CML i feel i can take this head-on, and beat it. Just positivity on my end!\n\nLiving in the Netherlands i am happy healthcare is quite good, so there is no problem for me obtaining those expensive medications.\n\n&amp;#x200B;\n\nI would say, chin up! There is a good chance that he would be living his life more or less like everyone else! Hi!\n\nI was 21 and entering 3rd year of uni when I got diagnosed. It was shear coincidence that we even found out. My doc suspected something was off and recommended I get a blood count done which was a great call. My GP interpreted the blood reports and referred me to an oncologist/hematologist. \n\nAt the time I had no idea what it was or whether my life was running on a timer. My GP and my research online seemed to suggest it was not something life threatening if caught at the right time but I had no idea what that meant or if I was safe or not.\n\nEventually checked with my oncologist, went over all my concerns, got all my tests done, and started Nilotinib (Tasigna). \n\nI was told about the blood count milestones, the bone marrow milestones and the blood BCR-ABL milestones (monthly, bi-yearly, yearly etc). \n\nFor the first month I didnt tell anyone about it. Not friends, not my girlfriend. The only person in my family who was there with me was my mom and that is about it.\n\nOnce I knew what to expect, I was more at ease with myself and told my loved ones after we would confirmed I was safe.\n\nThere were some minor side effects along the way including rashes and itching, sensitivity to allergens, fatigue and slowed hair growth(and some minor hair fall).\n\nI, unfortunately, also had type 1 diabetes which meant my vision and glycemic control took a big hit from CML which is a whole full length novel in itself but I will not get into the details. Otherwise, nothing too bad from the meds themselves.\n\n3 years in and I have hit all my milestones for CML recovery and docs say I might be eligible to try treatment-free remission (taking me off my meds). There is a roughly 40-50% chance of achieving treatment-free remission which means there is a small chance you might not need to take meds throughout. But that is something to consider once you are a few years down the line. Thanks a lot! Why is your CML story so different? Or better: how is your CML story? Thanks a lot for your answer! It is good for us to read some lifestorys of people with CML.\nI wish you good luck also with the Lymphoma, you will make that! Wow, what a story! What a big burden you had, having noone told about it except your mother.\nDo you want to take you off your meds? I have heard there is a risk that the illness comes worse back.\nYou are also so young. What about your desire to have children? You wrote: \"I just want to ask for one who I can talk to, who had a similar situation.\" So I noted that my story is different in the sense that I am not \"in a similar situation\" so I am not one who you \"can talk to\" in that sense but I felt like sharing a positive message anyway.\n\nI am much older; my diagnosis was seven years ago; and I was on a different medication until recently when I had to stop taking it. I was very happy about your positive message, so thanks! Thank you for the kind words.\n\nAs far as recurrence goes, it is heavily monitored. If signs begin to show of the mutated cells returning, measures are taken immediately. I would definitely like to know of I can achieve treatment-free remission. If I do not, then I am talking my meds anyway, might as well know that it is not in vain.\n\nChildren can be had by halting treatment temporarily. Your oncologist will guide you through the process once they deem you fit to stop treatment and have children. DO NOT under any circumstances stop your treatment unless your doctor explicitly instructs you to. On your last question - From the handful of pamphlets and books I have received from my hematologist, fertility in men is not really affected by imatinib or other TKIs. I have not googled for any studies on this.\n\n For women TKIs can affect pregnancy, but I read there are different treatment protocols that can be followed (going off TKIs) to have a successful pregnancy I was also 22 at diagnosis a year ago, I was in my senior year of uni. Being diagnosed so young feels surreal, but it is also awesome to have so many medication options. I am on Sprycel and have been doing great. Feel free to pm if needed!", "TKI withdrawal syndrome It had not occurred to me that stopping Sprycel would involve withdrawal issues. (Embarrassed that I did not consider it.)\n\nI stopped taking Sprycel at the end of August. I had the same exercise routine for months and months. Suddenly in September my joints and muscles hurt quite a bit. Could not figure it out. Could not be the exercise. Then I happened to discover that this is a symptom of TKI withdrawal.\n\nAnybody else have experience with this to share? Hi. Sorry to hear you are going through that. I do not have experience to share but I assume it is normal. People experience with withdraw symptoms from withdrawing from minor things like foods, coffee, etc. I know coming off of anti depressants people experience withdrawal. I assume the body will adjust, like it always does! I heard about this too. I experienced it when I went off Tasigna. I was told to take Claritin every day to help with the muscle pains (weird but everyone seems to agree it helps). Claritin? That is odd. Thanks for the tip. Thanks. I cannot complain. Grateful that the meds worked. Grateful that I may be able to get off the meds. Body aches and pain are a small price to pay. How long were you on the TKIs for? Congrats on reaching this milestone! 7 years.\n\nIt was less of a milestone than an issue with side effects. I had serious effusions -- pericardial and pleural. No choice but to stop. Regardless I am glad I have the opportunity to see if I can do without the meds. Just curious - did you try a reduced dose before stopping all together? I did not. I accepted the doctor's guidance which was to stop immediately, which began during my week in the hospital. I have heard of dosages being reduced after effusions, however 7 yrs is the usual time range to attempt TFR. Good luck to you!!\n\nI have been on Sprycel for three weeks and effusions have been in the back of my mind since. I believe I did read a study showong that those that have plural effusions are more likely to reach a deep molecular response. Thank you for the well wishes.\n\nI had heard of reduced dosages too.\n\nPerhaps I should have been more cognizant of side effects like effusions. I hope you do not worry about effusions. Please take this carefully as I am not a doctor but one very easy way I should have noticed the effusions was shortness of breath. This was on and off but obvious for a while. Since I was not mindful of the effusion issue, I did not realize the shortness of breath likely pointed to it.  Anyway it seems that shortness of breath would be an obvious indicator so there is nothing to be concerned about unless you notice that, right? (Again, I am not a doctor.) A simple x-ray can show the lung issue, which could be a pleural effusion. (In my case, I had a new PCP so she thought I merely had pneumonia. In retrospect, we both should have considered effusions.)\n\nGood luck. Sprycel will probably be wonderful for you. It is for many, many people and was for me for 7 years. Thank you! \n\nMy doctor mentioned this side effect almost in passing. I can see how it would be easy for you to not give much thought to your shortness of breath, especially seven years later. \n\nIve received the drugs free for the first two months from the drug manufacturer while things are worked out with my insurance company. I hope to be able to get it, even with more chances of side effects. \n\n I read studies that show dasatinib provides a quicker and deeper response, and better chances at success of treatment free remission when compared to imatinib/gleevec. Best of luck!", "Recently Diagnosed Hi everyone. I have been diagnosed with CML and been on medication for 3 weeks now I am on Asciminib. I have signed off on a 5 year trial with this drug. \nI live in Melbourne Australia. I am 30 years old and abseil/painter by trade. I am fit and go to the gym regularly. I am a man of faith. \n('I will restore health to you. And heal your wounds says the Lord' -Jerimiah 30:17)\nI honestly believe deep in my soul that I am going to blow away the doctors and my friends and family with my healing. Jesus has already won the victory for us by dying on the cross. \nI understand if some of you will not have the faith part but for me. It has helped me immensely.\nOne thing I encourage for you all and what I have found is do not feel sorry for yourself or when loved ones try and bring that energy tell them do not. Instead of asking for sympathy ask for strength. Be around people that already believe you are healed. \n I am thinking about making a Facebook/YouTube channel on my recovery and what I am doing. \n\n\nI pray for healing and strength for everyone on this page. Have a blessed day everyone. What side effects did they caution you about with Asciminib? No cautions. They did give a list of possible side effects. The only one I have noticed is a little bit of a sore stomach. Like a stitch feeling. The doctor has told me this is the spleen getting smaller which it has. It is not a strong stitch feeling it is quiet mild Best of luck to you mate. My hematologists suspects that I have CML, however I am still waiting for results from my biopsy. I am around the same age as you, curious what symptoms you had at the time of your diagnosis? Before I knew I had it. I had mild headaches and mild night sweats. What I would say is that when they said I had it. I started looking more for signs of CML. \nRight now a month after being diagnosed. I feel good now. I have worked out at my home gym as usual against doctors orders and I know that I am getting better because fatigue is getting less and less. Good on you for getting that checked out. Many may ignore those symptoms. If you do not mind me asking what was your white cell count at diagnosis? Mine was 320k initially, but again I am still waiting for my biopsy results. Hey mate. My white blood cell count was 180k. Just curious what do you do for a living? Have you dealt with chemicals for a pro long period in your life? \nI had a bone marrow biopsy done as well. They said I  am in the chronic phase. All the best for you and your  journey. Thanks, I am an engineer. No prolonged exposure to chemicals. I grew up in a rural farming  area and while I would bet the stuff sprayed on the fields is not healthy for you, I have not read there is a link between any of that and CML. What I have found is a chemical called benzene. Any pro long exposure to this chemical may cause leukaemia. You will very likely get your disease under control and be back to your normal life. Check my history, I just posted a 10 years experience of dealing with CML. Awesome story. I have read your story. All the best for your future", "Weight and Weight Gainer while Fighting CML Hey Everyone,\n\nMy significant other was diagnosed with CML recently (just a few days ago \\~415,000 WBC).  She has lost a lot of weight (approx. 20 lbs) from what we would consider her normal weight.  I was able to briefly ask the doctor if it is alright if we try to make her gain weight and the doctor agreed that it would be OK.  I was afraid of feeding the disease, but I was happy to hear that getting her back up to weight would be a good thing.\n\nSo! My question is - does anyone here have experience with gaining weight while fighting leukemia?  Did your doctors and nutritionists agree that weight gain is a good option?  I think I am going to get her some weight gainer powder (we love making smoothies) and maybe some Ensure shakes, or a similar brand.  What do you all think?  Could you share your insights and experiences?\n\nThanks.  \n\nPS - I am going to post this also in the Leukemia subreddit.  I hope that is alright :) When my mom first got diagnosed with CML, she had lost about 20 pounds unexpectedly and that was what tipped her off to something wrong. Her doctor told her to gain weight so she just started eating all the things she wanted like cookies, chips, and Nutella. Visiting her house was awesome. 😂 She is back up to her normal weight now. I hope your girlfriend's treatment goes well. Peanut butter, ensure shakes and marijuana. I dropped from 115 to 87 now I am at 120 lbs.", "Bcr-Abl raised...meaning? So my husband has CML and was diagnosed in Oct 2017. He was put on Sprycel and his white blood cells were at a normal rate just two months later, so we had caught his CML early.\n\n This month his doctor called saying his BCR-Abl raised. He did not say how much yet but my husband emailed him since their next appointment is in three weeks. The doctor is having him retake his test incase it was a fluke. I hate this waiting game &amp; his doctor can be a bit vague.\n\nMy questions if you can help out are:\nWhat does this mean that BCR-Abl increased long term? Have you experienced this increase before? Even if your WBCs returned to normal?\n\nAlso.. There are not a lot of studies on male fertility with this Q...If you are a male with CML did you have kids ok naturally? I have endometriosis so it is really hard to tell how much of infertility is my endo or from his sprycel meds 🤔. I think we accidentally entered a ticket into the sh*tty chronic disease raffle.\n\nBest of luck for you on your own journey with CML or your loved one's journey!\n", "Pregnancy Advice Hi all \n\nWould appreciate some advice from the community on our situation. My wife was diagnosed with CML in May. She is supposed to start treatment on Gleevec on July 18. \n\nWe are considering freezing her eggs before she starts treatment on Gleevec. However a bit of complication - she is recovering from covid and her energy levels are very low. Her physical health is quite poor, she cannot even go to the grocery store. So I am extremely concerned about adding additional medical procedures into the mix before she starts Gleevec. She is recovering day by day and feeling better but I am concerned the fertility procedures will exhaust her and then she will start Gleevec and feel really bad. \n\nFor context, she is 31 and we want to have two children in the future. I am aware you cannot get pregnant while on TKI inhibitors. \n\nThank you CML community. Do you already have an egg retrieval scheduled? The process is somewhat more complicated than just freeze eggs tomorrow. She would need to go on fertility drugs under the guidance of a reproductive endocrinologist at the right time in her menstrual cycle, be monitored frequently and then have a retrieval scheduled based on how her follicles look. (I know this from going through fertility treatments. I do not have CML-my mom does). Overall, I would talk with her doctors about your concerns and see what their advice is to balance preserving her fertility with managing her CML. Good luck to you both. Hang in there, I was diagnosed 9 years ago and completed an egg retrieval prior to starting treatment thanks to theLivestrong Foundation. I had my daughter 5.5 yrs ago and did not end up using the eggs since we got pregnant quickly. However, it was a great safety net to ensure that we had a backup plan in place. The retrieval process did take several weeks but it was a recommended step by my oncologist so she was supportive of the delay in starting TKIs. It is uncomfortable and requires a number of appointments but it was worth it for us to know that kids would happen one way or another.", "My Journey with CML This is my first post to Reddit so sorry if it is out of format or anything. Im currently 17 years old and have had cml for a 4 years. I used to be on Gleevec but now i have the privilege to be in a clinical trial where I have come off of it. I came here looking for others that I can talk to. If you want please leave a comment and message me so I can meet you all. On Tasigna for 2 years. I am in my 30s and was diagnosed about 3 years ago. Very advanced at my diagnosis so maybe had it for 4 plus years. \n17 years old and had it for 4 years already?That is the youngest I have heard but I am not that knowledgeable about those stats. Glad you get to take a break or to stop for good. Hope you do really well off treatment. Congrats and prayer and happy thoughts your way. \nI have had bad luck with my side effects but great CML remission/ complete molecular response. We are hoping to just push through and deal with these issues until doc says I can go off treatment in a few years. So happy for you and hoping we all get to eventually thrive off TKI treatments. Im 29 and have had CML for 2 years. I am on Tasigna. Being in a developing country is really hard on people like me since the maintenance is really costly. But every time I go for a check-up my physician gives me encouragement that I can overcome this. I pray we all do. I am 20 and was diagnosed at 15 years old and I am currently on Gleevec. Feel free to message me anytime you want! 30 now, diagnosed at 25, been on Sprycel  100mg once daily the entire time Probably sick for 8 years now. On dankatinib for 5 years now. Gleevec made me super sick. I am all right now, havent reached complete molecular thing... I´m in my thirties and every now and then I get super depressed of about being sick, then get over it. From what I have heard doctors aim for the 5 year mark before taking patients off of meds. Sorry you had such bad side effects. Stay positive! I am super lucky to be in such a well developed area with some of the best cancer treatment centers. I hope everything goes well I appreciate it. So happy for you. Enjoy your break. The rest of us will get there someday. Keep your head up my messages are always open if you need some encouragement  How did Gleevec work for you? How have the side effects been staying on 100mg? I am literally on day one of my sprycel, or any meds, and am not feeling great. Honestly, mine have been super minimal, aside from the occasional odd achy bones, but that could just be me getting older. Exercise regularly once it is safe, eat right, and hopefully you will be fine. You have to exercise to help your body supplement your hemoglobin so you do not get tired easy, according to my oncologist. I went on a low carb diet high protein diet because I was weight lifting at the time, and honestly, even after cancer, that was probably the best shape I have ever been in. Life has turned out well for me. I am 30 now, I am married, and I just bought a house. Things I thought out of reach when I first got diagnosed. It gets better. Also, what worked for me (Sprycel) may not work for you. People respond differently to different meds. That said, I believe Sprycel is one of the newer generations of TKIs, and should have less side effecfs than older ones, but like I said, everyone is different. It is been good stunted growth among other side effects have really messed up my sports though Gleevec has been a miracle drug for me. I am so thankful for it. A true blessing. I am glad it worked for you :) hi OP! i am 19 years old and was diagnosed 4 months ago. i am on sprycel and responding very well to it, but it is still a relatively new thing in my life and i have been struggling with depression because of it. with the rarity of cml in younger people, a diagnosis like this can be extremely isolating. is there anything that is helped you get through those rough patches? i hope you are doing well and i am sending good vibes your way!! Doing the things I love like sports and video games definitely help me keep a positive outlook on all of it. Hope we can all eventually get rid of this! Hell yeah! Dude, that fucking rules. Im so glad you are getting to come off the meds! I hope everything works out great there!  \n\nI just turned 33 and was diagnosed back in February 2021. Been on Sprycel for going on 3 months now. (Just opened that 3rd bottle of chemo pills!) I want to get to the point where I can get on a lower dose in the future. These side effects are brutal.  Hope everything keeps going well, my messages are open if anyone at all wants to talk about CML or anything. This stuff is the worst and we got to stick together! Thanks for sharing! Hey there. I was diagnosed at 21 and took sprycel for 8+ years, and now I have stopped the treatment. Had no side effects.\n\nIt is tough after diagnostic but this disease is very treatable and very soon you will be back to your normal life. I just posted my story in this subreddit, if it can help.", "Weak Heart? Hello everyone\nMy Mom has been diagnosed with CML over 15 years ago and over the course of that time, she has been on gleevec, tasigna, and now Speycel. Over the course of that time, it is become harder for her to breathe, her Bp is erratic (high bp and low pulse), she runs out of breath even while sitting. Recently, she blacked out and fell on her face. Her cardiologist is concerned and has considered pacemaker as an potential option (he will try other options first). Has anyone experienced weakening of the heart due to CML?", "tasignia Hello ,\n\nI have a condition causing dopamine degeneration , cell damage that tasigna targets , doctors will not prescribe without a precise diagnosis , does anyone have access to this , could save my life . thank you", "BOOK┡DOWNLOAD \"The Time MachineThe Invisible Man by H.G. Wells\" no registration spanish wiki amazon for reader kindle ", "Fresh ink  Too right.", "BOOK ┝ READ \"The Duke and I by Julia Quinn\" book touch free portable ebay shop ", "COVID-19 Vaccine Has anyone in this subreddit taken the vaccine and if you did have you experienced any side effects ? Some CML patients on the Facebook group are getting it and report no side effects I have seen so far.\n\nThe CML foundation also (\n\nAll of that said, do your research and do what is best for you. Had Pfizer. No side effects. Had moderna no side effects", "BOOK┠FULL \"The Best of Saki by Saki\" price english how download purchase ipad amazon ebook ", "TASIGNA 150MG I am a 22 year old woman who was recently diagnosed in 2018 with Chronic myeloid leukemia. I have recently reached NDI (no disease indicated) &amp; I have several boxes of tasigna left over &amp; would love to send it to someone in need for way less than the price I paid for it to help someone get to where I am. Please pm for me info &amp; proof. This is not a good idea. Against the law in the US. Try donating to a leukemia foundation or contact Novartis. Yeah and it may not be the right amount chemo", "Ph+, Tasigna: looking to see if anyone has had strange symptoms and any pertinent info Just recently have had some strange and concerning symptoms/side affects (unconfirmed currently) after taking my meds (300 mg). About 1.5-2 hrs after start to get light headed and feel a weird significant suppression of automatic breathing (normally you will breathe more when exercising etc., but in this case the 'default' body breathing rate is significantly lowered no matter the activity). Almost feels tiring to breathe. Had occasional tremors when lying in bed, as well as poorer circulation (cold feet etc.). I am plenty hydrated when taking the meds and afterwards (3+ glasses of water). Symptoms lasted for a few hours but hard to determine exact length till I get a larger dataset.\n\nOne thing I did notice is that the phenomena tends to have less apparent severity if I am active/doing things physically as opposed to reclining/laying down (less dizziness etc.). First happened a couple days ago and of course let my specialist know. Had some tests ran but nothing conclusive so am back on medication for the meantime. I have recently (within the past 10 days) gotten my second Covid-19 vaccine dose (Pfizer).\n\nMainly just trying to see if these kinds of symptoms have happened to anyone else, and if so, if their medical team managed to find anything out about cause and potential prevention. I am actually not much of an help. But maybe it will give you some direction. The first 15 months after diagnosis I was taking Imatinib 100mg. From day 2 I would wake up feeling cold. According to my hematologist I could not be the medication, because that side effect was not known. Blood research was done for my thyroid, but nothing was found. \nI actually hated my live. Except during the summer months, about 3 months, I would wake up normal. I often complained to my hematologist, but still I got the same response. After 14 months I had it. Every day I would wake up cold around 05:30 in the morning. I barely slept. Eventually I called him up and told him I wanted to quit medication. I month later I started using Dasatinib and lo and behold. No more frickin’ coldness and normal sleep.\n\nI am now on 50mg of Dasatinib and I noticed I had side effects with my 2nd and 3rd shot of Moderna for about 2 weeks. But, in both cases they started one week after the shot. According to the doctors, this is not known to them. \nI also noticed my circulation is poorer with Dasatinib. My feet were already cold, but it became worse with Dasatinib. This winter I discovered Reynaud in my fingers. I try to avoid smoke and bbq’s, because they both seem trigger some kind of asthma.", "Weight gain on bosutinib? Hey all,\nJust wondering if anyone else on these TKI's, bosutinib especially, have been experiencing any weight gain. I had a sleeve gastrectomy 6 years ago and since diagnosis and starting treatment last April I have put on 40lbs. Even with a smaller stomach it has seemed impossible to lose any weight.", "Been having breakdowns frequently sin e diagnosis a few weeks back how do you all cope???? Little background I am 34/m was diagnosed with CML  a few weeks ago been to oncologist/hematologist started Sprycel 3 days ago. I have quit smoking changed my diet and also have a new healthier daily routine. I have changed everything since my diagnosis to fight as hard as I can and do all I can to give mmeds the best shot. The fear of the unknown has been hitting me hard and I have been breaking down daily and having bad anxiety attacks. This is very hard for me since I am used to being  the heavy lifting tough guy and no I am told I need to be careful as my spleen is fairly swollen.. It is almost like my world is turned upside down. How do you all cope? What are some good guide rules to set for myself and so on and how do you all keep your shit together pardon my language??? I have delved more into faith but my mind still fights me always ending with me in my head and an anxiety attack on the way...", "A place to talk if you have cancer Hey everyone,\nI want to talk about an app called stupid cancer. It is a great place to meet and talk with other people with your cancer. It is incredibly helpful to feel like your not alone. Having someone who has gone through or is going through what your dealing with...it makes a world of a difference. The app is free.", "Wife’s First Appointment results (36 days on Gleevec) My wife had her first appointment with her hematologist-oncologist today. She has been on Gleevec for 36 days. They did not provide molecular results today but her hematologic results were positive. Her wbc was 4.1. That is the first time I have seen her wbc in the normal range since this all began about 9 months ago. I think that is good, right?! Just wanted to share! That is good to hear! My husband is on Sprycel and been on it for over a month. We found out June 3rd he has CML. So far his wbc looks good too. I send lots of love your way to you and your wife! Good. It can take a while to get to Major Molecular Response so take it slow (and BCR-ABL1 protein can increase randomly sometimes so do not get too panicked if so).", "Vanderbilt Research Survey: Understanding fertility and sexual health care needs after CML  Our team at the Vanderbilt-Ingram Cancer Center is working to improve reproductive health care needs for individuals younger than age 50 at cancer diagnosis.\n\n**If you were diagnosed with cancer between ages 18 and 49, please share your experiences in a** **confidential**, 30-minute online survey to help us learn more about how cancer and its treatments may impact reproductive health, here: (\n\nWith the Reproductive Health After Cancer Diagnosis and Treatment (REACT) Study, we hope to gather valuable information from individuals like you that will help us to better understand the highest needs and concerns are related to reproductive health—specifically for individuals diagnosed with a cancer before age 50.\n\n", "1 year off treatment! After 3 years on Gleevec I was cleared for a medical trial that allowed me to come off of it. Today is 1 year undetected and off treatment. It gets better everyone just hang in there!", "Wife Recently Diagnosed - Few questions about WBC Hello \n\nWithout going into a terrible amount of detail My wife has had persistently high WBC for 7 months. It has fluctuated from 14 to 12 to 20 to 27 to 12. Last week she registered an all time high of 27 and a week later she registered 12. We did every test ever and the doctor eventually suspected CML. \n\nA blood test came back positive for the BCR/ABL1 - karotype is pending. \n\nSo We had a bone marrow biopsy performed confirming 1% blasts, mild left shift, and 3% promelocytes. There is no evidence of fibrosis. The lab said it is consistent with CML. \n\nWe are meeting with our doctor next week who wants to start her on Sprycel. \n\nI am a little confused how her WBC can fluctuate so much in the span of a week though. Is this consistent with CML? She is not receiving any treatment yet. And I am sure CML is much more complicated than simply observing WBC. \n\nI should also note she recently had covid and made a full recovery minus developing POTS. \n\nThank you all! My best guess is that you caught it in the early stages. I am in no way a professional though so take that with a grain of salt. When I was diagnosed, my wbc was around her levels but mine were continually moving up. I am also on spyrcel and it worked wonders for me. Thank you for your reply. I appreciate it. We have not connected yet with the CML community and have no one to speak with except our doctor so thank you. Check out an app called GRYT. It is a community of cancer survivors and they have daily talks and groups to chat in. Also, get in touch the Leukemia and Lymphoma society. They have a ton of great resources as well. Not as familiar with the units you are using but that does not seem too high at least, so you have a healthy body to start from (instead of having to take hydroxyurea or something to dip them first in an emergency before you start the main meds). Yeah the average reference range is 4.0-11.0 X 10E9/L I believe. If that helps. Yea I am familiar with those numbers since that is also the typical average range my results are supposed to come in but did not want to assume. So the reason the WBC is high in the first place is because they are malformed, immature WBC. That is why they do not work well to defend against infections. It is also why once on sprycel (ideally) the counts go back to normal because the cells are matured correctly.\n\nIn general WBC count can fluctuate hourly which is why a normal range is between 4.5-11. It changes based on if your body if fighting something off as well as many many other factors that I do not recall/know.\n\nThat said, if someone has CML and gets something the body sees as hazardous it will start pumping out those immature WBCs and keep pumping them out because they are not working. Also CML and other blood disorders just generally fuck with your levels in weird ways.\n\n(\n\n(\n\n&amp;#x200B;\n\nedit: I think my wife's were regularly high but she has other respiratory issues so that contributed for sure. Thank you!", "Nilotinib-Induced Keratosis Pilaris with eyebrow thinning Been on Tasigna (nilotinib) chemo pills since I was diagnosed with CML in aug 2018. And five months ago I noticed I have been getting rashes all over my body, itchy scalp, and my eyebrow hair was falling off. I could not figure out what the cause was. Finally brought myself to a dermatologist and they found it was keratosis Pilaris caused by my chemo.\n\nNot life threatening, but just annoying. How I could describe it, if a normal hair follicle is like a an ice cream cone (pore) and ice cream scoops are the hair. It is like the cone being filled with ice cubes. So it is just a clump of keratin. Apparently there is only like 8 confirmed cases. I joke I am the 9th. \n\nJust creating this post for awareness and if a tenth case pops up, you are not alone! No bueno! I am sorry you are going through that. I have been on dasatinib for about a month now and am always curious what the next side effect will be. Woah, is this side-effect supposed to be rare with nilotinib? I have been dealing with it for 2 years now\n\nGuess I really did win the lottery\n\nAny tips? /u/swifferhash Oh yea supposed to be rare. Check it out with your oncologist, they may want to switch medications with you. My dermatologist recommended psoriasis cream to help with the rashes. Cerave is the brand. You can get it at like any Walgreens. I have also been applying minoxidil and castor oil on my eyebrows before bed to help stimulate follicle regrowth. It will take like a month of consistency before you start seeing results. Good luck friend!", "What Were Your WBCs at Diagnosis? I was just diagnosed but feel I have has this since at least October 2018. In January 2019 I had a total hysterectomy but was back in the hospital 10 days later due to a abscess. I was on IV antibiotics but my WBC never came down to normal. It was 16 before the IV and it came down under 14 is all. A few months later I went to a hematologist because of those labs but he was not concerned because the WBC was not that high, although I also showed left-shifted neutrophils. \n\nThis year in March I went to my family dr who took blood to check my cholesterol and my WBC was 86.2! So many other markers were screwed up too. \n\nI went back to the hematologist who ordered a bone marrow biopsy. By then it was 92.4.\n\nBon3 marrow showed the Philadelphia chromosome abnormality.\n\nI have not started my Gleevec yet because my insurance is still arguing...\n\nOh, this is also my 3rd form of cancer. I had retinoblastoma at age 10 and lost an eye. And I had an aggressive skin cancer on the very top of my head at age 40 which I needed a skin graft and 30:days of radiation because it got into the bone - I can grow no hair there. Mine was 35. Mine was 150. Diagnosed aug 2018. Rocking a 4.12 right now.\n\nCrazy stuff. I am sorry for the pain you have gone through. Stay strong. I was diagnosed over 2 years ago with CML. I was getting more and more tired every day, losing weight, and dealing with night sweats. Finally my wife convinced me to get in with my doctors. I am pretty healthy and eat healthy. I am in my mid thirties and was going to the gym almost every day for at least cardio. \n\nWhen I had my initial blood work, my white blood count was around 170k. Doctors were amazed that I was still working and walking on my own. They started me on Tasigna and it has generally been a very positive experience. I had bouts of pancreatitis and severe insomnia, but the biggest adjustment has been that my energy levels never returned to pre diagnosis levels. I wake up and each day seems to be harder to get out of bed. I almost have to give myself a pep talk to get up and go to work. \n\nWhite blood count is normal and so is red blood count. I am still severely anemic and doctors are recommending iron infusions. They say that can only help with the energy levels. \n\nI have a good support system with my family. It is imperative to have positive people around you and those you can talk to when you are feeling like garbage. Unfortunately you will probably have bad days and bouts of depression where they didnt exist before. Stay positive and listen to your body. Those are rookie numbers. 450K peak. Hospitalized for nearly a week to reduce my enlarged spleen, reduce the WBC and watch for blood clots. Then it was daily visits and lab tests until it got below ~75K. Visits started spacing out from there. My husband just got his tentative diagnosis: last week, 47.3 and today 51.5. No symptoms, just a CBC test for a gout flare that identified the problem. 402k over here. Done to 8.5 now. Diagnosed December of 2019 That is crazy. Glad you got it under control. We are you deathly pale-yellow skinned? Not even a little bit! I had no idea I was sick. Just extra tired but that usually comes with night shifts and a toddler does not it? Went in for a routine eye exam and the optometrist noticed some spots in the backs on of my eyes which led to bloodwork and a diagnosis. Dangerously enlarged spleen. From bloodwork to treatment was a total of 6 days. Managing very well on nilotinib with no side effects. I am waiting for my biopsy to come back but my initial bloodwork was 160 and got as high as 196. Nice to see a lot of people at normal levels :) I was diagnosed yesterday and my wbc was at 514k. This is a strange thing to “win” at. I am a bit scared. The diagnosis is the first step to recovery!  Feeling scared is normal and valid, but I hope you take at least a little bit of comfort in the fact that you now know what is wrong and how to fight it.  Sending good thoughts your way. Very good point- i have felt a bit off for the past 10 months and was not sure why. Went to the doctor but they did not do a CBC. Thank you for your kind words and positive vibes ❤️ I am so sorry to hear! Take time to let it sink it. But the good thing is that this is highly treatable! I would be happy to answer any questions, though I have only been in this 4 months. I have done a lot of research Thank you for your kind words. I am trying to be gentle with myself and take things one day at a time. Thankfully my body is responding to the hydroxyurea and the count has decreased. I am anxious but I am also very hopeful. And i will definitely take you up on that once questions start rolling in- right now it is still a whirlwind as I am still in the hospital. I appreciate you very much ❤️ 368k at diagnosis. No trophies here but still a decent number. My initial wbc was 191, I did routine cbc because I was feeling tired and some low level fever, so the doctor was checking if it was dengue or covid-19.\n\nI am still adjusting to the situation and diagnosis.", "few questions x My family friend who is a GP has been pushing for me to go see more specialists and he scared me (not purposely i am just health anxious), into the possibility of CML, and I am such a hypochondriac but also really physically sick all the time and desperately wanting answers asap...\n\nCan you have CML with extremely low white cell count?? Ive seen many posts about patients who mostly have astoundingly high cell counts, as opposed to mine which are drastically low below the normal range. \n\nMy glands are swollen all the time, sometimes easily moveable and painful, others just swollen and hard, no pain. I am sick all the time, sore throat, blocked nose, just general feeling of malaise, not to forget the fatigue which is out of this world. It is not allergies, I have been checked for everything, had surgery on my nose to supposedly fix the issues, that was only temporary and now I am sick all the time.\n\nThey do not reckon I have an autoimmune disease (such as lupus), I tested negative to most indicators except ANA.\n\nWhat have been your experiences with diagnosis and what were some of your first symptoms?\n\nI do not mean to take away from those of you who HAVE been diagnosed, from all the research I have done so far it sounds like an awful illness and J feel for everyone who has to live with it, you are amazing x Seems like it can be possible looking it up online. My own personal case presented with 38000 wbc and 2.8 million platelet count. I know I had a ton of fatigue and really bad swelling in my lower legs and feet and strange bruising from little or no contact. In chronic phase you may have no symptoms at all \n\nWish you luck and hopefully you get answers quickly I know how hard it is to not know or the fear that comes with hearing the leukemia word when talking to your doctor. Let me preface this by saying I am not a doctor or any sort of medical practitioner. But one of the trademarks of CML is a high WBC count or platelet count. There are also specific tests that can identify CML in an individual like the ( \n\nI have heard that low WBC count can be associated with ( but again, I am NOT a doctor. I would recommend more testing if that is possible. \n\nBest of luck to you, I sincerely hope you are able to find some answers.\n\nEdit to add: my WBC when I was diagnosed was 317000, I had fatigue and bruises all over body Yes, the CML standard is the presence of the Philadelphia chromosome.  \n\nMy husband was diagnosed only because he went to the doc for what was thought was a sore foot and the doc thought it was gout and did some blood work. The blood test came back with WBC of 47,000.  Just six months earlier, his WBC had been in the normal range.  The oncologist said gout can be a symptom: all that cell growth and breakdown of overgrown cells leaves excess uric acid in the bloodstream, hence, gout. He had zero other symptoms. The oncologist said that is quite common for CML: no symptoms until counts get extremely high. Hi, I had a platelet count of 3.9 million at one point, but was discovered at a 3.4 million platelet count. My other readings were elevated but not as insane.\nAt night my legs would feel so hot, like they were an electric blanket even in the middle of winter. I also used to bruise and have huge haematomas beneath my skin that took ages to go away. \nTiredness was also a huge factor. With extremely low cell count?  I am certainly no Dr., but I would really be interested to know how any health care professional would suggest a disease that causes the gross overproduction of white blood cells for someone with a below average count - especially one where the symptoms do not truly show until the disease progresses.   I was caught quite early and my WBC was over 30,000.  \n\nIf you have not already, go get your thyroid checked. I can tell you that I had none of the symptoms you are describing when I got diagnosed. And my blood was basically alphabet soup. They knew I had cancer just by looking at me. The only things I experienced  were nausea, and I very quickly got fatigued during physical exercise. And also one time both of my quads siezed up when I was dragging brush on a ranch. In retrospect all these things were signs that I attributed to other things.  My point is, the symptoms you are describing could match a myriad of different illnesses or nothing, and arent necessarily tied to a CML diagnosis.\n\nLow white cell count also doesnt seem like it would be related here but I could be wrong.\n\nCML is actually a very easy thing to test for! Its the first cancer gene they ever discovered. The test is quite definitive, and is done with a BCRABL blood test.", "You are not alone Hi, just discovered this sub and wanted to bring in some more activity to it.\n\nI am 28M.\n\nI was diagnosed with CML back in Aug 2018. I take Tasigna, a nilotinib. Chemotherapy by pill. As long as no relapses, I will continue to take it until 2021. Currently I am at 0.2% cancer detected. Shooting for remission by May! \n\nIt is been an arduous journey. I have had a lot of ups and downs and this has really affected my mental health. I have gotten low where I have had suicidal thoughts. I have persevered. I have stared into the eyes of God. I experienced survivors guilt, where I have recovered so speedily, why me? I have gone through trials and tribulations of hospital bills and Insurance stress.\n\nI am sure there is others out there that just want help, want answers, or just want someone to talk to. I am happy to be an open ear if anyone wants to share. You are not alone. I am also 28M, 29 in a couple weeks, diagnosed October 2016. On Sprycel 100mg. Keep your chin up! Whoa similar origin story. Have you been recovering well? How has it changed your life since before the cancer? Yeah, I have. I went into molecular remission in August with my blood test levels at .01%, and have my next appointment this upcoming Monday, where hopefully they will be the same or lower. My hope is to someday go off the medication, even if it is only for a couple years, so I can move somewhere else and resettle without having to worry about whether or not I have high quality health insurance and working a job I have no interest in just to stay alive. I got diagnosed on the ass end of 25, right before my mom's insurance could no longer cover me under the ACA (Insert unironic \"Thanks, Obama!\" here). \n  \n  From the get go, sprycel has been a good medication, with relatively few and minor side effects for me personally (bone pain, fatigue, hair loss ((though I am starting to think that is genetic)), and I have still been able to do all the activities I did prior to cancer. My vision has deteriorated drastically, which I have read COULD be a side effect of the medication, though I am not sure. My insurance of course is doing the bare minimum and has denied me the surgery I need to get my eyes stabilized and keep them from getting worse. Soon my left eye's vision will no longer be correctable (At which point, if it comes to pass, I am just going to Nick Fury it). \n  \n The biggest change is, I am now obscenely aware of how broken the American Healthcare system is, and I have grown to hate my country and a good portion of the selfish people in it. Growing up, I was not politically aware, and now, ironically, it is all I can see. I am aware of how I have next to no control, and how people like us are discarded in American Society unless they have money or \"Good\" Jobs with \"Good\" healthcare premiums. I work for a large international IT company, and every year our premiums get higher while our coverage gets smaller. I am also drastically underpaid compared to my peers, because I joined the company at a bad time, but raises have not been forthcoming because I have no degree, and now I have neither the time, the energy, nor the inclination to go back to school. (I have actually had people chastise me for this, saying single mom's find the time/energy to go to school and work full time. Can you imagine that? Can you imagine comparing being a single mom to having cancer? FFS!) Also, I refuse to pay for an overpriced BA, which is now the equivalent of a High School Diploma. (For any current college student reading this, seriously, shoot higher, nobody is fucking hiring BAs right now, my fiancee has a BA in relevant fields, but cannot get a job that pays more than $11 an hour,)\n   \nBut, ALL IS NOT LOST. Socialized medicine has taken center stage since 2016 thanks to Bernie Sanders and I think we may finally get healthcare as a right sometime within the next 5-10 years.\n    I have a wonderful, kind, smart, funny, and lovely fiancee whom I met in July 2018, to whom I \"came out\" about my cancer on our first date, and, to her credit, she did not run for the hills. We are getting married this July, and I am truly excited. \n   My contract with my employer was picked up for another year, so assuming I do not get laid off, I have gainful employment and health insurance until April 2021, which is fantastic, because we are still saving for our tiny, modest wedding.\n   If I can get off off my medication, and we can find a way to save money  to move across the country to somewhere less dreadful than Missouri, and buy or build a house, we plan to have babies within the next few years. If we cannot have our own, we will try to adopt. Either way, I plan to enjoy being a father, and give my future little ones every opportunity I was too unlucky to have. \n\nAll in all, if I could go back in time and change certain aspects of my life, I would not change a thing. Sure, I am more angry, disgruntled, and less tolerant of those with a less than compassionate view of the world, I am sure you know the type, (\"Fuck you, I got mine\"), but I think that just comes with the territory. \nBut CML has also made me a more self-aware, conscientious, and compassionate person, and helped me attempt to become a voice for the voiceless. I wait with bated breath, and watch with pride, as I see many other people in my country voice their disappointment and dissatisfaction with how broken it is. \n\nSimply put, for me, cancer changed everything, and ironically, it was for the better. Here is to hoping I continue to do well and live to see positive change through out my life, and I hope all of you get every opportunity to be happy, healthy, and thriving. Yooo thanks for that read man! Fantastic story and I am so happy for you and your fiancée.\n\nYa know I never thought about adopting. Never crossed my mind before cancer. But now, I am so open for it. I want daughters when I beat this. I want to be financial independent to care for them. I believe I was saved so I could save others. Maybe that means having kids and giving them a better life.\n\nI am glad you are able to say that cancer turned your life around. It helped me realize that we really do have a finite number of breaths on this earth.\n\nBut also, my eyes have been affected too. Aside from the muscle pain, constant headache, and fatigue, my eyes have like “early stage glaucoma” their intraocular pressure is like almost 40 when a normal persons is 15-20. I assume a side effect from the chemo. I hope things get better for us mate.  Thanks, and Hell yeah, leave the world better than you found it! \nAs for side effects, I have found that being physically active really helps with my general side effects. I am just getting back into it, I have gained a little relationship weight, but before I met my fiance, I was avid about doing my  weightlifting and light cardio to help me feel better, for both fatigue and my body pain. Soreness kind of becomes an old friend when you are active enough, it just really sucks when you are getting started. \n    I got diagnosed with keratoconus shortly after my cancer diagnosis, so my corneas are becoming misshapen.  It is especially bad in my left eye. Lights are blinding, especially when driving at night. It is gotten so bad, I do not drive in cities after dark anymore. It is like my eyes are seeing glare off of every bright light, which is beyond distracting. I need special gas permeable hybrid contact lenses to fill in the \"dents\" in my corneas, but I have to have this weird surgery called corneal crosslinking first. I was diagnosed in 2013. Imatinib, Nilotinib and now Dasatanib. My body cannot make up it is mind how it wants to tolerate Dasatanib - currently have a throbbing headache for example. But it is working and a lot easier to take than the Nilotinib. \n\nWhat I came here to say was thank you for offering an ear to people. I have never really been overly bothered by my diagnosis - I think largely because I have been able to shut it out of my mind. \n\n28/M/UK if anyone is curious. \n\n(Also - never thought I would use ASL again 😉) Lol my guy! I would love to help out and learn from my fellow fighters as much as I can. I just think life is funny sometimes and people can be brought together in the most interesting of ways. \n\nAnd that is interesting. Nilotinib would give me killer headaches but they have subsided. Any life lessons or words of wisdom you care to share that you learned from the last 7 years of your journey?\n\nAnd Florida guy over here! Man sorry about your eyes dude. And I feel ya on muscle fatigue. I get winded trying to run two miles, but slowly but surely I have had more energy than I have had in the past couple years so I am not complaining.\n\n\nBut a question I really want to ask is how did love work for you with those whole cancer thing? Like in my sense, dating has been hard. You go through the motions, and depressions. I have never felt anxiety like this before when it came to trying to form relationships. \n\nI never want to feel like a burden, I feel like having cancer comes with a special set of baggage. Or moreso, I just feel like milk that expires sooner than others that are cancer free. I digress, but would love to hear your love story and see how it can give hope to others and myself. I was just totally honest about my cancer. I told her on the first date, because it was not fair to make someone genuinely care about or even fall in love with me before I drop the C Bomb. She took it like a champ, and we had fun that night. I have never been worried about being a burden, because if we get married, and I get sick, and it looks like I might die, I will talk to her about it, and if she agrees to it, I will file for divorce so she is not burdened with my medical debt. I can still work, I make OK money, and I have decent health insurance, so it is more of a \"We will cross that bridge if we come to it\", ya know? The right person will not see you as a burden, either. Cancer is just something that happens in someone is life, like having abusive parents, or growing up in a community with a high crime rate. It shapes you to some extent, but you do not have to let it define you. “The right person will not see you as a burden.” That is what I needed to hear. Thanks man! Apologies for the late response. More of a lurker. \n\nMy main piece of advice would be to talk to your Doctor or nurse/other specialist. I have spend the better part of the last 7 years trying to be a good, quiet patient but lately I have been speaking up and being more honest. \n\nDespite never really feeling I was bothered by it I think it affects you more than you know I am 32 year old male in the US. Was diagnosed 3+ years ago at age 28. Been on Imatinib ever since and for the last two years I have not had any worse than 0.02%. Been lucky and have fluctuated between 0.0%-0.02% in the quarterly tests ever since. Dude congrats man! How long do you have to take imatinib for? What has it taught you about life? I am glad it did not affect your lifestyle as much. Do you feel like it is a prominent part of your identity? Or do you just reserve it for fun facts or when you are really getting to know someone? Not sure how long. I am really risk averse so as long as I stay at my job with good healthcare I would not mind staying on it forever as long as it keeps working. It is taught me how ridiculous the prescription prices are! Most of the time I forget I even have it. I try not to let it define who I am. \n\nI think most people tend to think you are on borrowed time when you tell them which can get a little tiring sometimes 😅 I cannot stand the prices. A month supply of Tasigna without insurance would be atleast $13k.\n\nI am glad good health has found you and continue to wish for it for you :) I would like to get to that point. I have only gotten to taste that feeling when I get really drunk, high, or fall in love. It is a high I will always be chasing. \n\nAnd that bothers me too. Dating is tough. I feel like expired milk sometimes. At the moment with everything going on it is more at the forefront of life. At the moment I feel like I am 75+ as everything aches so it is hard to forget about it. 29 Year old male Jacksonville Florida diagnosed back in August. WBC 300k+ Bruises weight loss random fevers. Put on Tasigna 400mg twice a day. Last appointment I was at 0.006 and that was 2 months ago hoping to be undetectable next appointment would really take some weight off the shoulders. Congrats man! i wish you the best of luck during your appointment! Im 24M also in Jax, diagnosed in 2013. i dont exactly remember my WBC count but i believe it was about 113k+. Imatnib for several years with a good response. was undetectable at one point &lt;0.001% then the very next appt jumped to 4.7%  then 7.1% (about where i started) over only about 6 months. Switched to Dasatinib and I felt like i was having severe withdrawls for about a week. Starting the night i switched medications i felt the worst i have ever in my life! Im currently sitting at 0.147% 3 years later.  Im hoping to reach undetectable again within my next couple appointments. We WILL get there, and we will STAY there! Hey man DM me would like to talk to you personally could use someone to help get through the bad day’s!", "Wife’s first check up since starting Gleevec Hi everyone \n\nNext week will be my wife’s first check up since starting on Gleevec. She has completed one month of the drug. They will be doing a lot of blood work but no bone marrow biopsy. In addition to the regular CBC, I believe they will be checking for the “molecular response” to the drug which I do not quite understand. Due to covid protocols, I will not be allowed in the doctors office with her. So I am a little nervous. For those out there who have been through this before, can you advise on the types of questions she should ask? I want to be prepared in advance. \n\nThank you to this community. My husband is on Sprycel, for over a year. His doc explained to us that every 3 months will be measurements of the molecular response, and every month a CBC test to double check on blood cells (at least for the first year or so).\n\nAfter one month, my husband’s CBC was normal (no overgrowth of white blood cells).  The first test for the chromosome status (% of Philadelphia chromosomes) set the basis for comparison and indicates the molecular response to the treatment. My husband had about 60% at his first chromosome test. Three months later it was down to 4% (that is more than a one log change—clearly a molecular response to the treatment: fewer of the mutated cells that cause CML). Three months after that he was down to 0.6% (nearly another one log change). And three months after than it was down to 0.2%.  We are hoping he gets down to under 0.1 for the next test. Doc hopes for a total of 4 log changes (which would be 100% to 10% to 1% to 0.1% to 0.01% and then maybe 0!) and if the 0 sticks for a year then the doc would consider taking him off the drug. \n\nMolecular response is not fast though White blood cell count will hopefully have responded within a month. \n\nAsk the doc if he expects any molecular response at the first month (I bet he does not and is just using this test as a baseline unless he had already run a similar test). \n\nAsk the doc what the CBC looks like. \n\nAsk the doc what your wife should watch out for in terms of side effects.\n\nWe kept a notebook and jotted down the questions. We often repeated the same questions; doc was quite tolerant. \n\nThe CBC is a huge indicator of current health. The Philadelphia chromosome test is an indicator of future risk. This is so so so helpful and such a simple explanation. I truly appreciate the time you took to explain. Best of luck to you and your husband in the future tests. And best of luck to you and your wife!\n\nA fascinating read that was helpful to us was the book “The Philadelphia Chromosome”. It told the story of the disease and the development of Gleevac. We found it very helpful. Also - sorry one more question - for measuring the molecular response is this the BCR-ABL1 test?  Or are they measuring the % of blasts. Just trying to interpret her current base line. BCR-ABL1 is the mutated gene on the Philadelphia chromosome that causes the disease. Gleevec and other TKIs prevent that gene from ‘operating’ —from transcribing proteins. \n\nThe BCR-ABL1 test measures the ratio of the mutated gene (BCR-ABL) to the normal gene (ABL).  And that test is indeed the molecular response. You want that number to go down over time (over months and years—do not expect an immediate drop to zero). \n\nIf I remember, for my husband, they did a separate initial test looking for blast cells, to see if he was in the accelerated phase of the disease (thankfully he was not) at the start.  The blast cell test is different from the molecular response test, I believe, but that would be a great question to ask your doc. \n\nIf you like science reading: \n\n\n\n\n Thank you so much for the explanation. I understand now. I recall that we were tipped off to the CML diagnosis when we did the BCR-ABL1 test but the ratio was never explained to me. I now get it. Thanks again! \n\nI have ordered the Philadelphia chromosome book and will start reading it tonight. Thanks again! The first link really explains things in detail with the logs. I really appreciate it.", "asciminib As I can no longer take dasatinib, I did a quick search on other CML meds. (I do not spend much time investigating CML or CML meds because I have great faith in my doctor.) Anyway I ran across asciminib, which seems new/new-ish. Anybody have any thoughts on this med?\n\nOne relevant link...\n\n May I ask how long you were on dasanib and why you had to go off? Just curious since I am on the same drug. Glad to talk about it.\n\nI was on it for 7 years. I had a serious reaction. Is it fair for me to link my recent details (below)? That seems easier and avoids duplication. (If you prefer that I restate it, let me know and I will.)\n\n That is perfect thank you for sharing. I think there is a lot of promising research on ascminib jsut not sure if it is available yet For you, being on dasatinib, let me add that I was thrilled with its effectiveness for me. It also seems to be a broadly great med overall so I would be optimistic with it working well for you. Please do not be discouraged by isolated reports (like mine) that show exceptions to that rule. I have had it for 3 years. Had really quick response the first 3 months(pcr .19). Took me a year to reach .1 and now jsut barely below .1. I was the rabbit that has turned into the turtle it seems. Great to have reached mmr but I am hoping for an even deeper response", "Roth Spots and Vision Issues Has anyone had Roth spots or vision issues leading to their diagnosis of CML?\n\nMy hematologist seems fairly certain that I have cml. I am awaiting my biopsy results. Wbc was 320k, down to 79k after two weeks of hydroxy urea.\n\nMy only symptom was blurred vision in the center of my right eye, and a small floater in my left eye. I ended up at a retina specialist who quickly sent me quickly to onc/hem. Both eyes had Roth spots and hemorrhages along with my Hugh wbc.\n\nUnfortunately I have had another hemorrhage two days ago in center of my left eye, which was previously compensating for my right eye. My central vision is very poor now. I am back to see the retina specialist in a few days. \n\nI noticed my right eye issues after a 5k run, and the more recent left eye issues after straining while working in my garage. I should probably take it easy..\n\nJust wondering if anyone else here has experienced anything similar. From what I have read they usually resolve once the underlying condition is treated. I am hoping this is the case for me. I have had plenty of floaters but I do not think its correlated for me. Did not have any weird eye things happen before mine. Yes, I had a Roth spot and significant haemoragging which caused floaters. I lost a lot of vision in the centre of my vision.\n\nVision did go back to normal after, but it took months rather than weeks. Unfortunatly the floaters did not go, which stands to reason really. Thanks, this is encouraging to me. I will be patient with it. My central vision is awful but I can watch TV fine  and use my phone with difficulty. Things could be worse! Mine was bad - I could not read a screen in front of me. So if I can get back from that, so will you! Thanks again! This is exactly how I was diagnosed. I went to my optometrist complaining of Roth spots in my left eye. He immediately sent me to the emergency room once he saw I was bleeding. How is your vision now? My eyes have improved quote a bit over the last  month, but I do still have blood over my retina. My vision was 20/200 or worse, now it is around 20/60. Less blurry and part of my left eye that was covered by a Roth spot is completely greyed out. I do not notice it though now unless the right eye is covered. My right eye is compensates. I got my diagnosis in January this year due to my optician (UK) sending me for blood tests. I had an appointment due to loss of vision in both eyes in the December of 2020, the right one in particular - she spotted burst blood vessels and done a scan to get a better look. I was started on Dasatinib in the January and my eyesight is back to normal - I am even learning to drive without needing glasses. \nSorry I am late to reply but just wanted to share and let you know my experience and that I hope your eyesight has improved. Thanks for the reply! My eyes have improved quote a bit over the past month. Not completely normal yet, but I understand it is a slow process for the blood to absorb. About how long did it take for your vision to become normal again? Around 6 months total for my eyesight to return, I have been on treatment 10 months now and everyday I am feeling better. Glad to hear that! Thanks again", "Accidentally consumed grapefruit while on Imatinib I have been on Imatinib for over a decade now and have yet to have any issues. Today, however, I drank a mixed juice; I could not tell while drinking but read afterward that it contains grapefruit. It is too late where I live to call my doctor so I thought I would check if anyone here knows whether the drug interaction is severe enough that I should attempt to throw up the juice? Sorry if that is a ridiculous question I am just not sure what to do here.", "FREE\\/BOOK \"The Bell Jar by Sylvia Plath\" android acquire macbook pocket format how to sale online reddit 91718", "Cancer life Hey everyone, I am Joshua, I just turned 33 and was diagnosed back in February 2021. Been on Sprycel for going on 3 months now. (Just opened that 3rd bottle of chemo pills!)\n\n\nJust wanted to pop in here, say who I was, and hopefully reach out to some of the great people here so I can try and build myself a tiny little support network of people we can all lean on each other Hey man I am new here and had a post similar to yours a couple of weeks ago. There are a lot of great people in here that are super nice. I hope your treatment goes well! If you have any questions my messages are always open. Right on man.  Thanks.  I am glad to hear that your treatment was going well enough to have your dose lower or removed! Thank you for sharing Joshua. Although I do not have CML, my wife does (diagnosed in May 2021). She has not had much motivation to join the CML community but I am trying to be active. I see a lot of people living normal lives. It is wonderful and reassuring. Best of luck to you and your treatment.  29yo female here with CML. I was on Sprycel only for a week and the side effects were unbearable for me. I am starting a lower dose in August. How did you find the medication? How long did it take you to adjust? \nThanks :) xx  Hey Josh, nice to meet you. I am a 29 y/o male. Been on sprycel since October of 2017. Welcome to the club my dude. Feel free to send me a message if you have any questions or just want to chat. Nice to meet you! My husband was just diagnosed last month. He starts his Chemo pills on Monday. Adjust? Whew. Its still the roughest thing I think I have done. The side effects are crazy but I trying my hardest to get through them and still be able to work since the Sprycel is having a great effect on my cancer. I do not want to mess with anything else. Ya know? Lol I am already on this and I am just gunna stay the course Sprycel since 2017? Wow. Glad you are doing better! Do the side effects get less crappy? Hey Josh! I am a 25yo male with CML. Been on Sprycel since I was diagnosed a year ago. Hardly have had any side effects at all and living a pretty much completely normal life now. Welcome to the club and I am sorry. This group is amazing about answering questions. My wife joined some Facebook groups and found those helpful as well. Tons of amazing folks sharing helpful advice and have been where you are. \nI am on sprycel now. I have been on a few over the last few years. Feel free to reach out for any questions about symptoms or side effects. Hi Joshua and thank you for sharing your story! My mom (61) was diagnosed with CML in 2006. It is been a rough road for her but she fights each day. She is on Sprycle as well for the last few years and the side effects are horrible. She was previously on Tasigna and Gleevec but they were not as effective. We are here to support you! :) I got used to them. I still get the occasional bone pain and bowel issues but other then that, it is gotten better haha.  Howdy Joshua.  I was on Nilotinib/Tasigna for 6 years, which recently became ineffective.  I have been switched to Dasatinib/Sprycel for a month now, and it seems to be doing the trick for me.  Like ElJefeDMD, my wife is on a FB support group, and a switch in meds is pretty common after several years, according to their members.  Minimal side effects so far....my feet have swollen, and are itchy as hell.  Hang in there. Adjust to the medication I meant. Sorry. \nMy oncologist said it would take a few months to adjust to it. When I had a trail run on it I was bed ridden, constantly nauseous and experiencing a lot of bone pain. Hey Joshua—sorry to connect in this way. I am 31 and was diagnosed with CML in July. I am starting treatment here soon and I am anxious about the side effects. Hoping to also follow along and get to know others on this journey. Hi Joshua, diagnosed in the acute stage of cml here in January this year. Here to say that I am now in MMR going from 55% to 0.05% just recently. If I continue going down the dr says I may even get to go treatment free in a couple of years. I am one of the lucky ones, I suffer very little side effects. I have numb toes on one foot and a bit of fluid retention in my legs, but that is about it. \n\nIt was not always this easy though. The beginning of my journey was horrible. Hospital stays, and I was also on hydrea for some time because my platelets were so high I could have had a heart attack (to put it in perspective, most people's platelets are at 150,000 and mine were 3,900,000 making my blood thick). Now, people can hardly believe I have Leukaemia. \n\nI hope your journey goes as well as mine 😁 Hey Joshua I have had Cml for three years now. Diagnosed 8/2018 age 33. I have been taking sprycel ever since with very little side effects now. First couple months experience a wide range of mild side effects ( headaches, nausea , fatigue). Exercise at least 3 times a week and hydrate. Those things have been huge for me. Especially the exercise. I was just diagnosed today. Reading comments like yours in this sub have really made me feel better. appreciate that man and sorry to hear about your diagnosis. I was shocked initially, angry and sad. But man are we lucky for modern day medicine. 3 years out the hardest part for me is remembering to take my medicine. Stay strong and done hesitate to reach out with any questions or support. Thank you", "Tasinga (nilotinib) reactions Anyone taking tasinga for CML have issues going to the bathroom or with rashes?\n\nBeen taking 300mg twice daily for just over a year. I ended up with digestive problems. Developed hemorrhoids and intestinal bleeding that required surgery. No rashes but a lot of issues with pancreatitis. 25-35 M no serious side affects, some peripheral neuropathy I took it it for over a year, and had diarrhea, and severe abdominal issues. I eventually had to switch due to the pain. I took it for 3 years ( F 17-20) Had regular diarrhea maybe twice a month, no issue with rashes though Took it? Did you get treatment free remission or you switched? I switched to Sprycel (dasatinib). Tasigna was super efficient for me but also gave me too much bone &amp; joint pain. Messed a lot with my liver too", "Can CML Phases be reversed? Hello folks,  \n\n\nPlease excuse my ignorance. My mother was diagnosed with CML about a week ago and I still have a lot to learn. While we are waiting on the results of her bone marrow biopsy to determine which phase she is in, I was just wondering if someone is in the accelerated phase and beings treatment, can the phase be knocked back down to chronic? Is that common, uncommon, or is that not at all how it works?  \n\n\nThanks so much. I am sure I will have a million more questions as time goes on, but I am glad I found this reddit to help with my research. I am not a doctor.  \n\nDo you mean acute? So sorry for your mom’s new diagnosis. Has she started any treatment yet?\nShe can definitely move between stages. The goal is to get into chronic or undetectable. I hope your mom is well into recovery..🙏..", "MOVIE ︻ FULL The Terminator 1984 srt subtitles movie VHSRip vumoo 720p FLV ", "Anyone here with CML experience depression-like side-effects? Ive been diagnosed 4 years ago, and found that ive become a totally different person... Unfortunately im cranky more often, but no way to change the mood. Recently i switched from gleevec to sprycel. Hopefully this changes my low view of life.\n\nAny experiences?  Diagnosed 10/16/17. Remission 4/16/18. Also diagnosed with PCOS, fibromyalgia, anxiety and BPD (all controlled). I was on Gleevec for almost a year before my oncologist switched me to Sprycel due to side effects . I attempted it for three weeks. In that time, my hormones became seriously unbalanced. I gained 15 pounds, developed acne and had pretty bad mood swings and depression. My anxiety skyrocketed. I am fairly certain it was the sprycel that caused it.  I was diagnosed 2 years ago. This January I talked with the doctor and he asked me if I was feeling down/depressed. I said yes, and he told me maybe it was a good idea to visit a psychologist because of my dark feelings. I had to explain to him why I was feeling down/depressed because of the side effects. I could barely get my rest, 9 months a year I woke up cold during the night, or I was sweating like hell, or I had to go to the toilet. Of course there were also the other side effects like Chronic Fatigue Syndrome, muscle cramps. I went from a young fit person to a old man. I was always very active, and suddenly I was to tired to undertake even a small walk. \nWhat helped me was discipline. I would set a daily goal. Not goals before I started with the medication, but goals that were feasible with my medication and side effects. It made it a lot easier to accept my life. \nYet waking up cold during the night and the sleep deprivation were eventually killing me. This February I switched from Imatinib (400mg) to Dasatinib (100mg). This changed my life. There were less side effects, but the side effects I experienced were heavier. Nevertheless still worth it. No more waking up cold during the night. Although now I would often wake up at night for the toilet. \nLife changed when I transitioned from 100mg to 70mg in June. For me it felt heaven. I did not know I could have so much energy. I am still tired, but the difference between 100mg and 70mg is enormous. Three weeks ago my hematologist changed my dose to 50mg. At this moment I am having some withdrawal symptoms. The same were when the dose was lowered the first time. It will take a month or so.\n\nI hope Dasatinib will change your life and I hope you will feel better! I you have any questions I am happy to answer them.\n\nBest wishes!\n I have switched from Gleevec to Sprycel two months ago. Side effects like cramps totally went away. Sore legs and joints stayed about the same.\n\nSince the switch im not feeling as down as before anymore. Maybe its because of the fact that im not as tired as before.\n\nThanks for your extensive answer. \n\nBest of luck!\n", "ONLINE \" BOOK \"I Know This Much Is True by Wally Lamb\" selling how read how to fb2 authors ios spanish doc 43659", "Omnicron and cml Hello cml family!   I was diagnosed march last year and did get my 2 vaccines.  However I tested positive for covod 3 days ago.   The head aches are bad but what is the worst is the cough.   I feel like I have a lot of flem that I cannot take out.  It is a really dry cough even though oncan hear the little motor in my throat.  Also,  my dr said that sprycel could sometimes cause issues with water retention in lungs.   I stopped taking it these days.   Has anyone experienced anything like this?   Since the cough is so bad I had to call out from work even though I work at home.   \n\nAnyone else experiencing this? \n\n\nThank you!", "Opening conversation for women of child bearing age Hi all,\nI am CML pH chromosome +. I was diagnosed last year 2 weeks after my 30th birthday and the same week CA went on lockdown. I have been on sprycel 80mgs for a year and 100mgs prior. The higher dose gave me headaches. I still believe I am having some cognitive issues with sprycel. Mostly forgetfulness.\n\nI have struggled with weight due to PCOS and thyroid issues but have maintained a healthy weight for 10 years until I started treatment and the pandemic began. In fact I was able to reverse thyroid issues and was able to stop all treatment for PCOS. I am an active crossfit member and have been for 5 years. I consider myself a healthy individual. The cancer was a huge surprise. \n\nI just wanted to get some thoughts about child bearing while going through treatment. My onco mentioned interferon as a daily injection once I conceive. I am leaning on the side of freezing my eggs and waiting until my wbc has fallen below 0.001% currently at 0.03%. My partner is not ready to be a father and I do not think I am ready to be a mother. Just thinking a lot and would like to hear about some other experiences. \n\nThank you for reading and I hope you are all doing well Hi,\n\nI hope you are alright. I actually do not know if I can answer your question. Nevertheless I want to help you. Maybe you can use the information.\nAlthough I am male, I struggled with the same question for myself. I am taking daily 50mg Sprycel for the last 3 years. Before that I took for 4 months daily 70mg, before that 100mg for 4 months and even before that 100mg of Imatinib for almost 1.5 years. Because I am taking medication for almost 5 years, I am going stop medication somewhere in January. At least I am going to try. Reason for this is because my wbc have already been below 0.0000% for more then 4 years. \n\nI have here a ( to a study from my hematologist. Sadly it is in Dutch. But you can translate it with Google. \n\nIn summary TKI’s can be extremely harmful to the unborn child. Nevertheless there are good outcomes and IFN is recommended during pregnancy.\n\nIt is not much. But I hope it will bring you one step closer. Thank you for posting this. My wife is around your age and was diagnosed with CML this year. She is on Gleevec. We explored freezing eggs prior to starting Gleevec but refrained as she was recovering from covid and we thought it would be too much for her body to handle. Has your onco said anything about pausing treatment to conceive or any other options? Can you freeze your eggs while on Sprycel? Thank you for responding and my thoughts are with you and your wife. \n\nNo, my onco pretty much said to go straight to interferon once we think about conceiving. That would also be the case if I were to start the process for egg freezing. I was not offered the time for contemplation. My white blood cell count caused some blindness (due to Roth bodies I believe) and I was rushed to the hospital. Like I mentioned before it was the same day CA went on lockdown. I was the only patient in the whole oncology wing. I was checked in around 2pm and by midnight I had already had the biopsy and was diagnosed with leukemia. \n\nI wish I would have thought of asking about freezing my eggs prior to starting chemo. But the situation was rushed, I was emotional and it was really shitty having no visitors. I have not read anything indicating sprycel would affect egg health. It only seems to affect development once it is conceived as the reply above mentions. \n\nHas your wife's oncologist said anything about gleevec and fertility issues? I am sorry I am not very familiar with this drug as I have thrown myself into research of my own. Thank you. This was an insightful read. \n\nMy counts I unfortunately have no fallen so rapidly as yours. We are hoping 5 years will bring me to that point. 🤞\n\nTo our continued health! Are you seeing a CML specialist?\nI am not seeing one but I assume they are more versed in questions on fertility. It seems to be a very common question for women with CML.\n\nOn CML Facebook groups I have seen quite a few women still in treatment having children. How their treatment plans were modified, I am not sure. CML specialist would definitely have some answers for you. \n\nBest of luck to you! Omg I will look for one..I did not know that even existed Thank you You are welcome. I looked for specialists in my area when I was first diagnosed. On Google I only found two in my province and the closest one was 4 hours away.\n\n For now I will just work with my hematologist, but if I have any significant bumps down the road I may seek a specialist for guidance. Very positive to hear this. Thank you for sharing!", "Living with CML for 3 years now I got diagnosed at 25, and my life has since been focused around my medication (Sprycel), and how I am going to paying for it. Today I received approval from a program that had previously been unknown to me, called the BMS Patient Assistance Foundation. I am now going to receive my medication for free for the next year, and I am so incredibly excited. I am getting married next year, and with this news, my fiancee and I will finally be able to start paying down our debts and planning our future in earnest. A year's reprieve is a blessing. If any of you are financially struggling to pay like I was, the number is 1-800-736-0003. They will direct you where you can download the form. For context, I make a little less than 36k yearly, and my copay after insurance for a 30 day supply of 100mg tablets was $1000. One of their prerequisites is you would have to spend 3% or more of your annual income on out-of-pocket medication expenses.  I hope this helps some of you out. Good luck my friends Great info, thanks for sharing! Saved this post for a rainy day. Thank you!\n\nAnd congratulations on the upcoming wedding! Thanks, and I hope it helps!", "Newly Diagnosed I was diagnosed with CML on the 14th...was just wondering if anyone had any advice or any ideas of what to expect?\n\nthanks in advance!", "Any other CML people wondering when they can get off Sprycel? ", "Hi is anyone active on this sub My wife is recently diagnosed with chronic myeloid leukemia and I would just like to ask what we should realistically expect she is 35 and right now is on hydrea as treatment but we expect to be put on a long term drug within the next week or two. Her platelets are 1.1 an WBC is 87,000 after3 weeks of treatment she started at 1.1 on platelets and 178,000 WBC  Hi, I am here and check in periodically. I am 27 years old and was diagnosed last July at 26. Obviously I cannot provide any long term results, but less than a year out from diagnosis I am doing so so SO well. I am currently taking Gleevec and my bloodwork has consistently shown improvement over time. I have every reason to believe that I will live my life to its full expectancy. What treatment is your wife on? If she is also on imatinib, I am happy to share and info/experiences/etc. Stay strong, stay positive, and feel free to reach out with any questions. Sending all my best wishes.  There is a huge community on ( that is definitely worth joining. A lot of information exchange. I need to share this sub with them at some point since it is so much easier to search information on reddit than on FB posts.\n\nAnyway, I also started with an extremely high white blood count (over 200k). I am in my early 30s as well. I have been on Sprycel 100mg since Jan 2016 and reached Major Molecular Response about a year after starting. I had one hospitalization when my WBC dropped after about 2 months of treatment, but it popped right back up and has been great ever since.\n\nCML is truly the best leukemia (and one of the best cancers) to be unlucky enough to get. The targeted treatments (the TKIs) are in their third generation and a fourth is beginning clinical trials shortly. All of it is pretty scary at first, but know that things get easier. Once the numbers start to settle and she begins her TKI treatment, she will have to take one pill a day and get her blood drawn a few times a year to check her BCR-ABL (presence of the CML chromosome mutation aka the Philadelphia Chromosome). Some of the TKIs have side effects for some people, so you will need to adjust some stuff (mine made me nauseous until I reluctantly gave up sugar). But overall, you just take your pill and go on living. Fringe cases aside, life expectancy is up to the general population.\n\nPM me if you have any questions or want to chat. Seriously, join that FB group. I see this post that might help you. it is comparision between the leukemia types\n\n Bit late to this but I am 27, been 3 years since diagnosis and I have been on gleevec since pretty much day one. Had some bad side effects the first 6 months but then I adjusted. Been in full response since about 6 months as well. Not had any issues since. \n\nGood luck to your wife. ", "CHEMO RASH + hospital visit for infection ", "Can we live forever？  Do you mean like average life span or Immortality &gt;Immortality\n\nLike a normal guys average life Might knock a couple years off but you should be able to live the average life span For sure we can, as long as we receive the right treatment.", "How are you guys doing? Hey folks, I wanted to tap into this feed and get some real-life perspectives, save from going down WebMD rabbit-hole! My girlfriend (in her late 20's) have been diagnosed in 2016, and currently she is down to 50mg Dasatinib. We have only been dating for about 4 months now, and I have since invested to learning more about the disease and how I could commit to being a better partner and plan for our journey together, as she continues her battle. \n\nI wanted to hear some more perspectives about how life gets further down the road: as the conflicts with the disease and side-effects of TKIs continue? What are our hopes for conceiving some day when we decide we are ready? Any pointers to stay on top of the side-effects? We are planning to see her doctor together for regular checkup next month: what are some of the aspects we could follow up on? \n\nMany thanks in advance! I had a great experience with dasatinib for 7 years. Early on I was told that, if I responded well to dasatinib and that response held for a year, then I could expect a normal life span. (Despite the recent change as noted below, I think this was a fair projection. As patients, we have to understand that bumps in the road and non-linear paths can occur.)\n\nAs I noted recently in my first post to this sub, I recently experienced some bad side effects and can no longer take dasatinib. This just happened. I meet with my oncologist in a couple of weeks so I do not know what the new plan will be. I am guessing that all other CML meds will be a problem too as they have the same serious side effects that dasatinib caused me -- and more.\n\nAnyway, given my recent experience, I would recommend being attentive to the possible presentation of side effects. I was doing so well that I did not pay attention. I did not realize that effusions were one -- not that it would matter. Of course, I also recommend not being over the top or anxious about watching out for side effects. Still important to enjoy a calm, peaceful life. I do not think there is an option of having a pregnancy while on any of the TKIs. However, if she has a deep molecular response, she may be able to go the TKIs long enough to conscieve and carry the pregnancy to term (see :  ( )\n\nIt would be a good conversation to have with her doc. I missed your other post but Dasatinib caused plural effusions for me too. Moved on to Nilotinib instead plus steroids to clear the effusion, and no more have happened after 6 months. Only side affects for me are cramps, kind of like I had on Imatinib. (Imatinib stopped working for me due to a mutation) BCR/ABL counts are going down again so happy days. YMMV of course but hope one of them does the job for you. FYI, my other (first) post should be near the very top.\n\n\"newbie here: checkin' in with my latest news\"\n\n", "Side effects - face bumps &amp; thumb/wrist pain I have been taking Tasigna (nilotinib) for 3 months and have had some of the standard side effects come and go. \n\nThe thumb and wrist pain started about a month ago and my doc ordered the appropriate rheumatoid arthritis tests and nothing really showed up, so I am just managing it myself by taking a turmeric &amp; curcumin joint supplement. \n\nBut my face bumps are weirding me out.  They are so tiny you cannot really see them… might just look a little rough overall. But when I am washing my face and pressing my fingertips against my skin, I feel all the tiny bumps just under the surface. Like maybe hundreds of them.  They do not hurt or itch or anything problematic, it is just strange.  I plan to talk to my oncologist In February and my Dermatologist on March, \nbut in the meantime, I am wondering if anyone else has noticed something similar.   \n\nThanks!\nTracey", "Fellow redditors with cml Next Friday I get to have the fun experience of having a bone marrow biopsy to confirm that I do have CML. My white blood cells and lymphocytes are way to high and my hematologist has told me that he is certain I have it and the biopsy is just to be 100 percent positive. My question for my fellow CML redditors, do you have any advice for me going into this? Anything I should expect. My hematologist really has not said much regarding actual treatment but my wife and I have been googling some info. Any advice would be much appreciated. You can PM me if you want to ask questions. What are your counts? Advice for going into the bone marrow biopsy? Mostly just relax. It is not a comfortable procedure but you will be fine. They only do a local anesthetic here but they may do something else where you are (epidural or some such).\n\nAs for advice going into the whole \"cancer treatment because you have cancer\" thing? Also relax, again, if you can. It may be tougher on those around you than on you. I was where you are but back in February. There are excellent drugs for this condition now. It is one of the real success stories of cancer research. You have every expectation of leading an ordinary life with CML. If you are feeling tired etc. right now you will feel better on your therapy in time.  My white blood cells were at 21.5 and my lymphocytes were at 12.5\n\n I had a feeling the biopsy sucked. I am one of those people who likes to turn to YouTube for to watch what I am about to go through. My biggest issue was just a fear of the unknown of what to expect. It is comforting to hear that this should not change much. Sounds like you are definitely in the chronic phase. I was at 155k (15.5) and around 12 when I got diagnosed as well. I only have my phone too type on, so it would be easier to talk. If you want someone to talk to, pm me and I will give you my cell. I am 34 and was diagnosed 6 months ago.  I was diagnosed at 17 in the chronic stages while asymptomatic. I went through the bone marrow biopsy and currently still get aspirations every 6 months and when I got the original biopsy I chose to be sedated before. It really helped me through the process so if it is possible I would recommend that the first time. The good news is that CML is more treatable compared to other cancers. I was able to take daily pills as treatment and had a great initial response. I hope everything goes well for you in your path to health. Biopsy was not to bad, no walk in the park but my main doc gave me Xanax before hand to help with the nerves. If you do not mind my asking, because I am still fairly new to this, what are aspirations? The aspirations just take bone marrow and the biopsy will take a piece of bone and bone marrow. Aspirations are not as bad in my opinion. Oh man, the bone marrow was the worst part, for me alteast. The bone removal/\"drilling\" just felt like the world's most uncomfortable massage. The bone marrow removal was pain all through my spine. 2/10 would not attempt again.", "MOVIE ︻ FREE Life Is Beautiful 1997 Tubeplus dailymotion how watch online solarmovie subtitles yify Dub free ", "Side effects of Bosulif I just got switched to Bosulif a week ago and have had pretty bad diarrhea and stomach pain daily since. I take the pill in the morning with breakfast and feel fine till I eat lunch. As I am eating lunch I get stomach pains which eventually and inevitably lead to diarrhea.  I take Imodium to help stop it, but am wondering if any of you are taking it and have had similar problems and what you have done to help slow the flow? Also, how long until you stopped having diarrhea and/or stomach pains? Not sure if this will help, but I have the exact same side effects on Gleevec. I started taking it before bed and have not had as strong of a reaction. The side effects are still there, just not as urgent and forceful. 🤷🏼‍♀️\n\nStay strong. I am on the magical Sprycel and take it at night. It seems to really make a difference and I do not feel nearly as nauseous and do not have the constant diarrhea that I used to have. \n\nI make myself drink 2 liters of water a day. Even if I am not able to keep it all down. I think it really helps with all of my Sprycel side effects. I also take it with a piece of cheese. Honestly, my dog takes her allergy pill with a half a piece and I just started using the other half. It is now a part of our nightly routine. \n\nI have been on Sprycel for 7 months and have not vomited or had a really awful day in at least 2 months with this regiment. I have found that cutting out all soda and any sort of beer has been helpful too. \n\nGood luck! Feel free to PM me with any questions! I think taking it at bed may be the answer. I will give it a shot. Thanks for your response! I think taking it at bed may be the answer. I will give it a shot. Thanks for your response! Good luck. Let me know how it goes. Sorry not Bosulif, but I also ride the Sprycel train and I had some horrible nausea when I started 4 years ago. Some of this is your body getting used to the medication, it will get better. It happens to some extent with all of the TKIs. But some tips I have found to add to /u/Alaskaadams.\n\nMy biggest improvement happened when I moved med time to an hour before bed with a big glass of water. Sleeping off the pill digestion is the only way to get through it. If I am out late I usually wait until I get home to take my meds as I know it will ruin my evening.\n\nI also learned not to eat anything from an hour before until the next morning, especially anything sugary. If I eat dessert too close to pill time or just eat too much sugar in general I will pay for it the next day with nausea for the morning.\n\nI have had really bad periodic weeks where I have had to rely on Imodium. It seems to always come in times that I am eating really poorly. When I slow down the eating out and the sugar, it goes away in a week or so.\n\nStay positive, I know how physically and emotionally draining these times are. Trust me, it will get better in time! Curious what dosage you were started at and if your side effects resolved. I started and am still at 400 MG. After 8 or 9 days of pretty bad diarrhea I switched to taking it at night. For the next 3 or 4 days I woke up normally in the morning, but with diarrhea. No accidents thankfully. Now the only side effect and can think of is I am more gassy and it smells pretty bad. Other than that I am running pretty normal! Thanks for your response. My mom started at 400 mg and took it at night but she woke up with such bad diarrhea and vomiting for a week that she ended up in the ER needing fluids. This is the third TKI she is failed on-gleevec lasted 12 days, sprycel almost a year, and this one 11 days. Glad it worked for you.  Hi I am new to this sub Reddit. Hi I was diagnosed with CML Sept 11 2001 Ive been on Gleevec (5 years), AMN 107 ( tasigna 5 years) under clinical trial at City of Hope (06-2011). Then after that I took sprycel another 5 years 2012- 2017. Now for the past 2 years I went from tasigna again (17-19) and now I am on Bosulif. Man is this Bosulif is kicking my ass. Gleevec was constant headaches, Amn 107/ tasigna was slight diarrhea, and bumps/white heads, sprycel has to be the best of all of them no side effects. Bosulif I started back in December and the stomach pain and diarrhea have not gone away. I have notice that what I eat affects my pain the next day. I do take it at night and I do not eat nothing after. I tend to eat more healthy food not so much process food since the next day my stomach is killing me. No more rice or most of the Mexican food we make nothing really spicy, greasy. I had to cut back my stomach is feeling a lot better with going with fruits and vegetables.", "How long until you were diagnosed? What was the time from when the doctors first noticed something was off or you had any symptoms to the time you were diagnosed with CML?\n\nWas it a simple process and obvious that it was CML or did it take time to realize and diagnose?\n\nJust looking for experiences. I was diagnosed last November. I basically had really bad night sweats so I went to get some blood test done. The next day the hospital called me asking me to come in. They told me that they were 99% sure I had it based on my blood test results, but that my blood and a bone marrow sample shall be sent for further testing to 100% confirm. They started me on medication that day and 2 weeks later the further tests results came back to confirm the diagnosis.  (26 M, UK) Dec 2014 was my date…\n\nCame in with blast phase, high percentage. Started out with gleevec. Lots of side-effects…\n\nNow everything stable and calm using dasatinib… loving life atm!\n\n(38/m/Netherlands) My husband was diagnosed last July. His doc thought he had gout and did blood work to double check, including a CBC panel. Then called to say his results looked like a malignancy and it was straight to a oncologist hematologist and onto Sprycel after the bone marrow test. \n\nSprycel has worked perfectly and no side effects to date. Gout-like symptoms may have been due to white blood cell overgrowth—he has not had them since. March 2015, I had bad night sweats and would get random fevers and extreme fatigue. Nurse practitioner caught it when I went in to have my wrist examined. My doctor called and wanted a 2nd blood test immediately to rule out any mis-steps with the first one. My CML diagnosis was confirmed 48 hours later. Been on Gleevec ever since and hit total remission about a year ago! Good luck, friend! My husband had symptoms for a good 7 or 8 months prior to diagnosis - the thing is, we were able to explain away the weight loss and lack of appetite. I did not realize about his night sweats. He had a routine checkup with bloodwork on a Friday. On Saturday, they called and told him to go to the hospital. He was diagnosed by... Monday? So maybe three days since the initial blood test, but a while since his symptoms, which he did NOT see a doctor for. And it was Columbus Day weekend. They kept him for a week because his levels were so fucked up. Some nurses had never seen counts like his. On the plus side, the cancer ward had a free pass for bringing in our cats, so that was fun. For me, it was 2 days, could not help but notice the pain since my spleen was so large it was pushing my rib cage out of the way, saw my g.p and got a blood test on the wednesday, scans on thursday morning and admitted to hospital that afternoon. I went in for a simple yearly checkup and when they drew my blood the white blood cell count was so high it could not be read by the machine. Next I was sent to the hospital for more tests. I went home that night and then school the next day. It was about 2 weeks of talking back and forth with doctors and all I was told was that it was not childhood cancer. Finally after weeks of test and doctors appointments I was diagnosed. The reason it took so long was because I was in the very early stages and not in blast phase yet. I have been having bone pain, muscle spasm attacks, fatigue, night sweats, nausea, blurred vision, loss of balance and dizziness. Once the fatigue got so bad that I could not get out of bed, even with my fiancé trying to wake me up, I started getting evaluated Feb 2020, it took 2 doctor changes to take it seriously. I was diagnosed by June-July 2020 in the Chronic stage. \n\nI am still off work but looks like I also have fibromyalgia, I just got off the phone with my doctor today with plans for diagnosis for that. I am 29 from California. I did not feel anything, mine was only caught due to a blood and platelets donation where they noticed my high white cell count. They recommended that I see my GP and was referred to a Hematologist Oncologist from there. Had bone pain 6 months before diagnostic, doctors saw nothing and because I did not do any blood test we did not realize.\n\n6 months later I was diagnosed during hiking because my body was failing me, extremely tired. I had very low hemoglobin, crazy high white blood cells and a huge spleen. At this point it was obvious from my blood test results that I had leukemia, and with my lowish blast count it was chronic leukemia.\n\nMore advanced test showed in the next weeks that I had the Philadelphie chromosome, meaning the typical BCR-ABL CML. This is what you must have for definitive diagnostic. Old post but I thought I would add my experience.\nIt was about a week and a half between ME noticing symptoms and getting a diagnosis.\nDiagnosis was essentially within the day that I went to the hospital. \n\nIt seems pretty straight forward to diagnose. Unusually high WBC or platelets, enlarged spleen are markers. Then confirmed with a bone marrow biopsy for presence of the Philadelphia chromosome which 95% of CML patients will have. I have even heard of some doctors not even bothering to do a BMB, but I believe it is still the standard practice to do one for confirmation and to check for other mutations so that treatment can be targeted better. \n\n\nI had a flash/floater in my left eye when I would blink. I did not think much of it. A week later after going for a run the vision in my right eye became blurry and it looked like I was viewing through a drop of blood.\n\nTrip to the ER the next day, then to a opthalmologist who noticed hemorrhages/bleeding on my retina. Next day I was at a retina specialist. From there after quite a bit of blood work I was sent to a hematologist and given my probable diagnosis due to my high white blood cell count.. It is scary hearing leukemia, but they were pretty sure it was CML and informed me it was very treatable. That was reassuring. I did not need to be admitted to the hospital. I was put on hydroxy urea right away and had a bone marrow biopsy a few days later, results back in about 2 weeks  confirmed everything they suspected. I have been on a TKI for a month and a half now.\n\nOther than my vision issues I really had no other symptoms. I may have had some spleen pain but that was masked because I had some fractured ribs at the same time.\n\nI often wonder how long I had CML prior to diagnosis. I am in Canada and was otherwise healthy so I had not seen a doctor nor had blood work in probably 15 years. Compare this to many people in the USA who have yearly blood work for insurance reasons, I wonder if this could have been found sooner if I had done the same. \nHowever, it does not seem like this will affect my prognosis. I had a WBC of 325k and was still in chronic phase.", "Cytogenic testing time frame I had my second Bone marrow Biopsy a week ago, 3 month after I started Bosulif. I received my PCR results and it showed an increase from 15% in August to 25%. I emailed my Hematologist and said that we would need to wait on the results of the Cytogenic test because she believes that is more important.\n\nDoes anyone happen to know how soon they get those test results back, because waiting is the worst.\n\nI know it probably just means I am resistant to the Bosulif, and most of my blood work is close to normal(wbc is 6.5, hemocrit and platelets are just below normal range), but that jump in 3 months is concerning to me. Mine usually takes 2weeks. I think they might batch them so if they are still waiting for more, it takes longer. Not positive about that, though. \nBest of luck to you. I hope the cytogenetics tell a more positive story. Unfortunately, the cytogenic test matches the PCR, so the Bosulif was not working. She order a mutation test as well, and that showed no bcr-abl mutations, so she is putting me on ponatinib and wants me to start the transplant process in case that does not work either. What waa ur pcr on the International scale?  Also have you tried the other tkis?", "BOOK┠READ \"Early Autumn by Louis Bromfield\" macbook original mobile online français mp3 look no registration ", "Pay attention to your glands I just spent the last three night in hospital. Infections and CML when you are taking something like Hydrea do not mix. Cannot wait to be just on dasatinib.\n\nI had swollen glands in my neck and a high temp that was attributed to my meds until a doc looked at me at accident and emergency and saw my throat. \n\nAnyway, I am home now and on a high dose of antibiotics. I have learnt that when you are immune system is compromised you sometimes do not have symptoms of being sick. \n\nAnd coming back to the title PAY ATTENTION TO YOUR GLANDS and if they are up, get it checked 😁 if its confirmed CML, i dont think u should continue hydrea and change to TKI Yeah, I was on dasatinib and hydrea because my platelets were 3,900,000 at one point. They had to get them wiped out as quickly as possible. I am now only on dasatinib. good to know. how long is it since the first diagnose and hows ur bcr abl now if I may ask? I found out at the end of January this year with my BCR ABL at 55% (I was in accelerated phase with 11% blasts). My BCR ABL was down to 12% four weeks ago. My specialist will be calling me Tuesday this week to tell me how it is going (hopefully on a downward trend). I see. the trend looks good. How the blast though? If I am not wrong, the blast is a very important parameter too. If u can get it to 0, then u r half way there. Keep up the good work Thanks! I am not sure about the blasts. I will ask him Tuesday 😁\nI have to be below 0.01% (or something like that) before a years up, otherwise the government will not pay for my medication. BTW I live in Australia - I am very lucky to have such a good health system. If I do not get there by a year, there are other TKIs I can try. Yes. The blasts if I am not wrong are the scary things that they are afraid about.I think u can get the result with simple peripheral blood test. Those are the mutated ones and dont respond on the current medication if I am not wrong. My son got 2%, he was in early accelerated phase with WBC 250k something. Well, it dissapeared within 3mth with the intensive tea drink tho. One thing I must stress up is that the tea must be of high quality (top 3 leaves) so u can get maximum antioxidant properties. I am lucky my friend supply that and I tried. I seems that the antioxidant did its job well for my son Thanks for this 😁 ur welcome. Hope u can pass this quickly and join as us survivors 💪👍👍👍 Thank you What is the intensive tea drink? My husband was just diagnosed a month ago and is back in the hospital with high WBC and low platelets starting.. he drank about 4-5cups a day. with at least 2 hours break between med. Now he only drank 2-3cups, but we add curcumin and D3 vitamin to boost his depressed immune Thank you! What kind of tea is it? Where do I find it? u can try find white tea. we use 5-6gram, coldbrew for 8hours at least. this should last for a day consumption Thank you so very much! Ur so welcome. Wish u a speedy recovery", "Anyone else diagnosed with CML not long after having Covid?  I got covid about november 2020; found out only after testing, since I was asymptomatic.\n\nIn january 2021 I was diagnosed; thought about covid implications, but I do not belive covid caused it, only worsened it to the point at which I noticed CML symptoms and went to the doctor to get some blood tests done, only then to find out. Yeah I am not going to say we know everything about the body but it very much should not cause it haha. I got diagnosed when I was in the hospital after surgery. I think it is just because you are now getting tested that they see something else is wrong and in a way lucky because they find it in the early stage. My wife was diagnosed a year after her bought with covid, but thinks she was experiencing symptoms not long after she had covid. I have read a lot of information in forums that suggests that people with CML seem to be diagnosed after some sort of higher stress volume in their lives, or an extremely stressful event. It seems like a DNA issue could be caused by some kind of stress, right? I mean, I have no idea how something like that would happen, but neither do the doctors working on finding out why, so I guess we can all have a theory. Any body paying high price for prycel Sprycel sorry I got Covid mid January 2021 between my two vaccines. Mild case and I moved on to having the second shot with no issues. I only found out about my CML diagnosis at the end of March after submitting to blood work for a pre-surgical workup. The only symptoms that I can think about in retrospect were some night sweats. My wife was diagnosed while having covid. That was a terrible week! However her BCR ABL tests were done well before our covid exposure and her elevated wbc goes back nearly a year. do you know about the copay assistance program?", "Desensitization to imatinib (Gleevec) Anyone ever done a desensitization protocol for imatinib? My mom gets a skin rash from it and that is what the doctor wants to try next. She is had pleural effusions on Gleevec and diarrhea/vomiting on Bosutinib that sent her to the ER.", "BOOK┚DOWNLOAD \"Magic Kingdom For SaleSold by Terry Brooks\" portable touch german free djvu pocket ", "Leukemia keeping family away Was did in 2018, since being diagnosed my family has all but deserted me. Does anyone else have the problem of family avoiding you since you have had cancer. I am absolutely so sorry that you are going through that. My diagnosis with CML has strengthened my relationship with my brothers and parents. If some are distant, maybe they just do not know how to react and might need you to see how to react like they are being careful and do not want to upset you (which sucks because ignoring you would just upset you more) Maybe they just prefer to support from a distance. I had people avoid me at first because they didnt know what else to talk to me about. They did it to avoid putting themselves in an uncomfortable position. After they realized that I was doing ok with it and getting better, they were quick to return to my life. \n\nI also had people I had not talked to reach out. And it also brought my relationship with a sibling a lot closer and mended some issues. I do not think the family avoiding is your fault. Its their coping mechanism.", "Wife starting Gleevec - what to expect Hi all - I have posted here already but my wife will be starting Gleevec next week (generic brand). Our doctor prescribed Sprycel but insurance denied it. It is quite frustrating. \n\nAnyways, without alarming her too much, I am quite nervous about the side effects. What should I watch for? Will she be able to live relatively normally (like go for walks, work, etc) or will she feel so awful and tired all the time she will be in bed 24/7. I am trying to stay positive. She is 31. \n\nAlso I was quite shocked about the avoiding grapefruit and pomegranate. She grew up with pomegranate trees so this will be an adjustment! \n\nThank you. I was on Nilotinib/Tasigna for 6 years.  It recently became ineffective, and I have been switched to Datanib/Sprycel.  Seems to be working for me.\n\nSide effects vary for all TK-inhibitors, some more intense than others.  I lived a perfectly normal life while on Tasigna, with minimal-to-no negative side effects.  Sprycel I am still getting used to, made my feel swell up and be all itchy.\n\nSeems odd that insurance would deny Sprycel.  That sucks. I went on gleevec when I was first diagnosed. Watch out for things like morning nausea, body aches and fatigue. Along with upset bowels and calf cramps. These if your wife has them should go away in a couple of months. I was on Gleevec for about a year, it turned out to not really be effective for me so I switched to bosulif recently.\nMy experience was that I was still able to keep up with full-time work when I started on Gleevec but I did struggle with alot of body aches and pains. Nothing so bad I could not work, just uncomfortable and I would have to take some painkillers for it so I could continue with my day. After a month or so it would calm down to the point of just occasionally getting muscle cramps and joint pain that would subside quickly. I would also frequently get nausea in the mornings after taking the drug but that never really completely went away for me, not debilitating though just annoying. After a couple months i started getting fatigue because my iron levels started getting low but that was fixed by having a store-bought iron supplement a day. \nAll-in-all my experience was not so bad, 7/10. They do not want to pay for Sprycel since there is a cheaper generic version of Gleevec available. It is infuriating. Insurance companies are more 'organized' than the mafia ever was. Thanks so much for posting this. I am also a 31 yr old female, recently diagnosed, and waiting on insurance to clear my treatment. I am starting on imatinib and I am anxious about the side effects. I know this is all a lot to take in at once—but if your wife is ever looking to connect, I am all for that. Everything is helpful right now. Take care!", "Day 56 of Imatinib - bruising? My wife (31) has been on imatinib for 56 days. She has a very typical case of CML according to her doctor. So far we have only had one round of blood tests since she started her treatment and her wbc came down to 4.1 (was at a high of 27). She recently started bruising easily. Is that normal? I thought that bruising easily is a CML symptom and the imatinib would reduce CML symptoms. Any insights would be appreciated we do not see her hemo till October. Thank you! Not answering your question, but asking one.Hope you do not mind.\nMy father has the same typical CML, chronic phase,  just started imatinib(day 6).Can you eloborate more about yours wife's experience, as in side effects ? Cannot help I am only started the medication a little over a month ago as well. But only bloodworks once? The first few weeks I got tested every week and blood every 2. Yes, sorry I should say bloodwork at the two weeks mark, six weeks then 12 weeks. At this stage, just puffy eyes and cramping in her legs. Very minor. Thank you for the information.Best wishes to you and your wife Ah oké had me worried there. No problem. Feel free to comment again and ask questions. Everyone responds differently to side effects but with Gleevec I believe the primary ones are muscle cramping and puffy eyes. My wife drinks tonic water and magnesium to help with cramping but always check with your doctor first because you do not want the drugs and random ingredients to interact. I have been on Dasatinib for about 2 months now and I have returned to playing soccer and the first day I practiced I collided knees with a teammate. My knee bruised pretty easily and that never used to happen before. It stayed bruised for quite a while but now it is pretty much gone.  My husband is on the same medication as you. Was not sure if it was the medicine or CML that causes easy bruising. I bruised badly and from practically nothing while on imatinib, and my blood levels were always too low. My counts are normal now on dasatinib and I do not seem to bruise as easily at all anymore. I think it might be due to the medicine and everything but i am not 100% sure. Hope everything is well with him! Thank you!! Hope that you are doing well!!! Thanks for sharing. Did your blood levels normalize at a certain point? 4.1 seems too low and worried me, especially with the bruising. Thank you! Hi … was magensium allowed ? Therealsscottydavybo are your able to private message me. My sibling is going through this as well and is taking gleevec would love to talk to someone on the same medication. Sure. Please send me a message. Yes magnesium was allowed.", "Cardiac effects on Dasatinib? Hello! I have been taking Dasatinib since March 2018. Since then there have been changes in my heart size and function. I am now being closely monitored by cardiology and have been diagnosed with Ebstein Anomaly; a congenital heart defect that has never caused any issues until now. Has anyone had a similar experience? Or anything cardiac / CML related? I get the sense that the TKI’s are pushing a lot of otherwise dormant issues to the surface. Treatment induced peri menopause anyone? 😭🤪 TIA and love to you Hi, I am sorry to hear about that. I do not have much experience with Dasatinib my wife is on Gleevec - however I know there were a lot of heart tests performed in advance of her starting treatment. My husband would get heart flutters and go into Afib. He had to get another ablation done this month. But they said it because of the chemo. My husband is on Sprycel once a day and been on it since July of this year. I have my 3 month scans coming up next week. I have been on dasatinib the whole time. I have not felt any issues with my heart but I guess the scan will let me know. So sorry to hear this. Stay strong. X Thx all ❤️ It can cause pericardial effusions. The pericardium is a protective sac surrounding the heart. A pericardial effusion can affect heart function. (I am not a doctor so I may not have said this entirely accurately.)", "Have to celebrate Just got a text from my specialist. \nPlatelets at their highest were 3,900,000 and are now at a normal looking 163,000. I can stop taking my 3000mg of Hydrea (woo hoo), and just take my dasatinib 😁 Have you had any side effects with the dasatanib I am more tired some days, nauseated occasionally and sometimes my toes and fingertips feel a little numb - other than that I am doing pretty well on them. Oh and sometimes I have a few weird muscle pains and aches but it is short-lived.\n\nI am remaining as active as I can, going to the gym 5-6 nights a week and lifting heavy and I am still working, so it has not had a drastic effect on my life. \n\nAt the beginning, when I was on a lot of different meds, I could barely do anything, but now I am on dasatinib I can still do everything I like to do.", "Hoping to hear from those of you with CML, or someone you love... My SO was diagnosed last October. Been a rough year. Is there anyone here with their story? I would like to know we are not alone. Not alone! My hubby has CML was diagnosed in 2011 (he was 34 at the time).  I will let him know about this sub.  We are both happy to speak with anyone who is in the same boat.  \n My husband just recently got diagnosed at 34 as well! I would love to talk to other families that are going through this  I am sorry to hear about your husband's recent diagnoses, as a spouse I completely know what a mixed bag of emotions you are having.\n\nI am happy to talk with you here or in PM (if that is more comfortable for you).  Feel free to reach out to me any time.   Not sure how far along you are in the process.  Has he had any treatment or surgery?\n\nWe have 2 kids, a daughter who is 23 from my previous marriage, and a daughter who just turned 10.  In the midst of treatment we celebrated our 11 year anniversary.\n\nHubby was diagnosed in June of 2015.  He had 6 weeks of weekly chemo treatments, and 6 weeks of daily (5x a week) radiation treatments.  The doctors then gave him 6 weeks to rest and heal, followed by an esophagectomy.  He was initially diagnosed as a late stage 2 or early stage 3.  Following the surgery they confirmed that he was a stage 2 as they found no involvement in his lymph nodes.  \n\nNow he is healing.  Surgery was in late September.  Recovering and his last procedure was to have his port removed (just prior to the end of last year).    He is eating as much as he can but just cannot seem to put weight on.  He was thin prior to his diagnoses and lost about 30 pounds during treatment.\n\nSorry I know that was a lot, just wanted to give you a little more detail about us.  Again,please feel free to reach out to me anytime.  I am happy to talk.\n\nTake care of you both. Just found this sub, if you have not found the Leukemia and Lymphoma Society or LLS for short, head over to their website. They have community forums for all types of our cancer. The CML forum helped me out immensely when I was first diagnosed. The people on that forum are welcoming, friendly and will answer any questions you have.  Good luck on your journey, I will be 8 years in September,  PM me if you have any questions  Hey All - just checking this sub and my husband has had CML for 10 years (gleevec, now Sprycel) and he is living a very healthy life - he is an ultra marathon runner, and hockey player. It does not have to take your health and life. And regarding going off of TKI's he tried under Dr supervision but alas CML came back..so back on! ", "Covid vaccine and CML If you are able to get the vaccine and have CML are you going to? Yes. Had the first one already. Absolutely Doctor said go for it Yes! Already had both doses of the Pfizer vaccine.  Had my first dose of the astra zeneca, though I think I was a bit sicker from it than I would have been if I was not on TKIs I have had two shots of Pfizer.    I was encouraged to do so by everyone on the team. Hope all is well now! 🙏 I had my second moderna vaccine yesterday and I feel terrible. Fever, body aches, and I cannot sleep. I probably should have held back my dose of Imatinib.", "IPTVRip Misconduct 2016 VHSRip bitsnoop in hindi kickass movie25 vumoo ", "Sprycel and Pfizer vaccine. My wife has had CML for five years. We tried the various TKIs and Sprycel had the least side affects. She has been on Sprycel for three years with undetectable numbers and mild side effects. Then in June and July she received the Pfizer vaccine. Within a month she started feeling pressure in her chest. In September she had a chest x-ray and there was a bit of fluid at the bottom of her lungs. Her condition continued to deteriorate until October 4th. We got her to the emergency room where she had another x-ray. Now the fluid was covering all her lungs. She has a plural infusion. They said this was a possible side effect to the TKI. \nThey stopped her chemo and put her on water pills. \nHas anyone else has this happen? Or is this just a crappy coinsidence? They wanted her to have a third vaccination before this all happened but now we have doubts. We meet with her doctor next week. Are there any studies or reports on interactions between TKIs and the vaccines? I would like to be fully informed when we meet the doctor. Yup Pleural Effusion. This is the most common serious side effect from Sprycel. It can happen at any point while on that specific TKI and one thing us Sprycel takers always have in the back of our minds. The vaccine may have assisted in triggering it, but it is plenty common just with the med. Your oncologist may or may not want to try a different TKI because of it. Lots of people have posted about it on the Facebook CML group if you want to read about others that have experienced it. Well, I did not even consider that Sprycel and the Pfizer vaccine could have been my issue. Interesting. Obviously we/I cannot conclude that but it is an interesting possibility.\n\nI got my COVID vaccine in May. Pleural effusion and pericardial effusion in August. Very bad. OK now. Off Sprycel after 7+ years and crossing my fingers. Pleural effusion... Thanks. My wife is on that Facebook page but she has not visited it in awhile. She says she will check it out. Thank you. Thanks for your response! My wife gets an echocardiogram on Monday. Then a meeting with the hematology team on Wednesday. They are taking it very seriously. I am glad they are on top of it but I do not know about that third vaccination they were originally suggesting. We have both already had COVID so we are leery about the risk. My non-medical perspective...\n\nMy (and your wife's?) effusions were due to Sprycel or *possibly* the COVID vaccine somehow added to the Sprycel effusion risk. I have not seen any evidence that effusions may result from the COVID vaccine and I am off Sprycel so I am going to get the booster. It is possible there is a relationship but probably crappy luck. My mom had been on Sprycel for a year before pleural effusions began (and this was pre Covid). My boyfriend has been on Sprycel for over a year now, got his two Pfizer shots in May, no problems besides muscle aches the day after the vaccines. I obviously can‘t confirm that there is no connection in your case, just wanted to tell you our story. I wish your wife the best of luck! I feel like there would be more reports from my Doctor from patients who also took the vaccine. Pleural effusion is very common in sprycel and could randomly happen at any moment which sucks. I think it was just a random coincidence. Best wishes to your spouse. My hematologist said plural effusions can happen in 20% of patients. I was aware of this side effect but had no idea it was that common when I started 2 months ago!\n\nGiven that, I do not think there is any correlation between it and the vaccine. \n\nI have not had any serious complications on dasatinib, but I do recall reading that people who do have plural effusions are more likely to achieve a deep molecular response (sorry I do not have a link to the study, so do not quote me). \n\nEDIT - here is the link. I do not have the full text, so just going by the title of the study \n\nMaybe ask your doctor about this, as it might not be necessary to abandon Sprycel all together due to one instance of a plural effusion. Thank you. I hope your boyfriends numbers stay good and maybe a stop trial some day. You are probably right. We were warned about them when she first went on Sprycel. The timing was just really close. We are waiting to see if they will approve a stop trial. Her numbers have been perfect for at least three years. They stopped the Sprycel least week and except for the effusion, she feels fantastic! She is dreading it they put her back on it. Thank you. We see the hematologist in a few days. I will read the study and talk to him. Thanks! We‘re going in a different direction now, he‘s getting a stem cell transplant tomorrow but his doctor still wants him to take Sprycel for a year or two afterwards to keep the risk of relapse as low as possible.\nFingers crossed that your wife can get off Sprycel and stay in full remission!", "Vent - CML SUCKS I was diagnosed in August of this year and had been pretty sick since about January 2020. I started on Sprycel (dasatinib) which did not work out well. I had a frustrating go with my doctor not wanting to monitor my blood as much as I thought we should. I ultimately was right and we should have been monitoring it more closely. The Sprycel was tanking my platelets into dangerous levels. I had to go on and off of it every couple of weeks. The side effects of changing so often were brutal. (Nauseous, gnarly bone and joint pain, headaches, sleeping a lot, the usual) I switched to bosutinib on the lowest dose early January. I have been in pretty much constant pain, now I cannot sleep, and have been very dizzy, throw up fairly often. The only time I feel ok is if I am stoned or after too many glasses of wine. The doctor is hoping that the side effects subside but he also wants to increase the dose next week. I am really trying to be optimistic that this will get better but feeling like this every day is exhausting. And the thought of doing it forever is soul crushing. \n\nHe really is a good doctor and I tried to tell him that I have always been a difficult case for doctors and that nothing has ever gone the way it normally does for other people. He finally admitted that I have been difficult and am giving him a run for his money. He was treating me as if I would follow the rules for once, lol. \n\nI am hopeful we are on a good trajectory, but sooner would be better. Between this and COVID I have not been able to scuba dive since the summer, and no good ocean dives since Nov2019. I was supposed to spend a week on a sailboat in the Bahamas last spring and will not be able to go on the rescheduled trip this summer. I probably will not be allowed to go on a trip like that for years. Hell, I cannot even get in the water until my side effects and levels stabilize. \n\nThanks for giving me a place to vent. Sending out positive vibes. \n\nTLDR:f*ck having CML 😤 it is frustrating and painful CML does suck. I am sorry to hear about your struggles. Glad to hear that you have found some relief with marijuana and wine. Honestly whatever helps sometimes. My docs told me to avoid any alcohol but edibles are a life saver for about 5-6 hours at a time. \nFor me Tasigna caused headaches, insomnia and pancreatitis. Even low doses did not work for me because of side effects. Bosulif made me so nauseous that I could not hold down any food for days and ended up in the hospital. It also causes a severe rash that was so itchy it made me crazy. I am having better luck with sprycel but even it has its issues. My platelets dropped to the 20s on a 50mg dose but 20mgs seems to be tolerable so far. \nMy doctors recommend massages but my back hurts too bad that I do not want someone touching me there. I have found relief with epsom salt baths and stretching on exercise balls and inversion tables. \nI love my docs but even I had to get second opinions when the side effects kept putting me in the hospital all last year. I hope you find relief soon for the other side effects. \nLet me know if you have any questions. Yeah Dasatinib is brutal. I went on to it after imatinib stopped working. It was taking my BCRABL counts in the right direction but ultimately had to come off it after loads of different side affects (anal fissures, hair loss, continuous diarrhea). The final nail in the coffin was one of my lungs filling up with fluid. Nilotinib is up next once my lung drains. I cannot wait tbh as now I am not on anything, the horrible itching is back. Never knew that was a symptom of CML until I was diagnosed. Cant sleep for more than a few hours cos of it.\n\nIt seems for most people they just keep rotating through the different TKIs until one hopefully works well enough and the side affects are not killing you. I would rather be on TKIs than a bone marrow transplant tho... have heard too many scary stories of GVHD etc from people who have had that.\n\nHopefully your next drugs work better. We are lucky there are so many different options these days. Not so lucky having CML mind you 😐 Have you ever had Tasigna (nilotinib)? Sorry to hear this. I had a lot of un-fun side effects on dasatinib. I hope you have better luck with another! Tasigna / nilotinib has been way better and more effective for me, though as I type this I have a low-grade fever (99.1...nothing bad, just enough to feel lightly crummy and have a headache, which I had non-stop on Sprycel. These only last a few hours every once in a while). For the most part I have had a way better experience. \n\nTake comfort in knowing you will figure out a better solution and have more life to live, including that trip, one day! Best of luck.", "Sprycel apparently not working anymore I was diagnosed early December last year.  Got put on sprycel, and everything went textbook fine, until early this month when they told me that my protein count suddenly went back up from .1% to over 1%.  Logarithmic change, he said.\n\nI do not know whether to be concerned or calmed by the fact that they are making me wait another 3 months before getting another blood test.  And it is not like the doctor's a hack, he is part of a really good hospital system, so I would hope he knows what he is doing.  But I am still on Sprycel, same dose and everything, and I guess I just do not get why it would suddenly start working again if it is starting to fail, and why we would not check sooner.  \n\nFuck dude, this entire past year was fine, I almost forgot it was even a thing because all I had to do was take a pill each morning, but now it is just a constant random thought of \"oh yeah, I am dying again.\"  Worse even is the fact that I am now tied to my job which is more stressful than ever because I need the health insurance.\n\nI do not know why I am writing this, I do not know what anyone could say or do to make things better, I am just frustrated and scared.  I am 27, this was not supposed to happen. I am on a similar drug, my count varied a little bit during the course of the treatment. Unless you can get another test, I would try not to worry as it will just stress you out. But definitely check with your team if you have questions as they will be glad to reassure you. Hang in there man. The fact that you hit your milestones up to now is good news. \nI heard someone say that BCR/ABL is not a spectator sport. There will be ups and downs, thousands go through this and I would bet every one feels like you do now. But they get through it. \n\nI am glad that you have had only good results and have been able to push CML to the back of your mind. Do not worry - you will get to that same point again. \n\nI am new to CML, a few years older than you. I know exactly how feel right now.  I have not had my first molecular test yet, I am a month away from that. My worry and anxiety has been sky high just wondering if dasatinib is working for me. \n\n I have done way too much googling and forum reading. Here is an example of someone that was in a very similar situation as you \n\n\n\nTalk to your doctor for some reassurance. Ask if they have dealt with other patients in the same situation (they probably have). \nThey often do not get concerned with a single test result. Really sucks to wait for three months I know. In the post above, his numbers were lower at the next draw with no change to medication or dose. My boyfriend (29 now) was taking Sprycel for over a year while we knew that it wasn‘t working properly. He just had regular check ups because his thrombo count was a bit of a worry for a long time but other than that, the Sprycel still kept his CML enough in check so we didn‘t need to worry about time at all. \nMaybe it‘s also reassuring for you to know that there are other options if Sprycel is not working. There should be several other meds that your team can put you on, at least that‘s what we were told. If you think it‘ll help, I can tell you more about how it is been for us after Sprycel did not work but remember that everyone‘s leukemia journey is unique.\nAlso I can relate so much to your last sentence! If you ever just want to vent, feel free to message me! And I wish you all the best! New to CML as well. My wife was diagnosed in May. I recall a veteran patient telling me to NOT be alarmed by a change in counts on a single test because it can just be treated as an anomaly and not an overall trend. Sorry to hear this is happening hopefully in three months they will confirm you are back to your under 1%. Newly diagnosed in August of this year. I was on Gleevac, and during an emergency visit, the doctors discovered my WBCs were 111,000. My oncologist put me in the hospital. My Gleevac was not working, my WBCs and platelets went really high. Now we are waiting on the results of my second BMB to start a new medication, until then I am on hydroxyurea. You can request it monthly if you really are concerned they tried saying the same to my wife but she insisted that she wanted labs monthly so they did it.\n\nHer dx was in Oct 2017 was on sprycel 100mg for ab 1.5 years then they lowered her to 80 then 50 then 20 before she said she could come off completely.. She was off ab 4 months and her bcrabl was getting close to 1% it was around 0.08 and oncologist said we get over 1 she will have to get back on. At 1.5 he put her back on 20mg it is been about 2 months and it went from 1.5% to 4.xx% so now he is going to put her on 70mg as of today.. So now we have to wait to see.. She was feeling so much better not being on the meds..", "Sprycel night 5. Was diagnosed on Aug 16, started meds Sept 4. Unfortunately I am also going off of effexor dt possibility of prolonged QT intervals between the two.  Not sure what I am feeling right now is the effexor or the sprycel but I am thinking the fatigue is Def sprycel. How long did it take for side effects to show from starting your TKI? I feel like I am waiting for a bomb to drop. I have been taking gleevec for almost two years now. Still have bad side effects like widespread pain, fatigue and GI issues. I tried switching to sprycel, but I had a bad reaction to it. I have learned that taking the pill at night before you go to bed helps a little bit. But, everyone responds differently. I wish you the best and a speedy remission. 💜 Yes, I can second this. I always take mine just before I go to bed otherwise I feel crook after."]