["So happy that I finally got surgery (17F)!! I had a hard time convincing myself that I should get surgery to correct my lopsidedness, but my mom pushed me to do it and I am happier than ever. I feel like I need to shout it from the rooftops! I went from no breast on my left side and a C-cup on my right, to what I hope will turn out to be 2 B-cup boobs. I got my procedure on Monday, I am in a little pain, it was covered by insurance (yay!!!!), and I have hopefully got almost even boobs now. \n\nI got a fat transfer to my left breast and a reduction on my right. I have a bunch of bra pads taped together that served as a left boob for the past 4 or 5 years that I joked about framing, just as a reminder of this whole ordeal. Good for you, glad everything went well👍🏼👍🏼 Damn...this is what I want to do but do not know how to start. What was step one? Well, I brought up my concerns to my family doctor. She then recommended a surgeon that was willing to perform on a minor. It is hard to find doctors willing to do a breast augmentation on someone under 18 because of the fear that they are not finished developing, but to the doctor that did my surgery it was clear that my left breast was not going to develop. I went in for many consultations, I cant even count them all! We talked about what I expected from the procedure, what the reality of it would be, and how we would go about solving my 'issue'. If you are underage go to a surgeon that specializes in children's plastic surgery, that is what I did, and it made the whole experience a lot less scary and more friendly :). I will not reveal the doctor, but I got my surgery done at the Texas Children's Hospital in Houston, Texas (yeehaw! 🤠). \n\nPS: If you are scared they will dope you up good, and they have a program called Child Life. A nice woman from the program came by, showed me pictures of the OR, explained what was going on, and let me chose an essential oil scent that made the smell anaesthesia bearable. \n\nSorry if that was too long, lol! That was definitely a lot more than step one. Congratulations! I am about to go for my first consultation in August, and I am nervous but excited. I will not actually get the surgery for at least a year and a half due to my age, and I cannot get it younger if I want it free - which I do lol. It is just nice to hear that someone else is going through the same thing 😊 Oh, how old are you? I am sixteen, but nearly seventeen Woot woot! Hope you get your surgery, and feel confident in yourself Thank you! I hope yours turns out well How long did the entire process take? From speaking with your doctor to post surgery? I am debating if I want to go through with it... I think I started talking about it in December-ish??? Sorry, I am not really sure, but it began for sure in late 2018. I scheduled my surgery for summer of 2019 just because I am a student, and I did not want to miss a ton of school. I am not done healing. I am like 4 days post-op, but the main healing process should take about 6-8 weeks. However, I will not know how my boobs will really turn out until 6 months. \n\nHonestly it is a lot of downtime, and I am hating it. But, it does not hurt that bad. My worst day was the day after surgery when I was coming off anaesthesia, but everything after that was fine.\n\nI about how excited I am to see my boobs lmao. You should really do it if your interested. It is just a little work for a lifetime of happiness! I have to get the same one !!", "⏰ CLOSING NOW ⏰ ", "What did you experience before, during, and after surgery? I recently got a call from my doctor saying that she finally out my referral through to a plastic surgeon! Now that I feel like it is actually about to happen, I am nervous and excited amongst other emotions. I do not know what to expect and would love to hear what other women have done and what they went through pre and post op! What is the exact surgery you are getting? I got an implant on my missing side and a reduction on my natural side when I was 15. When it was time for replacement and before my implant crossed my sternum, just around age 30, I got the implant removed. Insurance covered me up to that point but everything beyond is strictly uncovered cosmetic. I do not know yet, but definitely would prefer to just get a small implant on my left and a reduction on the right. My large breast on the right side has caused me so much back pain the I could not imagine how much it would hurt to have 2 this size.\n\nSo wait, it was covered but when you were older they stopped counting it as “medically necessary?” Covered younger as doc got it approved under psychologically damaging. Once your older you just get told to pay out of pocket. Some surgeons want implants on both sides for uniformity, but my first surgery was just what you want, made them very even in size and youth kept them lifted. When it is time to replace you will have more options to choose from. Naturally I would have been a large breasted woman as well so I say going down some size is good. Just make sure you are going with a size proportionate to your frame, or your average frame if your weight fluctuates.\n  Edit to add no related surgeries to this with me have ever been medically necessary. If our bodies function properly, then they do so without looking pretty. I wear a medical bracelet, as it is important that medics know you have less protection of your organs on your left side. I never thought about the medical bracelet! They are good to have, especially if the emergency requires surgery in the chest! My PS is saddled with another condition but I am missing some ribs on my left side as well. The military would not accept me because the lack of organ protection made me high risk in their eyes.", "Moderator Gratitude Post Hi Everyone!\n\nMy name is Andy and I created this sub a while ago.  I am beyond pleased to see so many members here and all the conversations that take place.  I can only hope that it will continue to grow and we can offer perspective and community to others afflicted by PS.\n\nCarry on!", "Hello ps friends! ", "Rant post, any comments that you guys have or shared experiences would be cool Sorry if this is written poorly, this is just kind of a stream of consciousness rant. Is anyone else super unmotivated to workout? I am in decent shape and consider myself moderately active, but the fact that I will never be confident about my body with my shirt off is really hard to overcome. I am missing my right pectoral muscle. I have been avoidant to chest exercises in the gym my whole life, as a result. The way I  look right now with a relatively small left pectoral muscle makes my chest seem as close to normal as possible I think. I do not want to build chest muscle and make my body look even more uneven than it is now. But the chest is such a large component of working out and, in my opinion, makes the body look really nice and building a huge chest for guys is like a major goal for everyone. Whenever I lift with friends, they all want to bench and I am tired of not being able to put  up as much weight as they can and knowing that I never will. I also watch a lot of fitness and lifting videos because I am legitimately interested in it, but seeing all these super jacked guys on youtube telling me how to get a better body and knowing that no matter how hard I work, I never will , sucks a LOT. I am also very jealous of other guys in the gym.  Usually I think seeing ripped guys in the gym would help motivate me to work harder so  I can look like them, but knowing that the harder I workout, the more uneven I will look really sucks. I will keep sticking to back, legs, and abs workouts, but knowing that the end goal for me is always going to be a strange body really makes me start to hate/resent working out. Like why should I train harder if I am still never going to be comfortable with my shirt off? I might as well  just go for a run every now and then to stay healthy and that is it. I will also say that when I do bench, I really really enjoy it. It is one of my favorite lifts. But feeling sore in one side of my body the next day just reminds me again how futile it all is. I know I am very privileged and there are many worse disabilities out there, but I just wanted someone to listen who can relate and give me their opinion on this dilemma of mine. What do you all think, do you have similar experiences? Again, sorry if this was written poorly, there was no structure, I am just typing as I think. I guess in summary, I just feel hopeless about working out. Completely feel the same. I just gave up working out. Tried many times. Normal right shoulder begun to grow while the left affected side (missing pecs and partially 3 ribs) just stayed the same. That was really painful to see specially on photos. Today i just accepted that i will never have a normal life never being able to go to the beach like others, never being able to post a pic on instagram without having many questions related to the condition and so on.And theres the pain also. Backpain, shoulder pain, even hips pain (i think the back unbalance causes hips unbalance too).\n\nThe most painful to me was when i tried to surf (a dream i always had). I can get no balance on the board, get exhausted fast and cannot swim evenly. \n\nWell i think we just have to accept that and try to live with what we have. For example PS never made me not have a good performance dancing so i stick to it.\n\nIm 37yo now and these struggle are far less important. I hope you can find ways to be your best. hey dude i am a little late for you but i am in the same boat. you can still get jacked if you want to. look up the body builder with poland syndrome, he is hot as fuck lmao. \n\nmy current fitness routine is to not be huge but be toned. i only use dumbbells for my chest so that i know i am getting the same workout on both sides and not building up one huge pec for the other one to be flat. it is probably always going to be noticeable, but if your arms and shoulders are equally built too then i think you can have a really great physique.\n\ni am 23 and gave up working out many times. i wish i had just focused on a balanced workout when i was younger because i always thought it would be useless too. I think going easy on the chest and then working out other muscles more is a good idea, after doing a ton of research, I think I can achieve a decent physique as well. At least I hope so lol. After talking a lot with my friends, I have decided that its better to try and fail to build a physique now than to grow old and regret not doing it at all. Unfortunately, I disagree with you on the poland syndrome body builders haha. I honestly do not want my body to look like that, I would rather my pec difference stay as unnoticeable as possible. I think, just by laying off the bench press, I can do that. Hopefully. holy moly I found 2 bros going through the same thing as me .. my Poland is on my left side with a little baby muscle on top not even really noticeable but it kind of adds a layer too the top too even out my chest .. long story short I had a bulk phase in high school 2015-16 lifting heavy and avoiding the bench as well because I realized after freshmen year of football I lacked power in bench because of my left chest missing I shrugged it off and focused more on my back, shoulders , and arms somewhat legs too , at that time luckily I had some knowledge on my weakness obv being Chest so I avoided it , I think it was after I smoked a blunt by myself I went down a rabbit hole of self realization&amp; seeing that YouTube video of the Mexican guy who got swole as fuck and went too get surgery in Mexico and it was a bust and his body looked so awkward that I was going to look uneven if I kept on lifiting , depression hit me heavy around that time since I was really self conscious about my chest and other shit that I just decided to get skinny with the help of uppers and weed I subconsciously got supper skinny as if I never lifted before , mind you this was maybe 3 years ago , since then I have not been too a gym and did not really care for muscle mass as long as you could not tell I had Poland through my shirt on I am happy &amp; still am , I found myself back In the gym after this breakup not that I got fat or anything I just wanted too release tension and anger that I could not get off running for an hour &amp; trust me I ran a lot  ( no muscle mass just shredded ) , it makes me feel good good but after getting that hit of high after lifting I find myself back in 2016 again .. I have done research as much as you have probably and I agree I do not want too get bulky and look uneven with a shirt on now but it is all in our head and it’ sucks .. we both know we could just be like that swole British guy living his best lift but we are so programmed mentally with this insecurity that it is a lot deeper then just agreeing too the advice of not caring anymore and not letting it be a problem (mentally , physically) but it made us care too much about how we look , I get jealous too man And too be blunt we make it a lot more complicated then it really is but I understand you dude .. I am 21 now I would not say I am shredded but I am just focusing on getting tonned with abs and pretty shredded arms and shoulders , just doing cables and barbells for my chest that I never workout ( only push-ups ) I honestly plan on finding a surgeon next year in Miami ( I am a FL boy ) that can take a piece of my back out and put it into my chest .. but I do not even know if that is a thing yet .. I seen a video of it being done so I might be wrong just got to find it .. I will prefer that over a implant because they still look awkward with an implant done and the future w an implant is a whole headache &amp; hopefully I can grow that muscle fiber into a chest doing more chest maybe hopping on a little cycle too grow my body .. You may be reading this thinking I am crazy or you maybe found your twin haha If you scroll down on the page , that sammy account is mine . That is me Holy shit, bro, yeah we are literally so similar. I am also 21 lmao. The stuff you said about not being able to overcome the insecurity hit home. I think I am pretty lucky that my Poland Syndrome does not cause me pain or lack of ROM, but I just get so self conscience. Looking normal in a shirt is a huge priority for me haha. After doing a good bit of thinking between making this post and now, I decided I am still going to hit the gym and just not work to improve my bench much. I am going to be a squat monster and work on tone for my upper body. I am going to do like pushups to hit chest on days where I do triceps and shoulders, but that is about it. There are days where I am like \"fuck it, idgaf what anyone thinks about my body, I am going to lift however I want\" and then literally the next day Ill stare at myself in the mirror and be like \"fuck I really hate how my body looks without a shirt on\". I don;t think surgery is the route for me. I do not have any pain or anything like that so I do not want to risk doing a surgery that might mess something up or make me look even more like a freak haha. I have been doing a lot of research on lifting and shit and now my youtube feed is full of thumbnails of jacked dudes with all their muscles and I get sooo jealous hahaha. I am missing my right pectoral as well, but have learned to embrace it and even feel some small pride about it. For upper body work I solely do body weight exercises so as to not throw myself too out of balance physically and to avoid some of the injury that we are at heightened risk of with things like lifting. I mostly do different sorts of pushups, pull-ups, planks, and supermans. This year I have been giving extra attention to my back and shoulders and it has done wonders as far as balancing out my strength and compensating for the missing muscle. Also, having bigger shoulders somehow makes my left pec look less pronounced, allowing me to build that muscle more without it looking too off.\n\nBut again, at the same time I am very comfortable with my asymmetry and have never lacked confidence being shirtless or talking to people about my deformity. I do not really know why this is the case for me, but it really has never bothered me. It also has never been an issue for girls I have dated; if you are comfortable and confident in the quirks of your body, girls for the most part will not think much of it, and if they do they are clearly not a good match anyways. Either way, it is me and it is just another thing that makes me unique, and that is worth loving.\n\nAs for the thing about feeling like you will never be strong enough, do not worry about that. Never measure yourself against others too seriously. You are you and that is fine. You can still be PLENTY strong without a right pectoral muscle. Everyone is body is different and has its strengths and weaknesses; all you can do is maximize what you have and feel good knowing when you have tried your best. That is what strength is actually about. Shoulders and back, man... Shoulders and back! I really liked your reply. So do you lift weights for your back and shoulders too, or when you said extra attention, did you mean like just extra calisthenics? Yeah, extra calisthenics and such; I do not lift weights ever. Doing different pull up techniques works great as does work with resistance bands. I also have found shoulder blade pushups (( to be really great and help with posture as well. If you are doing a regular pushup properly this motion should in fact be happening anyways, thus getting solid with SB pushups will improve your push up form overall and allow pushups to work your upper back better than you would with sloppier form. Long holds doing supermans also work the upper back and core really well. \n\nSwimming is also a great way to gain dexterity and strength in these areas (and just overall). In the last year I have gotten big into surfing which uses a similar arm motion to a front crawl and my shoulders have gotten a lot broader and toned as a result.\n\nBasically anything that works your back, core, or shoulders that uses little to no equipment is pretty solid, but again, pull-ups, pushups, and planks form the core of my upper body workout. Mess around with some stuff and see what works for you, but do consider finding alternatives to weights and machines as they often only work one area at a time and are not as effective ways for building integrated strength overall which will make you feel good and look balanced. I really liked this reply. Thanks. shut up Mods? Do you allow this sort of behavior in this sub? I am the mod for this sub What injuries are we at heightened risk for? General sort of stuff to do with body strength imbalance. It depends on the severity of your PS, but having major imbalance of strength puts a lot of strain on your connective tissues and frame if you are not careful.", "Anyone missing Pec Major and Minor? I have been getting into working out lately and have had a lot of complications with that (obviously). Upon google search is appears that everyone with PS who lifts weights is missing the Pec major, but can still build up the minor.\n\nIs anyone else missing the pec minor as well? Does anyone here have advice for lifting weights and getting stronger with PS? I felt the exact same way my friend. I am missing my major and most of my minor. It reduces my bench about 25 percent. If you have any questions, you can ask me and I will tell you what has worked for me. You are not alone. Is there a way for me to tell? Short of going to a doctor I mean. I miss both too just ask in the gym of they can make a specific full body workout just for you, you will not be huge (at first) but it is still something. Just looking in mirror and poking around should be enough Yes I hope I am not to late to the party. Like you, I have Poland syndrome. After a long little league career of baseball, thinking my unsymmetrical chest was to due to pitching, I was diagnosed with Poland syndrome (by a doctor). Was crushing news to a 16yr old boy who wanted to look like Ronnie Colemon. That said, I accepted I would never look like him, or any other two pec holding bodybuilder. BUT! I did not give up training like one. \n\nI am 33yrs old now and have been training sense I was 15yrs old. I majored in Exercise Science in college, worked as a strength coach intern at a private college, and tried many different methods of meat headed-ness. \n\nOhh, and I am missing my right pec major and most of my minor. Two things! \n\n1. Do not give a shit about what other people think. Be happy you can walk, talk, and breathe. \n\n2. Treat your OHP like the bench press. A wide thick set of delts is way cooler than a big set of pecs any day (call me partial, I do not care). \n\nIn my lifting career I have squatted 515lb x 8, I have deadlifted 600lbs, I have OHP 265lbs, and my biggest accomplishment \n\n315x2 on the bench press \n\nIf someone reads this and thinks “what a Bragg-a-doe-shish dude”, that is far from my intent. Just want people with Poland syndrome to know that, though we are anatomically/mechanically leveraged limited, your only limited by your bodies ability to adapt and recover. \n\nIf you prioritize the bench, no doubt you are going to further your asymmetry across the chest, triceps, and front delts. You will also punish your rotator cuff and front delt on the deficient side. But if you want to bench (for bucket list max sake) a closer grip, powerlifting style is more tricep and front delt loaded exercise, therefore reducing the amount of pec needed to press the weight. \n\nHope this rant helps somebody. Good luck with you training and DM me if you need any help or have questions.", "Reconstruction Has anybody had reconstructive surgery as a result of PS ? How did it go? Yes,  in 1988. Pm any questions.  Yup! 2 months ago! Feel free to ask any questions!!", "Just had revisions done for reconstructive surgery I had at 15 I am 25 now and just did implant exchange, mastopexy and revision on one side because my nipple was to large compared to my Poland side. I have never looked so even. I am really hoping I will not need anymore surgery. I always said if I had not been born this way I would have never considered plastic surgery, but I am so happy. It is honestly overwhelming. I just wanted to say it to someone because it is hard to explain to my friends and coworkers why I had surgery. But to anyone else struggling out there, Im with you. This syndrome and all the surgeries that go with it are hard. Your all strong and I am thinking of all my Poland sisters and brothers right now Bless you, so kind to share that message of support for others.  So glad the surgery went well too! So happy for you!\nI had surgery at 16 and am currently looking to find a doctor in my area to redo everything. Awesome! I replaced the saline ones I had with silicone and I am so much happier. Are you just replacing them? I do not think the surgeon who did the original surgery had ever really done anything like this and it is not the best. So hoping to get replaced and fixed Yeah my surgeon was great, idk if your in Florida but I would recommend him. Right before me he did a surgery on a child with Poland's syndrome so severe they only had skin covering their chest. It required a muscle flap surgery, rib surgery, and so on. He is great. If anything you should definitely find someone experienced.", "Do I have Poland Syndrome? It feels like my left pec is a lot smaller than my right and I do not know if it is just asymmetric or if I have Poland Syndrome ", "18 (M) I want to get surgery but.. I miss both my pec major and pec minor. Is this a problem when getting surgery? Has anyone here gotten surgery for both muscles?\n\nI love to lift weights and been doing it for years. Not going to lie, my chest grew a lot. Im kind of worried that one day I wont be that buff and then the imbalance will be the other way around..\n\nI would love to hear stories from guys on this sub on how the surgery turned out.\n\nHave a wonderful day. I am missing my entire right peck as well. I consulted a surgeon and he gave me options either they pull the muscle from my back and put it to the front or they can do an implant, that being said I have full function my body adapted to the missing peck so I have no trouble living my life and work. aside from it looking abnormal I am ok so for me it was not worth taking the risk of surgery and potentially lengthy healing time  if you feel self conscious about it,  it is completely understandable to want the surgery, yes people look at me funny when my shirt is off but to that I say fuck them just try to consider all the ramifications to make the best choice for you. Best of luck", "Shaking hands with limb difference Hey, so I was born with Poland syndrome and do not have fingers on my right hand except for a little thumb. Whenever someone wants to shake hands (and has not noticed the difference), it gets a little bit awkward. I would not mind to shake hands with my right hand, I cannot grab the other hand, but I could just lay it in there. But other people do mind, and react in a very weird way sometimes. When I was a child I never noticed or people just did not care about it , but when I was about 14 (I am 17 now) people started to be weird about it and I just never know what to do. \n\nFor those who have a limb difference on the right hand: How do you handle these situations?", "Hey fellow friends!! I am 19 f in college. I am missing my left major pectoralis, and my hand is smaller on the left side along with my nails.\nI have been suffering from TMJ, and wondering if anyone who has Poland syndrome. \nI also wonder if anyone has had any posture issues from a weight difference in the chest.\nWhen I hit puberty only one breast grew. So the other half of my chest is flat. This makes buying bras and swimsuits a pain. \nI have always been in between whether I should undergo surgery or stay the way I am because I am special. \nI have struggled physically with having strength to use nail clippers or paint cans in my opposite hand. It took me years to learn how to swim. Having an insert in my bra in the girls locker room was scary. \nMy mother probably was taking medications at the time to help with her schizophrenia but it is unknown to me. The doctor suggested I was probably positioned weird when I was developing so it cut the blood off. &gt;My mother probably was taking medications at the time to help with her schizophrenia but it is unknown to me. The doctor suggested I was probably positioned weird when I was developing so it cut the blood off.\n\nPoland Syndrome is not caused either of those things. It is genetic. My husband has Poland Syndrome and has the missing pectoral, his mother is more similar to yours. She has the small hand, she has always been very self conscious of it so I do not ask her about it. It is not genetic. I have Poland’s syndrome and an identical twin sister who does not.\nMy doctor also says it was a blood supply cut off during a very specific time of gestation. Interesting, I took another.look and the cause is listed as \"unknown\" and the theory of the cut off blood supply seems to be more accepted. When I looked into it years ago (my husband and his mother have it, I was worried about.our kids having it) I was  told the chances were extremely low. Neither of my kids have it. I am no doctor but I think it has been established and widely accepted that it is not genetic and IS related to blood cut off during pregnancy. Hello! I am also a woman with Poland syndrome and we are quite close in age. I understand the pain of buying bras it is always a bit uncomfortable and none of them quite fit. I also get annoyed at the fact that my shirts do not look as even because my boobs do not fill them in evenly. I opted to not have the surgery and I also have not worn any inserts for about five years at this point. Hey there, I am also a young woman with Poland Syndrome. I, too, have struggled with needing to find bras and bathing suits that have a spot for an insert and always worrying about if it looks “even.” This was especially a problem because I did ballet when younger and was hard to wear bras under the leotards, which is ultimately why I quit dance. I also struggle with the idea of surgery vs. no surgery. Still undecided, honestly. But airing on the side of not doing it. I also have TMJ issues actually, but the side of my jaw that is bad is the opposite side from my Poland Syndrome, so I have never thought of it as related. \nFeel free to reach out to me more- this is a rare battle we have to fight together! Cheers to us!! So nice to hear familiar stories! Best of luck. Hey girl, \nI am 22 with PS too. But I have my right flat and my right hand smol even my nails. I struggled with image and buying v neck shirts cuz it have a half cleav. Recently I got into doing gel nails on my own and having confidence on my small hand. My boyfriend cheers me up on swimsuits since I apparently look good on anything.\nEveryone here has their own journey on self acceptance and care.", "Pullups I am missing my left pectoral major and when i try to do pull-ups i feel a very sharp pain under my pectoral minor any advice on how to stop this and if not how to train my back? Ty. I am a woman with PS. Pretty active but my upper body strength is lacking. I have never experienced this pain (the pain I experience while trying to do pullups is more emotional, I think it is called failure haha). But I use assist bands. Put one knee through and do the pullups. When you get stronger, you can remove the band or use a smaller one. Haha its not about the strength though. I am strong enough to do a few pull-ups but i feel like my pectoral minor is being ripped off my chest after a few Work on doing some assisted dips, either on the assisted pull up machine, or using resistance bands. You might feel strong enough but your muscles on your PS side still need time to reconfigure. \n\nIf you can do 20 assisted pull ups after taking 15/20kg off your body weight then try again unassisted. \n\nYou could also try change your grip position, moving your hands closer together and using an underhand grip. \nOr further apart and an overhand grip. Variation will build up a stronger muscle group so might be easier over all, just with more work! I am missing my right pec major and do pullups routinely. It sounds like a mobility issue might need to stretch the serratus", "Male to Female Transition &amp; Poland Syndrome I am currently questioning whether I am transgender (MtF) or not and am a little concerned about breast development during HRT being stunted on my right side due to my Poland Syndrome. I was diagnosed at a very young age. My right arm is slightly smaller, I am missing a pec, and my right hand has some minor mobility issues. I am actually kind of proud of this aspect of my body as it is something unique, but I feel like that is a lot easier to say as a thin man rather than as a woman since it does not bring much attention in general. Female breasts are a whole other thing...\n\n Is there anyone on here who has gone through MtF transition and can speak to this?", "I am just here to vent but I am at 19 year old f and I do not really know what to do my left side is the side that is affected and for some reason when I lay a certain way my ribs start killing me and always inflamed does anyone else have this? And know anyway to make it stop ? Asking for a friend 😭  36 year old male right side affected.  When I was younger I would experience that.  Later it transitioned to numbness in the arms, or usually the arm on the affected side.  Honestly the best thing you can do for most Poland related discomfort is strengthening the peripheral muscles.  Triceps, biceps, deltoid, trapezius.  You do not have to be a fitness guru but just a few simple even light-weight exercises every now and then will help.  I would also put a pillow under my knees to make me more likely to fall asleep on my back rather than roll to a side. Oh wow I had a feeling my ps was the cause of my arm going numb every time I sleep on a side. Fun stuff this. Affected on the left so I sleep on right side with pillow under my left arm no more numbness. I am also 19f left side. I have not been affected in that way. Maybe it is time to make a doctors check up.", "To anyone who missing half there chest, have no fear! lol You are not alone. ", "Are you affected by Poland Syndrome? ", "How long did it take you to get diagnosed with ps? 22/f I am in the process of seeing if I have ps, wondering if anyone else had a hard time getting diagnosed (especially woman) and what it took to get a ps diagnosis. I was 4. Apparently I got sick during a vacation and my mom took  me to a doctor in the village. He happened to notice that I was missing a pectoral (my parents and regular doctor had never noticed). That being said, I have had other doctors who had never heard of it, but there is Google now! :) It was so blindingly obvious when I learned what PS was, I never actually got diagnosed by a medical professional and I feel like I do not need to.  I could be just randomly a mutant but I line up perfectly with the descriptors of PS so I am calling it good. It was extremely overlooked until my new stepmother requested medical advise when I was 14 years old.", "Sports with PS Hi all! \nMy 8 year old son has PS (left side affected). \n\nI was curious, when filling out forms for school sports, they always ask \"Does your child have any medical conditions we should know about?\" \n\nHow do you answer this? I have always said no, as I do not see a big risk with the sports he plays (soccer, baseball). But I do worry that if he took a hard hit to the chest it could potentially shock his heart in some way. \n\nAs a side note: He has been cleared by doctors to play all sports. None of them share my fear of the heart having issues from a hard hit. \n\nHow would you fill out the form? Hey! \n\nI would not class it as a disability. I have PS on the right side so cant comment too much but I have never seen it affect my sporting ability. \nListen to the doctors and your kid. The body compensates but he will tell you how he feels Hi!\nThanks for the response :)\nWe definitely do not see it as a disability, never once have we looked at it that way! Then I am sure itll be fine! \nI played lots of sports as a kid and even after the odd collision or hit to the chest I was fine! The ribs do most of the heavy lifting their anyway!", "Can you play vr? I have been thinking about buying an oculus quest but I do not want to spend all of this money on something I cannot use but I was just curious I know everyone is case is different but I am really curious", "Six month old diagnosed with Poland syndrome - advice to her parents? Hey there. So I just had my first baby last June and at her six month appointment last month she was diagnosed with Poland syndrome which affects her right breast. I noticed something was off when she was first born but I assumed the unaffected side was just swollen from hormones. Alas, I was wrong.\n\nAfter reading through some of the posts, I feel extremely fortunate that her pediatrician was familiar with it and was able to diagnose it now rather than discovering it once she is in the throes of puberty.\n\nObviously she is my daughter and I would love her whether she had one boob or five boobs. But my heart aches so bad already for what I know she is going to be going through in a decade or so. Life is hard enough as it is when you do not have a rare disorder that causes physical abnormalities 😓\n\nBreastfeeding was (and is) huge for me and the idea of her not being able to breastfeed was super upsetting but I have read several accounts on this sub of women breastfeeding even on their affected side and that is a huge relief to hear. \n\nIt is my intention to save up enough money for her to get the surgery when she is older if she chooses. Regardless of any surgery though, I want her to love herself and embrace her differences.\n\nSo if anyone has any advice, stories, etc. for the parent of a daughter with Poland syndrome, I would love all I can get. What can I do to make her life easier? I am really grateful that I at least get to be somewhat prepared for what this syndrome is going to at throw us. And I am also really grateful that this subreddit exists - my spirits have been lifted.\n\nI really appreciate all that is already been shared here and thank you in advance for any comments I get. I was diagnosed when I was 4, same condition as your daughter. Right breast/pec, no hand issues. I had the option to get surgery in my teens but decided against at the last minute. Until i was in my early 20s, I still occasionally thought about surgery, but around age 23 decided to stop worrying about it. I am 40 now and it was 100% the right decision for me. \n\nI have experience in all aspects of being a straight woman with PS: awkward momentsa, anxiety, childhood sleepovers, being a bridesmaid and everyone wanting strapless dresses, bra shopping, clothes that flatter me, dating, sex etc. Too much to put in a post, but please feel free to PM me at any time and I am happy to share. I was diagnosed around 1 or 2. I am missing my right pectoral muscle and my right arm/hand is a little smaller than my left. The joints in my right hand are also kind of crappy. My situation is further complicated by the fact that I will soon be transitioning from male to female and expect poor breast development on my right side because of my Poland Syndrome. I have basically just come to accept this fact and am at peace with it.\n\nMy biggest piece of advice for you as a parent is to make her feel as confident as possible about her deformity from a young age. My parents told me as long as I can recall about my condition and always assured me that it was one extra thing that made me unique that I should celebrate rather than dwell on. They encouraged me to think of asymmetry as an under-appreciated mark of distinction and beauty. There is an undertone of realism and self-acceptance that plays into this view in a big way. There is a very good life lesson to be had here. Incidentally, I have always taken some pride in being this way, never shying away from telling people about it. In fact, the confidence I have developed around this aspect of my body has boosted my self-esteem at times and has seemed to make me more attractive to women I have dated.\n\nGoing forward I will try to continue to keep in mind these positive lessons my parents taught me as I begin to develop female breasts in the next several months. I imagine it is going to be tough at first since it is all so new to me; these dynamics are different between men and women's bodies and how they are perceived, but I would like to think the same rules apply to some extent. If I have uneven boobs, so be it; if I end up with only one, so be it. Traditional notions of beauty do not interest me as long as I feel comfortable in my own skin. We have some choice around this in our lives.\n\nSo again, the best you can do for your child as she grows up is to inform her well and remind her that she is unique and can always feel beautiful on her own terms if she embraces herself as she is. I wish you both the best!  :) This was a beautiful response, thank you. I am sure I will come back to it over the years, too, as a reminder of what I need to focus on which is that her Poland syndrome makes her unique and even more beautiful if that is even possible. Your outlook is very inspiring and admirable and I wish you the best on your journey of transitioning! ❤️ Thanks! Glad to be of some small help!  &lt;3", "23, Male, left PS I am 23, been noticing my missing pec for years but more so the past recent years. My right side is fine, and the only thing is the pec major is totally not there. I just feel embarrassed when the wind hits me and you can tell.. thankful I found this post. I have only taken my shirt off in front of a few girlfriends, and wont in front of people. Self conscious to the max. Hi there, I am mainly posting because you are the age my husband was when we met and he has the same missing pec. He was self conscious, would not take his shirt of in public, it was the first thing he showed me about himself like it was a huge flaw.  I hardly ever noticed until he told me, I of course did not care.\n\nNow that he is older (38) it is more noticeable, we also noticed it is not just the pec, his shoulder and back muscles seem to develop less on that side as well, which tends to shift his neck sideways. He has back problems now, some of it due to his spine doing the work of correcting/balancing his posture.  I would recommend getting some X-rays done and monitor your spine as you age, he wishes he had done it earlier. His parents dismissed it as just '\" missing pec\" but it is more than that.\n\n  We have been together 14 years, have two kids (no signs of Poland Syndrome in either). 29 year old male here with the same side affected. I started to notice more around 6th-7th as more muscle developed. I have always been self conscious but getting older always helps as you start to care less haha. I get some back issues some too but balancing out workouts help along with stretching and spinal decompression. 20, Male, right PS\nI knew it since i was 4, never felt embarassed about it, for me it is just like having a big nose, i do not think you should be embarassed about it, the more you are embarassed the worse it is, the more you are okay with it the cooler it is, if someone does not like you because you do not have a pectoral, well maybe it is someone you should not even care about. Only idiots would care of you do not have a pectoral.\nFeel free to dm me if you want to talk with someone who is been through it, i also am part of italian association for Poland syndrome and i know lots of other guys with PS, even someone who has a case more similar to yours and decided to get plastic surgery", "Poland Syndrome Community Register (PSCR) Hello. \n\nI just wanted to share this new Poland Syndrome registry site that was literally just launched a day or two ago. \n\nMy daughter was born on September 17th and was diagnosed with PS on October 28th. Her left hand seems to be fully formed but is smaller than her right and upon assessment from an upper extremity pediatric surgeon at CHOP, she is partially missing her left pec major muscle. \n\nAs all of you I am sure are already aware, there is not a lot of information on Poland Syndrome. I found this wonderful group on Instagram, u/polandsyndromepipuk , which is where I saw they launched this registry site to try and gained more information. The more people that can sign up and share their experience the better so I wanted to post it here! :) \n\n(", "Hey! I think I have PS, I am unsure what to do... Hey all, it is cool to see a community like this. I am a 20 year old male and my right pectoral muscle appears to be missing. I have noticed it ever since I hit puberty and I have always been self-conscience about my chest, but I have never visited a doctor for it since I have full range of motion and do not have any issues in my day-to-day life. I do go to the gym often, but my numbers for chest exercises have always been a bit lower than my friends. I am just wondering if I should go to a doctor or not and look into getting an MRI or something to see what is specifically going on with my muscles. What are your opinions? The doctor will most likely say \"huh, how about that?\" or \"I never heard of PS\". There is nothing you can do to \"fix\" the issue, unless you look at plastic surgery (ie implants). I have known about my own right pec missing for about 10+ years. I rarely took my shirt off as I did not want to look \"different\". As of this past summer though, I did not give a shit. Went to the beach daily, no shirt, didnt care and guess what?, no one ever noticed. \n\nIn conclusion: just accept it, push forward and dont look back I am in a similar situation as you. I never knew anything was up until I was 18, had an unrelated chest surgery and the doc said to me afterwards 'did you know you dont have a pec muscle on that side?' lol\n\nIt didnt affect me back then, but now I am 22 and I have been going to the gym more like you, and now the difference in my chest is starting to become visible. I tend to skip chest days altogether because I am not really bothered about it, the one pec gets enough work during other arm and shoulder moves in my opinion.\n\nYou can go to a doc and get tests if you want, but there is not much point. They cant do anything to fix it, and they have likely never seen poland syndrome before unless you choose to look for a specialist. The most you can do is get a cosmetic implant, but then it might still be uneven if you keep working out and growing the other side.\n\nI would recommend just getting on with life, going to a doctor wont change anything. Keep going to the gym but adjust your workouts around your chest and be safe, dont hold yourself to the same bench press standard as your friends lol. I have seen pics of really fit guys with PS that inspire me to keep going with it. Most of it is just the confidence to let it be obvious and not care. hey! im a girl with PS (diagnosed only a few hours after I was born) here is my take: going to the doctor is a good idea. many likely have not heard of it, because PS is rare, but with persistence you might be able to get a diagnosis. A lot of people do not get diagnosed until their 20’s (most people I have talked to did not even notice until after puberty either) and some have even had to speak with several doctors before a diagnosis. be careful with the chest/overhead exercises and maybe see a physical therapist or trainer that knows how to work around the missing pec if you decide to go the gym more. also- you should not feel self-conscious! there are so many really cool people with PS and if you search it up, there are even famous people who you might not even know have it. for me, it is a part of my identity, and I have chosen to embrace it! I think you should go to the doctor and make sure you get xrays..etc. Mostly for your own history. My husband has the missing peck but also some of his back and shoulder muscles do not grow as much as the other side of his body, his neck has a slight curve. He is 38 and he says he wished he had known more about it when he was young. He has some back issues now, nothing serious but probably knowing all of that before would have made him more aware of his posture.", "Shoulder Pain and limited mobility Hi all,\n\n&amp;#x200B;\n\nSo I have a very mild form of Poland Syndrome, visually I am missing my right peck. Additionally I have been having pretty severe shoulder issues since around middle school (10 years ago). My right shoulder drops about 3 inches lower than the left, and it is even more prominent after the shoulder is aggravated. I also have difficulty with shoulder rotation and overall movement. Has anyone else had issues like this? \n\n&amp;#x200B;\n\nBest,\n\nPat I also have this, but perhaps to a lesser extent. Also my right (affected side) shoulder clicks and cracks when I move it I do as well, shoulder structure breaking down for compensating the lack of pectoral. Also, scapula winging, shoulder blade sticking out. And collar bone curled in.", "Overuse Injuries on Non Affected Side of Body? Hello! I am new here and curious if anyone has ever had an overuse injury on their clavicle on the non affected side of their body? I am 35yo woman w/ missing left pectoral and the fingers on my left hand were webbed at birth and are smaller than my right hand.\n\nI have been dealing with this clavicle / shoulder pain on the right side of my body for about a year and doctors have been very dismissive, I believe because traditionally clavicle injuries are from some sort of blunt trauma and PS is uncommon. I have tried everything physical therapy, massage, acupuncture, chiropractor, cold laser, steroid injection but cannot manage to heal.\n\nI have been thinking since I would been favoring the right side of my body my entire life, since my left side is weaker and my left hand is smaller more difficult to use, that potentially this is why I have been unable to heal. I have worked in warehouses on and off for the past decade so I have done repetitive tasks while not being mindful of this.  I have quit this sort of work and seen a significant improvement, but cannot quite get to 100% so I think day to day tasks contribute as well. \n\nHas anyone had issues like this? Is there a particular sort of specialist who has been more helpful for you all? A lot depends on not only what muscle tissue you are missing but also connective tissue and bone density.  \n\nMy Poland manifests on my right side with the full pectoralis major missing and about an inch in length of underdevelopment on my right side.  My job requires physical fitness tests and through training I have developed compensatory muscles (i.e., for pushups, I turn my right hand in to utilize my tricep rather than my missing pec.)  \n\nI have found a lot of primary care or GP physicians are far less familiar with the condition than a physical therapist.  When I got injured at work and had to see a PT, honestly he was the first medical professional to immediately recognize my Poland, and he had very helpful recommendations for reducing injuries and improving performance.  If you think about it, PT's help people recover from injury, and Poland is basically a congenital injury. I have tennis elbow on my non-affected side ", "ATTENTION PS KINGS , Looking for anyone who is had the lat transfer surgery too give me a in sight of how it is went for them , obv I am considering it mainly because I want too enjoy my 20s without explaining myself whenever I take my shirt off , please let me know below any feedback is appreciated  You are ripped! Nice work, I have been going to the gym for almost a year now and just cannot get much mass on my ps side. My consultation for the surgery is in three weeks, cannot wait. Thank you brother , keep at it ! even when my bad side gets too my head ,I single out a day and focus on the biceps and my shoulders too fill out my frame Killing it bro. Lean as fuarrkkkk Thank you braa we will all make it 💪🏻", "What do you all think am I one of you? ", "Awkward Chest Days at the Gym Hi you all so I am a 16 yr old male who just got diagnosed with Poland syndrome. I have been working out for about 3 months now and before I got diagnosed I have noticed that it is hard to do chest exercises on my left side. Now I know exactly why and it kind of has a psychological and physical toll on me as it is extremely hard to chest exercises. I can never keep the correct form as I literally cannot push without a pectoral muscle. This in turn has an effect on my right side as I my left side completely ruins whatever workout I try. Does anyone have any tips or exercises that helped them balance their chest in any way, or equalizing the strength on both sides?\n\nThanks in advance P.S. I do not plan on getting surgery Symmetry is overrated. I would still work out the other side with single arm dumbbell presses. Maybe do low weight bench and then switch to the single arm to finish. Work all your muscles. You are not going to get so ridiculously huge on one side from weight training. \n\nJust my advice, do not have PS (my young son does). Enjoy the gym and take it slow! Hey man, so I too have Poland syndrome and I have also been a competitive powerlifter for a few years and worked out years before that. The main tip I can give you is to focus on dumbbell work when it comes to benching, your right side is obviously going to be able to do more weight but do not try to do more weight than your left side can handle in an attempt to force it up, that is just going to lead to shoulder issues down the line. Also I am not sure about you but I have my upper pec so in that case I would say incline bench would be beneficial. Any other questions feel free to ask. And in regards to balancing your chest, their is no way to do that, you are still missing a muscle so it will always look unsymmetrical. You can follow  on Instagram, he has Poland syndrome too and he posts workouts that he does on his story from time to time. Thanks for the advice man. My deformity is not that bad my arm and hands are perfect and I still have my upper peck so I will definitely try to do more incline dumbbell presses. Bench presses are not that hard per se but what I find hard is seated dumbbell presses as I literally cannot lift with my left arm. I have also started working my left side more than my right side(not harder, but more reps to balance it out), I am not sure if it is a good idea but nevertheless I keep the weight the same for both sides even if I have to lower it down to a very small amount. I know that fork is the most important thing no matter how much weight you lift. I do not really care about looks I care about strength in general as I do not really want to waste my right sided potential. I want to know if there is any way to balance this out strength wise. Also thanks for the advice, I already follow him and watched some of his videos Thanks for the advice! I find doing incline dumbbell press really beneficial. Try to stay at the same weight and start slow. I am up to 70lb on each arm now and no left pec here haha. I avoid barbell work out all together to avoid favoring one side vs the other. I definitely notice my left side shoulder wise is a lot bigger than my right so your body will balance out to distribute weight evenly on each side. Do not forget mobility work. Definitely helps with tight muscles in the affected sides back and shoulder", "Do not over think it Ladies and gents my good energy is being sent your way as you read this , I am a (22M) same guy who posted the photos of me at the gym a couple of months ago , I have too say I am happy this forum exist but i see a lot of depressed and sad people who are affected by this , I am no one too give advice since PS has made me depressed and sad everyday but let us shift the energy into encouraging and helping ppl that have this condition especially the new ones who Trauma dump on this , Cosmetics if achievable will make you more confident then do it , but do not let this condition be the main chapter in your book of life , learn too love your self it is a lot cheaper then surgery and a healthier option then being sad Every day over something we cannot control ❗️ peace and love", "Joining the British army with poland syndrome Hey all,\nI am currently planning to join the British army when I leave school but I have been doing some research about my ps(I am missing or have a underdeveloped muscle below my left pec) and it says that they would not let me in however I am fit and healthy and it only effects me by the way my chest looks. I do not think they would let you in, because of having PS. I wanted to go to the marines but could not because of my PS. Best of luck! I was able to join the army and my condition is very obvious but as long as you can do a lot of push up as I had to demonstrate then you should be fine. By a lot of push ups how many do you mean and do you have any advice of how to do more because currently I can do 10-20 a time", "F32 with Poland Syndrome and getting married next week! That is all. That is the post!  Congrats!!! Congrats! Happy for you! Congratulations! I hope you have a beautiful wedding!", "Looking for answers... Hi anyone reading this!  I am 31 years old, I have got Poland Syndrome, and I am studying to become a nurse. When I was a baby, some pretty highfalutin doctors had no idea what was wrong with me.  My parents thought it was either something they did wrong during pregnancy or that it was hereditary and may be passed down to further generations.  Fast forward to a few years ago and the advent of Google and I had an answer in a few minutes after having a bit of a wonder on what it was.  Now while studying development and human physiology, I am wondering if I can connect with some other Poland Syndrome folks and see if we have any common ground to figure out a cause, even if it is only anecdotal.\n\nSo are there any other Poland Syndrome sufferers out there I can ask a few questions of?  I hate the word \"sufferer\" as I feel that I have 100% adapted to it, but I do not know what else to say. Because it might take a while to get responses, I will just leave some questions here and if you could answer them I would appreciate it!\n\n1)  When did you or your parents know you had Poland Syndrome?  Did you find out later in life or did they identify what it was right away?\n2) Did your mother smoke or drink during your pregnancy?\n3) Did your mother take prenatal vitamins during your pregnancy?\n4) Did your mother have severe nausea and vomiting during your pregnancy?\n5) How does Poland Syndrome manifest itself in you, and what surgical corrections, if any, have you had?  How are you managing or adapting today?\n\nHere are my answers:\n1) Nobody knew what was wrong with me, and I found out on my own later.\n2) My mother did not smoke or drink during pregnancy.\n3) My mother took prenatals but see answer 4\n4) My mother had severe nausea and was vomiting about every hour, every day, from her positive pregnancy test to when I was born.  So any prenatals were probably not making it to absorption, or much of any food for that matter.  \n5) My Poland Syndrome affects my right arm.  I would say my symptoms are mild compared to what I have seen.  I had webbing on my right hand, but was corrected with surgery.  I have short fingers but pretty much full use of my right hand.  My arm is a bit smaller around and shorter than my left, but I have similar strength in it.  I am missing pectoralis major on the right, but I do not believe I am missing any ribs.  Not really sure about latissimus muscle.  Today I am right handed, but I am not sure if I was meant to be or if I adapted. 1) When did you or your parents know you had Poland Syndrome? Did you find out later in life or did they identify what it was right away? I was in my late 30s. I never knew what the heck was wrong with me. \n2) Did your mother smoke or drink during your pregnancy? Maybe smoke.... I am not positive. My twin brother and I were born six weeks prematurely. \n3) Did your mother take prenatal vitamins during your pregnancy? Not sure. \n4) Did your mother have severe nausea and vomiting during your pregnancy? Yes, my mother was very sick with me and my twin brother. I am not sure if she took some sort of anti-nausea medication or not...this would have been in the early 1970s (my brother and I were born in 1972). \n5) How does Poland Syndrome manifest itself in you, and what surgical corrections, if any, have you had? How are you managing or adapting today? I have hypoplastic nipples (small--under-developed), pectus excavatum, missing muscles in my sternum (can easily feel bone beneath my skin), sparse/ displaced underarm hair (both arms), elevated scapula, very narrow clavicles (collar bones), and other issues. I am sort of a bilateral case; although, my right side of my entire body is more affected than my left. I was not diagnosed until I was in my late 30s. No surgical corrections.  I have it too (female, mid-30s). \n\nIt is funny because I hardly ever think about it enough to Google it, so I was stoked to find a PS post on Reddit that is not only a week old :) \n\nHere are my answers:\n1) Nobody noticed anything amiss until I was 4 and my mom took me to see a different doctor for a cold when our regular one was on vacation. \n2) Nope.\n3) I think so. But it would not have mattered either way. It seems to occur during the 16th day of gestation, so no woman would even know she was pregnant by then. \n4) Nope.\n5) I am missing my entire pec (major and minor) on the right side. No hand deformities. In my late teens, I decided not to have reconstructive surgery and I am happy with my decision. I did not want to have to medically maintain an implant for the rest of my life. As for how it affects me now? I think it contributed to a lot of anxiety when I was a teenager, and I was a late bloomer for dating  / sex. However, by my mid-20s, I really stopped worrying about it so much. Other than my weird boob, I have been (told that I am) totally blessed in the looks department, so if one super-wonky boob is my only complaint, I should probably shut up :) \n\n Feel free to PM me if you have questions.  Hi! Apologies for the rather late reply. But I  too am someone who is afflicted with Poland Syndrome. The only main symptom is that I am missing a large part of my left pectoralis major, and my entire pectoralis minor. There are other signs, such as my left foot being a size 13 as compared to my size 14 right (am 6' 1\"), but they are not too significant. \n\n1. *When did you or your parents know you had Poland Syndrome? Did you find out later in life or did they identify what it was right away?* My parents are both doctors, so they identified it right away.\n\n2. *Did your mother smoke or drink during your pregnancy?* AFAIK my mother only started drinking a little after my younger sister was born.\n\n3. *Did your mother take prenatal vitamins during your pregnancy?* AFAIK no.\n\n4. *Did your mother have severe nausea and vomiting during your pregnancy?* When she spoke about it, she said that her sickness was rather minor.\n\n5. *How does Poland Syndrome manifest itself in you, and what surgical corrections, if any, have you had? How are you managing or adapting today?* As I still have the upper part of my pectoralis major, it is very evident that the bottom half is missing (I lift a decent amount, and have a low fat content). No surgical intervention, although I did contemplate reconstructive surgery for a very long time. Gave it up as I did not want to be 'boob-job' guy for the rest of my life. I was very conscious about it for the first 20 years of my life. And then I began to realize that I had a lot going for me in the other parts of my body (abs and all that) and began to get a little more comfortable with taking my shirt off.\n\nDo let me know if you have any further questions. I would love to answer them. 1) My parents chose to ignore it, and I found out on my own when I was 21. For them it was all in my head...\n\n2) 3) and 4) I do not think she smoked, drank, took vitamins or had any nausea during pregnancy...\n\n5) Well I am missing a good chunk of my left pec, and i think something is slightly off with my left biceps. Other than that nothing really difficult to live with. \n\nI do bodyweight fitness 2-3 times a week and i do not feel impaired when doing push-ups. I never thought of surgery, discovering the name of what i had helped me accept it.\n\nAs for the why it happened, I always thought some problem with blood restriction in subclavian artery made this...  1) When did you or your parents know you had Poland Syndrome? \nDid you find out later in life or did they identify what it was right away?\n\nI found out when I was 18 or 19. I had always known I was born without the lower half of my left pec, but I did not know what it was exactly. I consider my case to be very mild compared to others I have seen.\n\n2) Did your mother smoke or drink during your pregnancy?\n\nNo and no\n\n3) Did your mother take prenatal vitamins during your pregnancy?\n\nNot sure. Probably not.\n\n4) Did your mother have severe nausea and vomiting during your pregnancy?\n\nI am sure she did, but she never mentioned anything about it. I am an only child and I would figure she would have mentioned something about that at some point.\n\n5) How does Poland Syndrome manifest itself in you, and what surgical corrections, if any, have you had? How are you managing or adapting today?\n\nI am 22 now and Male.\nPhew, well it absolutely destroyed my self-confidence for a long time. I was always afraid to take my shirt off in public places until recently. And it probably messed me up quite a bit subconsciously. I got a surgery done when I was 19, where a plastic surgeon took some fat from my hip areas and placed it into the area where the pec was missing. So now my chest is practically even, although I can still notice a difference. Oh yeah, and my left nip is smaller than my right one, but it is funny, when I get cold and they get hard they are about the same size. Part of me wishes I had not got the surgery done and just rocked what I was born with, as since the surgery I have put on a good amount of muscle. But it is in the past now. I will tell ya, one thing that really helped me overcome my insecurity was a guy on instagram who goes by the name  on instagram. check him out. ", "Top 6 Tips to Find the Best Pool Cleaner in Simi Valley | Stanton Pools ", "Tricep My median head of my tricep does not exist. Is there any way I can get the muscle back into my arm? I am very interested in MMA and fighting sports and I want to punch harder", "Right shoulder and chest starting to feel weird My right arm and chest is affected. Recently my right shoulder and chest area has started to feel rather tight, my skin around those areas feels uncomfortable; hard to describe. Especially my shoulder area. Is it anything concerning? Well, any time you feel weird it is worth a look.  I have never had symptoms like this and I have never heard of it before.  Tight-feeling skin...?  I would probably get it checked out but at least it does not sound like anything severe... as far as I can tell, which is almost worthless.\n\nThe only thing that comes to mind is, maybe you have been using it a lot more lately and you are not used to/familiar with the strain it can cause?  But that is a total shot in the dark First question, how old are you?\n\nMy right pectoral and some other little muscles and connective tissue in my right arm are missing.  I am 36.  Various times up to now I have noticed varying sensations.  Sometimes numbness when I sleep a certain way.  Sometimes a sensation of \"noticing\" the absence of the missing stuff whereas otherwise I was used to it.  It is all pretty normal because with Poland, your brain is not wired differently.  It expects you to have all the stuff you do not.  You will of course naturally compensate with other muscles (i.e., using your tricep to compensate for your missing pectoral.)  But having the affected area feel weird is perfectly normal.", "Please let me know what you think in the comments section. Thank you in advance. ", "Do I have Poland Syndrome or just assymetric chests? My left chest is looking smaller than my right ", "Free wellbeing course with former elite athlete with PS Lewis Hatchett  Due to a huge demand outside the UK and for different age groups, we have created a waitlist. If you are a parent/carer, younger/older, outside the UK, please sign the waitlist and we can work on more funding for sessions for all. ", "Best place to get the 3D implant surgery in Europe? Hello,\n\n&amp;#x200B;\n\nI will try to keep this brief, but I am a guy (24) and only found out about PS a year ago, I was born with a webbed shorter left arm but I got the webs removed when I was a kid. I am missing all of the pec muscles on my chest and I was wondering where would be the best place to get the 3D implant plastic surgery in Europe? Thanks in advance I have read that a company in my city (Toulouse, France) was the first to develop a technique to create custom implants tailored from body scans so that they fit perfectly, they are inserted below existing tissue to minimise any \"bordering\" effect so that the edges are not visible. Disclaimer, I have only looked into that recently, I have never consulted with them nor with a doctor so I cannot speak from experience, I have only recently found out I have PS too.\nThey work with hospitals and surgeons from outside France too, so you may not need to have to go too far from where you are. (", "My poland syndrome son🧒 were located in Texas! ", "Meet the Poland Syndromighties ", "Poland Syndrome in Men in Los Angeles ", "Tricep I am a huge MMA nerd and I wish I could throw harder straight punches, but my left arm's tricep is affected. The chest is way more affected, but I just want that extra strength the tricep can give. Can someone please suggest me a doctor who knows how I can have my missing tricep head implanted back in?", "IN PEACE ", "Meet the Poland Syndromighties. After having a wonderful half century with the unknowns of Poland Syndrome, I decided it was time something more was done.  So, my family and I started the POLAND SYNDROMIGHTIES this year to bring us closer to knowing possible specific causes and prevention. \n\nResearch and assistance require factual noise from a critical mass so that lobbying for funding is weightily heard from more than a small number of isolated cases.  By my calculation there should be approximately 168,085 people around the world with Poland Syndrome.  Moreover, by giving each of them a voice and listening to each and their families, we will all get closer to discovering if Poland Syndrome is caused by genetic factors, viral or bacterial infections, allergies, environments or even rare cancers.\n\nAccordingly, we invite and encourage anyone willing to join us in finding answers to the above.  If you or someone you know shares the same burning passion for the truth at last and for the better of all, please do not hesitate to contact us.  Thank you kindly in advance.  Adrian &amp; Family.", "Hello! 20F with Poland Syndrome and I am missing the usual stuff you know. I guess I just wanted to see if reddit had a community and it does! So hi! Wondering how you guys have led your lives dealing with this? How do you feel about all of it?  My young son has Poland syndrome. Cannot really answer your question but I am just sort of hoping we can help him overcome anything he is challenged with. Also, very impressed with your ability to take a photo without your hands! Take care. I have PS. I have had extensive hand reconstruction surgery on my right hand to the extend the length of my fingers. I have probably had about 25 plus surgeries. \n\nMy chest has not been impacted, I am a female. \n\nI have much to share if your interested lmk. Really? The last time I went to a special surgeries hospital I was told there were not many options most of them were experimental. For reference I live in NYC. I would really appreciate if you could tell me about it! I was a patient for many years of Shriners burns hospital in Boston. The doctors there are volunteers and typically deal with burns but in my case they did hand reconstruction with a partnership they had with Massachusetts General hospital. The thing tho is that free care was for those under 18.", "What should I do ? I fucking hate this shit bru lol , teenager w mild Poland hands are Normal just no pec on the left , slight gyno on the other nipple due to it being the only one that stores fats / water it is puffs out , should I remove the gyno first then have the surgery Orr  I have personally done nothing, and i have no right pectoral at all and a similar condition to yours, i am 20 so i know what u are young through. If u really want to do surgery consult first a psychologist and the surgeon, do not rush anything, you may regret it later Hey, 23(m) here. I have got the same setup as you. As far as the gyno goes get rid of it. The surgery for the fix though is rough. I personally did not do it because of the implant. Implant would be fine if you can maintain the same chest ratio your whole life. My alternative? Tattoo! Yeah we look weird with our shirts off. Get a little artsy with it and make it your own. When you are 18 ofc. Or get parental consent and get it early. I am sure you are parents would understand that you want your own twist on it. Unless you are planning on being a bodybuilder do not worry about it.  I am the same.  33M now.  As far as actual fitness your other muscles will compensate (just be careful about dislocations.)  If you are worried about dates, well, any woman/man who is petty enough to be freaked out about it are not worth your time. Haha for sure man , I have been thinking of that option as well , the implant &amp; or muscle transplant into my chest to fill in my pec seems like it would put a dent in my pocket &amp; with my insurance probably not covering it due too it being labeled a “ cosmetic surgery “ , a tattoo seems better i would rather pay a thousand for a dope tattoo instead of a couple thousand for a surgery that will start to sag as a get older ( the tattoo will hurt like a mother if I were to take a guess , my ribs are really flared out on my effected side maybe a Xanax or two will help that out haha , appreciate your input fellow pec less brother  Hey almost 40 m here, I am missing my whole right pectoral as well as having a dent in my chest ( r/PectusExcavatum ). It really bothered me as a kid, and was the cause of quite a few fights growing up at school, but I did not believe the results of surgery were worth the risk. (At the time the only surgery involved was open chest and at 10 or 11 I told the doctor to my moms surprise “Eff That!”) Along with the fact that it was a repeller of shallow people (kind of a bonus) It does not bother my wife or any of my girlfriends I had, and if it did they were not worth my time anyway.  I did not get an implant because I figured that would be a revolving door of surgery to match as I aged and my other pec grew or shrunk. But at the end of the day you need to do what is right for you. ", "Vent i think I am a 23 F with Poland Syndrome. No surgery yet. Right side of my chest wall is affected. Planning to have my augmentation and reconstruction procedures in Summer 2021. Covid might fuck that up though. Idk I feel like I really missed out on this sub when I was younger. Would have been comforting to know that I am not just an anomaly. It is challenging to see past that sometimes (personally). Lovers too. Although, I have had several committed long term relationships that were fairly successful after full disclosure and acceptance set in (for me and them). I have had men and women lovers, but the reaction is pretty much the same. Sadly I am constantly fetishized for how I look, but have also experienced being fetishized because of Poland a few times. By women shockingly. I will leave that for another time lol this is my 1st post on reddit. But if anyone wants to ask questions about any of my personal experiences, feel free to ask in the comments or message me. I am an open book pretty much aside from anonymity. \n\nThe reason for posting: Women being diagnosed with this condition is so rare, but I was diagnosed as soon as I was born. Like immediately after. My parents were advised to put me under so doctors could surgically insert a prosthetic that could be \"pumped up\" to look like a right breast. LOL. Has anyone else experienced this? Idk how natural that would have looked, but maybe my dysphoria would not have been as bad growing up or now. Anyways they did not go through with the procedure. They wanted me to \"choose\" lol. Normalcy has always been so close, but also so far away. I have felt invisible for so long carrying this \"secret\". Does not help that this sub is pretty much dead either. Hi! Another woman with PS here. I was diagnosed when I was 4. My hand is not affected at all, but I am missing my right pecs. I looked into surgery when I was a teenager but decided against it and have not really considered it since (I am 40 now). For me, as soon as I stopped considering surgery  I started thinking about my condition differently. It is to the point now where I barely think about it at all actually. Happy to chat more if you want to send me a DM. Thank you so much for your response! I definitely will consider this. I have some questions for the future, but I have never met anyone with PS. Hello I am a 20 year old woman. I was diagnosed officially at 18 (it also affected my right side). I went for a consultation and I ultimately decided against the surgery. I am completely fine with my polands syndrome. Feel free to message me, since we are so close in age it would be nice to compare experiences and vent together. I have never been super active in any PS forums, but I do not think I have come across any other women with it before. It;s more common in men I think.  \n\nI am curious about how you have had partners fetishize it.  I have only been with men and have never noticed that. But I have been impressed overall with how little of a problem it is been (and I have dated some shallow men over the years :)) 👋🏼 hi! Also female I am 34yr old. I was diagnosed at birth and have had 25 reconstructive surgeries on my right hand. My chest was mildly affected in terms of the chest muscle not being there but the breast itself was not affected. Hi! I am a 25 F and was diagnosed with PS at 19 on my left side. I have never met anyone else with the condition either. Fortunately mine is pretty minor (?) I guess compared to others - i did not even know there was a problem until I hit puberty and one of my boobs did not grow, lol. I felt like a mutant for a long time, mostly because no one knew what was wrong. Every doctor I went to was stumped, until I saw a plastic surgeon who immediately diagnosed it as PS. I had the surgery at 20 yo and have no regrets about it. I understand the struggle of living with it, and the daily wardrobe hassles (my god, the years of sewing pockets into swimsuits...). Prior to surgery, I convinced myself it was not a big issue and could live with it. Now, post surgery, I see how much I had altered my life around PS and am so grateful I do not have to worry about those things now. \n\nBut there are a lot of factors to consider. Always happy to talk to folks about my surgery experience and help weigh pros/cons. Hi! F 26 here and was diagnosed at birth. I have deformities in my left hand and left chest/breast. My left hand is still pretty usable but my left boob is nowhere to be found. Lol. I just cared enough about it when I started sexual encounters... the hassle of having to disclose about it before the deed so they will not be weirded out (but obv they still do).. Also such a bummer that i cannot wear nice clothes. So jealous of women showing cleavages while in their skimpy dresses. I am still in the process of \"accepting my flaws\" but i am also thinking about reconstructive surgery. Just that I do not earn much so it is probably very costly for me if I pursue it. I am all about body empowerment but there are just some days when I cannot. Glad to have bumped into your post. :) Hi again! Definitely. It is much more common in men. I also experienced male partners that did not care much about my PS. Pretty neat.\nTo answer your question though: Basically, I wear mostly androgynous looks. Once in a while, I will feel inclined to wear something more feminine, but I primarily wear men's clothing or gender neutral attire. Just makes me more comfortable + I learned that loose fitting clothes concealed my prosthetic the best.   My chest is not that big to begin with though, I am like a B cup (34/36).\nBut I have had a few girlfriends in the past get oddly into it because to them, my PS gave me a more masculine  chest. At first, it was just comments and I did not think much of it. Then weird quirks were happening. Like one of my exes, she would rest her head on my chest all the time when we cuddled or slept, but only on my affected right side. I would catch her tracing my smaller nipple with her hands, or tell me I would be a hot dude idk odd stuff like that. I even had one ex gf tell me straight up that I should get my left breast removed, to \"even me out\" make me look \"manly\" and \"sexier\". Big red flag. Pretty sure I broke up with her within a week after that. Luckily, no more weirdos since. Sorry this was so long! Hi there! Thank you for your response. We definitely should chat. Feel free to message me anytime! Hello! Thank you for sharing. It is interesting to see how PS looks different for everyone, especially women. Were your procedures covered by your medical insurance? This is my first time hearing about the breast developing despite the absent chest muscles. I am missing my pec major, minor, and some ligaments, in addition to the absent right breast. Hi there! Thank you so much for sharing! Your experiences sound so similar to my own! Same thing happened to me during puberty. I also called myself a mutant lmao for a while I thought I was an unknown member of the Xmen! Lol and omfg all the sewing I have done over the years, you would think I would have gone to design school or something. I would love to chat with you sometime if you are cool with that. My surgery is happening in 2021 ngl I am a little nervous! Of course! Happy to chat Girl yes! I know exactly what you are talking about! Feel free to message me anytime. Your post hit home. Self love is a bitch especially with PS. Same situation with me. I did not think too much about it until I reached sexual liberation age lol. I am also pansexual so I luckily have had more positive encounters than negative. But shit the negatives were bad. I have been laughed at many times smh. I learned if a potential partner could not accept me and my body as is, they definitely do not deserve to explore it and be intimate with me + I am hot &amp; dope as fuck. Their loss! Lol + Disclosure is such bs too. Everyone on this planet has insecurities about their body or physical appearance. Just know that our differences are just that. We are not necessarily flawed just because we are different. Took me a long time to accept myself for who I am and love what I see. We definitely can still show skin and wear whatever we want to! If you need prosthetic tips I gotchu. Just hmu. Off top though: Off the shoulder looks are elite + not as risky. Double sided tape is a girls best friend lol I use it all the time when I am wearing open shirts etc. Lastly, it is completely up to you if you decide to get surgery. I contemplated it for years and now finally firm in my decision after countless consultations. We can chat about that too if you are interested. Thank you for sharing love! Hang in there! Yeah is not it interesting to hear about others experience? All of my surgeries were covered through Shriners Burns Institute in Boston. They are a non profit burn and orthopedic hospital for children. Yes growing up doctors advised that my breast would not develop so I was mentally prepared for that but it actually was not affected. It is so cool to see that there are other women with this issue. This post seems to have brought us out. Not sure if this is too foreward, but would any of you be interested in doing a Zoom or Skype meetup at some point? I have never actually met another person with this, let alone another woman, and  it would be cool. If anyone is interested, send me a DM!", "Wow! So many followers! I totally forgot I made this subreddit, but I am really glad to see people using it!  Carry on :) I am 45, and I have been having a lot of pain with costocondritis. I had surgery for my Poland Syndrome back in 92. I am just wondering if anyone has any thoughts or comments on my situation!", "I have it on my right hand  I also have two fingers and one thumb om my right hand Rad Top post on the sub Fuck I am mirin .. that is and avatar edit from the greatest creators themself’s it makes you different and stand out poke them in the eye with the middle finger if you catch them staring too long", "Just watched Crip Camp I just finished watching Crip Camp, a documentary produced by the Obamas, about a camp, Camp Jened, for people with disabilities from 1951-1977 which started the whole movement to get the 504 and ADA signed. I was wondering if anyone in our group had ever gone to Jened? I am 27, and if it had still been around when I was a teen, I would have liked to go.", "Looking for advice on PS My 1 month old son was just diagnosed with PS. He has a mild case and is missing his left pec muscle.\n\n As of right now his hands look symmetrical. From my research online I have found that some people have a smaller hand on the affected side. I was curious if in those who do have one hand smaller if the hand was smaller at birth or if it did not grow the same size as the hand on the unaffected side? \n\nOther questions:\n1. What are some things you wish you knew about PS growing up? \n2. Was it emotionally difficult for you to explain to friends? \n3. Did you avoid taking your shirt off in public? or did you embrace it/feel comfortable taking your shirt off? \n4. Do you feel that PS held you back from any physical activities you wanted to participate in? \n5. Did your parents consider any surgical options at a young age? \n6. Did you consider any surgical options as an adult? Why/why not?\n\nAny additional advice/experiences you would like to share are appreciated! \n\n", "Anyone had the operation? Hi everyone,\n\nI am 33m and I have my pectoral muscle missing on my right hand side . I have always been shy about taking off my shirt in front of people. \n\nThis has been causing a lot of stress on my send confidence lately and i am planning have corrective surgery to fix this issue but I did not come across any male who had the surgery and would like to share his experiences . If you had the surgery male or female would you please answer the following questions to help people like me ?\n\n1) Are you happy that you had the surgery ? Does your chest look even and natural ?\n\n2)How did you find your doctor? Did your insurance cover it or you paid your own funds . How much did it cost and do you recommend your doctor ? If so please provide your doctors name \n\n3) How long is the recovery time ? How long after you were able to go back to your normal activities and how soon you were able to go back to workout ?\n\n4) Anything else you would like other people know about the operation ? \n\nThanks So I have not gotten it but I have considered it. One of the main deterrents for me is that recently, a lot of women who have had breast implants have been coming out that they became very ill from them and it stopped when they got them removed. While it might not be the same for male implants, it still has turned me away from putting a foreign object permanently in my body. I had the same concerns and I am trying to read about it . They say it is made of a different material and we would not have the same problem as women but it still would be good to hear from someone who actually went thru the operation I had an expander put in at 15, covered by insurance, although my surgeon said it was a battle to get it covered and it was the first time he had succeeded in getting it covered. I had an augmentation at 16. My effected side is permanently numb, and they are not completely even, and both sides feel different when cupped. But. I am happy. Before I had the surgery I was so ashamed, and although I still am self conscious, I am okay with it now.\n\nRecovery was easy and relatively painless. I dont remember my doctors name, but I can look through my records maybe. I dont know how it is for men, but in my case the worst part was my doctor wanted to continue to do surgery. After two separate surgeries I was done. But I should have just agreed to the third surgery to make them more even. Do you mean your whole right side of your body is numb, or just your chest? Right side of my chest. I can feel still but it is almost like when you are in the cold for a long time and all you can feel is pressure. I am a male and had a piece of my right side latissimus dorsi cut off (they kept the nerve attached) and moved/reattached as part of my chest when I first started high school. During that same surgery they also released the webbing on the right hand. It is pretty cool as the muscle adapted to go from a \"pulling\" muscle to a \"pushing\" muscle. Since then I have done played contact sports (like football and MMA), done crossfit and tons of yoga and never had any issues. \n\nTo answer your questions:\n\n1. I probably would not do it again. As I have gotten older it does not seem that \\ potential partners care. Combine that with the fact that the surgery was hugely painful with a sufficiently long recovery and did not get me to a sufficiently \"normal chest\" enough to avoid some looks when at the beach, I would say I wish I would have owned it and just moved forward. Though, that would have been very hard to sell my 15 year old self living in a beach town.\n2. No idea. I imagine my mom found it through the insurance? Again, I was 14-15ish... That said, for what the doctor did, she did a great job. PM me if you really want it and I can try and find her name for you. She definitely has before and after pictures of some of her patients, if I remember correctly. However, she might be retired by now. As for the cost: no clue. And, speaking as someone who works in healthcare, the cost of such a surgery greatly varies depending on place, doctor, exact coding of the procedure, age of patients, insurance, among other factors. \n3. Months and LOTS of pain. But, I would not let that deter you if this is something you think valuable.\n4. I guess, I would say it is hard for me to say whether I would do it or not again. (even though in response #1 I said I would not). I think the potential is there for the type of surgery I did. That said, having now the hindsight of many sexual partners and some amazing long term relationships, I am not sure not having had that surgery would have had a major negative impact. In fact, it might have been potentially positive as I have always regretted the amounts of morphine they hit me with for the days (a drip while in the hospital for a few days and then pills for up to a month or two) following the surgery.", "Getting corrective surgery! I am 17F, I had a letter through today in the post saying that my funding has been accepted, obviously over the moon and Burst into tears as this is life changing. Any woman (or men) had corrective surgery on here? Anything you can tell me about the process/pain/recovery? Congrats Thank you! I (31F) had corrective surgery at 19. While not perfect, it was a huge (2.5 cup) improvement and I am so happy that I did it. Expect some pain for the first couple of days but it is nothing terrible. \nI feel it is worth mentioning that I wish I had waited longer for my body to fully develop. At 19, my doctor said my right breast was finished developing so he structured my left to match. I continued to grow on the right side but this could be due to weight gain and having two children.\nIt is also worth mentioning that, YES, I could breastfeed on both sides! The side effected by Poland’s was significantly lower in supply but I did produce milk. \nHaving Poland’s is always something that will make you unique but I wanted to be “normal” so badly. I remember the relief of being able to wear low cut tops/regular girls clothes for the first time. It was totally worth it! Good luck! I am so glad this community exists. 25/M here, but I also got my surgery at age 19. The surgery was great and a singificant improvement, but I have been struggling a lot lately w/ my body image because I began an exercise regimen and put on more muscle this year, which made the corrective surgery look more asymmetrical than it did initially. Just nice to know I am not alone!!", "Just wondering about any surgery success stories...  my surgery succeeded they removed the skin between my fingers to move better, this was the second time i did this (first time i was 2 years old) i only had to puke every day after because i got really much anesthesia, when i woke up i was really confused and started to swear and fell asleep 5 seconds later.", "Just had the pec implant 6 weeks, some questions..  Hi all, I just had the implant- pec major on left side and am now 6 weeks post-op. The JP drain was in for about that long as well due to the amount of drainage, and my surgeon was reluctant to remove before it got to 30cc. Aside from being excruciating when pulled out, I am experiencing pain where the flat part of the drain was. The pain is in the sternum area (not swollen),and where the implant tapers off. The implant itself looks fine.  I am pleased with it so far, other than the pain.  I was pretty active before the procedure (running,some weights etc) and am wondering how recovery has gone for those that have had it.  When did you begin to feel “normal” or able to resume usual activities. Thanks! I had mine done in 1988, it is still there. Do not remember to much of early days but can say that waking up from sleep with my left arm over my head caused swelling and soreness years after and my implant has migrated towards my sternum. I suspect being a side sleeper with that side down may have contributed. I can go long term without noticing and I can get pain and soreness still. I am sure technology it is better, doctors are better informed, and having groups like this will help your experience be better long term. Congratulations on your implant! I am looking to get mine removed but I am nearly 50. Does anyone know if medical plans cover this sort of procedure in the States? Or would I have to pay out of pocket? Thank you! To my knowledge insurance will not cover, but you check in with a doc just to be sure.", "19(M) Very active lifter with surgery Qs Hey all, just found this sub today! I am a 19 year old male, very big into lifting weights. My body shape is well built. I am only missing my right pectoral major and minor, and it seems that my armpit is slightly affected as well. I was wondering when is the right time to get re-correction surgery? I do not know if I should wait until I gain more muscle lifting weights and more fit or just do it now. I have always wondered if by getting it now will I always have to maintain good size of my natural pec to match the implant. If anybody is an active male and has done this implant please share your experience. Thanks.", "Plastic sugery for PS Hi has anyone had successful plastic surgery in pec? Looking into it for summer (25M) I have never gotten surgery and I do not plan to, but I would say consult a plastic surgeon. In my opinion, implants and fat graphs are good but the lat transfer is the big no no. What makes you say a big no no ?", "Prosthetics So I have Poland syndrome and I started to workout for about 6 months now. I bought this grip off of Amazon that helps me grab on to like the barbell or something. However because of the grip is not made of plastic it gives me too much motions. Because of this I recently sprained my wrist. I have been considering a lot to look for a prosthetic arm or hand to better help me workout. And I was wondering.\n\n&amp;#x200B;\n\nI am new to this prosthetic hand or arm world, so I have no idea how this prosthetic arm or hand thing works. I was wondering if you guys can give me a backstory on how you guys got it, what you do with it. Of course, I am talking about a prosthetic arm.", "Is a muscle transfer dangerous? I am 18 and have a moderate Poland syndrome (I do not have a right pectoral muscle and an undeveloped right hand). My doctor mentioned a procedure involving the transfer of my lat muscle to the front to look like a pectoral. I am wondering if anyone had had any experience with this procedure and if it is very risky. Should I do this or silicon?\nThanks everyone Transfer of a muscle sounds dangerous Indeed, the procedure here is to take some fat from your lower back and transfer it on the missing pectoral, i reccomend doing this as a transferred muscle probably would not be functional, not to mention the problems that could come up for missing another muscle. Also the pectoral is pretty different from the lat muscle! \n\nPM me if you need anything Thanks for your reply. The fat transfer sounds interesting but I was just wondering if the fat transfer you mention is a permanent solution like the muscle transfer and if it would become dislodged when hit hard.\nAlso if im pretty thin would not it look kind of weird if im missing a chunk of fat from my back (does it grow back?)\nThanks again for the reply lol I have never heard about someone dislodging it and i know 5 people who did this kind of surgery, one of which was also very thin. Also as you may know, missing a muscle is way more evident that missing some fat.\n\nAlso i do not know the exact details of the operation since i did not do it, but i could probably get them or get you in contact with one of the surgeons. \n\nAre you perhaps from Italy or Spain? I have some direct contacts there and it would be much easier I am from Victoria, Australia. Do you perhaps know anyone there? I strongly do not recommend it tho I have never actually done it. I am 17 and I have learned to totally accept my body for what it is. I think if you cannot stand the way it looks you can get fake pec, but the muscle transfer sounds to me like a big no no. I doubt It but i will look into it My wife had it done at 14 years ago, it went well. Sometimes when she is lifting weights her \"pec\" will fire with the lat muscle, some kind of ingrained muscle memory. She thinks it is funny. Hey so does that transfer basically  still do the function of the pec? Also did it decrease the strength of her lat muscle? I had this done at 16 and I just turned 30, I am thankful I had the procedure and it helped my confident a lot.  I still have control of the muscle even though it is been moved from my back to the pec. So much better then the indent I had in my chest growing up. It is almost even with my of pec.", "Global Poland Syndrome Community Register ", "Problems with ripping stuff Do not know if this is because my dominant hand has Poland syndrome on that side but I have extensive trouble ripping things. The action of ripping causes what feels like contractions in my chest, left side and is really difficult. Right hand is not strong so cant use it instead. Noticed this while tearing boxes at work, anyone else got this? Yeah it feels unreliable almost, I feel you.. like you dont want to test the ripping motion. But pulling your own body weight is not an issue I am guessing? Weird, but I def feel you on that. Yeah! I am not a heavy person and cos I work in a supermarket I have to tear up these thick cardboard things to make display cases. Takes forever and I feel so weak lol I got to do the same ay my job, I totally understand where you are coming from, just stretch it to your limits, and go hard, give every day all you got and get stronger. I am 23, am missing a whole left pec it is never given me trouble just cant lift as much with my left arm as I can with my right. I got to do the same ay my job, I totally understand where you are coming from, just stretch it to your limits, and go hard, give every day all you got and get stronger. I am 23, am missing a whole left pec it is never given me trouble just cant lift as much with my left arm as I can with my right. \nIt is so easy to forget, right? You just assume you are totally normal and stuff and go about life normally and then you think \"wait just one second...why cannot I arm wrestle with my dominant hand?! What is this madness\" and then you remember I have always wondered if I could possibly have been left handed, or if my Poland's made me right handed by force.  Obviously this means I do not know how to answer your question but this is *very* interesting to me.  Do you do a lot of stuff with your dominant hand?  Do you have most functionality? I am lucky that the extent of my hand deformities is that it is a cm shorter than my right hand, so I have full functionality. I rarely notice anything regarding limitations until I need to start using my chest muscles. I can certainly see this being a valid point though, and it probably has affected people like that if their actual dominant hand has reduced functionality, just adapting and using the other one. Thank you for posting this. I have the same issue, you shed light on it. Thank you. Haha no probs. It is always good to have more symptoms or issues of Poland syndrome out there so people are reassured they are not alone. Certainly feels like it sometimes :)", "My son is 11 months old and has recently been diagnosed with PS. And his arm is not affected at all but they said he will need surgery because his lung pokes through his ribs when he breathes. Has anyone else experience this or had this surgery done?  Hi I am a 21 female with ps. I do not have my parent nearby atm on how they decided my surgeries. When I was baby, apparently I had a similar issue. My rib was very close to my lung at birth and doctors told my parents on the possibility of needing surgery. I do have PS in which not only it affects my right pect, it affects like I said my right rib, arm and my tiny right hand. From what I understood, my parents sought a second opinion and followed the idea to see how my growth went. Needless to say my rib did grow a bit and gave my lung some space. \n\nI am not a doctor but from what my parents did, maybe seek a second opinion and look into options and just see how you child’s growth plays out.", "Poland syndrome and bowel pain on the affected side? Hey 👋🏻 \nHave you ever experienced or know someone who has experienced recurring stomach pain on the side affected by Poland’s? \nMy bf has Poland’s and he is been dealing with these pains since forever. All the bloodwork, scans, colonoscopy came back clear and the doctors were like nah he is fine. But well, apparently something is going on. I cannot remember a day without at least one episode. It is on the right side, somewhere around the navel, sometimes migrates under the ribs. Seems to subside for some time after a bigger meal, fiber-rich foods, rice, etc., but comes back after some time. I am completely puzzled, because if it were something life-threatening, we would know by know - either from the screenings or his condition would simply get worse. I read on wiki that people with Poland’s can suffer from gastrointestinal tract abnormalities and to me it seems like it may be connected. Especially so the pain subsides when his stomach is filled with foods that suck up a lot of liquid and stay there for long as if it stretching the bowel somehow helped? (Forgive me, I am on my wit’s end because of this situation 😂) I could not find literally ANY story about someone with Poland’s having such an issue, so I turn to you - someone, something? Did you hear about stuff like this? Do you know a doctor who could help? \n\nCheers Never best of this being associated with the condition. I have PS and do not have this right side also. feel stomach pain but only when doing extenuating activities but i do not think is related to the gastrointestinal tract, rather it must be muscular pain. Right side too, never experienced such an issue, i also know at least 7 other people that do not have a pectoral due to Poland Syndrome and i have never heard of anything like that, i doubt that the 2 conditions are somewhat related, maybe ask in r/Medical_Advice or r/AskDocs", "Discreet Vendor:: Xanax, Addy30’s, etc. Wickr id: alphadeals1 Discreet Vendor:: Xanax, Addy30’s, etc. Wickr id: alphadeals1", "Vent? i guess?? wow hi didnt know this sub existed, i apologize if this is the wrong place to try and talk about this but like. i dont even know where to go??\n\nIt took many years before i got diagnosed, im 23 and assigned female at birth, and ive pretty much always felt... off. I am missing my entire pectoral muscle on my left side, and my left arm's significantly weaker, but that is it. I just got diagnosed with PS maybe a month ago, after doctors telling me for 12 years straight \"oh youll even out!!\" With a DD one side and an A on the other i was kind of skeptical ever since i hit 18 and was pretty much done growing. the size of  my non-affected breast makes my back hurt on the right side, and i stand disproportionately.\n\nbras have always been super uncomfortable, i basically just... dont wear them. if i do its for cosplay, and even then i feel weird because i sound like a maracca walking down a con floor with a pantyhose full of lentils in my underwear. the only time i really felt... right?? (maybe?) was when ive presented masculinely or more gender neutral. ive identified as trans for the longest time, and i know it seems odd but. now that ive finally gotten my meds figured out and feel happy for the first time since puberty, ive found i genuinely LOVE dressing on a more femme scale, and somehow, i feel like being trans just.. isnt it. ive never felt any bottom dysphoria, or a dislike of my general figure, just a hatred of my chest. \n\nanyway, gender garbage aside, if i make the case to my doctor, given that my insurance would pay to put an implant in, do you think they would pay to reduce the breast on the non-effected side? has anyone here even done that?? \n\nthanks for listening to me rant, i appreciate it. if you have an idea for a better place to go id love to hear it. Hey! Have not officially been diagnosed with PS (waiting on results for confirmation), but I have severe breast asymmetry as well and am getting surgery to correct it next month. Where I live (Ontario), our provincial insurance will only cover one side, but it did not necessarily have to be the affected side. My surgeon said I could choose to have them cover a reduction to match my smaller side, or have them pay for an implant. Since they would have still looked wonky with just an implant on the smaller side, I am also having a small reduction/lift on my right side that I am paying for out of pocket. The surgeon suggested I make insurance pay for the implant because it was the more expensive side and down the line I could ask them to cover a replacement. Also would recommend the /reduction sub! Lots of nice folks on there and some more advice about asymmetry Aaa i see!! i live in the states (Massachusetts) and my insurance is pretty good (MassHealth) but i choose an implant, theyll only cover one implant, no replacements. which seems kind of dumb to me, but hey, that is state-issued insurance for you. thank you for the input!! ill definitely have to check Definitely the place to vent. That is why we are here. I do not have any experience in the stuff you are asking about but please know you are supported here. I will let more experienced people chime in. thank you so so much!! i appreciate it.  Nb les here, affected as you are. Working on top surgery, you have found the right place.🌈🦄 aaa thank you!! i hope top surgery goes well for you!!! i know i wanted top for the longest time, but surgery always scares the heck outta me!! 😖 I hear you, fam. It is a trip for sure.", "I was born with this condition, missing my right pectoral muscle, and have a lack of confidence when I take off my shirt in public. I am a bigger guy with some fat and I just feel weird and awkward in public. Does anyone have any advice on how I can gain some confidence with this?  As someone with poland syndrome with a deformed arm as well, I‘d say confrontation. It is really the only thing that helps. Do it step by step. Try confronting your insecurity by for example staying without a tshirt for 5 min. Then 10 if you feel comfortable. Just continue making small steps to confront your insecurity. And if someone points it out, own your disability. Own every aspect of it. Tell them that you have poland syndrome, because it is nothing to be ashamed of. And if someone makes fun of you, remember that they are just projecting their own insecurities on you, never take anything personally. I can recommend you a ted talk by a man with a facial deformity, I think it is called own your face. You will make it!! I fit your description and body type, and I can tell you in my 50 years, I still struggle with it in certain situations, but over time you will learn, without trying, to care less and less about what other people think.\n\nIt is easier when I go somewhere where there is zero chance of running into someone I know, and easier when I am in a setting with just a few trusted friends who I know have my back.\n\nI have never, NEVER, been approached by strangers and insulted or questioned about my condition. Most people simply do not care. \n\nI have had friends ask about it, but it was out of genuine curiosity.  I had one ask me if I would ever considered having corrective surgery. My response was, \"What? Get it centered? That would be almost as weird as having two!\"  Then I dismissed it while he was standing there confused.\n\nYour Poland syndrome does not define you. It is not what makes you, you. It is only a characteristic, just like having freckles, blue eyes,  or facial hair. There are other people with similar traits, but we each have different personalities, life experiences, and social circles. Do not be embarrassed because you happened to be born the way you are. Sorry man, same situation here and I have no advice, just want to let you know you are not alone. Same here for me to! I wish I could give you advice and say, that is what I did. But I cannot, because I am still struggling with it. So hopefully you can learn from my mistakes, the mistakes that I make every day, and have for most of my 44 years. I used to cop a lot of shit in school, it really affected my confidence.  I used to lie about my body and did not sleep around a lot.  Eventually I became a dive instructor, worked with my shirt off every day in-front of strangers until eventually I did not care, thing is they did not care the whole time.  If you are worried about what a sexual partner might think, in my experience they do not really care either.  Through my life I have done a whole lot more physical stuff than most people.  The only issue for me now is the physiology of being a bit asymmetrical throws me off centre a little, that is it.  I like that I can fit my right hand into tight spots to pick up things and I can eat in bed with dipping sauce in my chest lol.", "Registration is now officially open! ", "PS Doctor Recommendations Just looking for a specialist or someone I could speak to about this. I am not looking for a cosmetic surgeon. \n\nIm looking for someone outside of my general practitioner that understands ps patients issues. Does anyone know of a specialist that I could speak with via video or in person? Following I dont know a specialist in PL but I found a lot of success in seeing a Sports Medicine Doctor. While they have little to no knowledge on PL specifically, they do specialize in body anatomy. Together we have figured out how the right side of my body has been compensating over the years and have been working to get more mobility in my shoulder with physio. I would recommend booking an appointment with one and maybe try to find a university since it is cheaper and they would likely give you ultrasounds and MRI's for free. Through the Ultrasounds they figured out that I still have both tendons of my pecks but little to no mucle on them and for some strange reason my pectoral major tendon goes all the way down to my elbow rather then my shoulder. Doing another ultrasound soon to determine if surgery would be an option which I sincerely hope it is. All these useless tendons have done is restrict movement. Best of luck my dude!", "I am a 32 year old with Poland Syndrome. My life is amazing. My partner is beautiful beyond measure. We have been together 12 years and just had a baby 2.5 weeks ago. Your birth defect does not make a difference if you meet the right person! Hello everyone. \n\nI see a lot of posts on here with a lot of hopeless and depressed people. I was you. I get it. I spent the first 20 years of my life depressed and certain I would not only never have sex, but would be alone for as long as I lived. I was certain that no one would ever find me sexy. I was certain that I should just kill myself. And I attempted suicide multiple times. \n\nI just want to share with you all that it is all bullshit. \n\nI have backpacked all over the world, working on the road (we do not come from money) with the love of my life. I run a business. I am an author of multiple scifi books. I now have a child. I am living the life I assumed with total and absolute certainty I would never have. \n\nHere is a link to my Instagram as proof of having Poland Syndrome. I post many pictures of myself without my shirt on, something I would have never dreamed of when I was younger. \n\n(\n\nHere is a link to the specific post where I share my story about overcoming my birth defect and body dysmorphia in general:\n\n(\n\nStop believing what your mind tells you. You are beautiful. You are worth it. And one day you WILL meet someone who sees you as beautiful and sexy. \n\nThe first time I told my now partner (been together 12 years, just had a baby 2.5 weeks ago, we just have no interest in marriage as we are not religious) about my birth defect was the very first time I met her. We were out at a bar in both our last years of university. I was still a virgin, of course, while she was quite sexually experienced. She took my breath away. She was beautiful, funny, captivating in every way. But of course, I knew I could never be with her because I found myself disgusting and horrifying. With nothing to lose, I told her, \"Want to see something crazy?\" she nodded. I lifted my shirt and showed her my chest. \"I only have one pec,\" I said, assuming she would turn away in disgust. She simply said, \"hmmm, that is interesting.\" And we went on having an amazing conversation and went back to my apartment to make out. We have been together ever since, 12 years now, like I said. \n\nStop believing that voice in your head that tells you you are gross and deserve to be alone. It is bullshit. There are many people out there that will love you for you and not your mere physical traits. There are even people out there that will find your body, just how it is, sexy! \n\nHave confidence in yourself. It is just a body. It means nothing! If I could do it, so can you. \nIf you or someone you know is contemplating suicide, please reach out. You can find help at a National Suicide Prevention Lifeline\n\nUSA: 18002738255\nUS Crisis textline: 741741 text HOME\n\nUnited Kingdom: 116 123\n\nTrans Lifeline (877-565-8860)\n\nOthers: \n\n \\&gt;It is just a body. It means nothing! \n\nThat is a hard, *hard* sell but I am glad you are enjoying your life and I hope you continue to forever.  \n\nShaking off the feeling of \"no one takes the defective apple when there are so many good ones\" is a never ending battle - and I am already married so it is not even a thing for me, except in my head.\n\nI will remember this post next time I feel defective.  Well, the time after next because next time came while I was writing this. That is perfectly reasonable and fair. I still have my rough days. But as you noted, it is all in our head. Everyone is dealing with something; for us it is more obvous than for others. But the truth is that everyone is defective in some way!", "Not 100% that this is Poland syndrome at all, but any suitable surgical suggestions?(right pec contraction=feels like chest tearing itself apart :/)  I am not a doctor but Poland syndrome is the absence of your pectoral muscle or an under developed one. Your pictorial muscle seems to be there and developed. Maybe go see the doctor about it, as it does not seem healthy either way Do you have any other things about your body that are not “normal”? Right side of my face shows clear lack of muscular development, dimples (which are that themselves) more obvious on right. I am having a septoplasty as my septum is deviated such that my left nostril is almost non existent.\n\nAlso difficulty moving extending neck (on right side) If you feel pain or discomfort go to the doctor. But it seems like you are just body insecure. I know this is old but, just in case, I wanted to say that in addition to the absence of pec muscles I also have a small right hand. Thumb looks almost normal but fingers are around half the normal size.", "Facial Manifestations Hey all!  I am 33 years old and was born with poland syndrome.  Usual missing pectoral (right side) plus a few other muscles.  My right arm is about an inch shorter than my left, but thankfully otherwise normal.\n\nOne thing in my research I have not seen is facial deformities.  The right side of my face \"droops\" a bit, and I kind of have a bit of Forest Whitaker eye on that side.  Anyone else have this?  Curious if it is a common occurrence or perhaps some unrelated congenital defect.\n\nStay strong! (On one side anyway.) Hm no I never see that in my research as well. Mine as far as I can tell has not affected my face though. I am a female and I have it on my right side as well. I do feel that the right side of my face does droop as well! Thanks!  It is as though the entire right side of my body is *slightly* smaller than the left side.  Was never enough to keep me from physical activity, but just always looked a bit weird in the mirror. yeah. I didnt even realize I had any differences until recently. Very subtle but I did notice that my rib cages on my right side are uneven compared to my rib cages on my left. For example, laying down on my back and feeling my ribcages, the right rib cage is significantly lower than my left.. Strange!  Mine manifests on the left side and I have noticed some drooping with my left  eyebrow! Weird! 🤔 Same with me!!! My entire right side--face, torso (obviously), leg, etc. is smaller/ affected. Absolutely. Also, I will add this: even the right side of my penis (corpus cavernosa--spelling is probably off) seems to be smaller or something--causing a bit of curvature with Mr Happy. Maybe it is causing by my right leg being smaller? Hell, I do not know. Anyway, I am sorry to hijack your facial comments with me yammering about my penis...but you never know when mentioning something like this help someone else in some way.  It is interesting to find out the many ways in which it manifests.  I recently found out I might be missing a kidney.  Not sure if as a result of Poland's or not, but we will see. Hello I have Poland and my face is definitely droopy maybe, hugely asymmetrical to say the least. Noticed it as I got older  26F. My face is not droopy, but I feel its more asymmetrical than other people's. Also, even though mine manifests on the right, I have found my belly button is slightly skewed to the left. I do not know if \"droopy\" was the best way to describe it.  But one side of my face always looks more \"tired\" than the other in a sense.  That being said, all my life nobody's ever really commented on it so maybe it is just a psychological thing.", "Muscles I have been working out recently and been touching the bench press. I was just curious where my strength comes from if I have no peculiar muscles. i am no expert but i am missing a left pec. when i do chest workouts, i notice my left shoulder does most of the work for that side I am missing almost all of my pec and the only left pec I have is one my collarbone. With that being said, I can bench 260 and I am 220lbs 5'7. Not super impressive in terms of weight, but I am 16 years old. You should be fine. Do not be afraid to do compounds. Deltoid, bicep and tricep dò most of the work So is your shoulder bigger on your left side? I have bigger shoulders so that might be why. i have not noticed but i am not very muscular to begin with, i just like to stay lean Yeah my shoulders crack and pop all the time on the side without a pec. I found that doing banded shoulder rehab exercises and warming up your labrum before working out really helps. I also use dumbbells a little more than barbells for bench press.", " Looking to share positive energy with you all. I was diagnosed quicker than most when I was an infant because my parents are incredible human beings and they went above an beyond to connect me with their colleagues in the medical field. All I want is to connect and say hi. I have been on Reddit for a long time (under various user names) but until tonight it never once occurred to me that there might be a sub for my specific birth defect.\n\nIf there is anyone out there who wants to chat or share experiences with me, I promise I am here for you and I will reciprocate with experiences from my own life if you would like. If you are not vibing on it, please just know that I am doing quite well and I sincerely hope you can say the same.\n\nLove!\n\n- Tyler (Seattle, WA)", "ok here I go.... how do u get round chest and have sex with girl?  I am a woman, and have had surgery but I think it is still pretty obvious I have PS. So it is a little different but I know how you feel. \nI usually mention it beforehand if it is someone I am dating. I do not make a big deal out of it. If it is a hookup I tend not to say anything, and no one has EVER mentioned it. Sometimes I will say the next morning or make a joke about my “dodgy boob” and then they will be like “oh yeah!”\nI am nearly 34 and it is taken me time to make peace with my PS and love my body, but once you accept and love yourself, it makes things a lot easier. Anyone who has an issue with your PS is not worth your time or energy. Good luck! Just let her know and she probably will not care. My husband made a big deal out of it when we first met..He pretty much made me sit and look at him standing in front of me ..and I just said \"OK?\" It is only a bid deal to you because you feel different but we just see a person we like. Good luck. I am always afraid when I have to tell a new partner, but I have literally never had anyone say anything negative or be mean about it. And I have been in both bad and good relationships. It seems like its something people accept pretty quickly. Women do not care lmao just explain it very briefly and as long as u treat it as no big deal, she will treat as no big deal. I get much more pussy than my normal chested friends. Just tell her straight up. The vast majority of women do not care, and the ones that do just are not worth it. I have Poland syndrome and I have been with the most beautiful woman in the world for the last 12 years. We just had a baby 2.5 weeks ago. The first time we met, we were out at a bar talking and I said, \"want to see something crazy?\" She nodded her head. I lifted my shirt and said, \"I only have one pec.\" I assumed she would be disgusted. She just shrugged and said, \"hmm, that is interesting.\" And we continued having an awesome conversation. It never mattered to her. They do not care Lol savage He is right, they do not care.", "Another Federal government website for the National Human Genome Research Institute with information on Poland Syndrome and resources. ", "Breastfeeding with Poland’s Syndrome Hi all! Question for women out there with Poland’s Syndrome: has anyone had success/experience with breastfeeding on their affected side? This is an odd question but I have never gotten an answer from a doctor, and as I am planning to have kids one day I would like to know what to expect. Thanks! Hey so I am breast feeding currently. My affected side is my right side and it is def a shitty titty. It is produces only about 1/3 of the left one but titties are pretty resilient. I have been able to exclusively bf my first one for 13 months and my second one for 5 months now. Thank you sooo much for your reply 🙏🏼. It is so helpful to have literally any information! That is amazing that you have been able to exclusively bf for that long Yeah my affected breast produced less milk. But the positive thing with that breast was that I could give my breast as a pacifier. My two kids could use it just to snuggle and suck whitout getting a mouth full of milk, and didnt have to worry about it getting much bigger by it. What I can remember they kind of evened out and nearly became the same size\nWhen I stopped breastfeeding them they prefer my \"little nipple\" as they call it. \nMy doctor couldnt either tell me how my production would be. Glad to help! At the point where you are breastfeeding make sure to subscribe to the breastfeeding sub the info exchanged there is pretty helpful. Hmmm cannot wait for even more uneven tits lmaoo 🙋🏻‍♀️ Same, affected side produces less milk but I have no trouble just feeding off my good side (7 months now and no plans to stop anytime soon). I have actually started just using the haaka on my affected side to collect extra milk and then exclusively feed from the good side. It works.. Oh wow I have never thought of using it for comfort... Nice to hear there might be some positive nursing aspect to all this. Thank you for sharing! So have your tits become even more uneven during/after breastfeeding? I had the surgery and am wondering if I should be planning for another post-child rearing I have not breastfed yet but I can imagine that there will be a huge difference after breastfeeding since both breasts are still build differently and thus one may produce less milk than the other one creating in more unevenness That has not been the case for me , the only time where there is a difference I can detect is when I am super engorged and the left breast feels rock hard and looks only slight more full than the right one. Yes to the haaka on my affected side. I do this as well because i can only get on let down so it makes sense to collect from my right breast then", "Training chest and opinions from ladies 1) Hi all, im new and wanted to ask/seek guidance on training the chest. Most trainings i just cant do because missing right uper chest piece and that front muscle that connects between the arm and the missing chest.\n\n2) how do women react when finding out?\n\nI rly want to go and get ripped and at some point was. I kind of feel that having a six pack and missing chest piece is still better then no six pack. Yet in someway it also emphasizes the missing part where its normally barely visible. This has been a major blocker for me for the majority of my life.", "I have Poland Syndrome AND Pectus Excavatum Not sure if I have seen anyone else online with both! Wow just stumbled upon this comment after being on this thread for a while but I too have both PE and Poland syndrome. Throws my bench off quite a bit and definitely try to refrain from taking my shirt off in public it is a pain in the ass believe me but I have been pretty grateful and that  I did not end up with some other crazy deformity or dwarfism no offense to short ppl. I knew someone would find this eventually lol. Yeah I had the Nuss procedure done for the Pectus. I am just going to live with he Poland tho. My gf thinks it is cute. Hang in there man and do not be scared to take your shirt off like I used to be Ya I am thinking of just fixing the Poland syndrome with a modified breast implant or something along those line and leaving the PE alone as it is not as deep as I have seen others online have Thanks for the inspiring words man. Like I said even tho there are way worse deformities out thee I still always felt held back from approaching not just girls but people in general but I am going to turn that around real soon and thanks again Same lol", "New here, what cannot we find on Reddit? Lol Hey everyone :)\nI also have Poland's syndrome. I was born with no right pectoral muscle, the ribs on the right side of my rib cage are thin and have fused together, my right clavicle is higher than my left, or is it lower? (Cranes head down to look with no success). My right arm is very much smaller than my left l, which makes me left handed lol. And like most of us I have the \"dent\" in the center of my chest. It is a deep one too😅\nLately I have been getting this weird numbness, tingly feeling in my right arm, that kind of sucks, kind of scares me. Also another scare is when I stretch or move my torso a certain why it feels like the right side of my rib cage shifts up a d it is uncomfortable for like a minute.\nAnyways, I am glad to be here and look forward to chatting if you all like :) enjoy the day! Welcome! Yes, numbness in the arm sounds scary, did you tell a doctor?\n\nI do not have PS but my son does, he is got the dent and smaller r arm and hand. He is almost 3 and a strong little bugger. I love everything about him. Symmetry is boring! I do sometimes worry that it will be a burden to him for certain things but all in all it seems very minor at least to me...\n\nI hope everything is good with you and you are enjoying the summer!", "What is Poland Syndrome in Men?  Is there actually anyone active in this community? Lawl I subbed to it but thought it was dead. It is pretty dead but I am not surprised. I have always been interested in this surgery and it was cool to learn a bit more about it. As you can see by my username... you can probably guess what it means. I think the surgery is interesting as well although I do not think I would ever get it. I think it is cool that plastic surgery can actually change lives and help people rather than just be a mode for aesthetic disparities. I think it really does help people with poland syndrome.  Tbh I feel it is a waste of money...and pain... for what? For us to fit in? Fuck that lol I am not spending thousands of dollars for other ppl to accept me 🤷‍♂️\n\n...but that is just my opinion. \n\nAnd yeah this sub is dead lol I feel like only 0.5% of the world even knows what ps is and even less have it lol how lucky are we? Lol my pediatric doctor did not even know what it was until she met me. I have got Poland syndrome and was diagnosed as a kid. Missing right pectoral major completely.\n\nWhen I was a kid I was kind of fat, but for some reason no fatty tissue grew in the area where I was missing the pec muscle. So I had a moob on my left chest and this hollowness on the right.\n\nI was offered reconstruction surgery for free under the public health service because the difference was so very large and noticeable under clothing. I suppose for mental health reasons or whatever.\n\nI was given 2 options- one was to take my right lat muscle and move it into the place where my right pectoral major should be, giving me a more symmetrical chest at the expense of back muscle. This would be a loooooong surgery with a long recovery time and would leave me with a weakened right side for life.\nThe other choice was to have what was essentially a breast reduction surgery on my left side to make the difference less obvious. Fast and easy with a quicker recovery time.\n\nI chose the latter, (I was about 12 years old, but my parents let me choose for myself) and was initially happy, although the recovery was pretty much agony for about 3 months. Any shock load to the body was amplified in that part of my chest and I had to strap my chest in elastic bandages to stop the tissue from moving as any little wiggle caused pain.\nHowever, as time started to pass and the wound began to heal I realised that the scarring would not fade all that much and I now have two fucked up sides of my chest.\n\nThe way the surgery was performed was that they removed the nipple from my left side and then removed the fatty tissue before reattaching the nipple. (Is this even how a normal breast reduction is done these days?) The nipple now looks like it was chewed up by a dog and has a much larger diameter than it did before the surgery. My right nipple is also tiny because it did not develop properly due to the PS. (It was about half the size of the left nipple pre-surgery and now looks about 1/4 the size due the the scarring around the left).\n\nFor some reason nobody at the hospital was able to tell me when I was a kid that if I just lost weight (which happened naturally once I grew into my teens) the problem (one man-boob) would right itself.\n\nThat was 20 years ago but is still an odd conversation to have to have when meeting a girl.\n\nI would not recommend getting surgery for what is purely a cosmetic thing. Even the video posted is not a real solution, given that the patient will either have to try to maintain the exact muscle mass he had at the time of surgery or return for different sized implants as his body composition changes.\n\nI recently found a YouTube channel called Poland Syndrome Bodybuilding where there is a guy that is pretty jacked who has PS and it really does not look so bad once the muscles that are left there grow and start to fill some of the gap that is left! Currently working towards something like that but am still a little pissed off that I let the public health service have their little experiment on me (they would never operated on somebody to correct PS before, and had only ever seen one other case of it at the time).\n\nAnyway, nothing I can do about it now! Maybe I will help somebody decide against what could be a shitty choice.", "FREQUENTLY ASKED QUESTIONS ", "joining the army with poland syndrome i really want to do i but im scared that my dream cannot be done because my right pectoral is partially missing. Will i be able to join? I was not able to 😔 I assume that as long as you are able to pass any physical tests then you would be fine!\n\nThis is just an estimated guess though* there is a guy on insta that is from the army. looks like just pec muscle absence though I was able to get a waver for the Navy. I just had to prove I could do the physical fitness test with no issues. You will have to go through a waiver process to prove that you can pass the physical tests, but it should not be too big of a hassle (I have gone through it, though did not end up joining). What do you mean? What happened?", "Any recommendations on support groups?  It is hard to find a good one since we are a rare breed not everyone is as lucky as we are, every time you find one is a ghost town.", "Chest Protector for Child's Sports Hey there, \n\nCool to see there is a subreddit for this. Any advice on protection for playing sports?\n\nMy 8 y/o son has PS, which in his case means he is missing 2.5 ribs and some lat muscle on on his right side. It does not affect him in the least, but he is VERY into sports and started playing soccer. I am concerned about the possibility of a stray ball in the wrong place causing heart or lung damage. I would rather him not play tennis or baseball (or soccer, really) without some kind of protection. \n\nI am trying to find something that will guard his chest and still be unobtrusive but not sure where to start. Any recommendations? I would not worry too much about it. I am missing my left pectoralis major and did Taekwondo to a high level and then later in life field hockey. Doctors said that I do not have the muscle to help absorb any impact from a kick etc but my bones will do most of the protecting anyway.\n\nBeen kicked in it before and had a hockey ball smacked into my chest before between the ages of 12-16 and never had a break or internal injury Hi, I found a recommendation for a chest protector in one of the facebook groups which look like a good option.   \nHope that helps: (", "New here! I am a 30yo male, left side affected\n\nMissing pectoral muscle\n\nMissing some bicep \n\nMissing 4 fingers off my left hand (still have my thumb) \n\nOver the past 6 months I have started to develop back pain and a slight curve in my lower spine. After doing some research its possible that I am developing scoliosis. \n\nDoes anyone have this same issue or know it will these two conditions are linked? \n\nI have an appointment with my doctor in the morning so hopefully she would some light. \n\nJust wondering if anyone is going through similar issues? I went to a chiropractor and she connected my scoliosis to how my body was trying to compensate for having Poland syndrome. Hey, good luck and I hope you are able to fix it asap.", "23M Looking at surgery Hey!\nI am a 23M currently ”battling” with my mindset about my PS. I have pretty mild ps, only my right pec is missing everything else seems normal.\n\nI literally hate wearing t-shirts, everytime im outside in the summer etc i feel ashamed that on my left side you can see a clear pec under the shirt but on the right side its just flat.\n\nI have been looking the past few days at surgery and i can say from what i have seen it look pretty good on the after pictures.\nI know i cannot rely on surgery that it looks 100% symetrical but if it just makes that i can wear my clothes with self confidence i see this as a complete win.\n\nHave anyone here done surgery and how did it turn out?\n\nIm willing to spend every penny it takes for this I have PS and I am 16 and I have gotten over it. I am chest and arm affected on the left side. Truthfully, nobody cares that you have it. You will be asked questions, but if you can brush it off, others will also brush it off. After all, it is YOUR chest. Had surgery, I am female. My Poland side is encapsulated so I need to have another surgery to replace it. Also if you do have the surgery, implants have to be replaced every fifteen years or so. I am happy with it, but it is a big decision. I have Poland's Syndrome, am a male and have had the surgery. I was always very good at hiding it, but after going to the gym people started noticing. I basically hate most attention, used to do swimming club but had to quit once I really started noticing it in my body. To me, having the surgery was one of the first step towards finding my confidence. I have always been well shy, and although I have had a lot of good friends push the shy out of me, this was one of the big major groundbreaking steps towards gaining my confidence. I know a lot of people have this viewpoint that aesthetic is 'shallow' or whatever but to me that is just another dimension of depth, you to do you. The surgery has its drawbacks, it is way harder to pull anything and I am right-handed, but it was a true game-changer for me and I would never look back.\nIt is never going to look 'normal' but under a t-shirt, especially once I build it up it will be fine. You obviously have a massive scar in ur armpit but to me they are all badass XD I am terrible at replying but I will make sure to reply to this for sure, it resonates too much. The more information you have the better decision u can make, hope I can be here for u if needed ✌️💜 Male, 50. Right pec non-existent.  Never had surgery. I figured if was only cosmetic there was no point. I have always worn baggy shirts.\n\nI will say though, that at my age and weight it is a little weird to have one moob.  Still, I do not care that much.\n\nEdited to include: I totally get if cosmetic bothers you enough to want surgery. In my teens, I thought it would be something I wanted to fix after I \"grew up.\" Then by my early 20s I did not care.\n\nI put \"grew up\" in quotes because I still do not feel like a grown up. Just the answer i was looking for!\nHow does it feel today wearing clothes? \nHow does it look today under the shirt, you comfortable without shirt?\nDid they do a 3D scan or what kind of surgery did you have? This is a decision im willing to make :) Really glad hearing you are comfortable with it. Sadly i really cannot get over it. I completely understand. I was also just as insecure as you when I first found out I had Poland syndrome. It took years for me to get over it. I am assuming you are a man like I am, which probably makes it easier. It will take years to get over it, but I promise you will eventually. You have got discord or something where its easier to get in touch with you? Had same surgery, needed to replace implant after 13 years. I actually got one implant and one reduction in my first surgery. I have not gotten around to replacing it and it is been 4 years. I am comfortable with the difference of a small B (nearly A) and a full C cup that I still wear bikini tops without too much concern. Most men I have been with do not have an issue with it and some say it is like having two different women. Will get the replacement eventually, just not in a rush is all. Haha I have heard the same thing. They say having two boobs gives them two experiences lol. I have to have a lift on my non Poland side and nipple change since there are different on each side. It is been about ten years since my surgery and if it was not encapsulated I would not even bother changing them For sure, next time under the knife I will lift the non PS breast as well. My implant was nearing to cross my sternum and although encapsulated the surgeon rushed me to pull it out with 2 weeks of seeing me due to that concern- apparently that is an issue with us as well… or it can be, as I am not sure your specifics. I never got any information really on my diagnosis. All I know is I have it. Not sure if I am missing muscle or anything like that. Next time I go to the doctor I want to ask if I am just missing fat or if I am missing musculature Gotcha, I am missing the muscle, tissue, and some upper ribs. Always best to get a full check, sometimes PS is paired with other things too. Yes definitely want to know. My surgeon said they just treated a person missing muscle and ribs. They said that there heart could be seen beating through the skin. Sounds rough, I also have Dextrocardia so my heart and organs are a bit backwards. Do not wait too long getting checked! Thank you! I will. Is the dextrocardia related to the PS I have read that it is been seen with PS but not sure it is connected directly. It is all about parental genes connecting. 22M, only left pec is effected. Having the surgery towards the end of the year and I cannot wait. Glad to hear that! What info have you gotten? You doing 3D scan of your right pec or how does it work out? :) We were originally doing the pectoral implant on the government health service but I have opted to go private since I have waited 3 years.\n\nThey are doing a breast reconstruction now which is using my lat muscles instead. Cannot wait! We were originally doing the pectoral implant on the government health service but I have opted to go private since I have waited 3 years.\n\nThey are doing a breast reconstruction now which is using my lat muscles instead. Cannot wait! I have heard about that!\nHow does that work? Are you able to train your lat muscle to its ”original” size again or is that a ”sacrifice” you will have to make?  And have you seen before/after picture of someone who done it that way? :)", "Female w/Poland Syndrome Just curious of the different outcomes for P.S. P.S. effects my left side. Missing complete pec, breast tissue, underdeveloped nipple. Less muscle in upper arm as well. Just ribcage with skin:( I have had the Lap Flap surgery with a silicone implant. Still not the best but getting closer. My \"problem\" is on the right side. I have a saline implant in my right breast and a lift on the left breast. \nWhen my kids was small my right breast produced less milk. I went ahead and had a silicone implant placed in my right breast too to give a more \"symmetrical\" appearance. I will never be able to breast feed on my left side since nothing ever developed beyond my intercostal muscle. Body fat will not even accumulate there. Surgeon took a section of my latissimus dorsi from my left side and reattached it to my chest and into my arm pit to you know hide a super super noticeable breast implant haha did your right breast size increase at all when you were pregnant? Fellow female affected here 😊 nice to meet you! I am right side affected, missing pec major but have my minor intact. Right hand has shorter fingers with some fused joints. I have not had any surgery, but I have always been interested in getting an implant to even things out. I am missing some of my upper ribs (which I only found out in the past year from my chiropractor) and my right lung is smaller (hello asthma) as well as the veins and arteries on my right side. \n\nI think it is so interesting to see how differently it affects everyone. I actually did my human biology project on it in college 😂 my professor thought I was a genius for even knowing about it and then I had to show her that I have PS as well and that is why I was interested. I am another female who is affected! I am too young to get the surgery and I do not even know if I want it yet. But, I use an insert into my bra right now. I used an insert in my bra in my teens as well. Not many surgeons are familiar with PS so if you decide on surgery you will most likely have to go to a larger city to see a specialist. My surgeon specializes in breast reconstruction surgery for breast cancer survivors and breast augmentation.", "Unexpected help for back pain related to Poland's I have had back pain due to Poland's and the scoliosis it caused for me for three or four years - usualy mild, but with flare ups that make it hard to walk. I do not know if this is common for people with Poland's, but I thought I would share because something actually genuinely helped it.\n\n\nThe treatment is called kinesiology. It works on re-balencing muscles through energy centers in the body. Obviously, I was extremely sceptical, and I mainly went to please my hippie of a  mother - even she was sceptical. During the actual treatment there were times then I thought \"this is utter bullcrap\".\n\n\nAll I can say is that it worked for me when I did not think it would. I walked out with the least back pain in three or four years, and cried with happiness all the way home. Thank you so much for posting this, I am 22 and have recently been getting obscene back pain, unfortunately I am also missing my latissimus dorsi on the effected side (the large back muscle) and you have given me some hope that it wont always hurt this much. No problem, I hope you find something that works for you", "Female reactions to missing a pec? I am missing a full pec, smaller bicep/forearm on that side, you know the drill. Just curious if anyone older here would share how women react to having only one pec etc. thanks in advance Its not something I tell people straight away.  My friends know and I am open about it.  \nWith girls, either ones I am interested in or girlfriend's, I have told them early on, before any shirts come off, and none of them have had any bad reactions.  A few have been more interested than others in the science of it but the worst reaction I have gotten was a \"oh cool\" from it so nothing negative at all. \nOne girl that was studying biology at the time was the most interested, and constantly asked to feel it and chat about it\n\nEven though I sometimes feel self conscious about it, my girlfriend reassures me that a) its not really that noticeable and b) its nothing to worry about\nIn fact I have found out that they tend to favour cuddling on that side of me, apparently its her 'nook' \n\nDo not worry too much about it.  I would suggest talking about it before any clothes come off just so there is no confusion. And remain calm.  Her reaction will mirror yours, if you are open about it and relaxed she will see its no big deal. \n\nStay confident my man! 🙏 I have never had any woman have any negative reaction, mostly just \"I would never have noticed unless you said something.\" Frankly, I am not sure I believe that, but again, it is never been an issue. Also, like Chrisy1221 said, i have had several girls say that like it cause it makes laying her head on my chest easier. :-) I know the feelings and concerns you have all to well and In my experience it was misplaced, I spent a lot of time in my life worrying what women would think and how could  I compete with “normal” guys, feeling ugly and ashamed of it. Turns out most women or at least the ones worth the effort do not give a shit about it. Your built how your built and there is nothing wrong with that, trust me my dude you will have a lot of other way more important things to focus your energy on in life. Now go out there and slay like the best of them As a woman missing a pec, it is interesting to see this from the flip side! I am curious, what has your experience has been with men? Right on par with the comments here! Nobody has ever had a problem with it in the moment, and most either said they might not have noticed much amiss, or were kind of fascinated by it. My first serious boyfriend said he enjoyed the \"variety pack\" that were my boobs. Another one said it would be a great place to hold chips or M&amp;Ms if we wante to snack after sex.  A few have said that the pecless boob was their favourite of the two. I am pretty up front about it early on though. If a man is seriously into boobs, that is fine by me, but I am probably not his first pick. Luckily, I tend to attract more \"ass men\" so maybe  that is why it is never been an issue. Variety pack heh nice  😎 I think most humans are less vein than we think and a lot of insecurities we have  are built in our own heads based on the media we consume/ shoved down our throats Same!! Well I am a woman missing my full pec, all breast tissue, and underdeveloped bicep. Just ribcage, tiny faint nipple, and skin all on my left side. I was not aware women could have breast without pec muscles. That is interesting! Poland syndrome has all different outcomes:) 37yo, missing all right pec plus 3 ribs. im a physician. until my 25's i was very concerned about that. today not so much because from all women I have had intimate relationships, the only one that asked something was one girl who was also a physician (even her, after a couple of months later). Im still surprised until today how almost no women notice or care or ask about. For something I am still obsessing over, I am amazed how few people ever even noticed. I have learned that what I see, is not what others see. I have had some people say I have a great chest. My initial reaction is to laugh, since I feel like a mutant, which is my own insecurity speaking but I am getting better saying thank you.Still, I always feel the need to tell others before I even think about going shirtless; sort of a defense mechanism. I am 62 and a gym regular. Working out is not easy when you are asymmetrical but I find it helps with the backaches I get as a result of the imbalanced sides. I am not a guy so I do not have that perspective for you, but as a female who is interested in females I can tell you I have never had a bad reaction to it. I think the best advice I can give is that if you do not make a big deal out of it, then 9 times out of 10 the other person will not either. And if you do run across someone who throws a fit over it, they are not worth your time because they are just an ass. Just be confident and everything will work out. idk about women, but i am a gay man and i have shirtless pics on my dating profile and even in person i have never had any type of reaction to it. i do not say anything unless they ask I spent a long time being terrified to date and wondering how women would react to my full missing pec and smaller bicep. When I finally got into college and started drinking (do not become an alcoholic, this was just a university thing for me), the confidence made me forget all about the pec, and I finally started trying to date and even hook up. I found out that not a single girl cared. I have been extremely happily together with my wife now for almost 11 years, and she is so blazingly hot, so far \"out of my league\" in regard to how I used to view myself. It is possible you will meet girls that care about it, but they are certainly very few and far between. It is all in your head dude. I used to never even be able to enjoy having my shirt off at the beach or at the pool I was so afraid of how women in particular would react--you might feel the same way. I am telling you dude, no one cares. Only you care. It is legit an awesome conversation starter--that is it!", "Does the implant reduce pain when you get punched on the affected chest? I am a huge fan of fighting and MMA so this matters to me. Mine does not.", "Prosthetic If I have Poland syndrome and it affects one of my hands will I still be able to get a prosthetic hand for lifting the ones I see online?\n\nI know its a dumb question but I am not an amputee so I was just wondering. Hi! It depends on how your hand/Arm is formed! But I am getting my prodthetic really soon and my arm is severely disfigured. It might pose a challenge to the people, since prosthetics for amputees are easier to make, but still very possible. If you want to ask me more questions regarding my prosthetic, feel free to ask!", "Slightly different request, guidance with surgery for shoulder. 19yo male pissing pec major and minor on left side, no webbing or anything else just the pec muscles are missing. I have **kind** of accepted it, it is what it is, the missing pec does not even bother me that much anymore, what does bother me is the quite visibly \"pulled up\" shoulder on the left hand side. \n\n  \nThis is what it looks like: ( (minus the pec muslces lol and sorry for the bad edit but I hope you get the idea)  \n\n\nTL;DR: in simple words, I do not like it and can this be fixed with some surgery? Can my shoulders be the same length and same height?  \n\n\nAnd I know we are supposed to be positive but I absolutely hate it! It has gotten more prominent as I have grown older and I cannot even look in the mirror without getting depressed. It sucks, I hate this look, it always looks like I am consciously pulling my shoulder up, like I am flexing my traps. I have seen videos of me taken from behind and looking at my shoulder just disgusts me. Even shirts fall on my left side, the sewing in shirts for where the arm starts is 1/3 down my biceps.   \n\n\nI want to get surgery to fix this, has anyone done something similar? I do not necessarily want to get the implant but if that is what I have to do to get even shoulders I will get the implant.  \n\n\nP.s. I also go to the gym,  would that be making it worse? I rarely do chest exercises but I do a lot of shoulder workout? You think my traps are trying to compensate for the missing muscles?   \n\n\nGuess I have not accepted it haha. I recommend you go see a doctor if you are concerned with your joints. That is all I know. So I am missing my left pectoralis major so I will explain what j can from my experience\n\n1) I notice my shoulder gets raised on the left when doing workouts and there is a reason for this\n\nI saw a remedial therapist for general care etc and when I do an exercise which should use my pec it obviously cannot so other muscles substitute, such as the anterior delt taking extra strain, part of the lats and all of your shoulder. Including the small muscles in my shoulder. So muscles that are not often used are now under intense stress so they grow and I get an imbalance\n\n2) can they be the same length and height?\n\nI believe not. Due to them constantly being active they will always be different to the other side\n\nThe implant would not reverse this from my understanding. I was told that if they loved the muscle from my lat then you have a back imbalance and something else will then look weird, plus the muscle will be \"dead\" so you cannot actually create strength within it so your shoulder will still overcompensate as it has done X number of years as that function, you will not have the muscle memory to engage the new pec\n\nThere are some exercises to stop the muscles going into spasm and becoming smaller but that is mainly a pain thing instead of visual.\n\nJust got to roll with it and do what you can Thanks a lot for your comment. Just visited an orthopedic today, and they said pretty much the same thing. All these years it took me to accept the missing muscle but now I have to face this?! Fuck. that. Every time I go out I know people look at my like I am the hunchback of Notre Dame. Fuck man this shit is just not fair. At all. If there is a God he can suck my big, bitter sweet, sweaty balls. Depending on where you live this rant might have been part of your morning notifications checking routine and for that I am sorry, but I had to let it out somewhere yeah it is a bitch. I still swim with my top on but that also hides the belly I have been growing (Thanks university drinking!) but i have never paid much attention to m shoulder as i only notice it at the end of a weights session. it is something i am keeping an eye on but it might be that i just have to overload the opposite sides traps to create the best visual balance i can if it becomes an issue\n\n&amp;#x200B;\n\njust got to keep moving forward and finding the spot that makes you happy Yeah I guess, no other option.   \n\n\nHave a good day man!", "How many dips can you guys do and what is your bench max? Just wondering. I can only do about 5 dips but have no problem banging out push ups. Poland syndrome does not seem to affect my push ups too much, although it visibly affects my dips. What about you guys?", "Question about workouts! Hey guys and gals,\n\nI have a question regarding workouts, specifically bench presses: do you find that your max weight had plateaud at a weight lower than you expected due to the lack of a pectoral muscle?\nFor the record, I am a 22M who is being working out for the past 8 months+ And my bench press specifically is stuck at around 40kg, keep in mind I only weigh 70kg.\nOther exercises have improved and I can see progress, just not in bench presses! \n\nAny info/help is appreciated!  Hey! 25M with Poland Syndrome, and have been working out for the last ten years. I am 6' 1\" and weigh 82kg. I am only missing about 75% of my left pectoral muscle, but definitely noticed all my upper body lifts plateau at some point.\n\nI have never been able to go over a 60kg bench, but that is mainly because of a fear of ripping my muscle in half. But apart from this, I have also seen my tricep and shoulder workouts be affected drastically too. \n\nWhat I personally did was lift weight just to maintain the muscle mass that I currently possess, and focus on running as my primary activity (i.e. the one which I set goals in, and compete).\n\nHappy no answer any more questions you may have, but having this Poland Syndrome has affected me in numerous ways. But there is always ways to overcome them!\n\n&amp;#x200B;\n\n&amp;#x200B; 26F I have never been able bench press more than 30lbs. I also cannot grip things right so I have never been able to consistently work my arms. My son has Poland syndrome, smaller right arm/hand and missing most of his right pec. Obviously he is awesome in our eyes but are there any particular challenges we should watch out for? Any sports to avoid?", "Quick question, but I just read how a parents were notified of a newborn's poland syndrome, why were not mine notified at all? Was born 2005 btw I just told them right now and they did not even have a fricking clue. images are proof btw  My husband was not told either, even though his mother has it, she has a small hand and shoulder. She did not know either! He was told he had the umbilical cord wrapped around his chest? \n When I became pregnant my husband was worried about our kids having his \"birth defect\" so I looked into it. Neither one of our boys has it. FWIW my son left the hospital without the Dr knowing. This was 4 years ago. We did not notice until the day we brought him home. His pediatrician said its possible to miss it because it is not on many doctors’ radar. I did not know I had it until I was 13. It is a lot harder to tell if guys have it, at least that what my doctor told me. I was diagnosed at 6 months, but I am a girl. I guess just because the extra fat that girls have make it easier to tell? Also depends on how severe your case is.\n\nETA: a lot of doctors do not actually know what it is. Thankfully the doctor that helped deliver me knew. My general doctor does not know, and the breathing specialist I had to go to due to pain in my collarbone did not know what it was either. When I was younger my pediatrician did not even know. Was born with this and dextrocardia, so got choppered to a children’s hospital. There for a few months to make sure I could survive and drs told my parents immediately when they recognized it. What is strange is you have never had a dr tell you that you have it. Unless you have never been shirtless in front of one of course. Perhaps you should get a full checkup to make sure you do not have any other internal issues. I have the same type of thing, I believe mostly because pectoral development happens later in development. More severe cases are missing much more than the pectoral, and are easier to detect young. I was adopted and my adoptive mother was told it was because of the umbilical cord was wrapped around my chest or something alone those lines. \n\nIt was not until later we discovered it was Poland syndrome. Had to find a doctor to tell me what it actually was called. I still do not think this is a commonly known amongst medical professionals.", "Possible PS diagnosis I (21 F) had a doctors appt today and the doctor suspects I have PS, which i have never heard of until today. He was feeling around and said it felt like my right side of my chest is empty and has no muscle tissue. My hands and fingers are completely normal, and my breasts are symmetrical too but I have a sunken appearance on my right upper chest above my breast that looks like an indent. My upper ribs on my left side seem to protrude slightly as well. I have chest and rib pain and chest tightness and some troubling breathing, especially during exercise and pain when I sleep on my side (which i do most nights). I was wondering if anyone could give me their opinion on my symptoms, the doctor has ordered an MRI to get a closer look but I am very nervous about this possible diagnoses. Thank you!", "I am 24 and literally just found out what this is called. I recently started working out and was online looking for tips on lifting weights with a missing pec and bam. For the first time in my life I know there are a decent number of people with this same condition. Hope everyone is well and proud of thier bodies today. Similar. I was around 45 and stumbled on this community here. Did not know there was a name for it,  or that there were so many of us. I have an exam tomorrow, other than the stress of inevitable doom I am feeling okay thanks for asking. Wow crazy!", "POLAND SYNDROME SOLIDER /// Would not it be cool if their was a gym we are only Poland syndrome brahhs were allowed too lift so we could be sharing our stories and helping our form .. pre surgery low body fat keep the shoulders boulder then the chest so when I am pumping their mirin ... ", "Any advice for bra shopping? I am going shopping for bras for the first time in years, and was just wondering if anyone had any tips. \n\n\nWish me luck! I have always worn mastectomy bras. Kind of sucks, but there are much more stylish options around these days. Man, bra shopping used to be the bane of my existence! I have had an implant now for around 9 years, but prior to that I wore mastectomy bras with a prosthetic to fill it out. They sucked but there are some cute styles out there if you search and the best part was the sales people made me feel super comfortable and I never felt too embarrassed trying them on knowing the people working at the store had seen everything before! If you need to get fitted for a prosthetic I recommend trying out all the styles they have in the store. I found one that filled out the breast and upper chest \"dent\" I have as well. \n\nI have an implant now so my breasts are much more similar in size than they were, although my upper chest still has a significant dent where the muscle is missing. I am a 32FF so when I shop for bras now I go to a specialty shop in my city and get fitted. I pretty much cannot shop at Victoria's Secret / La Senza or one of the mall stores as they do not have a size that fits me correctly. I would totally recommend that if possible. The bra fitters are always very kind when I explain Poland Syndrome to them! They fit to the larger (or unaffected) breast and we try on all the styles to see which fit the best. Lace styles do not work well for me as they do not hide the different sizes of my boobs super well. I like balconette style best, but I would recommend trying as many different styles as you can since every body is different! Hi, 24 yo PS patient here! I have found that shopping for band and cup for your “normal” side works best. And also sticking with tshirt styles. They make great fillers that cane help adjust. I really like the cute thirdlove so you should check them out!", "Weight training and isolation Hey all. I have noticed that when it comes to weight training, isolation movements are better since we have an unbalanced body. Plus, many of us are not just chest affected but also arm affected. Cheers.", "I do not know how to cope Hi, 28M here.\n\nLet me preface this by saying that I have never been diagnosed. Both my arms and hands are the same length, my fingers are all the same length, I do not have any webbing etc. In fact, I started to realise that I have PS about a year ago only. I have always been overweight, even obese by definition. Nothing *looked* out of order, I do not have a visible droop or hole in my left pec. But as far as I can remember I have never been able to flex it. I always brushed it off thinking it was because I did not have the proper nerve control and that I am just very right handed.\n\nAbout a year ago during lockdown, I decided to try and get into a semblance of a shape. I picked up my old weights that were collecting dust and decided to start working out at home. And that is when I started to notice that whenever I would do presses, I just would not feel any burn on my left side. I started regaining a bit of control there only to notice that the part of the pec I was now able to flex felt a lot shorter than on my right side. Almost as if the muscle goes from my armpit, straight at a diagonal to my sternum, but does not do the sort of arc that the sternocostal head of the pectoralis major does. I am not sure what parts are missing, the fat makes it a bit difficult to feel and see what is there (I do not have moobs but still). Looking at ( I feel like I am missing s7 and s6, maybe s5.\n\nI may also be missing (part of?) the short head of my left biceps (or should I say monocep in that case). It is always been much thinner and weaker than my right arm. I am not totally sure but it does seem like it. I am *a bit* more OK with that if it is true, but it still sucks.\n\nNow, here is the thing. I have always had a very bad relationship with my body. I have always hated it. I have never felt comfortable in it. I have stopped taking off my shirt when going to the beach, then stopped going to the beach alltogether, then even stopped going to my family's own pool, in our own garden, where no one outside of close family could see me. Mind you, that was not related to PS since I was not aware I had it at the time.\n\nWhen I was very young (&lt;= 4 yo) I had a vivid dream that I still remember to this day. It is very *very* silly, the kind of nonsensical thing you dream of when you are a kid, and I will not get into details about it, but it basically amounted to everyone around me \"being able to get muscular\" while it just \"did not work\" for me, and everyone was confused because it should have worked but did not. Well, turns out this nonsensical fear this tiny kid had was true. (also this kid turned out to be gay with a fascination for muscular guys, so that *definitely* does not help)\n\nIt honestly feels like taking a punch in the guts. Not only have I hated my body all my life, but now you are telling me I literally cannot ever have one that I am comfortable with?  \nMind you, I know you guys will think it is not true and you can totally be comfortable in your body while having PS, I get it, but I am just not in a place right now where I feel this can be true for me. Specially after discovering that about myself at the age of 27. I feel incomplete, \"not finished\".  \nIt feels like something I should have known for a while and should have had time to think about and grown with, but I just did not. During this past year I have clinged to the hope that it could just a very bad imbalance, because \"I am very right handed\", but you got to face the fact that being \"very right handed\" does not make a muscle outright disappear.\n\n&amp;#x200B;\n\nI do not know where I am going with this, just venting I guess. Thanks for sharing. I feel a lot of this resonates with me. I am 27 with PS on my left side- missing pec major only. Have known about it all my life though. \nYes, PS fucking sucks. Sadly, even at 27, I still struggle with confidence with my chest and am deathly afraid of taking my shirt off in public. The beach is the worst. I usually just wear a tshirt regardless of if I go into the water or not lol…I would give anything just to look normal. \n\nIt is not all bad though, you can still train at the gym. I think weight training is very beneficial for self confidence as well as keeping your pec minor strong. I bench press like normal. Sure, my left side is a bit weaker with chest exercises but I kind of just push through it. \n\nI am slowly starting to embrace looking like a freak lol. I might just cover my chest with tattoos and hope for the best. At the end of the day, what else can I do? I have not been impressed with implant procedures to date and any hope of “growing” a pec in a lab will not happen in my life time. \n\nI feel your pain. Thanks for your comment.\n\nYeah, right now I have a fear of taking off my shirt in public but for another reason: I am fat. But that was always something I could fix. Now suddenly I discover that there is another reason for me to be afraid of that, that will get visible if I lose weight and that I cannot do anything about...\n\nI try to do as much as I can at home, I am not in a place mentally where I would be able to go to a gym. (It just feels so \"out of character\" for me)\nBut just yesterday I was doing bench presses and gave up after a single set because I started feeling very bad (that is what prompted me to make this post in the first place)\n\nAs for implants, well, I do know there is a very good clinic in my city that specialises in custom implants made from 3D scans for things such as PS or pectus, and that seems to have pretty good looking results, but I am just not looking for that right now, and even if it fixes it visually, I would still know it is fake. Hi I can relate to you 25M with PS on right pec. Only noticed a couple years ago when I dropped body fat. Also avoid the beach and pool when fiends have party. It sucks. Affects confidence a lot especially when it comes to dating as not all are accepting and can be shallow about it. I am considering plastic surgery as a fix because I am getting tired frustrated of working out with a sweat towel around my neck to cover pecs when the gym is busy...\n\nCurious to know what % of the population has this syndrome Yeah I feel you. Though my concern is sorta different, it is not so much about other people's judgement as it is about my own being reflected by others. As in, they act as a mirror through which I tend to judge myself more than if I am alone. At the end of the day I will not go shirtless in public, so I guess the result is the same.\n\nI have never been sporty (which is the reason for my extra fat and terrible cardio and lung capacity...), I just do not enjoy it. People talk about the endorphin rush, it just does not seem happen for me. I am only trying to get something done at home because I must. Or rather, I should be trying. Cause these days I am finding it really hard to get the motivation to do anything. \"Why should I work out my chest if all it does is make the imbalance worse?\"\nAnd do not even talk about going to the gym, that is a thought so outlandish to me, it just will not happen.\n\nI keep hoping I am over-exaggerating and that I do not actually have PS, just a very bad imbalance, and at this point I just do not know, my left pec feels much smaller than my right but with a sorta similar shape? Like shrunk, in thickness and width. Cause it feels like it inserts at the bottom of the sternum at the same height as the right side... Eh. I will not really be sure without a scan or loosing enough fat that it becomes visible. Which I should do regardless cause being fat is miserable, but at the same time I do not want to know for sure, because being sure makes it real. Even though it probably is.\n\nAnd I am rambling again, sorry about that.\n\nAnyway, according to Wikipedia, PS occurs in 1 in 20,000 people. That would be around 0.005% of the population... And still common enough that I knew a guy from uni that had it. (And yet I did not realize at the time that I might have had it too)", "28 &amp; too late. Got pressured by doctors to get an implant at 18 and regret it. 28 (AFAB) with PS (left side affected).\nWent through puberty and early childhood hating my body and not understanding why mine was so different. Was severely depressed and suicidal. Was made fun of by my closest friends. Implant was presented as the only solution, the doctors never gave me a name for the condition just pretty much said “it happens sometimes, surgery’s the only option &amp; your daughter should get it before she kills herself”\n\nJust found the name of the condition today after googling “one boob.” It is been nearly 10 years since I got the implant and now I worry about the condition of the implant itself. I have also lost a lot of weight and the implant has transformed in such a way that I now have a noticeable difference in size and shape again. I got an ultrasound done earlier this year to ease my mind about the state of the implant and the technician recommended that I get a CT scan (even tho she was not supposed to say anything, which worried me more) Took this back to my surgeon who claimed it was fine, but offered a new surgery as an option. Sensing my distaste for the implant, he suggested a $17,475 procedure that would include removing the implant and transferring to the affected breast.\n\nI have never been happy with my body. Even after getting the implant done. I actually woke up in tears from my surgery saying “this is not me”still coming down from the anesthesia but feeling very much so conscious about what just happened. I fell into a depression that I still struggle with. I know that I have to get the implant that is in my body now OUT, because I am afraid of it popping in my body &amp; it is just so disformed (I am also an mma fighter) I am just not sure what to do next\n\nI have considered top surgery. I am nonbinary, but not sure I am comfortable with removing the one “natural” boob that I do have. \nI have considered the fat transfer but that comes with its own set of risks and complications and I do not have that kind of money.\nI have considered just removing the implant and learning how to love my lopsidedness in private but the truth is, I am a fragile person with a weak sense of self image and I am afraid that this option will make me reconsider su*cide like it did when I was a teenager.\n\nIdk if this is the right place to trauma dump but I have felt so alone through this process and learning the name of the condition lead me here and I have never been been able to talk about this in depth with anyone, so…. Yeah I will delete if this is too much", "do breast implants to fix asymmetry look tight and off? hi, if i were to get implants, would my skin on the affected side look tight and still not the same looking?", "stem cell surgery What if we transfer stem cell to chest can we grow pec muscle ı want to get surgery but for functional reasons. Is there any any way to get a functional chest muscle not a silicon implant. I have heard of people surgically moving a muscle in their back over to the chest. But that seems like it may just cause back problems, so I never considered it. But is it for cosmetics or do we getting a real functional chest muscle Definitely for cosmetics . . My desire / plan is getting that done as well theirs this yt vid of it you will see it if you look up PS surgery &amp; it the final result looks so much better then any silicone surgery done apparently it took him 2 years too grow out his chest too even it out but fuck it look so good compared too any surgery ever done in regards too Poland syndrome luckily I have the exact same type of body as the gentleman and luckily live in Florida where the surgeon is .. I do not have an expectations but I feel it in my gut that I will not ever get over this insecurity I see 30 / 50 Yr olds finally doing surgery after realizing they never got over the insecurities and I do not want too wait that long burning my 20s away being subconsciously fucked about this .. ima record the pre and post surgery and upload it on yt even if it takes years too grow it .. i want too be the mole breaker for guys like me too be okay with getting surgery and shed light too it pin this shit we are going to make it braaahs zyyzzzz 4EVER The body’s so beautiful and adapting .. I feel as if it will cause problems if you do not take care of it being active and growing it back out .. ofc w poor posture and a unhealthy lifestyle will cause that but like in anything you can prevent the preventable if understood Okey man how can ı get a functional pec muscle ? We were born without one you got to beat around the bush with what you were given man but you can  ... ask &amp; you may receive ... obv the only solution is getting a cosmetic surgery done .. and or wait it out and see what science and technology can do for us in the next decade ( have high hopes it is evolving faster then us humans ) currently the best solution for us that somewhat has light for a functional muscle is the surgery that I plan on having Maybe I will be 35 and they are giving celebs stem cells for their ass and tits idk man but do not overthink it or rush it I am just in a blessed position where I see that I can make a play on my biggest insecurity and hopefully come out w no regrets like the gentleman who is out there breathing with the surgery done The best thing you can do is to exercise regularly and strengthen the surrounding muscles. Unfortunately it seems like there is no magic trick for people like us. Just make the best of the life you were given. I use it as motivation to push myself at the gym and to be consistent with my diet and exercise. Gaining strength is probably the closest you can get to a functioning muscle. I am missing my right pec and have been working out for years. Feel free to message me if you want advice I would love to help!", "I wish I could feel better I am 28 years old female. I have Poland Syndrome that affected left side of my bad (a way smaller left breast, also I have short and webbed fingers) I am truly afraid that no one will ever love me because of it. I had problems with feeling comfortable around guys, and my last boyfriend did not even try to help with it. I felt like he was afraid of looking at it, and that is one of my biggest fears when it comes intimate situations. That my look is a turn off.\n\nAll my friends always tell me that I will find someone, for whom that will not make any difference, but I am losing hope. I am afraid that I will be burden to someone, or that their friends/family would tell them to look for someone better. I wish I could accept myself, but it is hard. Hey, I get exactly what you are going through.\n\n\nIt can be really hard to put into action, but the cleshé that you have to love yourself before you can accept the love of another is really true - we accept the love we think we deserve. \n\n\nI am sure you are an amazing person, and have so much to offer in a relationship. All you need is the confidence to be vulnerable, and respect yourself enough to not involve yourself with people who treat you badly - especially because of your insecurities. There are people out there who are going to treat you well, I promise, but you need to treat yourself to well first. 😘 You will feel better. You have so much to offer.\n\nAnyone willing to share a happy life will never be a burden for the right person. There is plenty of fish in the sea my friend!\n\nTake your time! You will find someome.  I am a 22 year old male with Poland syndrome, I am missing my entire left pec (major and minor)  as well as my entire left lastissimus Dorsi( the large back muscle). No clothes fit nicely and I will never be able to work out.  It honestly looks awful to me and really had effected me deeply mentally, however I have had 3 wonderful girlfriends who have never cared about it and when someone loves you that is the last thing that will matter, that does not change how I still feel about it.  It has ruined my confidence and prevented me from enjoying my past relationships ,from not going to the beach with them or even taking my shirt off in public, but all we can do is try to get to a point where we are happy with ourselves and when the right person comes along it will not matter because they will love you for who you are.", "Rib cage. Hi all. I have never been diagnosed, but I am missing my right side pectoral muscle. I am 41 years old and I never knew what Poland Syndrome was until recently when I decided to google, “missing pectoral muscle”. My question is that I can push the center of my chest/rib cage outward(kind of like in the movie Alien where it looks like something is about to bust from my chest). Is that something that is related to Poland Syndrome or a completely unrelated issue?"]