["Experts Share Insight on Ibrutinib's Bright Future in CLL Landscape ", "NOT CLL SPECIFIC: Major Breakthrough Could Enable Mass Produced Artificial Blood  This will help, but the real breakthrough comes with artificial white blood cells.  ", "Ibrutinib Approved by FDA for GVHD ", "Durable Responses With Single-agent Ibrutinib in CLL/SLL ", "STUDY ON CANCER TREATMENT IN SINGAPORE Hey,\n\nI am looking to have a discussion with any cancer survivors or their care givers who have traveled to Singapore for Leukemia or Lymphoma treatment.\nIt will be a paid discussion (100 USD) as it is for a research study.\nIf anyone is interested please do contact me on ", "Study Finds Longer Survival Seen With Ibrutinib Discontinuation Due to Toxicities ", "Ibrutinib Shows Strong PFS and OS Benefits in RESONATE Study Follow-Up ", "EXCITING: Venetoclax Plus Rituximab: 'Unprecedented' Efficacy in CLL ", "Scottish Medicines Consortium (SMC) recommends Imbruvica (ibrutinib) for restricted use in patients with Chronic Lymphocytic Leukaemia (CLL) in Scotland ", "iwCLL 2017 - Ibrutinib inhibits CXCR4 expression/function and causes CLL cell death by neglect ", "FDA Panel Votes Unanimously in Favor of First CAR-T Cancer Therapy ", "Early-phase CAR T-cell therapy produces promising results in CLL patients ", "Roche/AbbVie's Leukemia Drug Venclyxto Gains EU Approval ", "Study: CAR T-Cell Therapy Highly Effective in High-Risk Chronic Lymphocytic Leukemia ", "Selective Bruton's tyrosine kinase inhibitor shows long-term safety, efficacy in CLL ", "Beyond Myeloma: New Roles for IMiDs ", "Byrd Highlights Ibrutinib's Continued Progress in CLL ", "Expert Summarizes State of CAR T-Cell Therapy in Hematologic Malignancies ", "Ginsenoside Rh2 actual content of JINXING capsule  ", "Ibrutinib for CLL with Deletion 17p ", "Novel Targeted Agents For First-line CLL Treatment ", "Dr. Tam on BTK Inhibitor BGB-3111 in CLL ", "Expert Discusses Value of Venetoclax After BCR Inhibition in CLL ", "In need of advice/knowledge My mom just got a leukemia diagnosis, good news is that it was caught “early” / has not caused any other major issues (doctors missed it for 8-10 years but I am not touching that can of worms right now 🙃) so it is still manageable!\n\nHowever I do know this will come with many changes over time, and was hoping I could get some advice or reputable links about it; also any advice for how to give the best care and support would be appreciated. I am kind of lost and have never dealt with major grief/loss, and I cannot help but be terrified for my mom’s future.\n\nPlease, please do not throw the “thoughts and prayers” phrase at me, it is simply not a fitting sentiment for what I am in need of despite the compassion that no doubt comes with it. Has she been diagnosed with CLL (Chronic Lymphocytic Leukemia)? \n\nHAs she seen a CLL specialist? Get to one. If no one near where she lives it can be done remotely/ in conjunction with the doctor she is seeing now. The ( is a great resource. They can connect her with a specialist who can review all the blood work, order more and discuss options for treatment/ possibilities etc.\n\nDO NOT DR. GOOGLE. Things are changing at a rapid pace for CLL and the data online is 10+ years old and things have changed a lot with the targeted therapy treatments.\n\nShe should get the COVID-19 vaccine.  Some blood cancer patients develop little to no antibodies to the spike protein but some do. ANY protection is good. Everyone she is in close contact with should get it too. Same with Flu shot during influenza season.  A lot of CLL patients will be wearing face masks when going into stores etc until C-19 herd immunity is reached / for a long time. Talk to her doctor. Many CLL patients were wearing face masks on planes pre-pandemic.  She should eat healthy, exercise, treat her body well and get it in good shape to fight the cancer. Do not fall down the rabbit hole of \"try this vitamin / buy this supplement\" that every well-meaning friend will recommend etc. Talk to the specialist/ doctors about any dietary / supplement questions you have.\n\nA little salve for the 10 years not diagnosed. They do not start treating CLL until you REALLY need to be treated, you have major symptoms / blood work is off the charts, none of which it sounds like your mother had. The drugs only work for so long so they do not want to start before you really need them, Again, things are changing with that in a good way for the future. But your Mom being diagnosed 10 years ago just would have meant 10 more years of knowing and being in \"watch and wait\". \n\nSpend time with your mother. Make plans, take the little or big trips, lots of pictures. Tell the stories, laugh about your lives.", "WE FOUND THE CURE OF CANCER ! Α TAXOL ORGANIC TEA ! IT CURES CANCER ONCE AND FOR ALL, F.D.A. approved Taxol in 1992 PCT/GR2016/000023 EXAMS! ", "Venetoclax Plus Rituximab May Prolong Progression-free Survival in CLL ", "New hope for leukaemia patients as therapy shown to shrink tumours or make them disappear ", "Study Identifies Potential Biomarkers for CAR T-Cell Therapy Response in CLL ", "Low platelet count vaccine reaction? My 80+yo dad's CLL has been completely stable for several years. He has routine blood work every 3 months. He completed the Moderna vaccines a month ago. After reviewing the blood work results form the other day, we were surprised to see that his platelet count dropped significantly. Has anyone heard of/experienced a Moderna vaccine reaction of platelet counts dropping? I am the same due to my prostate problem I have to blood tests regularly.  Never had a problem with low platelets before.  All of sudden since the AZ jab my levels have dropped right down - below 100.   This is not a coincidence in my opinion.  I have to wait another 30 days to be retested.   My doctor has told me nothing about this! I am sorry to hear you are experiencing the same issue. My Dad's Drs did not know anything about that possible reaction either. Since nothing but the vaccine had occurred, it must have been a reaction to the jab. \nHowever, I am happy to share this remedy info with you: My Dad's Dr ordered a series of 4 Rituximab infusions -- one per week for 4 weeks. After only ONE infusion, his platelet count jumped from (original #) 58 to a normal level of 158 and it continued to rise with each treatment. After a few months, the response to the infusion held on with only a slight decrease in number drop. Since there has been a decrease, Dr has ordered an infusion 1x every 3 months. This would be valuable info for anyone who is experiencing the same effect from the vaccine. If you do not already do so, sign up for the CLL Society e-newletter. They continue to share info on how CLL patients respond to the vaccine (many without benefit or protection) -- just good info to have.  \nI hope this offers you some hope for boosting your platelet count.", "More CAR-T Therapies Sought ", "FDA close to approving revolutionary cancer treatment ", "Feinstein Institute Scientist Recognized for Innovative Chronic Lymphocytic Leukemia Research ", "Expert Discusses \"Sequential Triple-T\" Trials in CLL ", "IMBRUVICA (ibrutinib) Pooled Outcomes Data from Three Phase 3 Studies Suggest Potential Clinical Efficacy in Patients with High-Risk CLL  ", "Pembrolizumab in CLL patients with Richter's transformation and relapsed CLL ", "Evaluating A Novel Chemo-free Combination Therapy for Lymphocytic Leukemia ", "In the Era of Novel Therapies, New Prognostic Markers for Chronic Lymphocytic Leukemia Required ", "Ibrutinib for the Relief of GVHD-related Symptoms ", "AbbVie Announces Positive Topline Results from Phase 3 Trial Evaluating VENCLEXTA/VENCLYXTO (Venetoclax) Tablets in Combination with Rituxan (rituximab) for the Treatment of R/R CLL ", "Jefferies Begins Coverage On TG Therapeutics (TGTX) With Buy Rating ", "The increasing number of chronic disease amongst aging population is expected to boost the demand of chronic lymphocytic leukemia therapeutics market in near future. ", "Akt Inhibition With MK-2206 in Relapsed/Refractory Chronic Lymphocytic Leukemia ", "Experiences with Imbruvica My team and I are graduate students doing a project on your experience and perceptions of Imbruvica (ibrutinib). We are hoping to gain some insight on your experience using Impruvica and other treatments for chronic lymphocytic leukaemia (CLL).\n\nWe would really appreciate if you could take 5 minutes to fill out the following survey. The information collected in the survey will be entirely anonymous. Please do not disclose any self-identifying information when completing the survey. Thank you in advance! \n\nLink to survey: (", "Neurotoxicity After CAR T-cell Therapy May Be Associated With Endothelial Activation ", "Dr. Pinilla-Ibarz on Ibrutinib's Efficacy in Treating High-Risk Patients With CLL ", "Scientists create designer virus to kickstart immune system and kill cancer ", "MOR208 Combo Regimens Show Early Promise in CLL ", "Ibrutinib Discontinuation in CLL Examined to Help Develop Salvage Approaches ", "BCL-2, BCR Inhibitors Show Promise in Relapsed/Refractory CLL ", "AbbVie disappointed as NICE issues negative draft appraisal on Venetoclax ", "Redx Pharma PLC reveals more “potent efficacy data” for leukaemia drug ", "CIRM Approves $5.8 Million Grant for CAR-T Therapy That Targets Cancer Stem Cells ", "TG Therapeutics, Inc. - Clinical Data from the Phase 1/2 Trial of TG-1101 (ublituximab) Monotherapy ", "Phase 1 Trial of BTK Inhibitor, ARQ 531 Begins ", "For adults with common form of leukemia, new drug promises fewer side effects | Knowridge Science Report ", "Gene therapy for cancer nears FDA approval ", "VIDEO: Addition of ublituximab (TG-1101) to ibrutinib effective for high-risk chronic lymphocytic leukemia ", "Dr. Wierda Discusses Trials of Novel Combinations in CLL ", "Dr. Chavez on Combination of Ibrutinib Plus Ublituximab in CLL ", "\"Investigators found that treatment with lenalidomide significantly improved progression-free survival\" ", "European Commission : CORDIS : News and Events : Genetic Events in Chronic Lymphocytic Leukemia ", "Pembrolizumab is beneficial for CLL patients with Richter transformation ", "Acalabrutinib Shows Promise in Ibrutinib-Intolerant CLL/SLL ", "Dr. Wierda Discusses Sequencing New Agents in CLL ", "Kind Of Boring and Specific, but Progress Nonetheless ", "Scientists announce ‘outstanding’ results of new blood cancer study ", "ECG finding predicts AFib in ibrutinib-treated CLL ", "Algorithm may help identify severe neurotoxicity risk in CAR-T cell infusion patients ", "Sustained Molecular Remissions Reported in Patients With Relapsed/Refractory CLL After CD19 CAR-T Infusion ", "AbbVie and Roche tout a positive PhIII combo study of Venclexta, Rituxan in CLL ahead of FDA pitch ", "Dr. Brian Koffman: “But the most impressive thing is they looked in my bone marrow, which had been heavily involved with CLL and they could find no trace of CLL down a one in 100,000 or one in a million cells.” ", "Esanex Announces First Patient Dosed in an Open-Label Study of SNX-5422 in Chronic Lymphocytic Leukemia  ", "Complete Response to Chemo Critical in CLL Patients Who Develop Hodgkin Lymphoma ", "Exploring CAR T-Cell Therapy in Blood Cancers ", "Psychological Wellbeing of Cancer Survivors research study The research team at the University of Chester are currently investigating factors which predict who copes better following cancer diagnosis, and what we can do to maximise psychological wellbeing. Given the focus of this Reddit forum on chronic lymphocytic leukemia, we thought some people here might be interested in participating. If you are over 16 years of age and were diagnosed with cancer between 1 and 3 years ago, you might be eligible to do so. Participants will be asked to complete an online questionnaire which takes around half an hour to complete. You can find out more here: ( \n\nIf you have any queries about this project, do not hesitate to get in touch with us.\n\nBest wishes, Caroline and Nicole.", "UCSD cancer clinical trial gets $18.2 million ", "Log into Facebook ", "Dr. Zelenetz on Treatment for Patients With CLL Who Fail on Ibrutinib or Idelalisib ", "Investigators Set Sights on Combinations for Frontline CLL Treatment ", "Dr. Wierda Discusses the Need for Newer Therapies in CLL ", "AbbVie Announces Phase 2 Trial Evaluating VENCLYXTO (venetoclax) in Patients with R/R CLL w/ 17p Del ", "Dr. Awan Discusses Challenges With Ibrutinib in CLL ", "ASH Report: Lenalidomide Maintenance May Extend PFS in CLL ", "Ok ", "Venetoclax for chronic lymphocytic leukaemia ", "New Standards Are Emerging for Follicular Lymphoma and CLL ", "{Investment Article} - Duvelisib, A Molecule with a Lot of Potential But All of it Highly Speculative ", "Combining CAR-T Cells With Other Immunotherapies the Next Logical Step ", "Wanting to take part in a clinical trial for CLL/sll/lymphoma CLL/sll/lymphoma using Rick Simpson Oil, smokeables, as adjuvant treatment. \n\nI went to MD Anderson for tests, blood typing, FISH (tells you how screwed your chromosomes are) and CAT scan to view organs. Nodules  around everywhere. But blood counts are low, I.e., white blood count was 25,000 last test in January.  WBC is puke need to be in the 100,000+ range for me to be considered for any treatment. My chosen treatment is Rick Simpson Oil @ 1 gm/day for 60 days. I will drop in with my blood tests to share as they come in. I am traveling to Colorado to get what I need. ", "Venetoclax plus rituximab in relapsed or refractory chronic lymphocytic leukaemia: a phase 1b study ", "Engagement of the B-cell receptor of CLL cells drives global and MYC-specific mRNA translation  ", "Advanced CLL and SLL Patients Aided by Oral Duvelisib in Phase 3 Study, Verastem Reports ", "‘Hit-and-run’ gene therapy nanoparticles could enhance CAR-T treatments ", "European Commission Grants Marketing Authorization for Arzerra® (ofatumumab) in combination with Fludarabine and Cyclophosphamide in Relapsed CLL ", "Dr. Byrd on Long-term Safety Data With Ibrutinib in CLL ", "Ofatumumab - a valid treatment option for chronic lymphocytic leukemia ", "Physician Views Off-Label Use A 'Double-Edged Sword' For TG Therapeutics ", "Ibrutinib Better Than Bendamustine for OS in CLL, Indirect Comparison Suggests ", "European Commission : CORDIS : News and Events : Signification of Protein p-53 Isoforms in CLL ", "Anyone interested to participate in a patient experience study? We are currently conducting a study with a goal to understand impact of CLL to patients/caregivers- and how can they improved their overall experience. As the population is harder to reach, I thought maybe Reddit will be able to help me out :) \n\nIf you are interested, please let me know. \n\nthanks!   I do not understand what you are asking.  Do you want to interview people who have CLL?   Yes- or caretakers.  I would. There is also a CLL support group on facebook where you might find more people willing to participate. ", "Dr. Furman on Considering Factors for Upfront Therapy in CLL ", "Single-agent Ibrutinib Therapy Provides Durable Response in CLL/SLL ", "Ibrutinib Controls Chronic GVHD After Steroids Fail ", "Impact of ibrutinib dose adherence on therapeutic efficacy in patients with previously treated CLL/SLL  ", "Chemotherapy vs Ibrutinib for Frontline Treatment of Chronic Lymphocytic Leukemia ", "Clonal evolution leading to ibrutinib resistance in chronic lymphocytic leukemia ", "Post-allogeneic stem cell transplant, lenalidomide is not a viable option for persistent Chronic Lymphocytic Leukemia - results of a randomized phase II trial ", "Health, from San Raffaele hospital a new key to fight chronic lymphocytic leukemia ", "Systematic identification of personal tumor-specific neoantigens in chronic lymphocytic leukemia ", "Terminal cancer patients in complete remission after one gene therapy treatment ", "CLL: Long-term Outcomes After Ibrutinib Discontinuation ", "First gene therapy — ‘a true living drug’ — on the cusp of FDA approval ", "Study: Injectable Anticancer Drugs Increase in Cost Regardless of Competition ", "Adding Idelalisib to Bendamustine and Rituximab Improves PFS in CLL ", "Duvelisib: a phosphoinositide-3 kinase δ/γ inhibitor for chronic lymphocytic leukemia  Mostly just a good compendium of references.  ", "Venetoclax Plus Rituximab Induces Durable Responses in CLL ", "MRD Eradication With Alemtuzumarb Consolidation Improves OS, PFS in CLL ", "CAR T-Cells of Defined Composition Effective in Ibrutinib-Refractory CLL ", "AbbVie/Roche’s venetoclax hits goals in CLL trial ", "New Chronic Lymphocytic Leukemia Study Findings Reported from M.D. Anderson Cancer Center ", "Duke researchers advance potential treatment for leukemia  ", "Promising Treatment For Leukemia Leads To Remission In Clinical Trials ", "Cannabinoids used in sequence with chemotherapy are a more effective treatment for cancer ", "CAR T-cell therapy for leukemia leads to remissions in clinical trial ", "Ventricular arrhythmias and sudden death in patients taking ibrutinib ", "Immunotherapy Approaches against Chronic Form of Leukemia Emerge ", "FDA Puts Clinical Holds on \"Off-the-Shelf\" CAR-T Trials ", "Ruxolitinib May Improve Symptom Control in Patients With CLL ", "Chronic Lymphocytic Leukemia Combo in Phase 3 Study Named Orphan Drug by fDA ", "Dr. Rai on Novel Approaches in CLL ", "Acquired BTK and PLCG2 Mutations Linked to Future CLL Relapse ", "Expert Discusses Emerging Agents in CLL ", "Researchers Examine Acquired Mutations Linked to Ibrutinib Resistance in CLL ", "JINXING capsule content introduction ", "Adding Ublituximab to Ibrutinib Improves Relapsed CLL Response Rates ", "ArQule Wins FDA Approval to Begin Clinical Testing of ARQ 531 in B-cell Leukemias ", "NICE shoots down AbbVie's wannabe leukemia blockbuster Venclexta ", "Novel Antibody May Restore Immune Response to Rituximab for CLL ", "In CLL, specific mutation is key to ibrutinib resistance ", "Standalone Imbruvica May Not Stand Up To CLL; Combo Needed ", "Prior Ibrutinib Treatment Improves CAR T-Cell Expansion, Could Impact Response in CLL ", "CLL: The Biologics of Ibrutinib Therapy ", "New Data Presented at ASCO 2017 Finds IMBRUVICA (ibrutinib) May Offer a More Targeted Approach to CLL Treatment than Chemotherapy Agent Chlorambucil in Treatment-Naïve Patients ", "LONGFORM: Clinical Implications of Novel Genomic Discoveries in Chronic Lymphocytic Leukemia: Journal of Clinical Oncology: Vol 0, No 0 ", "Rituximab-based first line treatment for chronic GVHD after allogeneic SCT: results of a phase 2 study ", "Dr. von Tresckow on \"Sequential Triple-T\" Trial in CLL ", "'Meaningful' Responses With Ibrutinib in Chronic GVHD ", "CLT119: Personalized Cell Therapy Combined with Ibrutinib Achieves Complete Remission in High Percentage of Chronic Lymphocytic Leukemia Patients        ", "Early Results Show Palbociclib Helps Sustain Patient Response to Ibrutinib in MCL ", "Ublituximab/Ibrutinib Combo Significantly Improves ORR in Phase III CLL Study  ", "Venclexta/Venclyxto Effective in Treating Chronic Lymphocytic Leukemia ", "Venetoclax Plus Rituximab Promising for Relapsed/Refractory CLL ", "Understanding Imbruvica - SURVEY SURVEY LINK: (\n\nI am a graduate student working on a research project to evaluate the real-world perceptions of Imbruvica(ibrutinib). I am hoping to identify barriers to treatment, or unmet needs in people with the indicated conditions, in order to improve access to innovative therapeutic products. Any and all data collected is anonymous and we request you do not include any self-identifying information. I would really appreciate your input if you could take 5 minutes to fill out this survey. Thank you in advance! Done", "TG-1101: TG Therapeutics Reports Positive Data from Phase 3 GENUINE Trial of TG-1101 in Combination with Ibrutinib on ASCO Meetings    ", "Idelalisib Increases Progression-Free Survival in Patients with Relapsed or Refractory Chronic Lymphocytic Leukemia ", "AbbVie Announces Long-Term IMBRUVICA Efficacy and Safety Data in CLL at ASCO  ", "iwCLL 2017 - Baseline left atrial abnormality independently predicts atrial fibrillation in CLL patients treated with ibrutinib ", "CLL: Lenalidomide Maintenance Therapy Reduces Progression Risk ", "We are moving to r/cll Finally got hold of the mod that had r/cll and he was gracious enough to release it to us.  I will be posting over there from now on.  It is just a much simpler title.  Btw. thanks for continuously posting new developments/articles  regarding CLL. Thanks for the work/dedication regarding the sub.  No problem, happy to do it.  May take a few breaks as life/work dictate, but I will always be back to catch up with the new stuff we missed", "Upfront Ibrutinib Continues to Impress in CLL ", "Frontline CLL Therapy: Changes in Paradigm ", "FDA Approves Rituxan Hycela for Blood Cancers ", "iwCLL 2017 - Ibrutinib inhibits IL-4 production by T-cells and expression of smIL-4R on CLL B-cells ", "Medications Any body pay high prices for sprycel Not a treatment for cll afaik", "Incyte Doses First Patient in Phase III Study of GVHD Candidate Itacitinib ", "Absolute Lymphocyte Counts Predictive of Survival With CLL Post-FCR ", "AbbVie says Imbruvica more effective than chlorambucil in fighting chronic lymphocytic leukemia ", "Cytokine Biomarkers Can Predict Response to CAR T-Cell Treatment in CLL ", "ArQule Stock Up 28% on Lab Data for B-Cell Lymphoma Drug ", "Managing Ibrutinib Toxicity in CLL ", "High Response Rate With Venetoclax in Relapsed/Refractory CLL ", "Report Available: Global Leukemia Therapeutic Market Estimated to Grow Strongly by 2021 ", "Verastem Inc Blood Cancer Program Succeeds In Final Phase Trial ", "Ibrutinib Provides Long-term Benefits for Patients With CLL ", "Ibrutinib Could Enhance CAR T-Cell Treatment Impact in CLL ", "Doctors tackle nutrition myths in cancer treatment  \"But patients keep looking for answers outside the system. And it is all about control, says Jonathan di Tomasso, a nutritionist who works with the McGill University Health Centre Cancer Rehabilitation Program.\n\n\"People often lose control over many aspects of their life when they are diagnosed with cancer. Food is something they can control, but the roar of misinformation out there is deafening,\" he said.\" Exactly.  Kind Of the part that resonated with me, as well.  It is human nature and the best thing we can do to not be controlled by human nature is to be aware of it.  ", "Tell me about your experience with Imrbuvica (ibrutinib) Hi! I am a grad student writing up some research on Imbruvica. We recently posted a survey but I also though this might be a good place to get real world insights. If you are comfortable, please leave a note on what your experience is like. Some things we want to know:\n\n1. what is your general experience as a CLL patient?\n2. what is your general experience with Imbruvica?\n3. were you offered any other options as an alternative?\n4. would you consider switching to a drug that you only had to take temporarily?\n5. what are some common side effects you experience?\n6. anything else you think we should know?", "FDA announces first US gene therapy approval ", "Cord blood inspires an alternative to CAR-T for treating blood cancers ", "Dr. Woyach on Preliminary Efficacy Results of MOR208 Trial in CLL ", "Natco may launch leukemia drug in US mkt on or before Nov 2019 ", "Immunotherapies for CLL Complement Targeted Agents ", "Roche says Venetoclax combination improves PFS in phase III CLL trial ", "FDA Approves Subcutaneous Rituximab and Hyaluronidase Human for Blood Cancers  ", "FDA to review AbbVie drug to assist marrow transplants ", "Abnormal Liver Function Linked to Survival in CLL ", "AbbVie weak on new drug sales, Shareholders want newer drugs such as Imbruvica (ibrutinib) and Venclexta (venetoclax) to build momentum ", "Anti-CD20 Therapy Boosts Efficacy of Ibrutinib in CLL ", "Venetoclax plus rituximab ‘attractive potential option’ for relapsed, refractory CLL ", "Dr. Brown Discusses Acalabrutinib in CLL ", "High Response Rate, MRD Negativity Confirmed for Venetoclax in CLL ", "iwCLL 2017 - anti-CD19 CAR-T cell therapy with defined T-cell subsets for ibrutinib-refractory CLL ", "Long-Term Data Offers Positive Findings for Imbruvica (ibrutinib) ", "Young Patients With CLL At Risk for Secondary Cancers ", "Break the mysterious ingredients of JINXING capsule What is JINXING capsule, Why so many people are taking it? What is JINXING capsule, is it anti-aging and relieve fatigue? Today, we are bearking the mysterious ingredients of JINXING capsule.\n\n&amp;nbsp;\n\nJINXING capsule ingredients\n\n&amp;nbsp;\n\nFirstly, I think JINXING capsule must has special ingredients and complex composition. After reading the product introduction, which is a low-key and simple ingredient. \n\n&amp;nbsp;\n\nJINXING capsule ingredient is ginsenoside Rh2 and starch, one capsule is 125mg, ginsenoside rh2 content is 20.25mg per capsule, content percent is 16.2% or more. It is in the line with best absorption content of ginsenoside Rh2.\n\n&amp;nbsp;\n\nDoing a research of ginsenoside Rh2 in Chinese market, JINXING capsule is a Unilateral product only, others are compound products. Except ginsenoside Rh2, compound products contains other ingredients or other ginsenosides. Whatever of unilateral products and compound products, they have its own merits.\n\n&amp;nbsp;\n\nRegardless of the dosage form(injections, capsules, powders and others), JINXING capsule is A single measurable ingredients, function is determined and full play the effect of ginsenoside Rh2. There is no intestinal load which caused by ingredients during absorption, thereby affecting absorption effect.\n\n&amp;nbsp;\nGinsenoside Rh2 compound product contains other ingredient except ginsenoside Rh2, which is no rigorously verified, Absorption and utilization rate will be low, the effect of adjuvant therapy remains to be seen.\n\n&amp;nbsp;\n\nWhat is function of ginsenoside Rh2\n\n&amp;nbsp;\n\nJINXING capsule mysterious ingredients is ginsenoside Rh2, which efficacy is reflect by ginsenoside Rh2. What is function of ginsenoside Rh2? \n\n&amp;nbsp;\n\n1.Enhance immunity\nMany people know the side effect of low immunity. Ginsenoside Rh2 can enhance immunity is by enhancing immune cell activity, such as the killing activity of Lymphocytes, T cells, macrophages and others, enhance the monitoring of the immune system to prevent the invasion of harmful substances and bacteria. \n\n&amp;nbsp;\n\n2.Relieve fatigue\nFatigue is due to the accumulation of human lactic acid and other metabolites, which leads to muscle tension and exercise durability decreased. At the same time, due to the accumulation of carbon dioxide and stimulate the nerve center, which leads to sleepy, yawning, sluggish and other performance. Ginsenoside Rh2 has relieve fatigue function is by increasing the body's glycogen reserves, reducing the consumption of glycogen, reducing serum urea levels after exercise and inhibitting the increase in blood lactate levels after exercise. \n\n&amp;nbsp;\n\n3.Anti-tumor\nThe reason of ginsenoside Rh2 caused by scholars attention is anti-tumor effect. Many literature and experiments have prove it. But now, there is no ginsenoside Rh2 products for medicine use.  \n\n&amp;nbsp;\n\n4.Other effects\nGinsenoside Rh2 also has health care functions, such as antibacterial, improve cardiovascular and cerebrovascular insufficiency, regulate the central nervous system, enhance memory, anti-aging and so on. \n\n&amp;nbsp;\n\n\nJINXING capsule mysterious ingredient is ginsenoside Rh2. Just look at it, ginsenoside Rh2 is indeed a good thing and a modern Chinese medicine molecular medicine, which is a small molecule structure and should be able to play the above effects. At the same time hope that the friends who take this JINXING capsule can have good effect and longevity. \n\n\n                                                    破解今幸胶囊的神秘成分\n\n&amp;nbsp;\n\n今幸胶囊是何方神物，如今这么多人在吃，今幸胶囊是何种神器，能延缓衰老，缓解疲劳？让我们来破解今幸胶囊的神秘成分。\n\n&amp;nbsp;\n\n今幸胶囊的成分 \n\n&amp;nbsp;\n\n起初我也一直以为，这么厉害的今幸胶囊，一定是有特别的成分，复杂的成分组成，谁曾想，看过了该产品的介绍以后，竟然是如此低调，单一的成分。\n\n&amp;nbsp;\n\n今幸胶囊的成分是人参皂苷Rh2和淀粉，每粒胶囊125mg，其中人参皂苷Rh2含量为20.25mg，含量比例为16.2%，甚至以上，符合人体对于人参皂苷Rh2的最佳吸收含量。\n\n&amp;nbsp;\n\n笔者对国内市场上，网络上的诸多人参皂苷Rh2产品进行了一个小小的调查和对比，今幸胶囊是国内唯一的一款人参皂苷Rh2单方产品，其他的产品都是复方型，除了含有人参皂苷Rh2以外，还含有一个其他的成分，亦或者其他的人参皂苷成分。\n\n&amp;nbsp;\n\n笔者也了解了一些关于药品的相关知识，对于单方产品和复方产品有了个初步的认知。在笔者的认知看来，两者各有千秋。\n\n&amp;nbsp;\n\n比如说：在不考虑产品剂型的情况下（针剂，胶囊，粉剂等为剂型），人参皂苷Rh2单方产品今幸胶囊，成分单一可测，服用功效确定，并且能将单一成分，也就是将人参皂苷Rh2的功效最全面，最大限度的发挥，不存在成分间在吸收时造成的肠部负荷，进而影响吸收效果。\n\n&amp;nbsp;\n\n人参皂苷Rh2复方产品，含有除人参皂苷Rh2以外的成分，虽然看似更加全面，实际上却没有经过严格验证，吸收利用率也会偏低，作为日常保健可以吃一些，辅助治疗的效果还有待观察。\n\n&amp;nbsp;\n\n人参皂苷Rh2有何种功效 \n\n&amp;nbsp;\n\n今幸胶囊的神秘成分只是简单的人参皂苷Rh2，因此，它的功效就是靠人参皂苷Rh2体现的，那么人参皂苷Rh2有哪些神奇的功效呢？\n\n&amp;nbsp;\n\n1.提高免疫力 \n人体免疫力的重要性就不需要我过多叙述了，免疫力低下，会造成什么影响，许多人可能比我了解的更全面。人参皂苷Rh2能提高免疫力，通过增强免疫细胞活性，比如淋巴细胞，T细胞，巨噬细胞等的杀伤活性，来增强免疫系统的监听功能，防止外界有害物质、细菌的入侵。\n\n&amp;nbsp;\n\n2.抗疲劳   \n疲劳是由于人体乳酸及其他代谢产物的堆积，导致肌肉张力下降，运动耐久性降低。同时由于二氧化碳的堆积，刺激到神经中枢，引起瞌睡，打哈欠，精神不振，瞌睡等表现。而人参皂苷Rh2能增加人体的糖原储备，减少糖原的消耗，降低在运动后产生血清尿素含量，抑制运动后血乳酸含量的上升，达到缓解和减轻疲劳作用。\n\n&amp;nbsp;\n\n3.抗肿瘤  \n人参皂苷Rh2目前受到国内外学者的重视的一大原因就是抗肿瘤功效，已经有很多关于人参皂苷Rh2抗肿瘤方面的文献和实验证实了这个结论。只是目前还没有作为药品应用的人参皂苷Rh2产品。因此，此功效暂且不提。\n\n&amp;nbsp;\n\n4.其他功效  \n人参皂苷Rh2还具有抗菌、改善心脑血管供血不足、调节中枢神经系统、增强记忆力、延缓衰老等保健养生作用。\n\n&amp;nbsp;\n\n今幸胶囊的神秘成分是人参皂苷Rh2。只是这么看的话，人参皂苷Rh2确实是一个好东西，不愧是现代化的中医中药分子药物，是小分子结构，应该能发挥上述功效。同时希望服用今幸胶囊的朋友都能有好的服用效果，延年益寿。", "On the Origin of CLL Evolution – presentation at iwCLL 2017 ", "Outcomes worse for CLL patients who discontinue ibrutinib after disease transformation ", "Obinutuzumab/Bendamustine Combo Shows Promising Response Rates in Upfront CLL ", "Ibrutinib + Ublituximab: TG Therapeutics Inc boosted by leukemia drug trial  ", "Gold Nanoclusters Suppress CLL Cells by Inhibiting Thioredoxin Reductase 1, Induce Apoptosis (PDF Download for Full Text) ", "TG Therapeutics Inc (NASDAQ:TGTX) Reports Completes Enrollment In The UNITY-CLL Phase III Trial ", "Chronic Graft-Versus-Host-Disease Therapy Imbruvica Gets FDA Approval  ", "Current Approaches to Diagnosis and Risk Stratification in Chronic Lymphocytic Leukemia ", "Lenalidomide maintenance after first-line therapy for high-risk chronic lymphocytic leukaemia (CLLM1): final results from a randomised, double-blind, phase 3 study ", "Genetically enhanced, cord-blood derived immune cells strike B-cell cancers ", "Lenalidomide Maintenance Therapy Reduced Risk of Progression in CLL ", "iFCG Regimen Induces High Rate of Bone Marrow MRD Negativity in IGHV-Mutated CLL ", "Dr. Woyach on Ibrutinib Resistance in CLL ", "Mediated Resistance to Ibrutinib in Chronic Lymphocytic Leukemia: Journal of Clinical Oncology: Vol 0, No 0 ", "STUDY ATTACHED: Profile of venetoclax and its potential in the context of treatment of CLL ", "Evolving DNA methylation and gene expression markers of CLL are present in pre-diagnostic blood samples more than 10 years prior to diagnosis ", "CAR-T Cells of Defined Composition Effective in Ibrutinib-Refractory CLL ", "Chronic Lymphocytic Leukemia Can Be Treated With Chimeric Antigen Receptor T-Cell Immunotherapy, CAR-T ", "Ibrutinib-resistant CLL: unwanted and unwonted! ", "Drug that 'melts' cancer cells now available for human use - ET HealthWorld  Pretty much same article, different source.  ", "MicroRNA dysregulation to identify therapeutic target combinations for chronic lymphocytic leukemia ", "FDA Will Review Biologics License Application for Biosimilar Truxima ", "High blood platelet count 'as good a cancer predictor as a lump in the breast' ", "iwCLL 2017 - life after ibrutinib for CLL patients: Pre-clinical and clinical studies ", "FDA Accepts for Review Ibrutinib's sNDA for cGVHD ", "Nicotinamide Blocks Proliferation and Induces Apoptosis of Chronic Lymphocytic Leukemia Cells ", "A Cancer Drug Unexpectedly Reduced Allergic Reactions By 90 Percent   ", "TG Therapeutics, Inc. Announces Follow-Up Data for Combination of TGR-1202 (umbralisib) plus Ibrutinib in Patients with Relapsed or Refractory CLL ", "Evolution Anticipated in First-Line Treatment for CLL, Indolent Lymphomas ", "High-level ROR1 associates with accelerated disease progression in chronic lymphocytic leukemia ", "Patient with both Chronic Lymphocytic Leukemia and Mestastatic Melanoma treated with pembrolizumab - a published case study ", "Roche's Leukemia Drug Approved for Next Step in Europe ", "Sandoz proposed biosimilar rituximab accepted for review by the FDA ", "The Latest on TEVA's Oncology Business ", "Evaluation of treatment patterns and outcomes for elderly patients with CLL  A diagnosis of chronic lymphocytic leukemia (CLL) usually occurs in people aged ≥ 72 years. But most clinical trials do not reflect that reality; thus, treatments and prognoses are based on younger patients’ experiences. Researchers from University of Pennsylvania, Emory University in Georgia, NorthShore University HealthSystem in Illinois, New York-Presbyterian Hospital/Columbia University Medical Center, Thomas Jefferson University in Pennsylvania, and Dana-Farber Cancer Institute in Massachusetts, conducted the largest comprehensive prospective evaluation of this patient population published to date to their knowledge to examine treatment patterns, outcomes, and disease-related mortality in CLL patients aged  ≥ 75 years in a real-world setting.\n\nRelated: The Link Between Low-Density Lipoproteins and Chronic Lymphocytic Leukemia\n\nMD-IQ QUIZ: Cardiometabolic mortality &amp; diet among US patients\nDrug &amp; Dosing Information\nThe researchers analyzed data from patients in the Connect® CLL registry, a prospective observational cohort study that took place between 2010 and 2014 at 199 U.S. sites. Of 1,494 patients enrolled in the registry, 259 patients aged  ≥ 75 years were enrolled within 2 months of starting first- line of therapy (LOT1), and 196 were enrolled in a subsequent line of therapy (LOT ≥ 2). The patients were almost entirely enrolled prior to the introduction of novel B-cell receptor-targeted therapies. The researchers say they aimed to establish a benchmark for outcomes in elderly patients with CLL who were treated before those therapies to help properly position newer agents in the treatment paradigm.\n\nThey found that elderly patients with CLL were more likely than were younger patients to receive rituximab monotherapy. In LOT ≥ 2 they were significantly less likely to receive bendamustine/rituximab. Only 6.9% of patients aged &gt; 75 years received fludarabine/cyclophosphamide/rituximab, vs 33.7% of patients aged &lt; 75 years. Interestingly, the researchers add, older patients were significantly more likely than were younger patients to receive chemotherapy alone without anti-CD20 antibody therapy.\n\nRelated: Novel Treatment Shows Promise for Acute Lymphoblastic Leukemia\n\nSerious adverse events were more common in the elderly patients. Pneumonia was more common in elderly patients in LOT1; in LOT ≥ 2, rates of pneumonia were similar in both groups. In the follow-up with a median of 32.6 months, 433 of the 1,494 patients had died. Only 5% of patients aged &lt; 75 years in LOT1 died of CLL, compared with 13% of elderly patients. Time to death from CLL or infection was also significantly shorter in patients aged &gt; 75 years, compared with patients aged &lt; 75 years. When stratified by risk, mortality due to CLL or infection was 10.3% in the lower risk group compared with 30.6% in the higher risk group.\n\nThe researchers identified 3 prognostic indicators: &lt; 3 months from diagnosis to first treatment, enrollment therapy other than bendamustine/rituximab, and anemia. The researchers say the higher risk of CLL- or infection-related death has not, to their knowledge, been reported previously. This finding, they say, “highlights the urgent need for therapies tailored to this population.” Current therapies and strategies, they note, “appear suboptimal.”\n\nRelated: Pneumatic Tube-Induced Reverse Pseudohyperkalemia in a Patient With Chronic Lymphocytic Leukemia\n\nSource:\nNabhan C, Mato A, Flowers CR, et al. BMC Cancer. 2017;17(1):198.\ndoi: 10.1186/s12885-017-3176-x.", "A Personalized Era in Chronic Lymphocytic Leukemia Treatment ", "CAR T Cell/Ibrutinib Combination May Improve CLL Response Rates ", "Updated results of a phase III trial: idelalisib combined with ofatumumab is safe and effective in relapsed Chronic Lymphocytic Leukemia patients  ", "Dr. Parikh on the Optimal Frontline Therapy for Patients With CLL ", "Dr. Jones on the Efficacy of Venetoclax in Relapsed/Refractory CLL ", "Dr. Rai on Handicaps of Chemotherapy in CLL ", "Dr. James on Update of Ibrutinib for Chronic Lymphocytic Leukemia ", "Pivotal Trial Finds That Imbruvica Shows Benefit in CLL and SLL ", "Presage Bio Licenses Anti-Cancer Drug to San Diego’s MEI Pharma ", "Venclexta/Rituxan Combo Slows CLL Progression ", "Venetoclax: Australian Leukaemia sufferers to benefit immensely from drug; Venclexta forces cancer cells to commit cell suicide ", "CAR T-cell therapy shown to result in durable molecular remissions in CLL post-ibrutinib ", "Novel and Expanded Oncology Drug Approvals of 2016—PART 2 ", "Lenalidomide may be ‘practice changing’ for physicians treating leukemia ", "AbbVie and J&amp;J Present Positive Imbruvica Leukemia Data ", "FDA Accepts Ibrutinib Application for GVHD  ", "Who usually gets CLL? ", "risk factors linked to poor outcomes with other therapies may be irrelevant when predicting outcomes with ibrutinib – abstract presentation at iwCLL  ", "Patient Selection for CLL Treatment ", "Dr. Zelenetz on Potential of Acalabrutinib and BGB-3111 in CLL ", "Dr. Jones on Studying Venetoclax in R/R CLL ", "Dr. Leis on Promising Combo Regimens Being Explored in CLL ", "State's stem cell agency awards $18.2 million grant for B cell cancer clinical trial ", "Ruxolitinib controls disease-related symptoms in CLL ", "CAR-T Cell Therapies in CLL  My cll progressed on ibrutinib and my doctor has been in search of an open car-t trial for me for a while now. I wish there were more results out there with it, but it looks hopeful if I get the chance. Would you mind keeping us updated with everything?  I would be interested to hear about how your Dr. is going about looking for a trial.  Does he call his associates?  Does he submit an application on your behalf?  Any information you would like to share about you and your experience is definitely appreciated.  There are remarkably few resources out there for CLL given that it is so common and so unique among cancers.  ", "Inhibiting CFH May Improve Responses to Rituximab in CLL ", "CAR T-cell therapy effective for chronic lymphocytic leukemia ", "Duvelisib extends PFS in chronic lymphocytic leukemia, small lymphocytic lymphoma ", "Ibrutinib salvage therapy effective for relapsed CLL following transplantation ", "Frontline Ibrutinib Benefit Sustained in Pivotal Trial Update ", "Conditional European marketing approval for Venclyxto in CLL ", "Some CLL Patients See Tumors Reduced By Investigational CAR T-Cell Therapy, Studies Find ", "Revised iwCLL guidelines for the approach to a CLL patient – presentation at iwCLL 2017 ", "Kymriah is the first ever FDA approved gene therapy ", "Targeting BCL2 with Venetoclax in Relapsed Chronic Lymphocytic Leukemia ", "Dr. Goy Discusses Recent Updates in the Treatment of CLL ", "FDA approves first-ever T-cell cancer treatment, pioneered at Penn, CHOP ", "Extended Treatment with Single-Agent Ibrutinib at the 420 mg Dose Leads to Durable Responses in CLL ", "Dr. Chavez Shares His Advice for Treating Patients With CLL ", "PATIENTS NEEDED FOR TRIAL: Ublituximab + TGR-1202 Compared to Obinutuzumab + Chlorambucil in Patients With Untreated and Previously Treated Chronic Lymphocytic Leukemia (UNITY-CLL) | Aurora Health Care ", "Less Than A Quarter of Patients With CLL Tested for IGHV Mutation Prior to Initial Therapy ", " Obinutuzumab in chronic lymphocytic leukemia: design, development and | DDDT ", "Positive opinion’ given by the EMA CHMP to the rituximab biosimilar rixathon for the treatment of Chronic Lymphocytic Leukemia  ", "CD49d Expression Associated With Lymphadenopathy in CLL "]