["Profiling CLL Patients Likely to Progress on Available Agents ", "New Prognostic Tool Helps Patients With Leukemia Anticipate Care Needs ", "Venetoclax-Based Regimens as First-Line Therapy in CLL ", "NOTCH1 mutation significance in CLL defined by emulsion PCR | CMAR ", "CLL: Treatment Paradigm Shifts and Impact on Outcomes (Video 1 of 11) ", "Patients with B-Cell Malignancies Experience Stable Disease on Vecabrutinib Therapy ", "Exploring Duvelisib Plus Venetoclax for Relapsed or Refractory CLL/SLL ", "O'Brien Covers Evolution of Ibrutinib in CLL ", "EU Panel Recommends Ibrutinib/Rituximab Combo for Frontline C ", "Venetoclax approved by FDA for untreated CLL and SLL ", "Dr. Ailawadhi on the Rationale for Evaluating Lisaftoclax in CLL ", "Assessing Zanubrutinib, Obinutuzumab, Venetoclax for Previously Untreated CLL ", "Ibrutinib/Rituximab Combo Demonstrates PFS Superiority Over FCR in Previously Untreated CLL ", "Bone marrow stromal cells enhance the survival of chronic lymphocytic leukemia cells by regulating HES‑1 gene expression and H3K27me3 demethylation ", "COVID-19 Takes a Toll on People with Blood Cancers and Disorders ", "Evolution of BTK Inhibitors in CLL ", "Jennifer A. Woyach, MD, on the Alliance A041702 Trial in Chronic Lymphocytic Leukemia ", "Dr. Bhat on the Combination of Ibrutinib Plus FCR in Treatment-Naïve CLL ", "Acalabrutinib Appears Tolerable in Chronic Lymphocytic Leukemia ", "Dr. Abedin on the Clinical Significance of Undetectable MRD in CLL ", "Dr. Arora on Novel Therapies in CLL ", "Pirtobrutinib Showcases Encouraging Activity in CLL, MCL, and Other B-Cell Malignancies ", "Study Finds Single Agent Acalabrutinib Superior in Relapsed CLL ", "Positive Efficacy Achieved With Bendamustine Debulking Followed by Ofatumumab /Ibrutinib in CLL ", "Study Examines Prognostic Subsets of B Cell Receptor Immunoglobulins in CLL ", "Memory-Related Genes May Overcome Resistance to CAR T-Cell Therapy in CLL ", "Health Canada approves Janssen's Imbruvica for treatment of patients with chronic GVHD     ", "Case Report: Ibrutinib Might Protect Against Acute Lung Injury in Patients With CLL, COVID-19 ", "Study Results Show Greater Hypertension, Cardiovascular Risks With Ibrutinib ", "AEs From Ibrutinib in Real-World CLL: More Research Needed - Cancer Therapy Advisor ", "Dr. Al-Sawaf on Fixed-Duration Versus Continuous Treatment in CLL ", "Cirmtuzumab Added to Ibrutinib Induces Responses in R/R MCL and CLL ", "EU approves Imbruvica plus rituximab in first-line CLL ", "In Search of the Right Sequence for Venetoclax in CLL ", "Dr. Alkharabsheh on Remaining Challenges in High-Risk CLL ", "Dr. Seymour on Role of Ibrutinib in CLL ", "Ibrutinib plus rituximab 'more effective and less toxic' than chemoimmunotherapy for chronic lymphocytic leukemia ", "Investigators Pursue Less-Toxic Treatment in Frontline CLL ", "Ascentage Pharma Announces CDE's Approval for the Phase II Pivotal Study in China of the Bcl-2 Inhibitor Lisaftoclax (APG-2575) for the Treatment of Relapsed/Refractory Chronic Lymphocytic Leukemia/Small Lymphocytic Lymphoma ", "Dr. Smith on Ibrutinib-Based Therapies in CLL ", "Chronic Lymphocytic Leukemia: Signs, Symptoms, and Complications ", "Ibrutinib Continues to Outperform Chemoimmunotherapy in Patients With Treatment-Naïve CLL ", "EU Panel Backs Venetoclax/Rituximab Combo in Relapsed/Refractory CLL ", "Dr. Woyach on Frontline Treatment Options in CLL ", "Timing Important for COVID Vax in Patients With Blood Cancers  Well, I guess this was to be expected. I wish there was serology testing like this more available. Although, it is been so long since I got my second dose, I do not think the results would be easy to interpret.", "model supports MRD as primary endpoint in CLL chemo-immunotherapy trials Results from a meta-analysis in CLL ", "Budget Model Predicts Savings for Switch to Rituximab Biosimilar in NHL, CLL ", "Ublituximab Doublet Bests Chemoimmunotherapy in Chronic Lymphocytic Leukemia ", "In CLL, Venclexta-rituximab Combo Shows Long-term Benefits ", "Optimizing Treatment Approaches for Chronic Lymphocytic Leukemia ", "Maybe at last a Shingles Vaccine for CLL (chronic lymphocytic leukemia) Patients in the USA ", "CLL | CryptoLiveLeak Token | Airdrop Review ", "Ibrutinib, Venetoclax Combination Shows Promise in Patients With Chronic Lymphocytic Leukemia, Small Lymphocytic Leukemia - Hematology Advisor ", "Bendamustine/Rituximab is an Effective Salvage Therapy in CLL ", "ASH 2017 Oral Abstract #432 Early acalabrutinib/obinutuzumab combo data in CLL with markedly high response rates in both R/R and TN patients ", "LLS Launches Online Video on How to Join Clinical Trials, What to Expect ", "Frontline Ibrutinib Shows Sustained Survival Benefit in TP53-Aberrant CLL ", "How Does del(17p) Affect Survival in Patients with CLL Treated with Ibrutinib? ", "Clinically indicated ibrutinib interruptions do not limit long-term benefit in CLL ", "Venetoclax plus obinutuzumab extends PFS in CLL ", "AbbVie gets positive CHMP Opinion for VENCLYXTO for Leukemia patients ", "Researchers reveal discovery of new cancer drug fadraciclib ", "Rituximab and Covid-vaccine Hi everyone,\n\nDo you happen to have any information on the interaction between Rituximab and the Covid19-vaccine?\n\nI have finally been fully vaccinated and am ready to start treatment for the second time. My first treatment, immunochemotherapy Bendamustine + Rituximab, was in 2008 and resulted in about seven years of remission. Therefore I was leaning towards repeating it, which was also the first option my doc had addresed. But that was before Covid.\n\nNow my doc is telling me that immunochemo is off the table because Rituximab might block the effect of the Covid-vaccine. Therefore Venetoclax is my only other option (I have a heart condition, so  Ibrutinib is not a choice). But the same problem occurs with Venetoclax: I would not be able to take it with Rituximab. Which means I would be on it for an indefinite period of time, instead of just two years.\n\nThat is a real bummer. I trust my docs, but I would still like to read for myself how Rituximab interferes with the Covid-vaccine. I particularly want to know if it can still block the vaccine if administered a month AFTER the vaccine.\n\nI would be grateful for any lead. I live in Germany and have not found much about it here, at least no information that deals with cll, so I am hoping someone else has insights.\n\nThank you in advance! Hi, I seen to be in a similar situation. I have also been fully vaccinated and just started Venetoclax treatment, I will be getting Rituximab as part of my protocol. I received Rituximab with chemo 20 years ago on my first go through, so I was very positive about it being a part of my new treatment. There does seem to be some issue with Rituximab and sever Covid-19.\n\nBut as always the devil is in the details. These articles below were posted here recently, but they are talking mostly about autoimmune diseases and not CLL/SLL. But your doctor always gets the last word. It is the stuff we patients do not know that could make the difference.\n\nMy doctor is, at least at this point, still going to go ahead with the Rituximab. I will say, even though I just started a few weeks ago, the Venetoclax has been giving me great results, with barely any side-effects. \n\nGood luck to you, I second the recommendation to take Venetoclax. I did Gazyva (second generation Rituximab) 6 monthly injections last April - Sept, and Venetoclax starting last June. I tested uMRD in blood and bone marrow, and my oncologist has recommended stopping Venetoclax. The cessation of treatment should be based on testing results, and combining Gazyva with Ven can make it more effective, but Ven can also be effective on its own. \n\nI also did the LLS trial where they measured the Covid antibodies generated from the vaccine, which I took in March and April. I did mount a measurable response, even after Gazyva and during Venetoclax treatment, so it is possible!\n\nGood luck! Thanks for your reply! So, your doctors did not see any problem with giving you Rituximab after your vaccination? Did they address the issue of interaction at all?\n\nMay I also ask what articles you are referring to?\n\nI am glad to hear that you are tolerating Venetoclax well. Wishing you all the best! I have not started the Rituxamab just yet. But I am supposed to soon. I have had preliminary discussions about it with my doctor, but my next appointment will be mainly about the Rituxamab. \nSorry about the articles, I must have messed up when I added the links to my reply. But if you search this CLL subreddit for Rituxamab and Covid a couple articles show up. Thanks to you as well! \n\nI am not totally against Venetoclax, but the thought of taking it for an indefinite amount of time triggers my anxiety. \n\nI am also worried about the stress I may have at work during the adjustment period. With a chemo I would just be on sick leave for six months and able to concentrate on myself. With Venetoclax however I would probably have to juggle work and appointments, not to mention possible side-effects, and I am already on the verge of breaking down due to various reasons. \n\nGood for you that you responded to the vaccine! I am planning on having my response tested as well. The question however is, if Rituximab can still block this response after it has developed.\n\nI will keep looking for infos.\n\nGood luck to you too! I totally understand about the anxiety, and I suggest that you take a look at the CLL Society, they have a great website about CLL, and have support groups as well. I participate in 2 of them, and we are now all virtual, and have the meetings via Zoom. New members mainly listen, and hear about others experiences, and it is extremely reassuring. \n\n&amp;#x200B;\n\nOne thing to keep in mind: chemo can have damage to your bone marrow, which impacts can show up many years later, and the newer immunotherapies have very few side effects. Taking pills at night or in the morning had no impact on my ability to work, and I had no side effects. \n\nStay strong, we are all in this together.", "CAPTIVATE Study BTK Inhibitors With BCL2 Inhibitors in CLL ", "Randomized trial of ibrutinib versus ibrutinib plus rituximab in patients with chronic lymphocytic leukemia ", "An improved benefit‐risk profile of duvelisib in patients with CLL who received 2 prior therapies ", "First-Line Therapy for Older Patients With CLL ", "Statistics on age Although CLL is an older individual disease I wonder how many of you were young? Younger than 60? Younger than 40? And what were symptoms and treatments? It you do not mind sharing. Thanks 🙏🏻 I was diagnosed at the very beginning of this year. I am a 43 year old male. I am not currently going through any kind of treatment my doctor thinks it will be 5 to 10  years before I will need treatment. That is great news. As far your blood work during diagnosis we are they all out of whack do you know? Any aggressive lymph nodes? Thanks 😊 So I have a lymph node in my throat that is huge. It is the reason I went to the doctor. The primary care doctor I was seeing at the time had no idea what was going on with me so we did blood work, CT Scan ,and then a biopsy of my armpit. I feel like I have/had other symptoms, however my doctor has not told me if they are related. I am 28 diagnosed 2 months ago. No treatment yet. Swollen lymph node in groin was the only symptom! In your throat? Or on the side of neck? Wow really young. Any abnormality in blood work? Sorry side of neck right above my adams apple. Some days it is about the size of a grape some days the size of a walnut. They will not remove it unless it hinders my breathing or ability to eat, which is kind of annoying. Fortunately I have a beard or else it would be visible the majority of time. Oh and one other thing. After I got my COVID shots the lymph node in my armpit swelled up so big it was uncomfortable for like a month. I guess it is a common response however I find it a little odd. Oh alright I see, you say above your Adam’s apple? Is it visible to the eye? I am trying to picture it never heard of one there I was diagnosed when I was 27. The swollen lymph nodes were discovered by chance. I was on watch and wait for a couple of years, had a chemo that led to full remission, then some more watching and waiting, and now I started on Venetoclax. \n\nI have to say, except for the last couple of months where I felt fatigued, sweated a lot and showed a couple of haematomas, I feel like the disease has not affected me much physically over all these years. Even the chemo was almost like a walk in the park. \n\nWhat was affecting me mentally though was my face gradually puffing up from the swollen lymph nodes, until it was shaped like a peanut m&amp;m, lol. Makes you feel pretty self-conscious. But that is currently receding thanks to Venetoclax.\n\nWhat is your story? Are you a patient yourself? J Pretty common. Got my third vaccine and the lymph nodes under my arms are easily the size of baseballs. After my second vaccine, it took about a month for them to go down to the point of not being painful. Expecting the same, but this time is much worse so I am not that confident. Official diagnosis was at age 35, but we later discovered I would had CLL for a few years before that when looking at past blood work. \n\nI went to the doc because my vision seemed weird, had bad night sweats, and was waking up to high heart rate alerts from my Apple Watch. It is hard to say if any of these were related to CLL though, because I would have had it for years before those “symptoms” began. \n\nMy lymph nodes are getting pretty big, which is common for someone with an 11q deletion, and my white blood cell count is approaching 200k. No treatment yet, but I expect my Active Observation period will end soon. 44yo. Routine annual physical.  Blood work showed elevated WBC of 12000. Follow up a couple moths later had me at 19000. 7 months later 24,400. Wow 200k no treatment! You said you were diagnosed at 35, how old are you now, how elevated was the wbc then? And what is your ethnicity? Oh yeah! Sorry that is the thing that showed them. Had a white blood count of 49,000 Lymphocytes have been abnormally high since age 34.  Treated at 41.  Looks like 3+ years before another treatment. \n\nHeat intolerance above 74F, Sun intolerance beyond 15 minutes, massive splenomegaly on CT scan, upper left quadrant pain when diving deep in a pool.   Tenderness on left side eventually.   In the past 2 years night sweats.  Am ecxema like condition on my elbows and hip.  My lymphocyte count only grew to 17,000 before needing treatment.  \n\nDoc gave me rituximab monotherapy since I had an unusually bright cd20.  It seems to have worked well enough to resume a largely normal life.  The weirdest thing is that it cleared up my elbow skin and the heat intolerance. I am just about 38 now. It is been exactly 3 years since I decided to set an appointment. \n\nWBC was 14k at my first appointment and I have now officially doubled within 6 months based on my last lab. \n\nMost other counts are within normal range, so while my WBC is high, it is important, to me, to not treat just because of WBC. One can easily be in the 600k range without any symptoms whatsoever. \n\nIt is possible, although unlikely, that I will plateau around 200k for awhile. I know others where this has happened, but with the size of my lymph nodes, 11q, and unmutated status, I will probably look into a trial at MD Anderson within the next 6 months. \n\nFWIW, I am an American of Northern European decent, so about as white as they come. Interesting, thank you. White European tend to be the highest risk. One last question if that is alright, you say all other labs were normal. Did you/ do you have lymphocytosis? Interesting, thank you. How high were lymphocytes during diagnosis? Was it already &lt;5000? Or leukocytosis? Last thing, what is your ethnicity? Interesting thank you. Did you have elevated lymphocytes as well? And what is your ethnicity if you do not mind? I do not know the answer to that unfortunately.  I was sent home with no answers and simply mailed brochures with a broad range on information. \n\nI am Caucasian. DX 7 years ago at 46 yrs. Ibrutinib for about 3 years now. No high risk markers. Yes, my absolute lymphocytes are high, for sure, but not enough to alarm my doctors quite yet. WBC is high, absolute lymphocytes are getting up there, and hemoglobin finally dipped below 14.3 to 14 so we are seeing that start to drop for the first time. Platelets and neutrophils are well within normal range so far. It is a bit weird...  I had went for a CT for appendicitis in 2017 and the doc saw the splenomegaly and said something to the effect of \"you should see a hematologist if you want to get to the bottom of that mystery.  It is probably nothing\".   So I ignored it until 2019 when it started hurting.   The hematologist said I have cancer within about 2 minutes of talking to her, which was a bit of a shock.   \n\nMy lymphocytes were over 5k since 2012ish.   I was formally diagnosed at 14,000 around Aug 2019 but the biometrics had been going unrecognized by my pcp for years.  My CBC showed lymphocyte abs climbing steadily for years with no downward trend.\n\nIt was not until late 2019 that my WBC abs count became abnormal.  They saw smudge cells, clefted lymphocytes and giant platelets on the smudge and followed up with a flow cytometry.   The test took forever to get the results back for, but at that point it was clear that it was a lymphoma or leukemia.  I did another 2 months of tests (axillary dissection and bone marrow biopsy) and I. That time the lymphocyte count started growing rapidly and my symptoms made me pretty miserable.   The whole thing was very subtle until I needed treatment.\n\nMy ethnicity is mostly Polish and some Croatian.  I have some low single digits of Irish, Lithuanian, and Norwegian DNA.  Surprisingly I have an Irish surname. Very interesting story, I am sorry for it being quite unfortunate. The positive is you will most likely live a very normal life. I am surprised they did not pursue further testing since 2012 with the 5k lymphocytosis. Thanks again for sharing your story 55 yo M. Diagnosed four years ago at 51. Was not a major worry. But my WBC doubled twice in the past two years. It is up to 150K. Been having symptoms of night sweats and overall fatigue. Onco wants to start me on treatment. \n\nNot too happy to start chemo pills at 55 but interested in hearing what other people’s experience is. I was just diagnosed at 52 but who knows how long I have had it.", "FDA Accepts BLA for Ublituximab/Umbralisib in CLL and SLL ", "Circulating B-Cell Chronic Lymphocytic Leukemia Cells Display Impaired Migration to Lymph Nodes and Bone Marrow ", "Zanubrutinib Responses Deepen Over Time in Relapsed/Refractory CLL ", "Chronic Lymphocytic Leukemia: Causes and Risk Factors ", "Lower Adherence to Ibrutinib Among Real-World Patients With CLL  It is harder to stay on meds with your insurance company demanding PA with no notice, for an illness that has no cure. It is borderline harassment.", "Roche announces new data reinforcing the long-term benefit of Venclexta/Venclyxto-based combination for people with relapsed or refractory chronic lymphocytic leukaemia ", "Patient outcomes following ibrutinib discontinuation for CLL in a real-world setting ", "Top in hem/onc: Diet and prostate cancer risk, three-drug combination for CLL ", "Umbralisib–Ibrutinib Combo Shows Promise in Relapsed/Refractory CLL ", "Finding second hits to knock out leukemia ", "Ibrutinib Plus Rituximab Superior to Chemoimmunotherapy for Certain Patients with CLL ", "Acalabrutinib Regimens Improve PFS in Treatment-Naïve Patients with CLL ", "Ibrutinib Outshines Chemoimmunotherapy Among Older Patients with Untreated CLL ", "Ibrutinib/Rituximab Approved in Canada for CLL ", "Dr. Skarbnik Discusses the Changing Landscape of CLL  Turn off ad-blocker or open in incognito mode", "Small Molecule Inhibitors for the Treatment of Chronic Lymphocytic Leukemia ", "Off-the-shelf CAR T-cell therapy induces durable remissions in relapsed, refractory B-cell malignancies ", "Higher Overall Response Rates Observed When Adding Ublituximab to Ibrutinib Treatment for CLL ", "Does Treatment for CLL Accelerate Myeloid Neoplasms? ", "What has your experience been like so far? Hello, newbie here again. My father was recently diagnosed. I am incredibly appreciative of everyone that has given me advice within this sub and also through private messages.\n\nIf anyone is willing, I would love to hear about yourselves and you or your loved one's \"journey,\" from when you first suspected something was not right to diagnosis to treatment, etc..., good or bad. \n\nI am not trying to apply all experiences towards my dad's situation, I know everyone is case is different.  I am just genuinely interested in your experiences.\n\nEveryone I have talked to here has been so amazing. I have been thinking about you all a ton, and I truly hope for continued success and growth in treatment for this disease I can give you a positive story. They will not all be like that.\n\nI got diagnosed with CLL in 2015, and it was dormant until last summer when I got pneumonia. The complications were pretty bad: kidney failure, sepsis, WBC from 50,000 to 100,000 and back in two hours, and I had an incident of diabetic ketoacidosis (blood glucose 897). So they air medevacced me to a bigger hospital.\n\nAfter I got out of the ICU a week later, Sept. 7 I think, my WBC went steadily up and through 100,000, and at the end of the year my oncologist said I should start treatment in January. But then I got Covid-19.\n\nI finally started treatment at the beginning of April with obinutuzumab. This is a typical first line therapy, usually with venetoclax. The obin monoclonal antibody is made from a chimera, an animal with two genotypes. Some lunatic figured out how to bioengineer a mouse with 4% human DNA and then use its cells to make a cancer medicine.\n\nI had a 146,000 WBC a few days before the first infusion. When I came back a week later, the WBC was down to 1,300, which is too low. I have had five infusions since then and may be done after the sixth next month.\n\nI had no side effects from this. Nothing.I do not know how they will treat your dad, but if it involves infusion, it is pretty much a glide. It hurts for about three seconds when they put the needle in, then you just chill in a comfy chair for four or five hours. You can bring a computer or phone, read a book. I bring my lunch, but you can have food delivered too at the clinic I go to..\n\nI have been very lucky. These drugs are very powerful. Originally the oncologist told me the regimen would take a year. Cancer pretty much already wrecked.\n\nI wish you and your father all the best in overcoming CLL. Thank you so, so much for your story and the detailed information. I truly appreciate you taking the time to write it all out.\nHoly cow, last summer was insane for you! What a whirlwind, I cannot even imagine how difficult it all was! I am so happy to hear you are doing well.\nI know everyone is treatments and responses are different, it is just interesting to see other people's experiences.\nMy father will be hopefully starting on Calquence as soon as he can figure out how to pay for it.\nAgain, I am so happy you are doing well at the moment. I truly wish you the best, and due to your username, I cannot help but keep FakeNickOfferman in my thoughts forever. Thank you again 💗 I went on too much about myself. I did have some good news when I talked to my on July 22.  I have one more infusion and that is it, at least for now.\n\nI would say CLL is kind of a shape shifter. Some people end up having lymph nodes in their neck surgically removed, which scares the living hell out of me. For some others some of the drugs just do not work.\n\nOn the other hand, you have idiots like me who dodged a bullet, at least for now. My doc tells me he has one patient who has maintained a 200,000 WBC for years, but it is been stable at that level and he has not needed treatment.\n\nThe Reddit CLL site is great for research. But if you want tp get the whole spectrum of CLL patient experiences, check out the CLL section of Healthunlocked.  (\n\nThis site collects patient experiences from all over the world. They are worth looking into.\n\nMay your father live long and prosper.", "New diagnosis. Does anyone else have CD38 markers? It seems particularly aggressive. I just had a baby, when I never thought I would get pregnant. I saw median survival is 30 months. That is hard to swallow. I do not want to leave my baby. \n\nIf you were late stage or aggressive did you achieve remission? How long have you been in remission? \n\nMy head is spinning. I see the oncologist tomorrow, but I cannot sleep. Chill. None of the PFS or median survival information you have access to reflects the new classes of drugs. Get on the CLL Society website and into a local email group. Hi, I am sorry that you are just diagnosed. Do not Google any information about CLL, as much of the information is outdated. Also, after you talk to your oncologist, seek out a CLL expert, as there are so many great treatments and trials available for this cancer, and local oncologists may not be aware of them. CLL Society is a great start, there are also Facebook groups, \"CLL/SLL/NHL Cancer support for women\" is a private group, request access there for more information. p.s I am very aggressive, and its been 5 years and I just moved to another treatment that will take me out for many more years.", "FDA approves Calquence for chronic lymphocytic leukemia under international collaboration ", "Clinical Challenges: Treating CLL When BTK Inhibition Fails ", "Top stories in hematology/oncology: CRISPR-edited T cells safe in patients with cancer, FDA grants another priority review to Keytruda ", "Fixed-Duration Ibrutinib/Venetoclax Provides Deep, Durable Responses in Frontline CLL/SLL ", "'Possibility of Cure' for Some Patients With CLL {Grain of Salt} ", "LOXO-305 Demonstrates Promising Efficacy in CLL — Episode three ", "FDA Approves Acalabrutinib to Treat CLL/SLL ", "‘Surprising’ link between ibrutinib, hypertension spurs further study ", "End-of-Year Wrap Up: Examining Past, Present, and Future Developments in CLL ", "Umbralisib/Ublituximab Plus Venetoclax Triplet Moves Into Phase 3 Testing as Phase 2 Trial Completes Accrual in CLL ", "Early Efficacy, Safety Noted With Lisaftoclax in First-in-Human CLL Trial ", "Acalabrutinib Demonstrates Three-Year PFS Benefit in Relapsed/Refractory CLL ", "CLL diet: What to know ", "Duvelisib Effective in Relapsed or Refractory CLL/SLL Patients Who Failed Arzerra, Extension Study Shows ", "Dr. Seymour on the Safety of Acalabrutinib Vs Ibrutinib in Relapsed/Refractory CLL ", "Dr. Thompson on the Evolving Role of MRD Testing in CLL ", "Other Promising Strategies in CLL ", "Venetoclax combination improves PFS in refractory chronic lymphotropic leukemia ", "Jan A. Burger, MD, PhD, on CLL Research Coming Out of ASH ", "Study Shows Higher BTKi-Related Toxicity Burden with Ibrutinib, Lower Impact of CV-Related Toxicity with Acalabrutinib ", "Allan Looks at Acalabrutinib Results as Treatment of Patients With CLL ", "Blood cancer symptoms: The small marks on the skin that could signal leukaemia ", "Dr. Ghia on the Rationale for the CAPTIVATE Trial in CLL ", "Lymphocyte/Monocyte Ratio Associated with Survival Duration in CLL ", "CALQUENCE® (acalabrutinib) Significantly Prolonged the Time Patients Lived without Disease Progression in Relapsed or Refractory Chronic Lymphocytic Leukemia ", "Toxicity Burden Decreased With Acalabrutinib Vs Ibrutinib in CLL ", "Acalabrutinib and Its Therapeutic Potential in the Treatment of Chroni | CMAR ", "Venetoclax for CLL or SLL ", "5th case series reports a similar high death rate of around 40% for #bloodcancer patients COVID19. Surprisingly people who were NOT currently treated or never treated were MORE likely to present with severe COVID19 than untreated  Sorry, typo in the title. This should have said the UNTREATED CLL patients were surprisingly more likely to present with severe COVID19 than the treated. Yeah but even that is not fully accurate. Untreated, hospitalized patients with still a median age of 70. There is nothing in here that differs all that much from the general population when you take into account multiple comorbidities. Not only that, it flies in the face of other studies that have detailed mild disease for watch and wait patients. Lastly, out of 15,000 reported patients, only 200 ended up with Covid-19, if I understood that correctly. The info is interesting but I am not sure it changes any behavior, at least for me, a 38 year old watch and wait patient 13+ years into this diagnosis. Be cautious, wear mask, hygiene, no crowds for now. That is the best most of us can do. Be well. What data have you found for only mild illness in watch and wait people? It was in the study you posted. They referred to it. They said there was MORE severe illness than mild in the untreated. “Moreover, in a recent series focused on patients with hematologic neoplasms hospitalized for COVID-19, those without active cancer (watch &amp; wait strategy and remission status) presented a favorable outcome . In that cohort, six out of six patients diagnosed with chronic lymphocytic leukemia (CLL) survived the infection . A similarly favorable outcome was reported in a Spanish cohort focusing on patients with CLL, where all four affected cases recovered from COVID-19 without intensive care admission .”  Ah I see. You are quoting the review of the literature prior to this case series. Note that those two publications only cover ten patients between them. This new study is much larger so trumps them. The key thing is that some people will have mild COVID-19 disease whatever stage of their CLL.  But others will have severe disease and may even die. The advice to all of us has to be to do everything we reasonably can to avoid catching COVID-19 since it is like playing Russian roulette. We cannot guarantee having a good outcome sadly.", "Dr. Byrd on Combination Strategies in CLL ", "Acalabrutinib monotherapy in patients with relapsed/refractory chronic lymphocytic leukemia: updated phase 2 results | Blood ", "Ibrutinib Treatment for First-Line and Relapsed/Refractory Chronic Lymphocytic Leukemia: Final Analysis of the Pivotal Phase 1b/2 PCYC-1102 Study ", "COVID-19 Continues to Result in High Admission, Fatality Rates Among Patients With CLL ", "AZD8055 promise for CLL combination treatment ", "Exercise Can Help Ease Excessive Fatigue in Survivors of Cancer ", "SEQUOIA Trial Meets Primary PFS End Point Improvement With Frontline Zanubrutinib for CLL ", "Understanding the Management of CLL in the Time of COVID-19 ", "Key Biologics Accelerates CAR-T Research with New Leukaphereses Offerings ", "Venetoclax Plus Obinutuzumab Prolongs PFS, Not OS, in Chronic Lymphocytic Leukemia - Cancer Therapy Advisor ", "Stamping Bar Codes on Cells to Solve Medical Mysteries ", "Autolus Reveals Early Clinical Data of Next-Gen CAR-T Therapy ", "Venetoclax Active in Ibrutinib-Refractory CLL ", "Triplet Regimen Induced 90% Response Rate in Patients With CLL ", "Phase 1/2 Trial Demonstrates Activity of Pirtobrutinib in CLL, B-Cell Malignancies ", "Mushrooms and CLL I have seen references to shiitake, shaggy mane, reishi &amp; turkey tail mushrooms in leukemia research. What is known so far &amp; what is being looked into?", "Acalabrutinib Demonstrates Improved Tolerability, Similar Efficacy to Ibrutinib in CLL ", "AbbVie's venetoclax successful in late-stage study in first-line CLL ", "Trabectedin Targets Leukemic Cells and Restores Immune Cell Function in Models of Chronic Lymphocytic Leukemia - Cancer Therapy Advisor ", "Long-Term Ublituximab Plus Ibrutinib Results Show PFS Benefit in High-Risk CLL ", "VIDEO: Venetoclax-rituximab sustains survival benefits in relapsed, refractory CLL at 4 years ", "Dr. Hill Discusses the Progression of CLL Treatment ", "Dr. Raphael on the Treatment Landscape of CLL ", "Responses to Anti-CD19 CAR-T Therapy Tied to Longer Survival in Relapsed CLL ", "Discontinuation of Venetoclax Impacts Outcomes of Rituximab Combination in CLL ", "An Expert Assessment of Available BTK Inhibitors Within the CLL Treatment Spectrum ", "FDA Approval Sought for Ibrutinib/Rituximab in Frontline CLL/SLL ", "Evaluating Frontline Ibrutinib Plus Venetoclax in Chronic Lymphocytic Leukemia ", "Recent Breakthroughs in the Treatment of Refractory CLL ", "Zanubrutinib Demonstrates Positive Results at Interim Analysis in Treating Chronic Lymphocytic Leukemia ", "Detroit area Ibrutinib patients w/ sketchy insurance Hi,\n\nIf there are any Detroit-area Ibrutinib patients here, can you please DM me?  I have something for you.", "Case Report: Ibrutinib Induces Acute Gout Flare of Bilateral First MTP Joints in Patient With Chronic Lymphocytic Leukemia - Rheumatology Advisor ", "AstraZeneca ASCO 2021 Data Support Ambition to Revolutionize Cancer Outcomes by Treating Earlier and Transforming the Patient Experience ", "Ibrutinib and Rituximab vs Standard Chemoimmunotherapy in CLL ", "Venetoclax and Rituximab: New Standard of Care in CLL? ", "COVID-19's Impact on How Patients with CLL, Myeloma Have Received Treatment ", "Update: 2 Months on Imbruvica for CLL Male, 53, CLL\n\nNo major side effects, some transient mouth sores that last a day or two, some nausea, maybe once or twice a week, some folliculitis, dry mouth, especially when sleeping, very little diarrhea, non-stop peeing because I have to drink a gallon a day, really not much to report, totally tolerable given the results.\n\nAll of the swelling in my lymph nodes under my armpits &amp; in my groin, and under my chin isgone, while that was happening my WBC did spike to over 100k, and is now currently 73K.  This is one of the reasons I am supposed to drink a gallon of liquids a day, to flush the kidneys free of all of the cell debris.  By taking Allopurinol and drinking a gallon a day I hope to avoid TLS, (Tumor Lysis Syndrome), in my kidneys.\n\nSure there is fatigue, it has totally changed my sleep schedule, I take 3-4 hour naps, and keep a night owl schedule.\n\nThe fatigue just makes you prioritize what is important in your life.", "Acalabrutinib as Potential First-Line Therapy for Chronic Lymphocytic Leukemia - Hematology Advisor ", "Dr. Abutalib on Recent Updates in CLL ", "Low platelet count vaccine reaction? Hi,  \nMy 80+yo dad's CLL has been completely stable for several years. He completed the Moderna vaccines a month ago and had routine blood work the other day. We were surprised to see that his platelet count dropped significantly. Has anyone heard of/experienced a Moderna vaccine reaction of platelet counts dropping? Bump", "Single-cell sequencing of CLL therapy: Shared genetic program, patient-specific execution ", "Ibrutinib and venetoclax combination for first-line CLL: CAPTIVATE phase II trial ", "Ibrutinib Plus FCR Could Provide Functional Cure in Young CLL Patients ", "ASH 2019 Roundup: The Latest on CAR T, New Treatments for CLL, and Using Genes to Predict a Common Side Effect ", "Real-World Data Show Temporal Trends in Risk of Serious Bacterial Infections in Patients With CLL - Oncology Nurse Advisor ", "Targeted Therapies Take Center Stage in the CLL Treatment Paradigm ", "Pigmentation Traits Linked to Risk of Non-Hodgkin Lymphoma/CLL ", "NYC BLOOD CANCER CONFERENCE Is anyone going to be there tomorrow?? :)", "ASH 2017: CAR-T therapy and beyond - Pharmaphorum ", "TG pulls victory from the jaws of defeat (Ublituximab and Umbralisib) ", "Verastem Announces Data from Phase 3 DUO Study Selected for Oral Presentation at the American Society of Hematology 2017 Annual Meeting ", "Chronic lymphocytic leukemia with progressive anemia secondary to development of composite lymphoma ", "Dr. Roach: Should people on immunotherapy get COVID vaccine? ", "Venetoclax/Idelalisib Regimens Better Option After First-Line Ibrutinib for CLL/SLL ", "Liso-Cel Plus Ibrutinib Increases Potency in Relapsed/Refractory CLL Treatment ", "Cirmtuzumab Plus Imbruvica Led to Increased Response Rates in MCL and CLL ", "Preclinical Research Suggests Role for ITK Inhibition in Monocytic MDSCs in CLL ", "ASH 2017 Oral Abstract #262 on BCL-2 family members implicated in ibrutinib and venetoclax resistance in CLL ", "ASCO Value Framework Challenging to Apply in CLL | Cancer Network ", "Pirtobrutinib Elicits Encouraging Efficacy in CLL, SLL, MCL, &amp; Other Non-Hodgkin Lymphomas ", "A Patient's Guide to Chronic Lymphocytic Leukemia (US News &amp; World Report) ", "Dr. Awan Discusses Combinations With Ibrutinib in CLL ", "Venetoclax, Next Generation BTK Inhibitors Show Promise in CLL ", "TG Therapeutics Announces Oral Presentation of Umbralisib, Ublituximab and Venetoclax Triple Combination Phase I/II Data in Relapsed/Refractory CLL at the 61st American Society of Hematology Annual Meeting and Exposition ", "Therapeutic Approach for CLL Relapse ", "The Next Frontier of CAR-T Therapies: Off-the-Shelf Therapies ", "Pooled Analysis of Ibrutinib Shows Long-Term Efficacy in CLL ", " Redesigned CAR-T eliminates dangerous cytokine release syndrome in lymphoma trial ", "Dr. Danilov on the Rationale to Target MCL1 and BCLX in CLL ", "BeiGene Presents Pivotal Phase 2 Clinical Results of Zanubrutinib in Patients with Relapsed/Refractory Chronic Lymphocytic Leukemia or Small Lymphocytic Lymphoma at the 15th International Conference on Malignant Lymphoma (ICML) ", "Study explores use of checkpoint inhibitors after relapse from donor stem cell transplant ", "Acalabrutinib Mirrors PFS Results of Ibrutinib in Frontline CLL ", "Duvelisib Approved in Europe for Relapsed/Refractory CLL or Follicular Lymphoma ", "Frontline Venetoclax-Based Combinations Improve uMRD Rates Compared to Chemoimmunotherapy in CLL ", "PAK1 Emerges as a Potential Target in Ibrutinib-Resistant CLL ", "Dr. Gauthier on Findings for CD19-Targeted CAR T Cells Plus Ibrutinib in CLL ", "Zanubrutinib Shows Positive Results in Interim Analysis Against Ibrutinib in CLL ", "Genetic Analysis Provides Insight Into Venetoclax/Obinutuzumab Benefit in Frontline CLL ", "CLL-Specific Society Fills Unmet Need ", "New Research Highlights Drivers of Outcomes in AYA With CLL ", "AstraZeneca's acalabrutinib shows treatment effect in CLL studies; shares up 1% - AstraZeneca Group plc (NYSE:AZN) ", "Phase 1 trial shows experimental drug safe in treating chronic lymphocytic leukemia ", "A drug potency signature links progression of chronic lymphocytic leukemia to mitochondria-related stress responses and metabolic reprogramming under hypoxia ", "Acalabrutinib Demonstrates Favorable Safety and Efficacy in Relapsed/Refractory CLL ", "The Mechanisms of CD20 Antibodies and Kinase Inhibitors on Survival of CLL Cells ", "Drug Duo Boosts Outcomes in Elderly Patients With CLL ", "Dr. Hill on Recent Advances in Treatment of CLL ", "Novartis’ Kymriah shows durable response in blood cancer ", "Combination Therapies Offer Newer Options for CLL Treatment ", "Novartis' CAR-T Therapy Kymriah Is Not Living Up to Sales Expectations ", "Does treatment really make you feel better? I am 55M with 150K WBC and symptomatic w night sweats, bone aches and fatigue. Probably starting treatment this month (possibly Zanbrutinib.). \n\nDo these pills actually make you feel better or just stop the advance? Curious as to what my future is on these.  TIA. Cannot opine as I was asymptomatic when diagnosed at 46 and at start of Ibrutinib four years later.  Are you about to start treating? Yes. Onco appt this week and we are going to discuss which options. Unless you have markers that point to difficulty, it seems the pills are the go-to in most cases. I am 62m and had night sweats and WBC count of 179k in the fall of 2020.  Did 10 courses (5 months) of IV Gazyva as the first treatment.  Treatment was a breeze other than 5 hours in the infusion chair.  I am not sure I \"feel\" better @ 62 years of age but no more night sweats or bone aches, my lymph nodes are back to normal and WBC is under 5k.  I am expecting 18 months of remission before starting a new treatment like Ibrutinib or Ventoclax.\n\nGood luck. I am 32 had a WBC of 350k, other symptoms included enlarged lymph nodes, enlarged spleen, and other blood counts that were out of the normal range. I was in watch and wait for about 4 years. I started treatment (Venclexta + Gazyva) about 5 weeks ago. My count dropped down to 3.3 within the first few weeks. I am generally feeling better less fatigue, feeling more clear headed if that makes sense, and overall more energetic. My medicine does make me tired at times but otherwise I am feeling much better. I can also breathe better, I did not even realize my breathing was affected until treatment made it better. Still going through treatment for at least a year but it is nice to see some progress. Encouraging. Thanks for sharing! IV may be one of my options as well. Thanks for the encouraging info! I had five months of g watever is and one month of venetoclax.\n\nBone pain is gone.\n\nIt is worth the effort. I feel I bought myself two or three years and then I will do it again. 350K WBC!?\n\nI am glad you are still with us!\n\nThe same therapy took my WBC down from 146,000 to 1,300 in a week. Yup! 357 to be exact. Thank you, me too :) My spleen is back to normal size and most of my lymph nodes too. What a time to be alive, we are lucky to have modern medicine. I agree. Some very talented people literally saved my life.", "Distinguishing Features Among BTK Inhibitors ", "Prognostic value of measurable residual disease detection after a fixed-duration chemotherapy-free treatment: a prospective analysis of the CLL14 trial ", "What You Can Expect with Venetoclax Treatment for Chronic Lymphocytic Leukemia: First Two Months Can Be Rough, Then It is 'Smooth Sailing' | SurvivorNet  I am interested in anyone's experience with this.\n\nI just started the venetoclax dosage up ramp yesterday after a month of obnituzumumab (totally cannot spell it).\n\nI just kind of feel disoriented one day in.\n\nWould anyone care to share their experiences with starting this drug? Same here. Had this treatment a few years back. Was bearable. (There are treatments which are worse!) If I remember correctly our cohort has symtoms of body aches, nausea, fatigue mental fogginess, and fluctuations in various results of blood tests,  but they eventually settle down. Miracle drug for many. \n\nYou might be interested in the following website of a wonderful lady who started the treatment with us.\n\n", "What Should Blood Cancer Patients Do After They Get the COVID-19 Vaccine? | SurvivorNet  I have been advised to take the same precautions as before because we have a lower immune system and the efficiency of the vaccine in these cases is depleted", "Wierda Compares Treatment Options for Patients With CLL ", "Recognizing the Side Effects of Newly Approved CLL Therapies ", "A Phase I Study of Epcoritamab in People with Relapsed or Persistent Chronic Lymphocytic Leukemia ", " FDA Expends Approval for CAR-T Therapy, Tisagenlecleucel ", "Therapeutic Approaches for CLL ", "Early Promise Observed With Lisaftoclax in Relapsed/Refractory CLL and Other Hematologic Malignancies ", "Zanubrutinib Plus Venetoclax as First-Line Therapy for CLL/SLL With Del17p ", "Rutgers Cancer Institute tests cell therapy, treating patients who might otherwise be out of options ", "Tirabrutinib Well-Tolerated as Combo or Monotherapy for Pretreated CLL ", "Jennifer A. Woyach, MD, Reflects on the Changing BTK Inhibitor Landscape ", "Uninterrupted ibrutinib with CAR T could improve CLL outcomes ", "ERIC Recommendations on IGHV Gene Mutational Status Analysis in Chronic Lymphocytic Leukemia ", "Ibrutinib Effective in Patients with CLL with High-Risk Genomic Mutations ", "High Rate of Undetectable MRD with Venetoclax-Based Regimen in Untreated CLL ", "Checkpoint Molecule Could Be New Cancer Immunotherapy Target ", "Landfill health study: Did the dump make us sick? ", "Dr. Ghosh on Approved BTK Inhibitors in B-Cell Malignancies ", "Patients With CLL Who Have Anaphylaxis With Obinutuzumab May Be Able to Receive Rituximab ", "Death Risk High in CLL Patients Infected with Covid-19 ", "Reviewing Key Points from the Phase III MURANO Trial in CLL ", "AstraZeneca's Calquence found success in lymphoma. Will CLL follow? ", "October 23, 2020 - 8:30am to 9:30am - ZOOM CONFERENCE - Blocking BCR-signaling and Beyond in Chronic Lymphocytic Leukemia (CLL) - Duke University School of Medicine ", "Dr. Ailawadhi on the Safety Profile of Lisaftoclax in CLL ", "Optimizing Use of Prognostic Markers for the Treatment of CLL ", "Treatment Strategies and Challenges in Chronic Lymphocytic Leukemia - Hematology Advisor ", "UNDERSTANDING IMBRUVICA - ***QUICK SURVEY FOR CLL PATIENTS*** SURVEY LINK: (\n\nI am a graduate student working on a research project to evaluate the real-world perceptions of Imbruvica(ibrutinib). I am hoping to identify barriers to treatment, or unmet needs in people with the indicated conditions, in order to improve access to innovative therapeutic products. Any and all data collected is anonymous and we request you do not include any self-identifying information. I would really appreciate your input if you could take 5 minutes to fill out this survey. Thank you in advance!", "Immune Compromised and Getting the COVID-19 Vaccine | U.S. News ", "Anti-spike antibody response to SARS-CoV-2 booster vaccination in patients with B cell-derived hematologic malignancies ", "BTK Inhibitor Therapy Effective for Patients With High-Risk, Progressive CLL ", "Venetoclax/Rituximab Combo Approved for CLL/SLL ", "I am leaving this Subreddit Hi - \n\nI was really hopeful to find a welcoming and sharing community here. Instead, a single user spams out about 45 articles every 6 weeks. Later. Please PM me if anything good every happens here. It is mostly a single user, but I do not think it is spam. Its just a steady flow of information. Although some of it is too technical for me, I still find it helpful to understand the most recent developments. \n\nIf you want it to be a welcoming and sharing scenario, then by all means, stay and contribute. It could be both good information and a sharing environment. :)", "Patient Activation, Good Communication, and Shared Decision Making Are Critical in Chronic Lymphocytic Leukemia ", "Dr. Barr on Novel Combination Strategies in CLL ", "ASH: AbbVie, Roche pad their case for fixed-duration Venclexta use in CLL ", "Kuur Therapeutics Announces First Patients Dosed with Allogeneic CAR-NKT Cell Therapy ", "The Shifting Therapeutic Spectrum for Chronic Lymphocytic Leukemia ", "New targeted treatment option for patients with (CLL) now available in Australia ", "Frontline Therapy in CLL: Combination Strategies and MRD ", "Second Hematologic Malignancy Deemed a “Rare” Event in CLL - Oncology Nurse Advisor ", "Dr. Flinn on the FDA Approval of Duvelisib in CLL ", "Dr. Abedin Discusses Key Updates in CLL ", "Use Mosaic Chromosomal Alterations to ID New Approaches to Preventing CLL? ", "Breakthroughs in certain leukemia treatments are right at the doorstep - [Short &amp; Sweet Vid} ", "BTK Inhibitor Yields Promising Results in CLL Resistant to Venetoclax ", "Time-Limited Ublituximab/Umbralisib Plus Ibrutinib Achieves 77% uMRD Rate in CLL ", "The Role of Chemoimmunotherapy Dwindles Among New Regimens in Frontline CLL ", "Dr. Perl Discusses the Impact of CAR T-Cell Therapy on ALL ", "Dr. Wierda on Future Research Directions With MRD in CLL ", "Trial Results Demonstrate Long-Term Efficacy and Tolerability of Acalabrutinib for CLL ", "Study Shows Cancer Patients Are Choosing Less Severe Side Effects Over Treatment Efficacy  ", "CLL? 26M. I have had swollen lymph nodes in my neck for over a year and high white blood counts that fluctuate. Over the last couple of months I have gotten some other symptoms such as fatigue shortness of breath headaches stomach aches and back leg and shoulder pain  just to name a few. Could this likely be cll or no? I have been to so many doctors and I have yet to get an answer. Not looking for an actual diagnosis rather someone to give me some knowledge on the situation and what to look out for. Unlikely.   But it shows up on a flow cytometry test pretty easy. \n\nYou should schedule a visit with a hematologist-oncologist at a cancer center to get a workup.  They do that sort of thing all day long. CLL is not easy to diagnose. Leave it to a specialist. Tlak to you doctor and go see a hematologist oncologist. What is your white blood cell count? It is fluctuated up and down the highest it is been was 19 then I took another blood test three days later and it went back down to 11 and my most recent was 9.5 but it is been up and down for about a year As in thousands, like 19,000?\n\nWhat my oncologist told me is that it is not the absolute number but how fast you get there. He is got one patient who has been at 200,000 for years. But it is been stable and he has had to have no treatment.\n\nAs I understand it, if the number doubles in six months, treatment may be necessary. I went from 50,00 to 146,000 in three months. Now down to 2,900 after some quality treatment and guidance.\n\nThing is, other things than CLL can cause alarming WBC changes. This is something you may want to talk to an oncologist about in addition to your GP.\n\nLive long and prosper! How are you doing at this point\n?\n\nCLL seems to be a real shape shifter. My levels are below normal at the moment, but the WBC count bounces all over the place. Getting a lymph node biopsy next Tuesday and blood redrawn on next Thursday I wish you absolutely the best with this.", "Reduced-Dose Ibrutinib Remains Effective in CLL ", "Standard of Care More Effective in Reducing MRD Than Ibrutinib Plus Venetoclax for CLL ", "Western Diet Linked With CLL ", "CLL: Bruton’s TKIs Succeed Against TP53 Alterations ", "Part 1: Frontline Treatment Options for CLL by Risk ", "Interim Analysis Shows Positive Results for Zanubrutinib Versus Ibrutinib for Adults With CLL ", "VIDEO: Ibrutinib-rituximab prolongs PFS, OS in chronic lymphocytic leukemia  This is just an exclusionary trial helping to prove what we already know, that chemotherapy is dead in CLL and targeted novel agents should be the treatment. ", "Distinct evolutionary paths in chronic lymphocytic leukemia during resistance to the graft-versus-leukemia effect ", "Venclexta: Dr. Tony Lin Summarizes Latest Data Presented at ASH ", "For CAR-T Cancer Fighters in the Real World, Two Roads Diverge ", "Obinutuzumab-venetoclax combination extends PFS in treatment-naive chronic lymphocytic leukemia ", "Enhanced IL-9 secretion by p66Shc-deficient CLL cells modulates the chemokine landscape of the stromal microenvironment | Blood ", "BTK Inhibitor May Be Safe, Effective in Patients With Relapsed, Refractory CLL ", "Venetoclax, Obinutuzumab, and Atezolizumab Combination Promising in Richter’s Transformation ", "A new kind of CAR-T becomes a micro-pharmacy, eliminating glioblastoma in mice (General, Car-T) ", "Roundtable Discussion: Cohen Leads Examination of Therapy Decisions for CLL During COVID-19 ", "ABVD-Based Regimens May Improve Survival in CLL that Transforms to Hodgkin Lymphoma ", "Ibrutinib Alone Wins in Older CLL Patients ", "Acalabrutinib, Venetoclax, Obinutuzumab Shows Promise as Frontline Therapy for Chronic Lymphocytic Leukemia ", "New Combination Therapies for the Treatment of Chronic Lymphocytic Leukemia ", "Long-Term Outcomes of Ibrutinib in Chronic Lymphocytic Leukemia ", "CALQUENCE reduced the risk of disease progression or death by 71% vs. standard of care combinations at three years in the ASCEND Phase III trial ", "Looking Back to Go Forward: CAR-T Cell Therapy in R/R CLL - Cancer Therapy Advisor ", "Clinical Challenge: Risk of Tumor Lysis Syndrome With Venetoclax in CLL — Assessment and prophylaxis are key ", "Drug combo heralds major shift in chronic lymphocytic leukemia treatment ", "Chemoimmunotherapy regimen effective in CLL patients with IGHV mutations ", "COVID-19 Pandemic Highlights Underrecognized Vulnerability of Patients With CLL ", "Dr. Barrientos on the Challenges in CLL ", "Questions With BTK Inhibitors and Anti-CD20 Combos Require Further Study in CLL ", "Dr. Logan Discusses Ibrutinib Plus Venetoclax in CLL ", "National Blood Cancer Experts Provide Updates on CAR T-Cell Therapy, Leukemia, Lymphoma, and Myeloma ", " Ibrutinib /Venetoclax Follow up - CLL Support Association ", "Any tips to help deal with fatigue or explain it? ", "CAR T Cell Therapy Can Bring About A Medical Revolution - Health Periodical ", "FDA authorizes COVID-19 vaccine boosters for the immunocompromised ", "Pirtobrutinib Offers a Potential Strategy to Overcome BTK Inhibitor Resistance in CLL ", "Frontline Management of Chronic Lymphocytic Leukemia ", "TG Therapeutics Announces Positive Topline Results from the UNITY-CLL Phase 3 Study Evaluating the Combination of Umbralisib and Ublituximab (U2) for the Treatment of Patients with Chronic Lymphocytic Leukemia Nasdaq:TGTX ", "FDA approves venetoclax for chronic lymphocytic leukemia ", "Innovative oral regimen developed for 1st-line CLL treatment ", "Imbruvica plus Gazyva extends PFS for chronic lymphocytic leukemia ", "Combination Therapy Could Dramatically Alter CLL Treatment  My husband just started a trial at MD Anderson with these 2 meds.  If you are so inclined, I am sure there are many one here who would appreciate hearing updates of your experience.   ", "Ibrutinib Plus Rituximab Approved in Europe for Frontline CLL ", "VIDEO: CAR T-cell therapy has ‘incredible potency’ in chronic lymphocytic leukemia ", "CALQUENCE Significantly Prolonged the Time Patients Lived Without Disease Progression or Death in Previously Untreated Chronic Lymphocytic Leukemia ", "Dr. Seymour on the Kinase Selectivity of BTK Inhibitors in CLL ", "Long-Term Data Support Use of Venclexta-Gazyva in Patients With Previously Untreated Chronic Lymphocytic Leukemia ", "COVID-19 Triggered CAD and Muscle Inflammation in Leukemia Patient ", "ASH: Gilead Sciences touts 'astounding' Yescarta survival results at 3 years ", "Clinical Challenges: Chronic Lymphocytic Leukemia and COVID-19 — BTK inhibitors may have a protective effect; ASH offers guidance ", "BTK Inhibitors Boost Outcomes in B-Cell Malignancies, But Challenges Remain ", "Venetoclax, Obinutuzumab Combo Leads to Improved Quality of Life in Patients with CLL ", "Will Maintenance Lenalidomide Become A Standard for Relapsed CLL? ", "At Increasing Levels of Sensitivity, NGS-MRD Detects CLL in Bone Marrow ", "Dr. Gauthier on Potential for CAR T Cells in CLL ", "Predictive significance of selected gene mutations in R/R CLL patients treated with ibrutinib ", "Chronic Lymphocytic Leukemia: Risks and Complications ", "Acalabrutinib Shows Higher Tolerability Versus Ibrutinib in CLL ", "BTK Inhibitors Represent the Preferred Frontline Regimen in CLL ", "AbbVie Gets FDA Nod for Venclexta Label Expansion in Leukemia ", "Dr. Davids Discusses Duvelisib in Relapsed/Refractory CLL ", "In the Era of Targeted Therapies, New Biomarkers Come to Light in CLL ", "How I treat CLL patients with ibrutinib ", "What are some of the genetic changes which cause CLL? ", "Dr. Hill on Resistance to BTK Inhibition in CLL ", "Ianalumab Produces Encouraging Early Activity in Phase 1 Study of CLL ", "Dr. Ghia on Key Findings From the CAPTIVATE Trial in CLL ", "PI3K Inhibitors in Management of CLL ", "Dr. Atallah on the Prognostic Role of Undetectable MRD in CLL ", "New Data Demonstrate Long-Term Benefit of IMBRUVICA® (ibrutinib) as First-Line Treatment for High-Risk Chronic Lymphocytic Leukaemia ", "Age Impacts Treatment Options for Patients With CLL ", "FDA Grants Orphan Drug Designation to Bispecific Antibody LAVA-051 for CLL ", "Despite New Treatments in CLL, Comparative Data and Guidance Slow to Emerge ", "Responses to Zanubrutinib Monotherapy Continue and Deepen in CLL, Updated Results Show ", "Roche, AbbVie leukemia drug superior to older medicine in study ", "Multidisciplinary project aims to educate physicians, patients about best practices in CLL care ", "Novel Frontline Combinations With Ibrutinib in CLL ", "Copiktra Approved for Relapsed/Refractory CLL/SLL, Follicular Lymphoma ", "High rate of MRD-responses in young and fit patients with IGHV mutated chronic lymphocytic leukemia treated with front-line fludarabine, cyclophosphamide, and intensified dose of ofatumumab (FCO2) ", "A Phase II Time-Limited Approach to Initial Ibrutinib Treatment for Chronic Lymphocytic Leukemia or Small Lymphocytic Lymphoma in Complete or Partial Remission ", "AbbVie's releases new data for chronic lymphocytic leukemia treatment - Korea Biomedical Review ", "Ibrutinib/BR Combo Improves Survival in CLL ", "Long-term Data: Acalabrutinib Provides Tolerable, Durable Responses in Relapsed/Refractory CLL ", "Dr. Bhat on Emerging Targeted Therapies in CLL ", "Three-Year Follow-Up Supports Fixed-Course Treatment With Obinutuzumab/Ibrutinib-Based Therapy in Treatment-Naive CLL - Cancer Therapy Advisor ", "Long-term CAR-T effects in R/R NHL and CLL ", "CLL patients who progressed after BCRi therapies have potential with venetoclax therapy ", "Adding Imbruvica to CAR-T Cell Therapy May Improve CLL Outcomes ", "Ibrutinib and Other Options for CLL ", "Patients with CLL with Partial Response Versus Complete Response to Venetoclax-Obinutuzumab - Docwire News ", "Umbralisib/Ublituximab Plus Venetoclax Induces High Objective Response Rate in Relapsed/Refractory CLL ", "Tool appears to predict need for treatment in asymptomatic, early-stage CLL ", "Interruptions of Ibrutinib Lead to Worse Outcomes in Patients With CLL ", "Evaluating Fixed-Duration Ibrutinib and Venetoclax in Relapsed/Refractory Chronic Lymphocytic Leukemia ", "Dr. Stephens Discusses Optimizing Treatment Selection in CLL ", "Concurrent Ibrutinib With CAR T-Cell Therapy Improves ORR, Reduces Severe CRS in High-Risk CLL ", "Monday, June 3, 2019 - Do not Miss Tomorrow's Sessions Featuring the Latest CLL Research ", "Updated Results Show Continued Ibrutinib After Fixed-Duration Ibrutinib-Venetoclax Has Durable Responses in CLL ", "Sustained Efficacy and Safety of Ibrutinib in Relapsed/Refractory CLL - Cancer Therapy Advisor ", "AbbVie (ABBV) Phase 3 Study of VENCLEXTA/ VENCLYXTO in Combination with Rituxan Meets Primary Endpoint ", "ACCC Quality Improvement Workshops Address the Need for Improved Chronic Lymphocytic Leukemia Care ", "Ibrutinib Plus R-Mini-CHOP Misses OS End Point but Shows Improved PFS in Newly Diagnosed DLBCL ", "Analysis Reveals Novel CLL Subgroups ", "Machine Learning Model Identifies CLL Patients With High Risk of Infection ", "Targeted oral therapy combo safe, effective for chronic lymphocytic leukemia ", "Chemotherapy Poised to Have Minor Role in Future CLL Treatment ", "Dr. Seymour Discusses Rationale for MURANO Study in CLL ", "Rolling BLA for Ublituximab and Umbralisib in CLL Completed for FDA Submission ", "Venetoclax-Obinutuzumab Does not Impair Quality of Life in Patients With Chronic Lymphocytic Leukemia - Cancer Therapy Advisor ", "Phase 3 GLOW: first-line ibrutinib plus venetoclax improves outcomes in elderly or unfit CLL ", "Novel Combination Therapies in CLL Transform the Treatment Landscape ", "Front-Line Ibrutinib Plus Venetoclax Effective for CLL Irrespective of Patient Age ", "Acalabrutinib Demonstrates Promising Response Rates in CLL ", "Dr. Abedin Discusses Differences Between Acalabrutinib and Ibrutinib in CLL ", "Dr. Epperla on the Implications of an FDA Approval for Ublituximab/Umbralisib in CLL ", "Frequency of TP53 Gene Mutation in CLL ", "Acalabrutinib appears effective, safe for advanced CLL ", "Chronic Lymphocytic Leukemia Survey Helps Docs Understand Patient Therapy Choices ", "Dr. Davids Discusses Ongoing Research With Ibrutinib Plus Venetoclax in CLL ", "Patient Clinical Features Should Be Sequentially Considered to Determine Optimal Treatment in CLL ", "Dad might be diagnosed, malpractice? About a month ago my dad was in the hospital for chest pain. He is had one heart attack so we are always cautious of this. While he was in there (dec 16th) apparently they found that his WBC was extremely high. (And Has been for the past year) They did a blood smear test and it showed abnormal cells. NONE of this was disclosed to us during that visit, and he was sent on his way w no follow ups or hematologist appts. Now, about a week ago my dad was having back pain. He is also had ruptured disks in the past so we brought him to the hospital again. This is when the Dr. tells us he looked at his blood work and his WBC is extremely high. This is when he mentions leukemia (CLL) he says that the blood work the last time he was admitted (dec16) showed extremely high counts and they did a blood smear and showed abnormal results. Mind you, he was sent home after that visit with NO FOLLOW UP or mentioning of this problem. This doctor is telling this to us and we are in COMPLETE disbelief that this info was not disclosed to us the last time he was admitted. They did the blood smear without telling us and it showed abnormal cells and they did not tell us. If my dad would have never gone to the ER for back pain this past week, we would have never figured this out until the next time he had blood work done and by then it could be too late. \n\nThe hematologist in the hospital is going to speaking with us soon, and helping w. Diagnosis. The doctor said the cells and blood work are consistent w CLL. \n\nIs this malpractice/negligence if he is diagnosed w CLL? \n\nI am extremely hurt stressed and worried \n\nThank you  Something very much like this happened to me. My dr did a blood test and the results were emailed to me, saying my results were consistent with a diagnosis of CLL. No dr call or anything. When I got my PCP on the phone she said yes you might have CLL, go see oncologist. After a week or so oncologist told me I have MBL, a sort of pre CLL which is surprisingly common, and not especially bad, as long as it doesnt turn into full blown CLL.  Yes, we have abnormal cells, but its in a quantity that is low enough that its not too harmful.  Hopefully that is what your Dad has too. Still sucks that they didnt say anything tho... Yes that is interesting but an e-mail or call was not sent to us to notify us of the first blood work they did that showed abnormalities. (Including blood smear) \n\nIf my dad had not been admitted this week for unrelated issues, we would have never found out about it  That is unfortunate, OP, and I am terribly sorry you had to experience this! They should have *definitely* called after the results of the smudge test. I had a similar experience to u/st3v3k4hn.\n\nYour father should have gotten a digital record of the test, and he very well may have within a day or two of his tests. I am not sure where you are located, but most hospitals in the US have some method of retrieving your test results online. It is possible he simply did not read it, email notification went to spam, or the smudge test in particular was lost in the flurry of dozens of other metrics. \n\nI was about as young as you get when it comes to a CLL diagnosis, so that probably makes me a bit more savvy in retrieving test results in a digital world. I went in to the doctor for an odd side pain, had my blood drawn, and checked my test results upon receiving an email notification within 24 hours. Quite frankly, I was mostly just curious about my cholesterol. There were dozens and dozens of tests, but the old \"smudge\" test stood out like a sore thumb amidst otherwise super-medical-sounding terms. Sure enough, I found out I had leukemia from an automatically generated email. It was a pretty shitty Friday, which also did not help in trying to get a hold of any doctors for about 4 or 5 days.\n\nMy experience is not the same as yours or your father's, but I bring it up because it is a prime example of what is in store for life with CLL. Basically, you have to be your own advocate. You have to be adamant about your tests, knowledgeable about what they mean, and continually be doing your own research on symptoms, trials, and treatments, because it is such a slow moving cancer that most doctors simply are not going to do that for you.\n\nThe word cancer is scary. The word leukemia is scary. I have a pretty good feeling on your emotions right now, but know this, more than likely nothing would have been done differently in that month of not knowing what should have been disclosed. Most with CLL are diagnosed after likely having it for *years.* \n\nIt is very possible I have had it for a long time, but have only known for one year. In that one year, my life has not changed that much outside of frequent doctor visits and screenings, but there is definitely a psychological impact. My doctor actually told me to try and forget about it, go on with my life, get married, have kids, etc. I cannot imagine this is possible for anyone with CLL. I literally think about it every single day, but time does help.\n\n( is a great resource and community if you have any questions or want to read up on other experiences. Unfortunately, the Reddit community is pretty slim on the CLL front, but that is most likely due to the average age of someone with CLL being 72. \n\n(Throwaway because I have not told my friends and family yet.)", "Novel Combination Therapy Shows Exciting Results in Chronic Lymphocytic Leukemia, Mantle Cell Lymphoma ", "Zandelisib/Zanubrutinib Produces Promising Safety, Efficacy in Relapsed/Refractory B-Cell Malignancies ", "CAR T-Cell Therapy: High Response Rates, High Toxicity Rates ", "Leukemia Survival Improved From 1995 to 2009, but Racial Gaps Increased for Some Types ", "Ibrutinib: the home run for cure in CLL?  Nothing against Ibrutinib, but always keep in mind ( of headlines. **Betteridge's law of headlines**\n\nBetteridge's law of headlines is an adage that states: \"Any headline that ends in a question mark can be answered by the word no.\" It is named after Ian Betteridge, a British technology journalist who wrote about it in 2009, although the principle is much older. As with similar \"laws\" (e.g., Murphy's law), it is intended to be humorous rather than the literal truth.The maxim has been cited by other names since as early as 1991, when a published compilation of Murphy's Law variants called it \"Davis's law\", a name that also crops up online, without any explanation of who Davis was. It has also been referred to as the \"journalistic principle\", and in 2007 was referred to in commentary as \"an old truism among journalists\".\n\n***\n\n^( ^| ( ^| ( ^| ( ^| (   ^]\n^Downvote ^to ^remove ^| ^v0.28", "Can Agent Orange cause chronic lymphocytic leukemia? ", "Patients with CLL face ‘substantial burden’ of adverse events in real-world treatment setting ", "Roche files Venclexta plus Gazyva in CLL ", "Well worth it if you are an American. ", "Top Discoveries in Chronic Lymphocytic Leukemia at ASH 2018 ", "{Soft News} Fully-vaccinated leukemia patient dies from COVID-19 after letting guard down  In case anyone needs an anecdote 😢 Wonder if he had a positive antibody test or a serum level tither to establish how well the vaccine worked.  I wonder if he had no response or a partial response.  If he had a response, did it wear off?", "Joint pain Hello,\n\nMy mother has CLL and has trouble moving around and deals with a lot of aches and pains. Anything you guys recommend to ease that pain ? \n\nThank you !", "Combination targeted therapy provides durable remission for patients with chronic lymphocytic leukemia ", "Ibrutinib Plus CAR T-Cell Therapy Boosts Response in CLL ", "Venetoclax's Role in Relapsed/Refractory CLL ", "Dr. Davids on Selecting Between Continuous and Time-Limited Therapy in CLL ", "Redefining Prognosis for Hematologic Cancers in Older Adults by Age - Highest 1-yr survival rate = adults with CLL: 91.8% in those 75 to 84 yrs &amp; 81.6% in 85 yrs+. Highest 5-yr survival rate = adults with CLL: 76.5% in those 75 to 84 yrs &amp; 55.2% in those 85+ ", "AbbVie Gets FDA Nod for Imbruvica+Rituxan in First-Line CLL ", "Chemotherapy-Free Combo Therapy Approved for Previously Untreated CLL ", "MRD Reported Undetectable After Liso-cel CAR T-cell Therapy in CLL ", "Patient Considerations When Approaching Immunoglobulin Treatment ", "Zanubrutinib More Effective in CLL/SLL When Used Earlier ", "Updated Results on MURANO and ASCEND in CLL ", "Novartis CAR-T likely improves long-term survival and is cost-effective, study finds - MedCity News ", "Fixed-Dose Venetoclax/Obinutuzumab Combo Maintains PFS Benefit at 3 Years Following Treatment Cessation ", "Dr. Shadman on Considerations for BTK inhibitors in CLL ", "Treatment Landscape Is Quickly Evolving for CLL/SLL ", "Duvelisib Effective in Lymphoma Patients Who Failed Arzerra, Trial Finds ", "Expert Reviews CLL Advances Presented at ASH ", "CLL/SLL: Ibrutinib, Venetoclax Therapy May Improve Outcomes in First Line - Cancer Therapy Advisor ", "Ibrutinib/Venetoclax Combination Achieves High Rate of MRD Negativity in Relapsed/Refractory CLL ", "CD19 CAR T-cell immunotherapy plus ibrutinib results in durable responses in R/R CLL ", "Long‐term efficacy of first‐line ibrutinib treatment for chronic lymphocytic leukaemia in patients with TP53 aberrations: a pooled analysis from four clinical trials ", "Long-Term Follow-Up Supports Early Use of Ibrutinib in CLL ", "Axi-Cel Induces Durable Remissions in Relapsed CLL, B-Cell Lymphoma ", "Favorable Safety Profile Demonstrated With Umbralisib in Pretreated CLL ", "MedicalResearch.com | CAPTIVATE Study: Ibrutinib Plus Venetoclax for First-line Treatment of CLL/SLL ", "Introduction of Noncovalent BTK Inhibitors and CAR T Cells Excite CLL Landscape ", "Pushing Toward Time-Limited Options and More Tolerable PI3K Inhibitors in CLL ", "Early venetoclax discontinuation impacts survival in CLL ", "Dr. Lee on Cirmtuzumab/Ibrutinib Dosing in MCL and CLL ", "E1912 trial leads to FDA approval of ibrutinib-rituximab combo for untreated CLL ", "Optical Genome Mapping Offers Potential Tool to Assess Genomic Complexity in CLL ", "Dr. Talley on the CAPTIVATE Trial in CLL ", "Tell me about your experience with IMBRUVICA (ibrutinib) Hi! I am a grad student writing up some research on Imbruvica. We recently posted a survey but I also though this might be a good place to get real world insights. If you are comfortable, please leave a note on what your experience is like. Some things we want to know:   \n1) what is your general experience as a CLL patient?  \n2) what is your general experience with Imbruvica?  \n3) were you offered any other options as an alternative?  \n4) would you consider switching to a drug that you only had to take temporarily?  \n5) what are some common side effects you experience?  \n6) anything else you think we should know? I am 13q del, unmutated, I was diagnosed at age 34 so much younger than the typical cll patient. Before research showed traditional chemo did not give sustained remission, and before ighv testing existed, I did FR in 2012 and 2016 but did not get sustained remission. I was neutropenic and had multiple infections (mostly pneumonia) in 2017. I started ibrutinib in 2018 as well as ivig infusions after my ighv testing showed my mutation status. \n\nI developed a full-body rash a month after starting ibrutinib. My dosage was reduced, the rash subsided, the dosage was reintroduced. Generally I tolerated it quite well although it upset my stomach if taken in the morning (so I took it at night) and I would have random joint and muscle pain which would last 2-3 days which ranged from inconvenient to incredibly painful. \n\nI stopped in 2019 and had a stem cell transplant. I had a complicated medical history so had reduced-intensity conditioning (less chemo). I went back on ibrutinib to suppress my wbcs about 10 months post-transplant I think. After 14 months I stopped taking ibrutinib and started Venetoclax as ibrutinib did not put me in full remission following the transplant. \n\nIn addition to ibrutinib, my medical team considered idelalisib or a stem cell transplant but we tried ibrutinib first. \n\nIbrutinib was not that bad, I would do it again. I have had worse treatments. If your survey is online, if you post it I will share to cll support groups I am part of.", "Sorting Through the Alphabet Soup of Evolving Treatments in CLL ", "Lack of Biomarker Testing in CLL/SLL May Lead to Suboptimal Treatment ", "Venetoclax With Acalabrutinib or Obinutuzumab Evaluated in Treatment-Naive CLL/SLL ", "Combination of AbbVie's venetoclax and Rituxan successful in late-stage leukemia study - AbbVie Inc. (NYSE:ABBV) ", "Brukinsa shows superior efficacy in CLL/SLL compared to Imbruvica ", "got diagnosed with CLL, but I am not so sure it is CLL Please read!! I really need some advice\n\nSo my mom noticed multiple enlarged lymph nodes on her neck, got a biopsy done which showed cancer. Doctors believed it was lymphoma and referred her to a specialist. Now that specialist is saying that it is CLL and she is probably not going to require treatment for several years. But I have read that patients go many years without any symptoms, yet my mom has multiple enlarged lymph nodes in her neck even though her lymphocyte count is only slightly high. A normal person's lymphocyte count is between  0.5-3.3, and hers is 4.6, so not very high, then why are her lymph nodes enlarged. Do you think there is something else going on, why is she already showing symptoms when her lymphocyte count is still not that high? Check out the CLL Society website and get a free second opinion. This is totally in line with my experience. I was diagnosed as I had an enlarged lymphnode under my chin. They did blood work, had slightly elevated WBC, after some other tests and biopsy of the lymphnode it was determined I had CLL. There are different types of CLL, the main 2 are B cell and T cell, with other subsets. I went 3 years before requiring FCR therapy. $ years after treatment my bloodwork is still perfect (knock on wood) What kind of doctor is she seeing that did the diagnosis? If she has not already, she should see a CLL specialist. MD Anderson will also do remote consultantions/second opinion with newly diagnosed patients. \n\nRE her bloodwork: the peripheral blood smear, are there smudge cells? What were the flow cytometry results? Those tests tell you if it is CLL.\n\nMany people with CLL have some one or more enlarged lymph nodes (the size can change on their own as can the number) and stay in watch and wait for years. I know a patient who was diagnosed 18 years ago and is just starting treatment this year. Get her (with you) to a CLL specialist, it will help with all your questions and making decisions and plans for her healthcare. When the CLL shows up in your lymph nodes, it is called SLL. It will not be reflected in your standard blood work, instead she probably had a FISH test or flow cytometry. She should ask for the results of that, as the CLL Society Expert Access second opinion will need the results from that test. \n\nMany patients with CLL are in watch and wait (worry and wait) and do not need treatment. If the lymph nodes in her abdomen get too large and create problems she may need a targeted treatment, not chemo.  I second the opinion to check out CLL Society for more information. I am very sorry to hear about your mother's diagnosis. I completely understand the mental roller coaster your family is going through right now, but rest assured, the future is likely not quite as bleak as the panic-inducing Google binge you have probably already experienced.\n\nI was diagnosed with CLL a bit over three years ago after routine bloodwork revealed a high white blood cell count. A follow-up smear revealed smudge cells and confirmed the CLL diagnosis. After a FISH test, we further discovered that I had an 11q deletion. These markers (11q, 17p, 13p, etc) help determine a CLL patient’s treatment options. The reason I bring up mine is because folks with an 11q deletion tend to show symptoms of their CLL through enlarged lymph nodes rather quickly when compared to patients with other markers. I showed no symptoms until recently, but as predicted my lymph nodes are rapidly growing and for about the last 4 months I have gained what appears to be the neck of a linebacker with nodes the size of fists. This was expected. It is awkward, but not painful. Could be worse!\n\nThere are a few resources mentioned in the comments. I would like to reiterate these as well as emphasize the importance of two things: 1) it is imperative your mother has a CLL *specialist* or *expert* on her care team and 2) it is vital to be your own advocate with this disease. Advancement in novel treatments happens very rapidly; a general oncologist will simply not be able to keep up with the latest CLL treatment options. You need an expert on your team and you need to know how to find the latest developments yourself.\n\nStart with the ( They have great resources and an even better program called ( that will enable your family to get a free second opinion. I got mine from ( My path to treatment will be lead by ( in Houston, TX, who I discovered through the Society.\n\nSeek out a support group near you through the CLL Society. These can be vital in maintaining continued education in the advancement of treatment. You must be your own advocate!\n\nCheck out ( This popular forum has daily active discussions from people all over the world with CLL. It is an incredible spotlight on the latest treatment as well as regular conversations surrounding life with CLL. The form is generally positive and community is extremely supportive. \n\nThere are many articles out there that can paint you into doomsday or doldrums. Proceed with caution as you do your own research. The brunt force of this cancer is truly the psychological impact it lays upon you—particularly in that first year since diagnosis. There will be stages of anger and denial. Heck, when I was diagnosed even my doctor friends were in denial and thought it *must be something else*. Understand that the pace of CLL treatment is so rapid, anything on the internet related to treatment that is older than six months is likely out-dated or irrelevant. \n\nThe future is getting brighter every day. If your mother was just diagnosed, she will likely be in what people refer to as “Watch and Wait” mode for years. Honestly though, fuck that term; it was clearly coined by doctors. I like to call it “Active Observation” or AO for something more positive and less akin to counting down to something terrible. Just observe and stay knowledgeable. There is a good chance your mother’s best treatment option has not even been invented yet—but it will be. Best of luck! Awesome response and great info! See you at a CLL Society support group! Hi!! thank you so much for your reply. She has been seeing an ENT, and he is the one who diagnosed her through a biopsy and a blood test. I am trying to find new doctors for her to see so that she can get a second opinion. Thank you so much for your kind words! And you have given me so much hope. I am going to do all the research I can and advocate for my mother's health. Thank you! she is seeing an ENT. I am trying to find CLL specialists and will be doing my research. This is a recent diagnosis, and she was not only diagnosed with CLL but also thyroid cancer. So we have been dealing with quite a lot. I will for sure take her to a CLL specialist after her thyroidectomy. Thanks for your advice! Did they do a flow cytometry with fish test or cll panel add on?  What were the results?  Specifically the light restriction and the CD markers present on the cell surface?\n\n4.6 is low for CLL. You can see some patients delay treatment and not see symptoms until 150k. \n\nAs far as lymph nodes, unless they are over 10 cm in diameter, it is not a trigger to start treatment for CLL.  How big are they?  Many cll patients live with some clusters of 1-2cm lymph nodes and it does not require treatment. 10 cm is 3.94 inches hi thanks for your reply. She has not had a  flow cytometry with fish test. Frankly, our dr did not use these terms and I am only learning about them just now. I will be looking into that. And yes, the lymph nodes are very small, 1-2 cm. Right now, I am just trying to find a new doctor, the one we go to is an ENT and maybe I should get a second opinion from someone else? 100% the appropriate kind of doctor is a hematologist-oncologist at a cancer center.   \n\nThe ones at satellite offices and hospital attached inpatient cancer centers are good enough for straightforward cases.  The ones at NCCN certified centers are for the hard cases.  A visit to either one will get you more information and a fully differentiated diagnosis.   \n\nThere are a lot of illnesses that look like CLL.  It is a good idea to get to the bottom of it and not wing the diagnosis as close enough.  It is also worth it to get the advice of somebody who treats this illness on a regular basis. &gt;she was not only diagnosed with CLL but also thyroid cancer\n\nAre they sure the thyoid cancer has not metastasized in the lymph nodes? vs it being CLL or SLL? Yes, they are sure that there are two separate cancers. That was my first thought too but they have confirmed that there are two different cancers showing", "TRACON Pharmaceuticals Announces Positive Results from Phase 1 Trial of TRC102 and Fludara® - Overall response rate of 24% seen - CLL Among Diseases in Trial ", "Ublituximab Added to Ibrutinib Demonstrates ORR Benefit for Relapsed/Refractory CLL ", "VIDEO: AstraZeneca executive highlights ‘extensive’ development program for acalabrutinib in CLL ", "Acalabrutinib, venetoclax, and obinutuzumab as frontline treatment for CLL ", "Key Considerations for Individualizing Therapy in CLL ", "Fixed-Duration Regimen More Cost-Effective Than Treat-Until-Progression Therapies in CLL ", "Dr. Hill Discusses Combinations in MCL ", "Drug Regimen Found More Effective Than Chemoimmunotherapy for Patients With CLL ", " ", "Dr. Kambhampati on Challenges in CLL ", "CLL Watch and Wait Patients 'Neglected and Anxious' ", "Dr. Flinn on Toxicities With Venetoclax Plus Obinutuzumab in CLL ", "Elderly CLL: front-line maintenance rituximab improves PFS ", "Humanized CD19 CAR T-Cell Therapy Shows Early Promise as Treatment of Hematologic Malignancies ", "Xconomy: Scripps Research’s Calibr to Test “Switchable” CAR-T in Clinical Trial ", "Single-Agent Ibrutinib Promising in MCL and CLL, Improves Patient Well-Being ", "Zanubrutinib May Be Superior to Ibrutinib in Relapsed/Refractory CLL/SLL ", "Dr. Kahl on the Impact of Venetoclax in Chronic Lymphocytic Leukemia ", "Dr. Barrientos on Treatment Considerations for CLL ", "An Early Look at When CAR-T Therapy Fails Patients With CLL - Cancer Therapy Advisor ", "Dr. Stephens on Early Intervention With Targeted Agents in CLL ", "Ibrutinib for chronic graft-versus-host disease after failure of prior therapy - Full PDF available for Free ", "BTK Inhibitors Provide Extensive Frontline Treatment Options in Treatment-Naïve CLL ", "Paid Study for People Diagnosed with Chronic Lymphocytic Leukemia Paid Study for people diagnosed with \nChronic Lymphocytic Leukemia \nSavvy Cooperative would like to talk to patients and caregivers of those diagnosed with Chronic Lymphocytic Leukemia (CLL), Multiple Myeloma (MM), or Myelofibrosis (MF)\n\nScreener\n\nDetails:\n\nVirtual 1 hour Interview\n\nFrom home\n\nEligibility criteria:\n\nPatient or caregiver\n\nDiagnosed with Chronic Lymphocytic Leukemia (CLL), Multiple Myeloma (MM), and/or Myelofibrosis (MF) in the last 5 years\n\nNOTE: Only patients with verified diagnoses will be considered\n\nEnrolled in the following:\n\nPart D Prescription Drug Plan (PDP) (i.e., traditional Medicare)\n\nMedicare Advantage Prescription Drug Plan (MA-PDP), including Employer Group Waiver Plan (EGWP), non- Low-Income Subsidy (LIS)\n\nReceive:\n\n$110\n\n", "After outcry, drugmakers decide not to triple the price of a cancer pill ", "Safety Analysis of Monotherapy for Patients With Relapsed, Refractory CLL ", "Anticancer compounds for B cell cancer therapy targeting cellular stress response ", "High Rates of Undetectable MRD Following 2 Years of Ibrutinib-Venetoclax in Certain Patients With CLL/SLL - Cancer Therapy Advisor ", "Resistance to Ibrutinib in CLL ", "Drug combo for untreated CLL approved by FDA based on E1912 trial ", "AbbVie Submits New Drug Application to FDA For IMBRUVICA® (ibrutinib) in Combination with Rituximab for Treatment of Previously Untreated, Younger Adults with CLL ", "Dr. Sharman on Unmet Clinical Needs in High-Risk Relapsed/Refractory CLL ", "Dr. Logan Discusses Treatment Options in CLL ", "First-Line Ibrutinib Effective for CLL/SLL Irrespective of Cytogenetic or Mutational Risk Features ", "Venetoclax Retreatment May Yield High Response Rate in CLL ", "Personalis to Profile CLL Patients in Invectys Phase II Drug Trial ", "Dr. Maddocks on Unanswered Questions With BTK Inhibitors in B-Cell Malignancies ", "No Viability in Adding Chemotherapy to Novel Regimens in CLL ", "Targeted Therapies Offer Attractive Treatment Approach for Elderly/Unfit Patients With CLL ", "Dr. Davids on Exciting Data With Acalabrutinib in CLL ", "Dr. Wierda on the Fixed-Duration Cohort Results of CAPTIVATE Trial in CLL ", "Zandelisib Moves Along in Development for B- Cell Malignancies ", "ASH 2020: Results From the Phase 1/2 BRUIN Trial ", "The Role of Early Intervention in the Treatment of Early-Stage CLL - Hematology Advisor ", "Improved Survival Outcomes With Ibrutinib Plus Rituximab in Chronic Lymphocytic Leukemia - Hematology Advisor ", "Study Analyzes Quality of Life Research on Patients With CLL and Their Caregivers ", "Ascentage Pharma Announces Updates on the Clinical Development of APG-2575, including an ORR of 70% in Patients with Relapsed/Refractory Chronic Lymphocytic Leukemia ", "Venclexta Added to Novel Combination Therapy Elicits High Responses in Patients with Relapsed/Refractory Chronic Lymphocytic Leukemia ", "ASH 2017: CAR-T Wallops Blood Cancer ", "Dr. Rai Discusses CLL in Older Populations ", "Ibrutinib/Rituximab Improves Quality of Life as Frontline and Continuous Therapy in CLL ", "Ibrutinib Plus Venetoclax Achieves MRD Undetectability in Patients with CLL ", "Selecting Patients for Treatment With Ibrutinib in CLL ", "Meta-analysis: Acalabrutinib showed better PFS and OS than other frontline CLL therapies ", "Acalabrutinib Meets Primary End Point Versus Ibrutinib in Previously Treated, High-Risk CLL ", "Sequencing Strategies in Frontline CLL ", "Doctors Debate: Is Chemoimmunotherapy or Small Molecule Inhibition Most Optimal for Frontline Treatment of CLL?  This is an interesting discussion. My personal story was I got randomised to FCR Chemo in the FLAIR trial. I had hoped to get ibrutinib plus venetoclax. But to be honest so far FCR has worked for me. In a couple of months it will be two years since I started chemo. I got to MRDU and so far my lymphocyte count is really low. This is despite me being UNmutated in IGHV and loads of people (especially Americans!) telling me chemo definitely would not work for me. It is given me some extra time and one day I will almost certainly relapse and then start my journey with the newer drugs.", "Dr Lindsey Roeker on Using MRD for Decision Making ", "Al-Sawaf Highlights the Benefit of Fixed-Duration Venetoclax/Obinutuzumab in CLL ", "CLL Therapy, Venetoclax/Rituximab, Shows Reduced Risk of Disease Progression ", "Triplet Regimen Leads to Long-Term Efficacy in CLL and Richter Transformation ", "Pharm Exec's 2018 Pipeline Report - Go to pg 2 for CLL ", "Just Keep Livin  You can probably find some of my previous posts when I was first diagnosed at 25 .It has been \\~4 years since my diagnosis. I am a completely different person since then, so I feel like I have some advice to give, as ironic as that may seem. I am married, I have a daughter, doing my thing. But living with CLL takes some compromises, you need to learn to live with them.Let me give some advice that was given to me that I tried really hard to listen to, but did not really understand at the time. Trust me please;\n\n1. You are not defined by this illness. It can be hard to explain a chronic cancer to people. Most everyone think that cancer means you beat it or you are done for. CLL is different. It is a monkey on your back you have at all times, even if you do not realize it. You feel like you have a loaded gun pointed at you, yet everyone thinks that its shooting blanks. If you find solace in community or information, there is no wrong answer. It is different going forward, but different is not \"bad\". Just understand that eventually, it becomes part of your life.\n2. I am part of the CLL study examining genetics. My grandma was diagnosed with CLL when she was 30. I just went to her 90th birthday party. She recently went on Ibrutinib in the last few months, but she spent her entire life without any medication. There are plenty of horror stories, but I believe that more people die from CLL without realizing it than dying from CLL. Actually, David Spivak Idk stats on people directly dying from CLL, I believe its more from other stuff in consequence to CLL, but whatever.\n3. Please go to a specialist. A general oncologist or the debate between whether CLL is a blood cancer or a leukemia is irrelevant. Get on a limited time trial clinical trial. Do not submit to chemo, or being on Ibrutinib for the rest of your life. Combos are doing wonders, I am MRD- after two years of Ibrutinib and Venetoclax in combo. That leads into my next point...\n4. Do your research. I do not know about anyone else, but I felt empowered in such a scary time in my life by learning as much as I could about my disease. It helps immensely, at least from my experience, to learn about how the disease operates, risks, new trials, etc.\n5. The best piece of advice I can give; How heavy is a glass of water? A normal glass of water. An ounce? What if you hold it for 2 minutes? What if you hold it for an hour? What if you hold it for 12 hours? Trust me, CLL is not worth holding onto more than 5 minutes at a time. Go and do your shit. CLL will not make or know the difference at all.\n\nCheers.", "Noncovalent BTK Inhibitors, CAR T-Cell Therapy Generate Excitement in CLL ", "Venetoclax-Based Regimens Best CIT in Fit Patients With Chronic Lymphocytic Leukemia ", "Dr. Davids Discusses Duvelisib Plus FCR in Young Patients With CLL ", "ASH successes set to lift Imbruvica in CLL ", "Recognizing Secondary Malignancies in CLL ", "clonoSEQ Assay Medicare Coverage Expanded to Include MRD in CLL ", "FDA Approves Rituxan Biosimilar to Treat Blood Cancers   \n\nIn 2019, Ivosidenib (TIBSOVO) developed by Agios Pharmaceuticals, Inc. was approved by the FDA for the treatment of AML in older patients with a susceptible IDH1 mutation who have comorbidities that preclude the use of intensive induction chemotherapy.\n\nRead complete report @ (", "Emerging Agents Lead to Extended Survival, Reduced Toxicity in CLL ", "Crossover Study Offers Additional Line of Therapy for Patients with Relapsed CLL/SLL ", "Safety of Venetoclax and Ibrutinib in CLL ", "BRIEF-Novartis Plans To Deliver Kymriah From New Swiss Facility By 2020 ", "NHS to fund Europe’s first CAR-T childhood cancer treatment | Verdict ", "Cirmtuzumab Plus Ibrutinib Shows Activity and Tolerability in MCL and CLL ", "Acalabrutinib Plus Venetoclax and Obinutuzumab or Rituximab in Patients with Treatment-Naïve or Relapsed CLL ", "Identification of key miRNA‑gene pairs in CLL through integrated analysis of mRNA and miRNA microarray - Download PDF on Right ", "﻿Epigenome Map of Cell May Help Show Cancer Evolution &amp; Drug Resistance | What is Epigenetics? ", "Umbralisib Plus Ublituximab Improves PFS in Frontline and Relapsed/Refractory CLL ", "mask question I was recently diagnosed with CLL. Is there a covid recommendation for mask wearing given that I am fully vaccinated? Thanks I am fully vaccinated and still wear mask most of the time.  I am just a bit worried about the variant. My doctor suggested that I keep masking and following the covid protocols, distancing and hand washing as well. When you start whatever treatments you will be doing ask your medical team for specifics. But until then, better safe than sorry. My dad has CLL and is vaccinated. Both his PCP and oncologist have told him to keep wearing his mask. His oncologist mentioned recent studies that have come out showing the vaccine might not be as effective for those with CLL. He is testing him for antibodies this week If you want the short answer, the vaccines are basically ineffective for people with CLL. There is a slight chance for t-cell immunity, but no great way to test for it. Few are showing antibodies and those that do likely do not have enough for protection. \n\nMask up, distance, and party like it is 2020 for another year. We are relying on heard immunity to have a life. I had my antibody test two weeks ago. The result showed no detectable antibodies. The research I found online said that people who were treated with Venclexta, as I was, are getting no benefit from the vaccine. I received the Pfizer vaccine. Is the antibody test to see if he was exposed to Covid-19 yet asymptomatic, or to see general immune strength, or what? What a completely false statement. It depends where you are at- what stage, treatment started or wait and watch, etc. I am stage 0 and still have a pretty good immune system the vax totally is helping me against covid. You have to keep in mind that we do not fully know what the antibody test means as far as protection. It is a best guess. There could be another level of protection that we do not know about (T cells, etc). But being careful and acting as though you do not have protection is a smart idea given all of the unknowns. In practice, I have heard remarks that they are not seeing huge levels of those with blood malignancies in the hospital. That tells me something we are doing is probably working. Maybe it is the caution,maybe it is the vaccine, maybe it is both. I think for us, the most vital thing is that those close to us, like family, are vaccinated to protect us more. Stay well! But please do get outside and enjoy life. I am trying to remind myself of that as much as I can. They are not entirely wrong. Study showed stage 0 vs other stages were just as at risk. It was one of the big surprises of the study done in Pittsburgh. You probably have protection of some sort but we do not know. But I agree, their statement is a little over the top doom and gloom. It looks like vaccines do not work well for us, even those of us who have never been treated, like me. FFP3 masks are now recommended to protect the wearer against Covid. It is to gage antibodies produced after the vaccine. Did you get the antibodies test through LLS? To see the immune strength thx Thanks for your entirely thoughtful, helpful and useful reply. I appreciate it so much.\n\nIt is really scary feeling so vulnerable to this virus, especially since I also just found out that a recent CT scan reveals something is wrong with my lungs. I will find out what it is on Thursday when I have my first ever appointment with a pulmnologist. \n\nI live alone which is good and bad. Good because I am safe but bad because I am very isolated. Thank God I have a terrific dog to keep me company. And we both enjoy going on really long walks together. I wish you well and uneventful news. Uneventful news would be a relief for sure. Thank you. It went without saying that I wish you well, too. Hey there, how old were you when diagnosed with CLL? Sixty. How come? That is specifically why I said “the short answer.” Yes, there are dependencies. Yes, it varies for everyone. Also, we _don’t_ know if we have great protection and there is _no_ definitive test. So, the short answer is protect yourself and act as if you have not been vaccinated. \n\nCurious, how do you know the vax is “totally helping you against covid”? Have you gotten covid?", "CMS weighing National Coverage Decision for CAR-T ", "Calquence Shows Favorable Long-Term Outcomes in Treatment-Naive Chronic Lymphocytic Leukemia ", "SARS-CoV-2 vaccination in rituximab-treated patients: B cells promote humoral immune responses in the presence of T-cell-mediated immunity ", "Blood Cancer Survivors Should Not Rely on COVID-19 Antibody Tests to Determine Immunity ", "Pretreatment With Ibrutinib Reduced Obinutuzumab-Induced Cytokine Secretion and Infusion-Related Reactions in CLL/SLL ", "Results of GO-CLLEAR Study in Patients With Chronic Lymphocytic Leukemia - Hematology Advisor ", "Fixed Duration Ibrutinib-Venetoclax for CLL Resulted in High Rate of Undetectable MRD - Cancer Therapy Advisor ", "ALPINE and ELEVATE-RR Trials ", "Adding to the Regimen: NCCN Updates in Leukemia and Lymphoma ", "Comorbidities predict poor prognosis with ibrutinib for chronic lymphocytic leukemia ", "The Effects of PFS, Toxicity Risks on Choosing Novel Agents in CLL - Docwire News ", "Meh I guess ", "Ibrutinib/Venetoclax Combo Demonstrates Durable Remission in CLL ", "CLL/SLL Patients Had Higher Progression-free Survival With Imbruvica, Study Says. ", "MRD-Guided Treatment Represents the Future in CLL ", "TG Therapeutics completes FDA filing for Roche challenger in CLL - ", "New tool could help researchers design better cancer vaccines ", "Dr. Lamanna Discusses the MURANO Trial in CLL ", "Real-World Study Shows Limited Implementation of Reccomended Biomarker Testing in CLL  I was denied IGHV and NGS by my hematologist-oncologist pre-treatment.  I went to another location to see if I could get it along with a second opinion and all they added was a hypersomatic mutation test that failed to gather results.  \n\nAt that point I got a case worker for the insurance company.  \n\nTheir advice was to go pay out of pocket at a different health system in the next state over if nobody was willing to do it at the it integrated delivery and financial system I was limited to via the insurance plan.   \n\nI tried showing everybody I could talk to the iwcll 2018.5 guidelines.  I tried the cllsociety \"test before treat\" handouts.  They acted like I was a WebMD fool.  \n\nOne physician stated that they are going to be undeterred from the treatmeny plan (R monotherapy) regardless of whatever the test would find and incorrectly claimed that igvh mutational status changes and it would need to be retested before the next treatment choice anyways.  \n\nThere needs to be some more effective patient advocacy materials that works on this topic.", "Experts Outline Best Practices in the Treatment of Chronic Lymphocytic Leukemia ", "Dr. Erba on Selecting Between Ibrutinib and Acalabrutinib in CLL ", "CD19 CAR NK cell therapy clinical trial shows encouraging results for hematologic cancers ", "Four-Factor CLL Prognostic Score Deemed Clinically Useful for Risk Classification - Cancer Therapy Advisor  ", "CAR T cell therapy: On the cusp of 'an immunotherapy revolution'? ", "Dr. Mato on the CLL14 Trial Results in CLL ", "Tumor Lysis Syndrome in Venetoclax-Treated CLL in Clinical Trial, Real-World Patients ", "CAPTIVATE: Ibrutinib plus venetoclax show stunning efficacy in CLL ", "Addressing Physical and Emotional Fatigue in CLL ", "Transplant Status May Affect CAR-T Therapy Outcomes in CLL ", "Doctors Are Worried About Covid-19 Vaccine's Efficacy in Cancer Patients, Other Immunocompromised People ", "Where U2 Will Fit in CLL Treatment Landscape? — Episode two ", "Genetic Prognostic Factors in CLL Treated With Novel Compounds - Cancer Therapy Advisor ", "Choosing the Best Therapy for Patients with Chronic Lymphocytic Leukemia ", "Splicing Molecule Delays Leukemic Infiltration in CLL, Has Targeted Therapy Potential ", "Real-World Data and CAR T Therapy ", "Impact of Targeted Therapy in CLL (Video 1 of 11) ", "Efficacy of the BNT162b2 mRNA COVID-19 Vaccine in Patients with Chronic Lymphocytic Leukemia | Blood ", "Diagnosis and Staging of Chronic Lymphocytic Leukemia (CLL) ", "Clinical trials on CAR-T cell therapies surge in two years ", "Patients With CLL With High Cancer-Specific Stress May Benefit From Psychological Intervention ", "EHA 2019: Introduction of a new fixed-duration targeted therapy with venetoclax plus obinutuzumab in previously untreated patients with chronic lymphocytic leukaemia and coexisting comorbidities. ecancer ", "Third Full Dose of COVID-19 Vaccine Increases Antibody Response in Patients with Blood Cancers ", "ASH 2017: Highlights on Chronic Lymphocytic Leukemia ", "Survival Benefits, Established Safety Profile of Single-agent Ibrutinib for CLL Reinforced in Long-term Phase 3 Study ", "Acalabrutinib with or without obinutuzumab vs chlorambucil and obinutuzmab for treatment-naive chronic lymphocytic leukaemia (ELEVATE TN): A randomised, controlled, phase 3 trial ", "PLOS Papers on Y-Chromosome Sequencing, Blood Methylation Markers, CLL Mutations ", "Dr. Mato on Utilizing CAR T Cells in CLL ", "Dr. Eradat on the Unmet Needs in CLL ", "Novel Agents for Treating Older Patients With CLL ", "Venetoclax Promising in the Treatment of CLL ", "Frontline Venetoclax/Obinutuzumab Combo Emerges as Treatment Option for CLL With CKT  My mom will be starting this combo as soon as her port is put in and her prescription arrives. I am incredibly thankful that her diagnosis came when it did so that she can be treated with this combo, especially considering she has the TP53 gene deletion. Thanks for sharing.  If you are comfortable please feel free to keep us up to date with the process, I know it helps people to hear real world experiences.", "Universal 'One-Size-Fits-All' Cancer Treatment ", "Anti-CD20 Antibody Improved Response to Ibrutinib in High-Risk R/R CLL - Cancer Therapy Advisor ", "BTK Combos seek to raise the bar in CLL Treatment Paradigm ", "CLL Patients Willing to Trade Some Drug Efficacy for Reduced Side Effects | Cancer Network ", "Acalabrutinib Approved in Europe for Chronic Lymphocytic Leukemia ", "ELEVATE-TN Shows Acalabrutinib Is Well-Tolerated in CLL ", "Deluge incoming - every year holidays cause a backlog Happy holidays.  Sorry for so much at once.", "Case study shows CLL may mask COVID-19 infection ", "Ibrutinib for CLL Tied to Higher Heart Risks vs Chemotherapy ", "FDA Approves Rituximab Biosimilar for NHL and CLL ", "Depleting White Blood Cells Improves Response to CAR T-cell Therapy ", "Venetoclax-Based Combos Demonstrate High Rates of uMRD in Frontline CLL ", "Educational theme: chimeric antigen receptor (CAR) T-cell therapies in DLBCL and CLL ", "Twists and Turns from 'Tumor in Tumor' Profiling: Surveillance of CLL leads to detection of a lung adenocarcinoma, whose genomic characterization alters the original hematologic diagnosis ", "Rituximab Biosimilar Approved by FDA for CD20+ B-Cell NHL and CLL ", "Long-Term Follow-Up of BTK Inhibitor in Symptomatic Treatment-Naïve CLL ", "An Investigator's Perspective on the Chronic Lymphocytic Leukemia Research Front ", "After signs that cancer patients could take less of an expensive drug, its maker tripled the price ", "Ibrutinib Plus Venetoclax for First-line Treatment of Chronic Lymphocytic Leukemia ", "New Australian drug puts cancer cells permanently to 'sleep' (Not CLL Specific) ", "Chemoimmunotherapy With Reduced Chemotherapy Exposure in CLL With Mutated IGHV and Without del(17p)/TP53 Mutation - Cancer Therapy Advisor ", "Duvelisib Granted Priority Review for CLL ", "Dr. Brander on the Treatment of Relapsed/Refractory CLL ", "Leukapheresis is a procedure used to treat chronic lymphocytic leukemia (CLL) or patients with very high white blood cell counts - Times Tech Pharma ", "Risk of Breakthrough COVID-19 Infection May Be High in Population With Hematologic Malignancies ", "Positive opinion for venetoclax + obinutuzumab in previously untreated CLL - Hospital Healthcare Europe ", "Dr. Cheah on the Safety Profile of TG-1701 With and Without Ublituximab/Umbralisib in CLL ", "Umbralisib Shows Promise in Relapsed/Refractory CLL ", "Using Patient-Specific Factors to Guide Treatment Decisions in CLL ", "Patients receiving FDA-approved CAR-T therapies face potentially prohibitive co-payments - Gilead Sciences, Inc. (NASDAQ:GILD) ", "Pharma giants are scrambling to be part of cancer cell therapy revolution - Verdict ", "Acalabrutinib Shows Promise for Frontline CLL Treatment ", "Chemo-Free Combo Boosts PFS in First-Line CLL ", "Acalabrutinib Shows Significant Survival Benefit in Patients With Chronic Lymphocytic Leukemia ", "Dr. Wierda on Novel Therapies in Relapsed/Refractory CLL ", "Novel CLL Regimens Show Promising Efficacy ", "Dr. Alkharabsheh on Emerging Treatment Options in CLL ", "Venetoclax Effective in Ibrutinib-Failed Chronic Lymphocytic Leukemia ", "ASH: Gilead, Novartis tout long-term data for CAR-T slow starters Yescarta, Kymriah ", "Upfront Low-Dose Chemo-Immunotherapy Safe, Effective for Elderly With CLL - Cancer Therapy Advisor ", "Genomic Profiling in Chronic Lymphocytic Leukemia ", "Resistance to Venetoclax in CLL ", "Obinutuzumab plus venetoclax shows promise for chronic lymphocytic leukemia ", "Cause of Death Varies by Risk Group in Chronic Lymphocytic Leukemia ", "Father diagnosed last week - Stage 4 CLL Hello! I am grateful to have found this sub. My 65 year old father went to his doctor last week after feeling short of breath for a while, and ended up being very unexpectedly diagnosed with stage 4 CLL.  His doctors have not given a prognosis, as they need to see how he responds to treatment. We are so scared and full of anxiety. I am going through all the posts here to try to find resources as well as personal experiences. I am also worried about Covid. He is vaccinated, but from my brief readings so far, we likely need to continue being extra extra cautious? My mother has a very different type of cancer, so Leukemia is new to me. Sorry if I sound stupid, we are just so lost and stressed. Any advice or general information would be so appreciated. Advice is staging not comparable to staging in solid tumors at all. Stage IV lung cancer, breast, etc worrisome. You can be stage 4 CLL at one blood test and 3 months later stage 1 because of variation in platelet counts. With the current palette of drugs it is similar to high blood pressure for many people. Make sure your dad gets treatment at a good medical center.  If it means driving two or three hours away, it is worth it.  Secondly, there are good meds for leukemia now.  Since he is stage four, it might not be easy for him.  They have to kill the cancer and then get his levels back to normal.  However, it is doable.  I fully expected to die, yet here I sit.  And the meds are getting better.  Smarter.  Instead of a med killing everything in the body, some of them target the cancer directly.  It is a wonder.\n\nIn terms of eating, I consider that very important to survival.  During treatment there may be cravings for food, so let him eat what his body is telling him, or a good healthy version of it.  Mouth sores can be an issue.  If they get too bad, there are products that can completely numb the inside of the mouth and throat and will allow him to eat.  Tell him to eat as much as he can while his mouth is numb.  If he gets treatment in hospital, it is important to drink a lot of fluids.  I used to take a bottle of organic lemonade with me - I would add a little to my water to make flavor and I would drink a lot.\n\nWhen battling cancer, it is a bunch of little things that adds up to getting through it. You do not sound stupid. You are wonderful for being eager and I wish the very best for you and your family. I am still in the very early stages of learning. I hope the response to treatment brings everyone some comfort. Hang in there. Hello,\n\nI have CLL as well and first order of advice is despite how hard it is, *DONT Panic.* Second thing, dont consult Dr. Google! Please go here ( and join the cll group. You will find the best and most current information about latest treatments and the best support group anywhere. Next thing to do is go here ( and find a cll specialist in your area. In my opinion, having a cll specialist is paramount. Cll is a very slow growing disease and you will not be forced to make decisions immediately. These days cll is a very treatable disease. I wish you and your father well! Nothing stupid here.   Stay calm.  Ive been stage 2 for 4 yrs now.  Still in a watch and see mode.  Though i have not started any treatment as yet, my talks with my oncologist on the progression of treatments is very positive.  CLL is not a death sentence.  Dr has patients diagnosed 10 yrs ago and have seen omly a slight progression.  Keep the faith.  Stay off the internet  !!!!! Head over to healthunlocked.com and find the CLL support forum. It is not like other cancers and often is just monitored having been routinely picked up during routine blood tests. Personally I have not been staged (UK) but as others have said it is not like other cancers and people can carry it for years and not need treatment (I hope to do that). It is possible that your father will need treatment but this is something which often leads to regression for a time. I have learned recently, sadly, that my immune system is not fully functional. That unfortunately means the vaccines MAY not be so effective in CLL patients as the general population and also, indeed a common cause of death, is an inability to fight off an infection, be that from a cut or covid. Things will stabalise as you learn where your father is at physiologically, this is a chronic long term condition and not to be mistaken for acute forms of leukaemia (sorry UK here so I spell it right 🤭) which are much more concerning. Consider an antibody test, it is likely covid is the biggest risk to your father in the short term and it would be good to know he had antibodies following his vaccination. Do not be surprised to find none though. Best of luck. Advice: get multiple opinions if that is an option in your situation.  Dr.s are human and only know what they know.  Talk to a couple or more if you can.  \n\nAlso, after you are done worrying, try to stop worrying.  This is a manageable disease and there is never been more options for treatment.  Comparing treatment for CLL from even five years ago is like night and day compared to today's options.  I have talked to Dr.s in the field and they are excited to have so many arrows in the quiver.  They are just figuring out which combos work best in which situations. \n\nLastly, wear sunscreen.  Seriously. Thank you so much for this info, I was not yet able to find anything very clear about how staging works. This is really helpful and gives me a different perspective. I am trying to get them to go to a better hospital in the city, but they have crappy insurance and are already worrying about costs of treatment  :(   I 100% agree though. In my experience, no matter how much a local hospital acts like they can handle these serious and complex diseases, they in no way compare to the bigger hospitals in the city.\n\nThank you so much for the tips, I have added them to my notes. And I hope you are  doing well! Thank you, your kindness truly means so much. You and everyone else here have been so understanding and helpful and are really helping my mental state. I just made an account on healthunlocked thanks to you guys.\n\nThank you for the information, incredibly helpful! I am surprised his doctors have not mentioned any potential Covid issues at all. I am going to have him add covid/antibody testing to his ever-growing list of topics to discuss.\n\nAnd I am so sorry, but leukaemia just looks so troublesome to my small American brain 🙃 Thanks again and I hope you are doing well! Ideally he will bring back a result which is positive for antibodies. Its very possible he will not though, or they will be low. You will then discover that the immune system is not so well understood, especially when it malfunctions. It is thought the t cell response may perform a protective function in CLL patients more so than regular folks. Perhaps the body is adapting to handle its weakness, but it is unknown. There certainly have been many CLLers that have got covid and survived, some with not a particularly rough time but it is still best avoided, but that goes for us all.\nYour father is 65 so can still have a good life ahead of him. Life is for living but just be cautious. Avoid crowds, go to shops at off peak times and mitigate risks where he can. Treatment is often necessary to manage the symptoms and it seems he has a few but consider carrying them as some treatments can further weaken the immune system. Your Dr will know all this of course, or should. Good luck. Doing okay.  Chemo changes your life but for the most part, I feel pretty okay now.  And I am alive, and maybe I will see my kids have kids someday, which would be nice.  I can honestly say I have quality of life.\n\nOh.  I forgot one thing - chemo can cause clinical depression, so be aware that if your parent is feeling terrible and they just feel like they want to die, that is the chemo talking.  Messes with the head, but it is manageable once you realize how it works.  Good nutrition offsets it some but chemo is a real hammer of a medicine. I am glad to hear you are doing ok! I get so bugged out over this stuff and how unfair it often is to so many people\n\nAnyways, thank you for the depression info. He actually has had serious depression issues in the past. Honestly until this diagnosis, I have never heard him talking about wanting to live so badly. He wants at least 10 more years, which is opposite of what he was feeling just a few years ago. Once treatment starts, I will definitely pay close attention to his mental state I just signed up for healthunlocked. I have never heard of this website, so thank you!\n\nThe site with specialists is so helpful. I agree, a specialist is often invaluable. Unfortunately they are really worried about money and I do not think I can convince him to leave his local hospital at this point. I am going to keep trying. Hoping he listens to me eventually, depending on how the next few months go.\n\nThank you for the resources and well wishes. It truly means so much. I am so glad to hear you are doing alright!  And I know you are right, but it is so very hard to stay off the internet lol.  I am mostly trying to connect with actual people with real experiences rather than googling statistics.  But... I am still doing too much googling lol.\n\nThank you a ton for the advice and well wishes! He is super stubborn and worried about cost, so I cannot get him to seek much outside of his local hospital at the moment. If things do not go well over the next few months, I am hoping he will reconsider.\n\nThank you, I really am trying not to worry too much. I know every person's case is different. I do tend to lean more towards realism/pessimistism because I just cannot take trying so hard to be optimistic, only to be devastated....   I am honestly feeling a lot better already thanks to you and everyone else who took the time to comment and give advice. Thank you again Quitting the internet is difficult,  but you will have your head spinning with all the \"information\" available.  Not to mention the anxiety you will give yourself.   Speak to your oncologist about sites you can research the disease.   There are reputable sites.  Understanding the disease with correct information will help you stay calm and educated. Okay, very good. One more thing I thought of in favor of a larger treatment facility: everything is in house.  When they test your blood, the results come back in an hour.  When you need a CT or PET scan, it is at the hospital in the facility.  Bone marrow transplant?  There.  And it is just one bill.  At the small places, they cannot do it all so they might ship off the blood draw, and it will take time to get it back.  They may have different places to send a person to, to get procedures done, and all of those places might send a bill.  Which means different bills from different places and you cannot combine them.\n\nAnyway, I know it is a lot.  I do know this.  At first I was terrified but my husband suggested the big place because we knew what our chances were locally.  It made a huge difference. \"These days cll is a very treatable disease.\" Is that really true? My mother has been diagnosed with it (based on smear test so far) and I have been very sad because google says there is no way to cure it. Any help and information would be really appreciated because we are very lost! Rule #1: DO NOT CONSULT DR. GOOGLE\n\nRule #2: Get a CLL specialist. cll specialists can be found at the cll society webpage at (\n\nRule#3: Sign up and join the **cll group** at ( There is not a better support group on the web. You will find the best information here.\n\nRule #4: Take a deep breath.\n\nI wish you and Mother all the best! I know you are not asking me, but I believe krell is very correct about not looking too deeply into whatever you find on Google. My mother was diagnosed with a much different, very rare cancer a few years ago, and internet searches and her first doctor (who was not a specialist) basically told me there was not much hope. I eventually learned there are so many different factors that need to be considered for each person's specific case, and a specialist makes SO much difference. My mother turned out to have one of the \"better\" pathologies and after intense surgeries and treatment by a highly-regarded specialist, she is considered NED (No Evidence of Disease) for now. We need to mostly pay attention to their specific test results and specialist opinions, though I know how hard that is.\n\nTruly wishing the best for your mother and your family Thank you so much for your continued advice, it really means the world to me. I have copied and pasted all of your comments into my erratic list of notes. Your advice is exactly what I was hoping to find, and I am truly grateful to you for taking the time to help me. \n\nYour earlier comment about expecting to die really made me feel 😩  I know I cannot even comprehend all the feelings you must have felt. So, so glad you are doing alright now. I really need to convince him to see a specialist. Thank you for using your experiences to help other clueless people like me 💗 I am really concerned about Covid for him, especially since the new variant seems to be growing in our area. Unfortunately I come from a family that largely thinks Covid is a political issue, and one of our close family members is convinced that the vaccine caused his CLL diagnosis. So I am super thankful for the advice from someone that actually has this disorder. You are welcome.  I mean, I made it through to the other side here, so the least I can do is hold out a hand to help someone cross the turbulent river.  It is rough, but it is, thanks to new technology in medicine, quite doable.  I mean that the odds are a lot more in the patient's favor as opposed to even ten years ago.", "Expert Shares Insights on CLL Treatment Paradigm ", "Ibrutinib plus venetoclax safely induces remission in relapsed, refractory chronic lymphocytic leukemia ", "Dr. Kay Discusses the Role of Ibrutinib in CLL ", "{()} ‘Gift Of Life’ Bone Marrow Donor Meets Man He Saved ", "First-Line Ibrutinib-Based Rx More Effective, Less Toxic Than Standard for Younger CLL Patients ", "Venetoclax With Rituximab Improves Survival in Relapsed/Refractory CLL ", "Efficacy and safety of lisocabtagene maraleucel in patients with NHL and CLL/SLL - update from the ASH 2019 annual meeting ", "Approval Sought for Ibrutinib, Venetoclax Combination Therapy in Patients With Chronic Lymphocytic Leukemia ", "Frontline Ibrutinib Sustains OS Benefit in Chronic Lymphocytic Leukemia ", "Second-Generation BTK Inhibitors Hit the Treatment Bullseye With Fewer Off-Target Effects ", "Vanderbilt Research Survey: Understanding fertility and sexual health care needs after CLL Our team at the Vanderbilt-Ingram Cancer Center is working to improve reproductive health care needs for individuals younger than age 50 at cancer diagnosis.\n\n**If you were diagnosed with cancer between ages 18 and 49, please share your experiences in a** **confidential**, 30-minute online survey to help us learn more about how cancer and its treatments may impact reproductive health, here: (\n\nWith the Reproductive Health After Cancer Diagnosis and Treatment (REACT) Study, we hope to gather valuable information from individuals like you that will help us to better understand the highest needs and concerns are related to reproductive health—specifically for individuals diagnosed with a cancer before age 50.\n\n", "Part 2: Venetoclax and PI3K Inhibition for Relapsed/Refractory CLL ", "TP53 and Deletion 17p as Prognostic Factors in CLL ", "Long-Term Follow-Up Shows BTK Inhibitor Produces Deep, Durable Responses in CLL ", "FDA Grants Orphan Drug Designation to Cirmtuzumab in MCL and CLL ", "In Hotel Room With Hot Sarah Bella ", "Any suggestions from my CLL buddies about dealing with severe allergies?  I do not have any easy answers.\n\nI have Cll, and allergy has been awful this year.\n\nMy doctor told me to take zyrtec and flucticasone.\n\nIt helps, but I still feel like duct taping a kleenex box on my face.\n\nI wish you the best finding a good solution. I feel your pain. Allergies are awful this year. Mine has lead to sinus infection 😩. The worst was weed whacking. I do not have a huge yard but it is amazing how much dead weed allergen spewing junk you can accumulate.\n\nHas to be done here for fire prevention.", "Time-Limited Triplet Emerges as a Potential Standard in Relapsed/Refractory CLL (Umbralisib, Ublituximab, and Venetoclax) ", "Positive Results From SEQUOIA Analyses for Zanubrutinib in Treatment-Naive CLL and SLL ", "Lindsey Roeker, MD, Discusses Rationale for Investigating an Ibrutinib-Containing Triplet in CLL ", "Cirmtuzumab Plus Ibrutinib Had Overall Response Rates in MCL and CLL ", "Venetoclax Plus Rituximab Outperforms Standard Bendamustine Plus Rituximab in CLL ", "Dr. Radich on Impact of MRD in Acute Vs Chronic Leukemias ", "Acalabrutinib Approval Leads Frontline Advances in CLL ", "Gene expression patterns identify high-risk chronic lymphocytic leukemia ", "Novel Mutations Contribute to Disease Progression in CLL ", "More Specific BTK Inhibitor Shows High Relative Rates of Response in CLL ", "Novartis withdraws patent for costly disease medication in Historic decision ", "Dr. Kahl on Ibrutinib in CLL ", "Expanding the Utility of Novel Combination Regimens in CLL ", "long term results of ibrutinib use in CLL patients efficacy and safety ", "For CLL/SLL, Janssen Seeks FDA Approval of Imbruvica-rituximab ", "Venetoclax Improves Outcomes vs Bendamustine in Chronic Lymphocytic Leukemia ", "Ongoing Phase III Trial Evaluates Treatment Discontinuation Methods in Treatment-Naive CLL ", "CLL Prognosis, Survival Rates, Outlook, and Coping ", "ASH: AstraZeneca's Calquence posts sky-high survival numbers in previously untreated CLL ", "Dr. Barrientos on Remaining Challenges in CLL ", "Use of MRD Status Following Obinutuzumab/Ibrutinib to Guide Subsequent Therapy Selection in CLL ", "Stress linked to more advanced disease in some leukemia patients ", "Acalabrutinib Is Viable Option for Ibrutinib-Intolerant Relapsed/Refractory CLL ", "Chemotherapy-Free Regimen Consisting of 3 Novel Agents for Previously Untreated, Poor Prognosis CLL - Cancer Therapy Advisor ", "Concerning Mortality Increase Seen With Venetoclax/Bortezomib Combo in Phase III Trial ", "Novel Combinations Making Their Way to Frontline Setting in CLL ", "I am immunocompromised. Will the COVID-19 vaccine protect me? ", "Dr. Woyach on 3-Year Follow-Up of Acalabrutinib/Obinutuzumab Combo in CLL ", "Current Standing and Future Directions of CAR T Therapy for Chronic Lymphocytic Leukemia - Hematology Advisor ", "COVID-19 vaccination appears less effective among patients with active leukemia, myeloma ", "AID overexpression leads to aggressive murine CLL and nonimmunoglobulin mutations that mirror human neoplasms | Blood ", "MorphoSys eyes 2020 launch for lymphoma CAR-T challenger ", "Patients With CLL Had Improved Quality of Life on Imbruvica Plus Rituxan ", "Evolution of CLL Testing and Treatment in the Past Decade ", "Acalabrutinib Shows Promising Results for the Treatment of CLL ", "Understanding Factors That Influence Treatment Decision-Making in Patients With CLL ", "Revolutionizing the Management of Chronic Lymphocytic Leukemia (Video 1 of 12) ", "How COVID-19 is Impacting Patients with Chronic Lymphocytic Leukemia ", "Preclinical Studies of First-in-Class Pan-FLT3/Pan-BTK Inhibitor CG-806 Show Promise for CLL ", "Risk Assessment in Tumor Lysis Syndrome ", "Part 1: Sandoval Sus Discusses Recommended Treatments for a Patient With CLL ", "Exploring the Utility of a Next-Generation BTK Inhibitor for the Treatment of Patients With Chronic Lymphocytic Leukemia ", "Checkpoint Blockade in Melanoma Patients With Underlying CLL ", "Progression on Frontline Ibrutinib in CLL ", "Zanubrutinib outperforms ibrutinib in advanced CLL, small lymphocytic lymphoma ", "Chronic Lymphocytic Leukemia: 5 Things to Know ", "Verastem's Lymphoma Drug Duvelisib Shows Significant Results in Trial ", "Acalabrutinib Monotherapy Improves PFS in Relapsed/Refractory CLL Over Standard of Care Combos ", "Dr. Woyach on the Role of Acalabrutinib in CLL ", "FDA lifts partial clinical hold on AbbVie’s trial of venetoclax ", "Dr. Roback on Subsequent Treatment Following Ibrutinib Discontinuation in CLL ", "Details of Different Therapies and Modalities Decide Treatment of CLL in the Second Line ", "Success of Venetoclax and Obinutuzumab Use in Patients with CLL ", "Dr. Davids on Results of Obinutuzumab With Ibrutinib in CLL ", "The Untold Story of the Longest Persisting CAR-T Cells in CLL - Cancer Therapy Advisor ", "Paid Study for People Diagnosed with Chronic Lymphocytic Leukemia who are on Medicare Paid Study for people diagnosed with Chronic Lymphocytic Leukemia \n\nSavvy Cooperative would like to talk to patients and caregivers of those diagnosed with Chronic Lymphocytic Leukemia (CLL), Multiple Myeloma (MM), or Myelofibrosis (MF)\n\nScreener\n\nDetails:\n\nVirtual 1 hour Interview\n\nFrom home\n\nEligibility criteria:\n\nPatient or caregiver\n\nDiagnosed with Chronic Lymphocytic Leukemia (CLL), Multiple Myeloma (MM), and/or Myelofibrosis (MF) in the last 5 years\n\nNOTE: Only patients with verified diagnoses will be considered\n\nEnrolled in the following:\n\nPart D Prescription Drug Plan (PDP) (i.e., traditional Medicare)\n\nMedicare Advantage Prescription Drug Plan (MA-PDP), including Employer Group Waiver Plan (EGWP), non- Low-Income Subsidy (LIS)\n\nReceive:\n\n$110\n\n", "AstraZeneca Calquence Gets FDA's Breakthrough Status for CLL ", "Ongoing CLL Trials Most Likely to Change Clinical Practice ", "Assessing Adverse Events From BOVen Therapy in Patients With Previously Untreated CLL ", "Updated results from the phase 3 HELIOS study of ibrutinib, bendamustine, and rituximab in relapsed CLL ", "cfDNA-Based MRD Assay Is Feasible for Use in Relapsed/Refractory CLL ", "Acalabrutinib Shows More Promise in High-Risk CLL | Cancer Network ", "Circulating Tumor DNA May Predict Outcomes of CAR T-Cell Therapy in Large B-Cell Lymphoma - Cancer Therapy Advisor ", "NHS England strikes deal with Novartis on Kymriah ", "Diverging from US, Canada Approves Biosimilar Rituximab in Both Oncology and Rheumatology Indications ", "Frontline Eprenetapopt Plus Venetoclax/Azacitidine Elicits CR Rate of 37% in TP53-Mutated AML ", "Mounting Data for Small Molecule Therapies in CLL Push Chemoimmunotherapy Further From the Frontline ", "Aptose Doses First CLL Patient in Phase 1 Study of CG-806 and Doses Third Cohort in Phase 1 Study of APTO-253 ", "MD Anderson researchers find mechanisms behind CAR-T cells' efficacy, toxicity - MedCity News ", "Treatment of relapsed/refractory CLL with the BTK inhibitor zanubrutinib: phase 2 study | Journal of Hematology &amp; Oncology ", "Expert Discusses Recent CLL Approval ", "Updates in Front-Line Treatment of Chronic Lymphocytic Leukemia ", "Zanubrutinib Demonstrates Activity in Patients With CLL/SLL and Del(17p)  Miracle drug.", "Dr. Rogers Discusses Obinutuzumab, Ibrutinib, and Venetoclax Combination in CLL ", "Data From the CAPTIVATE Study’s uMRD Cohort Suggest Role for Fixed-Duration Therapy in CLL/SLL  - Cancer Therapy Advisor ", "Verastem Oncology Announces Dosing of First Patient in Yakult Honsha Co., Ltd.’s Japanese Bridging Study Evaluating COPIKTRA® (Duvelisib) in Patients with Relapsed or Refractory Chronic Lymphocytic Leukemia/Small Lymphocytic Lymphoma ", "25% of Patients With CLL See Disease Flare When Ibrutinib Therapy Pauses ", "Phase II study of combination obinutuzumab, ibrutinib, and venetoclax in treatment-naïve and relapsed or refractory chronic lymphocytic leukemia ", "Deciding on CLL Therapy and When to Treat ", "EMA Green Light for Avapritinib for GIST, Acalabrutinib for CLL ", "Novartis study shows benefits of Kymriah in hard-to-treat cancer ", "Exploring Beyond Chemoimmunotherapy Combinations in CLL ", "Dr. Kahl on Frontline Therapy Selection in CLL ", "Melanoma linked with CLL, close monitoring recommended ", "Leslie Breaks Down the Growing Importance of BTK Inhibitors in B-Cell Malignancies ", "Novel Agents, Earlier Diagnosis Driving Survival Gains in CLL ", "Treatment Selection in CLL Broadens Beyond Discussions of Efficacy ", "Dr. Roeker on the Rationale for BTK/Venetoclax Combos in CLL ", "Prognostic Tool Helps Treatment Planning for Asymptomatic Early-Stage CLL ", "Phase 1/2 CLL/SLL Trial Evaluating Duvelisib-Venclexta Combo Doses 1st Patient ", "Dr. O'Brien on the Phase III ASCEND Trial in CLL ", "COVID-19 Vaccine Failure in Patients With Blood Cancers ", "Infections: A Cause for Concern Among Patients With CLL ", "Toxicity Management With Venetoclax for CLL ", "NDA Hopes To Speed New Combination Therapy To Leukemia Patients ", "Efficacy of Pfizer-BioNTech BNT162b2 mRNA COVID-19 Vaccine in Patients With CLL  This article may have a subscription wall depending on how it is accessed, but it is free and worth it.\n\nKey new updates: \n\n1. Observed thresholds for pfizer covid 19 vaccine seroconversion rate based on igg and igm blood serum levels.  \n\n2. Effect of rituximab active and post treatment on Pfizer covid 19 vaccine seroconversion rate.", "Novartis: JULIET Trial Shows Sustained Responses With Kymriah - Quick Facts ", "Immunoglobulin Replacement May Benefit Some Patients Receiving CAR-T Therapy - Hematology Advisor ", "Acalabrutinib Better Tolerated Than Ibrutinib in Previously Treated Chronic Lymphocytic Leukemia - Cancer Therapy Advisor ", "Acalabrutinib Shows Superior PFS, Safety Over Other Treatments in Relapsed/Refractory CLL ", "Test can predict how people with leukaemia will respond to chemotherapy ", "Dr. Siddiqi on Rationale for the TRANSCEND CLL 004 Trial in CLL/SLL ", "How I Manage CLL with Venetoclax-Based Treatments | Blood ", "Pirtobrutinib Demonstrates Strong Response Rates for Previously Treated CLL/SLL ", "Combination Therapy May Benefit Subset of Patients With CLL Who Have Poor Response to Ibrutinib ", "Acalabrutinib May Be A Safer Alternative to Ibrutinib in CLL ", "Dr. Eradat on Novel Therapy Vs Chemotherapy in CLL ", "Prognostic Tool Predicts Length of Watch and Wait Period in CLL ", "Cancer Space Update: Label Expansion for Three Major Drugs ", "More Favorable Safety Profile of Acalabrutinib Vs Ibrutinib Validated for CLL ", "Ibrutinib-Based 1L Therapy Sustains Efficacy, Safety in TP53+ Chronic Lymphocytic Leukemia ", "Dr. Mato on Rituximab Biosimilars in CLL ", "Dr. Davids Discusses the Results of Ibrutinib Plus FCR in CLL ", "Frontline Venetoclax and Obinutuzumab Maintains Delay of Progression in CLL ", "Low neutralizing antibody responses in WM, CLL and NHL patients after the first dose of the BNT162b2 and AZD1222 vaccine ", "When COVID-19 Meets CLL: Limited Evidence Offers Some Hope for Good Outcomes - Cancer Therapy Advisor ", "Leukemia Cutis: Symptoms and Treatment ", "Dr. Brander Discusses the Frontline Treatment of CLL ", "Liso-Cel Shows Promising Clinical Activity and Safety in CLL/SLL ", "Report: Cost of CAR T-cell therapies aligns with clinical benefit ", "BALL score predicts benefit from ibrutinib therapy in relapsed/refractory CLL patients ", "Brukinsa May Cause Fewer Side Effects Than Other BTK Inhibitors for Patients with B-Cell Malignancies ", "About big pharma sacandal and cll cure I recently diagnosed with cll. Iam pharmacist by theway. after doing some few searchs i found there is some possible cure and no one ever talk about.and the people who doing the research dont even bother them selves to explain the component of the mix they use. I think its genoside done by some selfish money sucking buisnessman so that is the link\n i am not kidding\nPlease tell me i am wrong.. Or share your thoughts we only have us. I was having a dream to have a bmw car.\n\n From what I know, the chances of spontaneous remission without chemo or immunotherapy is very slim, like 1% slim. That being said, it is no secret that EGCG found in green tea is a natural CLL killer in lab rats. Also, EGCG combined with Tumeric yielded an even greater molecular response but these trials were done in a lab and from what I remember the dosage used was very high. My mother’s CLL specialist advised against trying to replicate the dosages used in the trials but advised us to make good use of green tea and include tumeric in it or in your diet plan. If you can find a good reputable source of EGCG extract from China, I would use it. The sources here in the US are a hit or miss and usually do not have anywhere near the amount of extract they claim it to have. Good luck! 2 main diffrence it done on arat lab and with very high dosage  iam talking about a drug with normal dose used in a man not rat and the research done in boston or dana farber i dont remember and the researchers are from recognized universties like harvard", "Combination Therapy Options Emerge in Treatment Landscape for Relapsed/Refractory CLL ", "Umbralisib-ublituximab combination extends PFS in CLL ", "Immunocompromised can develop a good immune response after vaccination against SARCoV-2 ", "FCR therapy may only benefit younger patients Letter to Editor suggests ", "In small study, hints of promise for 'natural killer' cell therapy ", "Patient With CLL May Have Had Longer COVID-19 Incubation Period - Cancer Therapy Advisor ", "Part 1: BTK Inhibitors for CLL in the Second Line ", "Richter Transformation Survival in CLL Appears Better Among Treatment-Naive - Cancer Therapy Advisor ", "New agents change treatment landscape in CLL ", "Drug Can Keep Leukemia in Remission for Years in Younger Patients ", "Woyach Highlights Progress and Next Steps in CLL Paradigm ", "Front-Line Imbruvica-Venclexta Combo May Induce Durable Responses in Chronic Lymphocytic Leukemia and Small Lymphocytic Lymphoma ", "Calquence approved in Japan for the treatment of relapsed or refractory chronic lymphocytic leukaemia ", "Aggressive B-Cell Lymphoma Shows Sustained Response with JCAR017, CAR T-cell Therapy, in Trial Update ", "Acalabrutinib: Same Survival Rates, But Better Tolerated Than Ibrutinib in CLL Treatment ", "Scottish scientists discover drug mix to help beat leukaemia ", "Combination Regimen’s Timing Studied for Patients With CLL/SLL ", "CLL Research Explores Feasibility of Time-Limited Treatment ", "Venetoclax plus rituximab increases progression-free survival in relapsed chronic lymphocytic leukemia ", "Happy Holidays!! And sorry for the massive dump.  Was totally out of range of signal until xmas and then had to play catch up with the massive amount of news that came out concerning CLL in December  ", "Acalabrutinib May Reduce Toxicity in Chronic Lymphocytic Leukemia Compared With Ibrutinib - Hematology Advisor ", "Dr. Wierda on Treatment of Relapsed/Refractory CLL  My mother is currently on the venetoclax/rituximab combo and has been since last October. She is handling the treatments fairly well until recently where she has had a significant increase in inflammatory response. I suspect that she will have a reduction of dosage this month vs prior months. She was originally diagnosed with CLL 5 years ago. I cannot recall her initial treatment plan, but she went into remission after 18 months. ", "U.K. NHS advice, might be some useful info for non U.K. residents ", "Low Rate of Cardiac Toxicity Reported With Acalabrutinib in CLL ", "Current and Emerging Treatment Options in Chronic Lymphocytic Leukemia  This is 20 times more information than I got from my oncologist.\n\nThank you.", "What is with these posts? It seems like only 1 user ever posts here, and they are always links to the same sites. There is no discussion of actual patient experiences - just journal articles. Wassup with that? I always think the same. Not sure why it is not more active.  I link to the same sites because there are not that many (I have found) that discuss the nuts and bolts of CLL.  Anything I find that discusses CLL I throw on here besides most of the soft news type stuff.  I would love if this was a more discussion/experience oriented forum.  I think that would be great.  But if this is just a place we collect the latest information about CLL, that is ok with me too.  I would support whatever people want to do with this place. I am a part of this sub for my mother who is 6 years past diagnosis. She has found these articles very helpful and they give her hope. She is currently under treatment and these studies and articles give us much needed info we would not have otherwise!  Thank you poster! Thanks - this Sub was just a mystery to me until your reply! I know someone who underwent haplo transplant at Hopkins in November 2017.", "First-Line Targeted Treatment Approach Appears Efficacious for Older CLL Population ", "Targeted treatment of chronic lymphocytic leukemia | OTT ", "Treatment with ibrutinib, acalabrutinib for chronic lymphocytic leukemia may increase risk for second cancers ", "Novel CLL Scoring System Helps Predict Risk of Atrial Fibrillation ", "Monitoring Weight in Patients With Chronic Lymphocytic Leukemia Treated With Ibrutinib - Hematology Advisor ", "Ongoing Class Switch and Somatic Hypermutation in a Significant Subset of Chronic Lymphocytic Samples ", "Dr. Kay Discusses the Role of Acalabrutinib in CLL ", "Hepatitis B More Prevalent in Patients With CLL Than Those With MM ", "US Galien Foundation honors Venclexta, (venetoclax) as \"Best Pharmaceutical Product\" for Treatment of CLL ", "CLL study pays $75 ", "Fighting Cancer with CAR T and Big Data  Let us hope they will get a cure one day.", "Clinical application of obinutuzumab for treating CLL ", "Examining Ibrutinib Plus Venetoclax as a Treatment Option for CLL ", "Vaccination reaction? Well I guess this is meant to kind of generalized but….I got the flu shot the other day and wow, i have the worst cold now. I had a pretty intense reaction to the Covid vaccine too. Just wondering if anyone else has any experience with this? Is it normal?  \n\nI got a Covid test and it was negative, could be allergies. But this sucks! \n\nIm on watch and wait! Well about to start targeted therapy but pre treatment. (Slightly anemic)", "42-Month Follow-Up Data of Acalabrutinib Monotherapy in R/R CLL ", "New Prognostic Score Predicts Likelihood of First Treatment Required for Early-Stage Chronic Lymphocytic Leukemia - Hematology Advisor ", "Case Presentation: A 67-Year-Old Man with Chronic Lymphocytic Leukemia  ", "Researchers complete genomic map of chronic lymphocytic leukemia ", "New Therapies for Blood Cancers Hold Promise ", "GENUINE Improvements: Ublituximab Plus Ibrutinib for CLL ", "New BTK Agents and Combinations Are on the Horizon for B-cell Malignancies ", "Cyclacel looking to begin proof of concept study in CLL ", "How I manage ibrutinib intolerance and complications in patients with CLL ", "Dr. Robak on the Results of the 7-Year Follow-Up of RESONATE-2 in CLL ", "Individualized Lenalidomide Plus Chlorambucil and Rituximab May Be Feasible in Advanced CLL ", "Low COVID Vaccine Response in Patients With Blood Cancers ", "Dr. Davids on the Potential Utility of Ibrutinib/Umbralisib in MCL and CLL ", "For Younger Patients, CAR T-Cell Therapy Could Play a Role in CLL Treatment ", "Dr. Maloney on the Promise of CAR T-Cell Therapy in Hematologic Malignancies ", "Amid Explosion of Targeted Agents, FCR Retains a Role in CLL Paradigm ", "Genomic Complexity in CLL Is Detected With Optical Genome Mapping ", "Umbralisib Found Safe in Treating Leukemia, Lymphoma in Clinical Trial ", "Dr. Thompson on Emerging Treatment Strategies With BTK Inhibitors in CLL ", "Dr. Bociek on the Role of MRD in CLL ", "Venetoclax-Rituximab Led to Sustained MRD Negativity in R/R CLL - Cancer Therapy Advisor  ", "Ibrutinib Plus Venetoclax Improves Outcomes in High-Risk, Older Patients With CLL ", "Exploring Durable Responses With Liso-Cel for Relapsed/Refractory CLL ", "Burke Reviews Targeted and Immunotherapy Combinations in CLL Case Studies ", "An Expert Provides Insight Into the Use of BTK Inhibitors in CLL ", "Relapsed/Refractory CLL: Evaluating Other Novel Agents ", "Zanubrutinib may be poised to challenge ibrutinib for CLL ", "Triplet therapy shows promise in phase 2 study in chronic lymphocytic leukemia ", "Registry could be 'invaluable' for tracking long-term CAR T-cell therapy outcomes ", "Sunesis Pharmaceuticals Announces Presentation of Preliminary Data from Phase 1b/2 Trial of Vecabrutinib in Patients with CLL and Other B-Cell Malignancies at EHA Annual Meeting ", "Early FCR Lacks Evidence to Change Standard Watch &amp; Wait in Stage Binet A High-Risk CLL ", "Frontline Ibrutinib/Venetoclax Combo Shows High MRD-Negative Responses for CLL ", "Revisiting autoimmunity in chronic lymphocytic leukemia | JBM ", "Venetoclax, BTK Inhibitor Combination May Induce Greater Remission in Patients With CLL ", "Q-TWiST Shows Acalabrutinib Has Favorable Risk-Benefit Profile for R/R CLL ", "Researchers find dual inhibitor may be safer for CLL patients ", "Clinical course and risk factors for mortality from COVID-19 in patients with haematological malignancies ", "The Effect of Severe Infections on Patients with CLL Receiving Chemoimmunotherapy ", "Could Active Surveillance Help Prevent Advanced Melanoma in CLL Patients? ", "Dr. Danilov on ELEVATE-TN Trial Results in CLL ", "Molecular Therapeutics for Drug-Free Cancer Treatment - Not in article but Rituximab also has potential in treating CLL ", "Ibrutinib dose modifications in the management of CLL ", "Clinical Stage at First Response to Therapy Is Prognostic for CLL ", "Calquence earns breakthrough designation for CLL monotherapy ", "Dual inhibitor therapy may be safer for CLL patients, Moffitt study shows ", "Janssen’s Imbruvica combination provides survival benefits in CLL trial ", "Optimizing Treatment Strategies for Patients With CLL ", "Promising Results Seen With Ibrutinib Plus Venetoclax Combo in Relapsed/Refractory CLL ", "People with immunodeficiency should take COVID-19 vaccine booster shots - Texas News Today ", "Venclexta Approved for Treatment of Previously Untreated CLL ", "Dr. Davids Discusses Findings From DUO Study in CLL ", "Duvelisib Provides CLL Patients With a Later Line of Therapy ", "3 Things In Biotech, May 25: A CLL Game Changer ", "New Data Reinforce the Long-Term Benefit of Venetoclax-Based Combination for People With Relapsed/Refractory CLL ", "1-year DFS Rates similar between Ibrutinib and placebo following Ibrutinib-Venetoclax in CLL  Thank you for this.", "I am hoping some of you might also be interested in a new group for blood cancers of all types. I think there is some things we can learn from each other. R/bloodcancer ", "Adding Copiktra to Standard of Care Chemotherapy Combination in CLL Could Improve Outcomes, But Not Without Toxicities ", "AstraZeneca gets an early green light on BTK blockbuster hopeful Calquence ", "Exploring the CLL14 Trial in Untreated CLL After 4 Years of Follow-up ", "Controlling Infections Could Be Key to Improving Survival in CLL ", "Cholesterol-lowering drugs can help blood cancer treatment - Medical News Bulletin | Health News and Medical Research ", "‘Interesting science’ behind ibrutinib, venetoclax combination for CLL ", "COVID-19 antibody tests will not tell you if you are protected ", "CAR T-Cell Therapy Induces Response in NHL and CLL ", "Poor Neutralizing Antibody Responses in 132 Patients with CLL, NHL and HL after Vaccination against SARS-CoV-2: A Prospective Study ", "Dr. Barrientos Discusses the Management of Elderly Patients with CLL ", "Precision Medicine Wrap-up: Combination Therapies in CLL ", "Study: Patients with Leukemia, Lymphoma Achieve 73% Response Rate with CD19 CAR NK-Cell Therapy ", "TG Therapeutics (TGTX) Highlights Triple Therapy Data from Ph. I/II Study of Ublituximab (TG-1101) in Combination with Umbralisib (TGR-1202) ", "Optimized CLL Care Requires Prognostic Marker Testing at Diagnosis ", "Adding Ibrutinib to CAR T-Cell Therapy Increases Response Rates in CLL ", "Obinutuzumab-venetoclax shows activity for chronic lymphocytic leukemia ", "Prognostic Factors in CLL ", "Selecting the Optimal Frontline Therapy in CLL ", "Talley Traces Developments in Chronic Leukemias ", "Extended Follow-up Phase 3 Data Underscore Sustained Efficacy and Safety of IMBRUVICA® (ibrutinib) in the Treatment of Chronic Lymphocyt ", "Umbralisib Plus Ublituximab Prolongs PFS in Treatment-Naïve, Relapsed/Refractory CLL ", "Dr. Mato Discusses Advances in the Treatment of Patients With CLL ", "CLL Paradigm Continues to Be Refined ", "Duvelisib has marked response, survival benefit in difficult-to-treat leukemia and lymphoma ", " Cancer survivors Hi, r/cll community,\n\nIf you had a cancer diagnosis and are currently in remission, we will truly appreciate your contribution to our research in regards to survivorship and coping following cancer.\n\nI am a PhD student in Computational Linguistics and I am interested in researching methods to improve the life of cancer survivors together with my colleague, a health psychologist and PhD researcher that has been working with cancer afflicted youth for the past 7 years and has been helping them with psychological supportive care for their mental health.\n\nWe would really appreciate your help to understand more about your cancer experience as a survivor, but most importantly how well this experience is reflected in the cancer survivors’ language used on social media. People often voice their feelings, victories or concerns about cancer through social media.\n\nFor instance, in recent research, our team tried to understand the changes in social media content of individuals diagnosed with depression. The current research is similar to the one described above, as our team endeavours to seek whether social media language reflects well-being and survivorship coping skills.\n\nWe hope that you can share your experience with us by completing a set of questions that will take only 15 minutes of your time, but will make a large difference in building knowledge in regards to the well-being of cancer survivors.\n\nWe truly appreciate your contribution to our research in regards to cancer survivorship, meanwhile respecting the confidentiality and complete anonymity of your responses.\n\n(\n\nThank you!", "Interim MRD May Help Direct Individual Treatment for CLL ", "UNDERSTANDING IMBRUVICA - ***SURVEY FOR CLL PATIENTS*** SURVEY LINK: (\n\nI am a graduate student working on a research project to evaluate the real-world perceptions of Imbruvica(ibrutinib). I am hoping to identify barriers to treatment, or unmet needs in people with the indicated conditions, in order to improve access to innovative therapeutic products. Any and all data collected is anonymous and we request you do not include any self-identifying information. I would really appreciate your input if you could take 5 minutes to fill out this survey. Thank you in advance!", "Ibrutinib/Venetoclax Bests Chlorambucil/Obinutuzumab for Treating CLL ", "Dr. Roeker on the Emerging Role of MRD in CLL ", "Dr. Mato on the Efficacy of Fixed-Duration Venetoclax-Based Combo in CLL ", "Dr. Danilov on the Efficacy of Entospletinib Plus Obinutuzumab in Relapsed/Refractory CLL ", "Prognostic Model for Patients With Relapsed/Refractory Chronic Lymphocytic Leukemia - Hematology Advisor ", "Roche Gets FDA Nod for Venclexta Plus Gazyva to Treat CLL ", "Study Further Characterizes Symptomatic Bronchial Involvement in CLL - Cancer Therapy Advisor ", "Zanubrutinib Demonstrates Impressive Responses in Relapsed/Refractory CLL ", "3 Drug Treatment Puts Some Patients With CLL On the Road to Remission ", "Poor prognosis is ZAP70’ed into focus in CLL | Blood ", "Acalabrutinib Now Finding a Role in CLL, Shows Good Tolerability ", "Revolutionary two-pronged attack that is beating 'incurable' blood cancer  Grain of salt warning anytime you read the word \"cure\"", "Combination Therapy With Ibrutinib and Venetoclax Bests Chlorambucil/Obinutuzumab for CLL ", "With So Many Options for CLL, the Best Treatment May Be a Clinical Trial ", "Truxima to hit US market next week as first rituximab biosimilar ", "Arzerra Will Be Available at No Cost to Patients with Chronic Lymphocytic Leukemia in US  This is good news for CLL patients, however the reason they are doing this is because they are pivoting away from the CLL market to focus on the MS market, where this drug has better outcomes for patients.", "Patients With CLL and Other B-Cell Malignancies Benefitted from TG-1701 ", "Anyone following this?  Am now! Odd that they did not mention the specific pathway.", "Venetoclax Plus Obinutuzumab Prevails as First-Line Combo in CLL - Cancer Therapy Advisor ", "{Soft News} How a New Cancer Therapy Saved My Life ", "Acalabrutinib Plus Venetoclax and Obinutuzumab Achieves High Bone Marrow uMRD Rate in CLL ", "Acalabrutinib, Alone or With Obinutuzumab, Improves Quality-Adjusted Survival in Frontline CLL ", "Exploring Why Venetoclax and Ibrutinib Have Synergy in the CLL Population ", "Acalabrutinib Induces Durable Disease Control in Frontline CLL at 4 Years ", "FDA Approves First Non-Chemo Combination Therapy for CLL - Imbruvica/Gazyva ", "Ibrutinib and Hypertension in CLL: What Are the Risks? - Cancer Therapy Advisor ", "Real-World Ibrutinib Dose Reductions, Discontinuations in CLL ", "Benefits of Ibrutinib + Rituximab for Previously Untreated Patients With CLL ", "Roche/AbbVie drug could further improve prognosis in CLL - Pharmaphorum ", "The CLL International Prognostic Index predicts outcomes in monoclonal B-cell lymphocytosis and Rai 0 CLL | Blood ", "Ibrutinib with rituximab in previously untreated CLL: indication of added benefit over FCR ", "TP53 Mutations Among Prognostic Factors Associated With Ibrutinib-Resistant CLL ", "Assessing Primary Endpoint Trial Results for BOVen Therapy in Previously Untreated CLL ", "Post-Ibrutinib Treatments Show Promise in CLL ", "Teva launches Rituxan biosimilar in U.S. - Teva Pharmaceutical Industries Limited (NYSE:TEVA) ", "Dr. Shah Compares Toxicity Profiles of Ibrutinib and Acalabrutinib ", "A High Rate of Opportunistic Infections in Patients with CLL ", "Follow-Up Analysis Presented for MURANO Trial of Venetoclax in R/R CLL ", "Ibrutinib Plus Venetoclax Induces Lower MRD Rate Vs FCR in Previously Untreated CLL ", "BTK Inhibitors in the Management of CLL  ", "Setting the Stage for CAR-T Cell Therapy in Chronic Lymphocytic Leukemia ", "Study: Combination Targeted Therapy Provides Durable Remission for Patients with Chronic Lymphocytic Leukemia ", "After Long-Term Ibrutinib Therapy for CLL, BTK Mutations May Signal Progression - Cancer Therapy Advisor ", "CLL Treatment in Community Oncology ", "CAPTIVATE and iNNOVATE Clinical Trial Results for CLL ", "Autolus moves forward with novel CAR-T therapy candidate ", "Oncternal Therapeutics Announces Updated Interim Data from a Phase 1/2 Study of Cirmtuzumab in Combination with Ibrutinib ", "New CLL Data Point to ‘Durable, Lasting Response’ ", "Antibody responses after first and second Covid-19 vaccination in patients with chronic lymphocytic leukaemia ", "Prognostic Factors in Patients With CLL ", "Transitioning to Targeted Treatment for Patients with CLL Using BTK Inhibitors ", "Anti-CD19 CAR-T cells trigger durable remissions of CLL, B-cell lymphoma ", "Venetoclax/Rituximab Hits Over 80% 2-Year PFS Rate in CLL ", "Navigating Chronic Lymphocytic Leukemia Diagnosis and Staging ", "Ibrutinib May Improve CAR T-Cell Production for Patients With Chronic Lymphocytic Leukemia ", "Patients With CLL Experience Better Quality of Life With Ibrutinib Plus Rituximab ", "Novartis gets approval to sell Kymriah in Japan for $306,000 ", "Dr Peter Hillmen Outlines Zanubrutinib as a New Option to Treat in R/R CLL ", "Favorable Safety and Efficacy May Be Possible With Off-the-Shelf CAR T Cells in NHL ", "Venclexta-Gazyva Combo Creates More Long-Term Treatment Options for Patients with CLL ", "Potential Early Drivers of Disease in Treatment-Naive CLL Identified - Cancer Therapy Advisor ", "High-Frequency, Low-Dose Acalabrutinib Yields Effective Response in CLL/SLL ", "Dr. Byrd on Future Directions With Acalabrutinib in CLL ", "IGHV gene mutation at heart of CLL treatment  I have been looking for an article that succinctly sums up the value of ighv testing to help frame up a conversation on the topic with my doctor.  My doctor has denied ighv and TP53 mutation testing would have any effect on her choice of treatment and I do not understand why this is not standard practice in my regional cancer center (In Pittsburgh). Get a CLL specialist. ASAP. I see Dr. Mato at Sloan Kettering. You are close to Ohio State with lots of great options there. I have been on watch and wait for 13 years and I am IGHV UNMUTATED. My local oncologist is dumbfounded that I have not needed treatment. One thing is for sure. If they would have treated me with the old FCR at some point in this journey, I would probably be dead now. Know your IGHV Status and all of the other genetic testing that is important. GET A CLL SPECIALIST ASAP! I can literally save your life. I am male 38, a vet, and have been dealing with this for a long time if you want to PM me. Have you had any treatments, even palliative ones? Not a thing yet. Not even IVIG-G. I am getting closer though but my doc thinks i am still years away unless something drastically changes.", "Dr. Fakhri on Tumor Lysis Syndrome Associated With Venetoclax/Obinutuzumab in CLL ", "Dr. Woyach on Ibrutinib Regimens in Frontline CLL ", "Harnessing the Power of Both Alemtuzumab and Rituximab in a Bispecific Antibody ", "Weighing the Impact of Long-term Safety and Efficacy Data for Ibrutinib in the Treatment of CLL ", "Understanding the Implication of Sequencing on HRU/Cost for CLL/ SLL Patients ", "Expert Discusses Add-On Study Design for Ibrutinib as Treatment for Chronic Lymphocytic Leukemia ", "“Unfavorable Genetics” Negatively Impacted MRD in Some Patients With R/R CLL ", "Blood cell mutations linked to leukemias are inevitable as we age ", "Venetoclax-rituximab maintains efficacy in chronic lymphocytic leukemia 1-year posttreatment ", "Autoimmune cytopenias in chronic lymphocytic leukemia ", "Daughter says her father died from flesh-eating bacteria while visiting Emerald Coast (Weakened immune system due to CLL, be careful out there)  Holy smokes - has anyone heard about anything like this or discussed it with their doc? I live in south Mississippi, and flesh eating water born bacteria is common enough here that local doctors are given training on recognizing when someone has it and on how to properly treat it (or best attempt to...it is very difficult to treat). I know this because I worked at a university that put on the seminar. Anyone is susceptible, but especially those with weakened immune systems.", "How Patients with Chronic Lymphocytic Leukemia Are Equipped to Handle the COVID-19 Pandemic ", "IMPACT OF DISEASE TREATMENT ON THE OUTCOME OF PATIENTS WITH CHRONIC LYMPHOCYTIC LEUKEMIA (CLL) WITH COVID‐19: A MULTICENTER STUDY ON BEHALF OF GELLC ", "Pirtobrutinib Demonstrates Favorable Efficacy in Patients With B-Cell Malignancies ", "Dr. Raphael on the CLARITY Trial in CLL ", "Norm MacDonald? I do not wish to be disrespectful by my speculation, but did Norm MacDonald die of CLL? I read it was acute leukemia. But he had it for 9 years? Does acute leukaemia stick around that long? RIP Mr. MacDonald. Chronic indolent lymphomas can go through \"transformation\" and an aggressive acute leukemia will be the result.  Google \"Richter's Transformation\" for the one that can happen in some CLL patients. Where did you read this? Amongst others on ( Maybe he alternated between remission and relapse over the course of the years. That is what I am wondering. It just freaks me out a bit as I have CLL and was told basically no one dies from it. But then I keep hearing of people who do. Since average age of onset of CLL is early 70s, and does not necessarily require treatment for many years if ever, and even if you are treated with current treatments most people will see at least 10 yrs of remission, that takes most people into old age.  And when you are deep into 80s or 90s, chances are some other ailment or other cancer will get you first. Thanks, that is what I have heard as well. I am only 49.", "Dr. Al-Sawaf on the Efficacy of Venetoclax/Obinutuzumab in Treatment-Naïve CLL  I can testify to the effectiveness of this combination.\n\nMy WBC was 146,000 just before the first infusion. A week later: 1,300.\n\nObviously this two low, but after five infusions and one round of venclexta, I think I am almost done with this cancer.\n\nMy oncologist took me off allopurin and two other ajuvants, and I only have one more infusion scheduled.\n\nI am amazed at how powerful this MAB is.", "Fixed-Duration Imbruvica-Venclexta Combo Benefits People With Chronic Lymphocytic Leukemia ", "Tolero Pharmaceuticals Announces First Patient Dosed with Investigational Agent TP-0903 in Phase 1/2 Study in Patients with Previously Treated Chronic Lymphocytic Leukemia andSmall Lymphocytic Lymphoma ", "Dr. Tam Discusses the DUO Trial for CLL ", "Dr. Byrd on Challenges Facing CLL ", "Natural history of monoclonal B-cell lymphocytosis among relatives in CLL families | Blood ", "Early Analysis of the Mutational Status of Patients with CLL Is Critical ", "Dr. Burke on Current FDA Indications for BTK Inhibitors in B-Cell Malignancies ", "Infection Control a Necessity in Treating CLL  pneumonia vaccine helps", "Zanubrutinib/Venetoclax Shows Efficacy in High-Risk CLL Subgroup ", "AbbVie and Roche's venetoclax shows long-term treatment benefit in late-stage leukemia study ", "Dr. Burger on the Benefits of Novel Combination Approaches in CLL ", "Idelalisib Improves Survival Compared With Rituximab in Relapsed CLL ", "Exploring Treatment Options for Patients with CLL ", "FDA Approves Ibrutinib/Obinutuzumab for Treatment-Naive Patients with Chronic Lymphocytic Leukemia ", "Jeff P. Sharman, MD, on Results from the ELEVATE TN Study in CLL ", "Evidence for Increased DNA Methylation Heterogeneity in Certain Circulating CLL Cells - Cancer Therapy Advisor ", "Dr. Arora on Sequencing Strategies in CLL ", "Nurses Make a Difference as the Frontline in Managing Adverse Effects from Ibrutinib ", "Acalabrutinib Plus Venetoclax To Be Evaluated in Treatment-Naive CLL/SLL ", "Dr. Davids on the Combination of Ibrutinib and Obinutuzumab in CLL ", "Novel Triplet Shows Early Promise for Pretreated CLL ", "Understanding the Pendulum Swing in CLL Research Over the Last Decade ", "Patients With R/R CLL Have Promising Efficacy Outcomes With Zanubrutinib ", "Long-Term Safety, Efficacy After Second-Line Monotherapy for Relapsed CLL ", "Secondary Malignancies After BTK Inhibitor Therapy for CLL ", "FDA takes second action under international collaboration, approves new treatment option for patients with chronic lymphocytic leukemia ", "Dr. Furman on Prognostic Markers in High-Risk CLL ", "CLL Landscape Continues to Expand With Addition of Venetoclax ", "Novel Combination Therapy Contributes to Additional Progression-Free Survival Benefit Compared With Chemoimmunotherapy in Patients with CLL ", "Ibrutinib/Obinutuzumab Combo Improves PFS in CLL ", "Ibrutinib Plus Rituximab in Untreated Older Patients With CLL: Results of the Alliance AO41202 Trial ", "Dr. Ghia on the Key Takeaways of the CAPTIVATE Study in Treatment-Naïve CLL ", "Clinical Trial: Zanubrutinib Plus Rituximab for Previously Untreated Patients With Chronic Lymphocytic Leukemia - Cancer Therapy Advisor ", "Convalescent plasma helped a blood cancer patient who got Covid-19 after rituximab treatment. ", "Bendamustine Plus Obinutuzumab, Venetoclax Shows Therapeutic Potential in CLL ", "Stress is Linked With More Advanced CLL ", "Ibrutinib/zanubrutinib Anyone have experience in taking these?My watch and wait lasted a whole 6 months thanks to my lymphocyte count more than doubling. Now The docs moving towards treatment. \n\nAny side effects? Long term? Did you respond to it? Anything helps thanks", "Outpatient CAR T-cell therapy possible if done earlier ", "Venetoclax/Rituximab Combo Achieves Durable, High MRD Status in CLL ", "The relationship between oxidative stress and cytogenetic abnormalities in B-cell chronic lymphocytic leukemia ", "Which Drug Therapy for CLL, Time-Limited or Continuous? ", "Real-World Outcomes of First-Line Ibrutinib vs Chemoimmunotherapy for CLL ", "Venetoclax shows promise for ibrutinib-resistant CLL ", "Ibrutinib Regimens Yield Superior Efficacy in Older Patients With Chronic Lymphocytic Leukemia ", "Obinutuzumab Plus Chemotherapy Found Active in Fit, Untreated Patients With CLL - Cancer Therapy Advisor ", "Patients With CLL Treated on the ELEVATE-TN Trial Experience Improved PFS With Acalabrutinib ", "Hungarian Researchers May Make Leukemia Treatment More Effective ", "Patient with Cancer Shares Tips for Being Your Biggest Advocate | Dana-Farber ", "BeiGene Announces First Presentation of the Phase 3 ALPINE Trial Comparing BRUKINSA® (Zanubrutinib) to Ibrutinib in Chronic Lymphocytic Leukemia to Be Featured in Presidential Symposium at EHA2021 ", "Venetoclax-based time-limited combination therapies show efficacy in CLL ", "Kite's CAR-T Cell Therapy Shows Promise in Phase 1/2 Trial ", "Cost-effectiveness of first-line vs third-line ibrutinib in patients with untreated chronic lymphocytic leukemia | click \"CONNECTED CONTENT\" link for full free article ", "Guest commentary: Most anticipated studies on chronic lymphocytic leukemia at ASH ", "‎Hematologic Oncology Update: Exploring Clinical Investigator Perspectives on the Optimal Management of Chronic Lymphocytic Leukemia (Medical and Hematologic Oncologists) 2020 on Apple Podcasts  Full disclosure, I have not gotten around to listening to this. Hematologic Oncology Update is available on many podcast apps.\n\n  ( • ( • ( • ( • ( • (\n  \n  ^(I am an automated bot helping people quickly open podcast links in their preferred podcast app. More platforms are added by request when technically possible. (", "Dr. Barrientos on Treatment Options for Patients With TP53 Mutations or 17p Deletions in CLL ", "Liso-Cel Shows Promising Clinical Activity and Safety in CLL — Episode four ", "Prior Comorbidities Predict Risk of Treatment-Emergent Atrial Fibrillation in CLL  This is BS. It is trying to shifting the blame of Afib away from the drug and onto the patient. Second generation BTKi does not have this issue", "Combinations Have Potential to Shift CLL Treatment Paradigm ", "Dr. Wierda Discusses Use of CAR T Cells in CLL ", "Obinutuzumab Appears Safe, Effective in Relapsed/Refractory CLL ", "Protective Role of BTK Inhibitors in Patients with Chronic Lymphocytic Leukemia and COVID‐19 ", "CK does not seem to affect OS in CLL patients taking idelalisib ", "Prior History of SCC Could Be a Red Flag for Development of SCC in the Setting of CLL - Cancer Therapy Advisor ", "Frontline Ibrutinib Showcases Long-Term OS Benefit in Older Patients With CLL ", "Salvage Ibrutinib Provides Benefit for Patients With Relapsed CLL ", "AbbVie Receives Positive CHMP Opinion for VENCLYXTO® as a Chemotherapy-Free Combination Regimen for Patients with Previously Untreated Chronic Lymphocytic Leukemia ", "High MRD Rates Seen with Venetoclax in Patients With Relapsed/Refractory CLL ", "Study for patients who traveled to any other country for cancer treatment Hey,\n\nI am looking to have a discussion with any cancer survivors or their care givers who have traveled to another country from Thailand/Indonesia/Malaysia/Philippines/Vietnam for Leukemia or Lymphoma treatment.\nIt will be a paid discussion (100 USD) as it is for a research study.\nIf anyone is interested please do contact me on ", "Dr. Wierda on Chemoimmunotherapy in CLL ", "China approves new self-developed cancer drug ", "Dr. Ghia on the Design of the CAPTIVATE Study in Treatment-Naïve CLL ", "Real-World Outcomes Differ for Common Therapy for Follicular Lymphoma, CLL  ", "Dosing Begins in Advanced CLL and SLL Patients in Study of TP-0903 Given With or Without Imbruvica ", "Superior PFS to FCR in Previously Untreated CLL Seen With Ibrutinib Plus Rituximab ", "CLL: Evolution of Treatment (First in Eight Video Series) ", "Brander Details Different Therapies and Modalities for Treatment of CLL in the Second Line ", "Dr. Ghia on Lack of OS Advantage With Acalabrutinib Per ASCEND Trial in CLL ", "BRIEF-Abbvie Presents Data From Venetoclax Chemotherapy-Free Combination Regimen For Patients With Previously Untreated Chronic Lymphocytic Leukemia ", "New Study Offers First Direct Comparison Between Venetoclax, Ibrutinib in CLL ", "Ibrutinib plus obinutuzumab more effective than chemoimmunotherapy in CLL ", "Portell Discusses the Treatment of Relapsed/Refractory CLL ", "Stress linked to poor outcomes in chronic lymphocytic leukemia ", "Early data show CAR-NK cells' potential to overcome CAR-T toxicity - and Takeda is interested - MedCity News ", "Calquence Could Offer Treatment for Chronic Lymphocytic Leukemia with Fewer Side Effects ", "Approaching Therapy for Relapsed/Refractory CLL  Turn off ad-blocker or open in incognito mode", "Novel BTK Inhibitor Well Tolerated in Patients with CLL, Other B-Cell Malignancies ", "Aptose's CG-806 shows encouraging effect in blood cancer (NASDAQ:APTO) ", "FDA Approval Sought for Duvelisib in CLL, Follicular Lymphoma ", "The MURANO Phase III Trial ", "Statin use and chronic lymphocytic leukemia incidence: A nested case-control study in Manitoba, Canada ", "Long-Term Outcomes, Secondary Malignancies of Common First-Line Treatment for CLL ", "Study Finds First-Line Targeted Treatment for CLL Is Beneficial in Elderly Patients ", "Dr. Bhat on the Potential for Time-Limited Combinations in CLL ", "An Analysis of CLL in Adolescents and Young Adults - Docwire News ", "Ibrutinib/Venetoclax Yields Durable Benefit in Previously Untreated CLL ", "Adding Bendamustine to Venetoclax Combination Treatment Increased AEs in R/R CLL ", "Novartis’ Kymriah shows ‘strong efficacy’, ‘durable response’ in new analysis ", "Julie Vose, MD, MBA, Discussed Toxicities Associated With Acalabrutinib or Ibrutinib for Chronic Lymphocytic Leukemia ", "Acalabrutinib Shows Sustained Superiority Over Standard-of-Care Regimens in Relapsed/Refractory CLL ", "How to Manage Venetoclax Resistance in Chronic Lymphocytic Leukemia - Cancer Therapy Advisor ", "Dr. Woyach on the Utility of Time-Limited Therapies in CLL ", "Acalabrutinib Improves PFS, Safety in Untreated CLL ", "Rapid Infusion of Biosimilar Rituximab Safe, Well Tolerated ", "Dr. Eradat Discusses Data With Acalabrutinib in CLL ", "Expert Highlights Potential of Targeted Therapies in Combinations for CLL ", "VIDEO: Ibrutinib plus chemoimmunotherapy ‘promising’ for young patients with CLL ", "Dr. Jacobs on the Use of Ibrutinib in High-Risk Patients With CLL ", "CAR T Cells Liso-Cel Demonstrate Promising Activity and Manageable Safety in CLL and SLL ", "Janssen gets indication expansion approval to treat CLL/ SLL ", "Real-world experience of ibrutinib therapy in relapsed chronic lymphoc | JBM ", "BeiGene Presents Long-Term Efficacy and Safety Results from Three Pivotal Trials of BRUKINSA® (Zanubrutinib) and Tislelizumab at EHA2021 - Headlines of Today ", "Roche and AbbVie Push Towards First-Line CLL Treatment ", "Second-Line Treatment Options for Relapsed CLL ", "Lymphoma Hub Symposium | The value of BTK inhibitors for the treatment of patients with R/R CLL ", "Swollen lymph nodes Hi, I am probably overreacting. I was diagnosed last April and have had no issues. I see a hematologist every July (so once so far) and have bloodwork every 3 months. This morning, I woke up with a sore neck and felt a lump. It was visible when I looked in the mirror. It seems like the swelling is going down but it still hurts a bit. Should I wait it out or do I need to see a doctor? No fever, no other issues. \nThanks", "Dr. Woyach on the Role of Chemoimmunotherapy in CLL ", "Dr. Gerson on Targeted Therapy Versus Chemotherapy in CLL ", "CAR-T Therapy May Be More Effective When Administered Earlier in the Multiple Myeloma Treatment Continuum - Cancer Therapy Advisor ", "CLL Treatment May Increase Risk of Death From COVID-19 ", "Dr. Abedin on the Need for Risk Stratification Before Chemoimmunotherapy in CLL ", "Fixed-Duration Ibrutinib/Venetoclax Shows Greater PFS in CLL ", "Dr. Davids on Frontline Challenges in CLL ", "Limiting Treatment Duration Improves Cost Effectiveness in CLL ", "Venetoclax/Obinutuzumab Combo Approved by FDA for Frontline CLL ", "Venetoclax + Obinutuzumab: Impact on CLL Management ", "Zanubrutinib Faces Off Against Ibrutinib in CLL Trial ", "CD19 CAR T-Cell Therapy Effective for Relapsed/Refractory DLBCL | Cancer Network ", "GLOW: MRD Outcomes After Fixed-Duration Ibrutinib Combinations in Older CLL Patients ", "Researchers May Predict Which CLL Patients Will Respond to Kymriah ", "Zanubrutinib Highly Effective in CLL/SLL, Despite Presence of High-Risk Cytogenetics ", "Ibrutinib Superior to Chemoimmunotherapy in Treatment-Naive CLL ", "TG Therapeutics Announces Data from the UNITY-CLL Phase 3 Trial Presented at the 63rd American Society of Hematology (ASH) Annual Meeting ", "Ibrutinib Extends PFS in Patients with TP53-Mutated Chronic Lymphocytic Leukemia ", "Frontline Ibrutinib/Venetoclax Elicits Durable Responses in CLL With Undetectable MRD ", "Cost Effectiveness of CAR T-Cell Therapy Depends on Long-Term Outcomes ", "Unmutated IGHV Predicts Benefit of Obinutuzumab Plus Venetoclax for Untreated CLL ", "Novel Agents Could Improve Chemoimmunotherapy in Chronic Lymphocytic Leukemia ", "Ibrutinib Plus Short‐Course Fludarabine Elicits Encouraging CR Rates in Previously Treated CLL ", "Ibrutinib/Venetoclax Yields Deeper Rates of MRD in Elderly and Unfit CLL ", "Teva Pharmaceutical Industries Ltd. - Teva and Celltrion Announce the Availability of TRUXIMA® (rituximab-abbs) Injection, the First Biosimilar to Rituxan® (rituximab) in the United States ", "New CAR T-cell Therapies for Lymphoma, Leukemia Justify Price, ICER Report Suggests ", "In Older Patients With Chronic Lymphocytic Leukemia Ibrutinib Regimens Yield Superior Efficacy ", "Pilot Study Supports Lower Dose of Ibrutinib in Chronic Lymphocytic Leukemia ", "BTK Inhibitor Combos Could Transform the Complex CLL Armamentarium ", "Venetoclax in the Treatment of Chronic Lymphocytic Leukemia: Evidence, Expectations, and Future Prospects ", "Thank you. I just wanted to thank you for taking the time to post this information. ", "Transient disappearance of CD19+/CD5+ B‐lymphocyte clone in peripheral blood in a patient with CLL during SARS‐CoV‐2‐related mild disease ", "Updated CAPTIVATE Data Continue to Show Benefit of Fixed-Duration Ibrutinib-Venetoclax in First-line CLL ", "Front-Line Ibrutinib for CLL: Long-Term Follow-Up of Time to Next Treatment, HRU ", "Prognostic model identifies patients with CLL at risk for ibrutinib failure ", "Dr. Shadman on the CLL14 Trial in CLL ", "Dr. Pleyer on Phase 2 Study With Ibrutinib Plus Short-Course Fludarabine in CLL ", "Ibrutinib plus venetoclax in relapsed/refractory chronic lymphocytic leukemia: The CLARITY study ", "First-line Treatment Options in CLL (First in Seven Video Series)  \\*Second", "Venetoclax Plus Rituximab in Relapsed Chronic Lymphocytic Leukemia: 4-Year Results and Evaluation of Impact of Genomic Complexity and Gene Mutations From the MURANO Phase III Study ", "Higher dose of CAR T cells may be more effective in advanced chronic lymphocytic leukemia ", "A Pilot Study of High-Intensity Interval Training in Older Adults with Treatment Naïve Chronic Lymphocytic Leukemia  Loads of benefits to exercise, especially on the immune system.\n\nUnfortunately this type of research does not produce a pill that can be sold, so little research has been done", "Clinical Challenges: Selecting First-Line Therapy in CLL ", "Undetectable MRD Status in Patients With CLL ", "Addition of Ibrutinib to Chemoimmunotherapy in CLL ", "Covid Vaxx + CLL Treatment = ?? I am 45yo and was diagnosed with CLL 5 months ago and am currently under active surveillance. There is a lot in the news about the Covid vaccine and folks undergoing CLL treatment and there have been some instances of the Vaccine not being effective or not getting the immune response a no-immunocompromised individual would expect. \n\nI am actually pretty worried about getting the Vaccine and then when I do begin CLL treatment down the road, the CLL treatment would be ineffective due to the Vaccine.\n\nI did call my doctor for advice but the response was \"We do not know\". \n\nI had Covid back in early 2020 and had a mild symptoms, mostly fatigue.   \n\nWith all the hardline talk about passports, no Jab means no job, no travel, no life..  It feels like I am being forced to choose between being ostracized or death by CLL.  \n\nI am not really sure what to do... &gt; when I do begin CLL treatment down the road, the CLL treatment would be ineffective due to the vaccine\n\nI thought it was the other way round? When one's undergoing treatment for CLL then the vaccine would not be effective?\nI do not know much I am just lurking this sub because I have a relative with CLL. Hi! From what I know it is the other way around: the CLL treatment can affect the effectiveness of the vaccine, but not vice-versa.\n\nI was on watch and wait when Covid started, but then my lab values started deteriorating. My doc then insisted that I get vaccinated before talking treatment. \n\nI am now fully vaccinated, but decided to get tested for spike protein antibodies as well as neutralizing antibodies, and both tests were negative. So, basically, it is as if I had not been vaccinated at all. That does not necessarily mean that I am not protected at all, because there may be other protection mecahnisms, but fact is the vaccine did not have the effect it has in a healthy person.\n\nWe then proceeded to treatment: Because of covid, my doc ruled out any therapy option that includes Rituximab, because it destroys your B-cells and leaves you without a functioning immune system. That is just to risky during the pandemic. So I started Venetoclax last week, as a montherapy, i.e. without Rituximab, and I can already see in my labs that it is working.\n\nSo, do not worry about the vaccine compromising the treatment. Every expert I have heard so far advises their CLL patient to get vaccinated. It cannot cause any damage with regards to the CLL. It could only be ineffective, meaning that you would still have to isolate yourself. What he said! Yeah it is the other way around. Thank you for the thoughtful reply! \n\nYou are correct, there have been reports of the Vaccine rendered ineffective by CLL treatments. I only wonder if the reverse is also possible. \n\nMy Dr's nurse said the same thing \"We recommend getting the Vaccine\". I said \"I understand but, has anyone considered the vaccine making CLL treatments ineffective?\"\n\nHer reply was \"We do not know\"  \n\nI am not sure what would be the best course of action here... I have been living with CLL for 7 years and was just treated so I am following this closely. \n\nCheck out the some of the great science based resources at  and  \n\nBoth offer some excellent evolving information on CLL and Covid.  \n\nNet is you should get the vaccine as soon as you can. \n\nGood luck and stay safe. I understand your confusion, this nurse was sending you mixed signals! All I can say from my own experience as well as from the various webinars I have watched and articles I have read is that there is no reason to believe the vaccine affects the treatment. Like I said, I was vaccinated in June and started treatment last week and the treatment works perfectly. I am not your Dr. but as someone who reads a fair amount about this specific topic I can tell you the medical community is pretty in sync about someone in your position getting the shot.  It is a, \"we are fairly sure it will help we just do not know how much,\" kind of thing.  Get the shot my dude.", "Dr. O'Brien on CAR T Cells in CLL ", "Improving Outcomes in CLL With a Prognostic Approach ", "Calquence Use Associated With Limited Heart Toxicities in Patients With Chronic Lymphocytic Leukemia ", "Select antitumor cytotoxic CD8+ T clonotypes expand in patients with chronic lymphocytic leukemia treated with ibrutinib ", "Dr Brian Koffman: It Is Critical That Patients Educate Themselves and Leverage Their Advantages ", "FDA Approves Ibrutinib Plus Rituximab as First-Line Rx for CLL ", "Successful vaccinations COVID-19 even without B cells  Does anyone understand what they are saying in this article? What is a vector vaccine vs mRNA vaccine? Would a j&amp;J be a vector vsccine?", "Expert Expands on Treatment Choices in Patients With Genomic Aberrations in CLL ", "Acalabrutinib Versus Ibrutinib in Previously Treated Chronic Lymphocytic Leukemia: Results of the First Randomized Phase III Trial ", "Patient recruitment starts for the international PRO-SID study evaluating Panzyga® for primary prophylaxis in patients with chronic lymphocytic leukaemia and secondary immunodeficiency ", "Clinical Stage at First Response May Predict Outcomes in Chronic Lymphocytic Leukemia ", "Treatment Strategies Expanding for Elderly Patients With CLL ", "New analysis method for predicting the risks and effects of immunotherapy ", "Dr. Gerson on Venetoclax/Obinutuzumab Combination in CLL ", "FDA Grants Fast Track Designation to “Switchable” CAR T-Cell Therapy ", "Data confirm efficacy of venetoclax-ibrutinib combination in chronic lymphocytic leukemia ", "Kinase inhibitors in CLL: drawing the roadmap | Blood ", "Ibrutinib/venetoclax effectivefor chronic lymphocytic leukemia ", "Risk of Progression Significantly Reduced With Upfront Ibrutinib and Obinutuzumab in CLL/SLL ", "'Driver' mutations are behind chronic leukemia's growth ", "When and How CLL, SLL Should Be Treated ", "BTK/BCL2 Inhibitors &amp; Other Novel Agents in CLL Therapy ", "Truxima Produces Savings and Comparable Outcomes for UK Patients With CLL, NHL ", "FDA grants fast track designation to CLR 131 for diffuse large B-cell lymphoma (CLL) ", "CMS Policies Concerning CAR T-Cell Therapy ", "Long-Term Data Showcase the Clinical Utility of Fixed-Duration Venetoclax/Obinutuzumab in Treatment-Naïve CLL ", "Background on Chronic Lymphocytic Leukemia and Treatment ", "FDA announces approvals for sunitinib, obinutuzumab - obinutuzumab can be used to treat CLL ", "VENCLEXTA® with Rituximab, a Treatment for Patients With Chronic Lymphocytic Leukemia (CLL), now reimbursed in British Columbia ", "Matthew S. Davids, MD, MMSc, Discusses Rationale for the MAJIC Study of Venetoclax Plus Acalabrutinib in CLL ", "Pigmentary traits, sun exposure, and risk of chronic lymphocytic leukemia: A study within the French E3N prospective cohort ", "Which population of patients with CLL might benefit most from venetoclax plus ibrutinib? ", "Woyach Highlights Long-Term Acalabrutinib/Obinutuzumab Data in CLL ", "Increased Risk of Sudden Cardiac Death of Ibrutinib Combination with Rituximab and ACE Inhibitors - Onco'Zine ", "CLL Drug Study Finds Single-Cell Analysis Can Gauge Patients' Response Rates ", "Cellectar Seeks FDA's OK to Test CLR 131 for Rare Pediatric Cancers ", "Yale Cancer Center study suggests new approaches needed to manage ibrutinib-related toxicities in CLL patients ", "Genentech Announces FDA Approval for Venclexta Plus Gazyva for People With Previously Untreated Chronic Lymphocytic Leukemia ", "The association between deaths from infection and mutations of the BRAF, FBXW7, NRAS and XPO1 genes: a report from the LRF CLL4 trial ", "Novel Bcl2 mutation leads to venetoclax resistance in progressive CLL patients ", "Chronic Lymphocytic Leukemia: Prognostic Factors at Presentation in a Resource-Limited Center. ", "IGHV Mutation Status Now Included in clonoSEQ Diagnostic Assay in CLL ", "Lindsey Roeker, MD, Discusses the Outcomes of Using Ibrutinib With Umbralisib/Ublituximab in CLL ", "New CAR T-cell Therapy Shows No Severe Toxic Side Effects ", "Awan Weighs Options for Treating a Patient With High-Risk CLL ", "Dr. Mato Discusses a Phase II Trial of Umbralisib in CLL ", "Vaccinations in CLL: implications for COVID-19 ", "Second-Line Options in CLL: Progressing on Ibrutinib ", "Acalabrutinub Sustains Benefit In Patients With R/R CLL After 42 Months ", "Gene mutations linked with death from infection in patients with chronic lymphocytic leukemia ", "High Rate of Response Noted in MCL and CLL With Cirmtuzumab Plus Ibrutinib ", "Impact of Targeted Therapy in CLL ", "Acalabrutinib Shows Benefit in Ibrutinib-Treated Relapsed/Refractory CLL ", "Venetoclax for patients with chronic lymphocytic leukemia who progressed during or after idelalisib therapy ", "Targeted Therapy Combination Well Tolerated in Relapsed, Refractory CLL ", "UK's NICE Recommends Venclyxto, Gazyva for Chronic Lymphocytic Leukemia ", "Patients With Blood Cancer Less Likely to Produce COVID-19 Antibodies After Vaccination ", "Ibrutinib Efficacy Sustained at 7-Year Analysis for CLL ", "Progress in Relapsed/Refractory CLL Could Pave Way for Upfront Advances ", "A Phase II Study of Venetoclax and Obinutuzumab as Initial Therapy for Chronic Lymphocytic Leukemia ", "Experts Offer Roadmap for Treating CLL During the Pandemic ", "Ibrutinib, Venetoclax Active in High-Risk, Seniors With CLL ", "FDA Grants Priority Review to Imbruvica-Gazyva Combo for First-line Treatment of CLL/SLL ", "Dr. Mato on the Use of Biosimilars in CLL ", "Expert Details Latest Advancements in CLL Treatment Paradigm ", "Long-term outcomes from a randomized dose optimization study of chimeric antigen receptor modified T cells in relapsed chronic lymphocytic leukemia ", "'Real-World' Data Show CAR-T Therapies Are Cost Effective ", "Frontline Triplet Regimen Induces Undetectable MRD in the Bone Marrow of Patients with CLL ", "Study: Most Blood Cancer Patients Could Benefit From Additional Dose of COVID-19 Vaccine ", "ASH 2017 Oral Abstract #493 Duvelisib emerges as a formidable treatment option in CLL/SLL ", "BeiGene Announces Data on BRUKINSA® (Zanubrutinib) from Phase 2 Trial in Marginal Zone Lymphoma and Phase 3 Trial in Chronic Lymphocytic Leukemia or Small Lymphocytic Lymphoma at the 62nd ASH Annual Meeting ", "Real-World Data Show Higher Economic, AE Burden of CLL - Cancer Therapy Advisor ", "Cirmtuzumab, Ibrutinib Therapy Well Tolerated in CLL/MCL ", "Increasing Karyotypic Complexity Linked to Poor Survival in Ibrutinib-Treated Chronic Lymphocytic Leukemia ", "Study from The Leukemia &amp; Lymphoma Society Shows COVID-19 Vaccine Is Safe But 25% Of Blood Cancer Patients Do Not Produce Detectable Antibodies ", "Studies suggest people with blood cancers may not be optimally protected after COVID-19 vaccination ", "Machine Learning Identifies Newly Diagnosed CLL Patients at Risk for Certain Outcomes - Cancer Therapy Advisor ", "Dr. Shadman on the Future of Venetoclax in CLL ", "Father (55) recently found out he has CLL, what could we expect might happen at his age? Like the title says, we just found out my dad who is 55 has CLL, but we do not know too many details yet since he is only had an initial blood drawing where they found it. Overall he is super healthy, works out pretty intensely about 5 days a week and has nothing else that would be a negative factor for his health. \n\nI do not expect too exact of an answer since we do not know many details about it yet, but if anyone has some things that we could generally expect short term and long term that would be super helpful! Nothing much happens. He will eventually need to take pills. Depends on what DNA makeup of his particular flavor of CLL. Generally speaking CLL is a pretty slow moving disease.  There are currently a bunch of very effective treatments. Speaking only for myself, I have not had many side-effects and the ones I get are pretty tolerable. \nHopefully that will be his experience as well. Good luck to yo and your dad. That is good to hear, thanks!! Good luck to you too! Depends which CLL. \n\nNext step is an oncologist to determine next steps. He could have the typical CLL which can take decades to develop to the point where treatment might be considered. He might have a more aggressive form too. Fancy bloodwork should provide this detail--test likely will not be cheap. Routine bloodwork can show elevated WBC counts, and hemoglobin and platelet counts.\n\nWorkouts are a positive. I was just diagnosed at 61. Just make sure he has a cll specialist. Some more tests to determine it is stage and just a routine followup for a while, until it shows symptoms. Could take years, even 10, before any treatment. I got diagnosed in 2015. I am now 60 and did not need treatment until April. It was a monoclonal treatment that was supposedly to last a year, but I am out after five months. I will have to do it again.\n\nMy observation is that I wasted a lot of time being afraid since 2015 and lost some friends because of it.\n\nSorry for the clichéd reference. But fear is the enemy. Maybe. My oncologist told me he had a patient who been running a 200,000 WBC for years and did not treatment because it was stable.\n\nIt is not supposed to be a problem unless it doubles in six months. \n\nIn the local ER, mine doubled from 50K to  100K in two hours. They air medivacced me out because of complications. \n\nAs my mother used to say, fuck your luck. All true comments.   My cll diagnosis was Oct 2017.   I am still on a wait and see program.  Regular check ups every 3 months.   Stay chill.  Stay off the internet.  Get a good support system of friends. Wow that sounds rough, hopefully everything’s alright now! I am Rolling.\n\nThe best thing is to make sure you have a competent oncologist and skilled staff. I was diagnosed in 2016 at 56 years of age and did not need treatment until this year.  I highly recommend your dad see a CLL specialist because there are a number of different genomic markers that can predict how the disease will evolve over the next few years.  For instance, I have an unmutated IgVH which will direct which treatments I should consider.\n\nHere is a listing of CLL Doctors from the Lukemia cociety \n\n", "Ublituximab Plus Umbralisib Granted BLA for CLL and SLL Treatment ", "New Data Demonstrate the Continued Clinical Benefit of Fixed-duration, Chemotherapy-free Venclexta-based Treatments in Chronic Lymphocytic Leukemia ", "Promising Clinical Activity Seen in Single Agent and Combination TG-1701 in CLL and Other B-Cell Malignancies ", "Dr. Choi on the Utility of Duvelisib in CLL ", "High Response Rate Found in Heavily Pretreated, High-Risk CLL With Liso-Cel ", "Ibrutinib delays progression versus chemoimmunotherapy in older CLL patients ", "Benefit From MURANO Trial in CLL Sustained With Subsequent Therapy ", "Epigenetic Factors Determine the Characteristics of B-Cells | What is Epigenetics? ", "Researchers detect a loophole in chronic lymphocytic leukemia treatment ", "Numbers have changed drastically in 2 weeks. I am in the process of being diagnosed, with all signs pointing to CLL. My Lymphocyte count has been up for the last year or more and my doctor referred me to a Hemotologist who looked at my blood work results from 10/23 and ordered her own set, which I had done on Friday morning. The results are now showing up in in my MyChart and it is Sunday, so I will not hear back from the doctor until at least tomorrow. My Lymphocyte count went from 61% to 70%,and my neutrophils went from 30% down to 22% in the last two weeks. Am I right to be extremely concerned? You are not going to get much response on this forum, unfortunately. It is mostly a place where research is shared about CLL. Nobody can really tell you whether or not you should be concerned. Percentages also do not say a whole lot, at least not for me. I think the fact that this disease is mostly an older adult disease makes it such that those folks do not tend to use Reddit. But if you have questions, I can try to answer. I would just chill until I talked to my doctor about it though. Hi, yes this is mainly the place to see any news related to CLL. But as a 53yo person who has CLL  will tell you one thing and that is do not over think it and cause yourself extreme worry. \nWaiting for results is a pain in itself, see what the numbers are when you get them and ask your doctor every thing you want and have them explain. I have been living with it for 2 years, numbers steadily going up, no treatment of any kind yet. Changed my diet. Trying to exercise more, fatigue is my biggest problem. \nWords that you will probably hear from your doc is to W&amp;W watch and wait. This disease is a cruel one imho, it will not kill me it just makes you feel miserable. I apologize if my post has not helped you ease your mind. I am always here so if you want send me  message and I can answer some of your questions. Also will post a forum that deals with CLL patients and is pretty great place for information. Thanks. Would love that forum link. Health Unlocked, search for CLL Support forums", "BTK Inhibition in CLL: Successes and Challenges ", "CAR-T concerns for Novartis as Kymriah identified out of spec ", "FDA Grants Fast Track Designation to CAR T Therapy for B-Cell Malignancies ", "The Impact of Telemedicine and Access to Leukemia Experts: Insights on Patient Behaviors to be Presented at the American Society of Hematology 61st Annual Meeting  Congratulations Dr. Brian Koffman on the success of your ExpertAccess program!", "Drug Duo Granted Priority Review for CLL Treatment ", "Zanubrutinib Shown Noninferior to Ibrutinib for Patients With R/R CLL/SLL ", "A 17-gene expression signature to distinguish patients who are likely to achieve long-term remissions following front-line FCR chemoimmunotherapy from those who might benefit from alternative regimens ", "Celgene filing plans potentially mean two more CAR-Ts on the market by end of next year - MedCity News ", "Dr Lindsey Roeker: Novel Agents Have Revolutionized CLL Treatment ", "Ibrutinib Combination Therapies for Patients With CLL ", "Venetoclax/Rituximab Combo Demonstrates Sustained Benefit for Retreated Patients with CLL ", "Dr. Ma on Developing Novel Agents in BTK Inhibitor–Resistant CLL ", "Outcomes of the phase I/II REVLIRIT CLL-5 AGMT study in patients with CLL ", "CLL: Treatment Paradigm Shifts and Impact on Outcomes (First in Nine Video Series) ", "Abs Lymphocytes count M21, 5'11, 165 lbs, USA(Cali, La), Asian Indian decent. Dermatologist diagnosed me with Seborrheic dermatitis 2017 (do not know if this is relevant ). Had benign pituitary tumor that has shrunk ever since the finding as the endocrinologist said she does not even consider it a tumor anymore.\n\nMy absolute lymphocytes count has been gradually increasing as I have noticed for the last 3 blood tests. The normal range on my panel is said to be between 850-3900 cells/uL. On 1/10/18 it was in the normal range of 3015 cells/uL but ever since, the next 3 have been 3908 uL (6/19/18), 4036 uL (8/2/18), and now at 4378 uL (12/28/18). Everything else seems to fall under the normal range such as WBC, RBC, hemoglobin, platelet count, abs neutrophils, abs monocytes, abs eosinophils, abs basophils and nucleated RBC. Neutrophil % at 42.6, lymphocytes at 45.6 %, monocytes at 6.7%, eosinophils 4.8%, and basophils at 0.3%. Vitamin levels are also normal with the exception of vitamin D which is at 27 L (normal range 30-100 ng/mL). What can this high abs lymphocytes count be indicative of? A bit worried. 165.0 lbs ≈ 74.8 kilograms ^(1 pound ≈ 0.45kg)\n\n\n\n^(I am a bot. Downvote to remove.) \n\n_____\n\n  ^| ^( ^| ^( ^| ^( ^| ^( ^| ^( ^|", "Part 2: Supporting Data for Ibrutinib-Based Regimens in Frontline CLL ", "Is CAR-T Really Putting Us On Road to Gene Therapy? ", "Exploring Novel Ibrutinib Combinations in Clinical Trials for CLL ", "Dr. Barr on the Implications of the Long-Term Results of the RESONATE-2 Trial in CLL ", "Fixed-Duration Venetoclax Plus Obinutuzumab Improves PFS With High Undetectable MRD Rates in CLL ", "Dr. Furman on the Safety of Acalabrutinib in Hematologic Malignancies ", "Gilead reaches deal for Yescarta coverage in England ", "Ibrutinib plus Venetoclax Combo Treatment Effective in Relapsed CLL ", "Acalabrutinib/Obinutuzumab Prolongs PFS vs Ibrutinib and Venetoclax Combos in CLL, Meta-Analysis Says ", "Venetoclax Outperforms Standard Chemo-Immunotherapy in the Treatment of Relapsed/Refractory CLL - ASH Clinical News ", "IVIG. Anyone have any experience with it? My Dad was diagnosed with pretty early stage CLL a year ago. He is 67. He has had a cold that has been lingering for over a week so his doctor recommended receiving IVIG treatment to boost his immune system. Has anyone has any experience with the treatment? Side effects? I would be interested to hear about this as my husband is 69 with early CLL. Concerned about viral infections in the fall. Hope some members have some input. 69? Nice. \n\nI am a bot lol. Do they know how long he is had CLL? If they think he is had it since relatively close to the diagnosis, that seems early to need IVIG to me. \n\nObviously everyone is different. I have got somewhat bad markers and have had CLL for at least 6 or 7 years and never needed IVIG. I am also 30 years younger than your dad.\n\nI know others who do it during the fall and winter months every year and it seems to work well.  \n\nCheck with his insurance too. The cost can vary greatly. In the US, one treatment can easily be $8,000. 😔 They actually find out he had it by accident. They took a mole off his face and sent it in for biopsy and noticed something off with the white blood count. Further tests showed it was CLL. They said it was very early and most likely would not have to do anything serious for many many years. It seems that the IVIG is just precautionary to get him through this cold. Yes!  Just this year.  I kept getting sick and the doctor looked at my numbers and said, “You are really low”.  I also then looked at the numbers because I will be honest with you, I did not know what the igG blood test meant.  So, my number was less than sixty, and normal range is above. 550.\n\nI had a sinus infection during my first infusion, and the antibodies swarmed to where I was infected and made my face puff up.  It was a terrible drive home.  (I had taken a nap in my car before the long drive back, and took a Benadryl to make the swelling go down).  Post nap was better, and I rested the next day.\n\nAfter that, the infusions were much better because I was no longer so sick from having lack of antibodies.  I am going in next week to get some more.  It is a life changer and it is nice not to have major sinus infections that will not go away.\n\nEdit:  the reason my doctor started the treatment was because I told her I had been sick for two solid months, January and February, and I had asked her for antibiotics.  She did not want to give them to me and scheduled the igG infusion.   In the days leading up to it, I had gone to Texas and while I was there I went to a minute clinic to make the infection go away, but it came right back when I got back from Texas.  Then, the first infusion of igG happened (I had one infusion a month for about four months) and I have been healthy ever since. I think it is probably relative to the person as to whether they need it or not.  Everyone is immune system and blood will handle things differently.  I did not remember getting igG infusions ever until this year.  But maybe I had and did not remember, before.  I was really sick in 2019 and 2020.", "AbClon confirms differences of its CAR-T drug from existing treatments ", "Acalabrutinib Demonstrates Less Toxicity Burden Than Ibrutinib in CLL ", "Acquired Mutation in BCL2 Confers Resistance to Tx in Progressive CLL ", "Upfront Duvelisib Plus FCR Shows Promise in Younger Patients With CLL ", "Current Approaches to Assessing Patients With CLL  ", "Fixed-Duration Venetoclax-Obinutuzumab for Untreated Chronic Lymphocytic Leukemia - Hematology Advisor ", "Most Medicare Beneficiaries With CLL Diagnosis Do not Get Therapy, Claims Analysis Finds ", "Starton Therapeutics moves closer to treating CLL by selecting lead formulation candidate ", "Dr. Jain on the Combination of Venetoclax and Ibrutinib in CLL ", "Dr. Abedin on Managing Cardiac Toxicities With Acalabrutinib vs Ibrutinib in CLL ", "Ibrutinib plus fludarabine, cyclophosphamide, and rituximab (FRC) as initial treatment for younger patients with CLL ", "Dr. Wierda on the Safety and Efficacy Results of the TRANSCEND CLL 004 Trial in CLL ", "Dr. Seymour on the PFS Benefit With Acalabrutinib With or Without Obinutuzumab in CLL ", "Maybe CLL? So I am male 23 years old I started having really bad headaches about 2 weeks ago so I decided to go to ER. They did a CT brain scan as well as CBC. Ct scan was fine I was told nothing abnormal, until I looked at my CBC I started to worry. I might have CLL. Anyone who knows how to tell or can give me any info please let me know. My blood showed smudge cells as well as Variant lymphocytes. My WBC is 11.4k, my mean platelet volume is 9.6, segmented neutrophils 44%. Lymphocytes 35% with 8% atypical lymphs. Everything else came in the NORMAL range. It also stated poikilocytosis and anisocytosis. The only person you should get a diagnosis from is a doctor,  and a specialist at that. If you or your doctor is concerned, ask for a referral to an oncologist/hematologist. Do not take internet advice or just start googling symptoms. \nDiagnosing CLL is not something you can do on your own. I will have additional test this upcoming week. I just wanted to know if anyone had an idea or information since I get anxious easily I definitely understand, but do yourself a favor and do not get ahead of yourself. I have seen what incorrect over diagnosis can do to a person. It will drive you crazy. \nTake things as they come, one at a time. Do not worry until it is time to worry. This disease (as well as others) are complex and nuanced. I was first diagnosed 20 years ago. I was cancer free for 19 years after treatment. It is back and my treatment options are even better than the first time.\nGood luck to you. I sent you a message, if you can help out by replying if not thanks for your time! I agree with others that you need an assessment from an oncologist. \n\n11.4k is close to the high end of normal \n\n\nI hit 146k this year before. I had to start chemo.. Which has been very effective with no side effects. \n\nBut yes you need analysis from an oncologist.. Not your GP. \n\nWishing you well. \n\nOne good source of info is the cll section of Health unblocked website. I will second the others. Definitely do not start googling and diagnosing yourself. Just keep doing your tests and take it day by day.\n\nYour WBC is still close to normal. I am sitting around 200k right now and still have not had treatment. \n\nPing the subreddit when you find out more and we can surely point you toward some resources if you need them. So I am a 43 year old male that was diagnosed with CLL 7 months ago. I went to the doctor because I have a lump in my throat. The primary care physician I was seeing at the time insisted that I googled what could be wrong with me after my first round of blood work came back off. So I did, let me tell you it was the worst thing I could have done. The last appointment I had with that doctor she had me convinced I had a stage 4 cancer and basically told me good luck. Point of the story is that primary care physicians are not oncologists. Only trust what a oncologist has to say and always get a second opinion. I know what you are going through sucks, but trusting anyone aside from a expert will only cause you unnecessary stress and pain. That is great for you. I just went through the same thing at the ER. I am 30 and a tad scared right now. I will be going to my doctor next week to get more bloodwork. I had my last bloodwork 3 months ago and everything was normal but now WBC count and smudge cells and lymphocytes are all elevated. Did you have blood work at the hospital or was it referred from your doctor? The elevated bloodwork was from the ER yesterday. 3 months ago was at my primary doctor’s when everything was normal You said you are 30? How elevated are the results? I am not a doctor but I can give yoi the info I was given", "Novel Agents Lead to Changes in Therapeutic Strategies and Sequencing for CLL ", "Ibrutinib Remains Well Tolerated in Elderly Patients With CLL at 5-Year Follow-Up ", "EHA25Virtual: Advances in Treatment of High Risk Chronic Lymphocytic Leukemia ", "Less Intensive Monitoring of Venetoclax May be Safe in Low-Risk CLL ", "Dr. Siddiqi on the CLL14 Trial Results in CLL ", "Ibrutinib, Rituximab for Patients With CLL Superior to Standard Chemoimmunotherapy ", "Coutre Evaluates Treatment Options in Relapsed/Refractory CLL ", "Envisioning the Role of Combination Therapy in the Treatment of CLL: A Q&amp;A With Philip Thompson, MB, BS ", "Dr. Danilov on the Utility of BTK Inhibitors in CLL ", "Children, young adults experience ‘rapid improvement’ in quality of life after CAR-T for ALL ", "Dr. Danilov on the Safety Profile of Entospletinib Plus Obinutuzumab in CLL ", "CLARITY phase II trial on ibrutinib and venetoclax combo in R/R CLL ", "Dr. Woyach on the Results of the ELEVATE-TN Trial in CLL ", "A Tool to Select Candidates for Allogeneic Hematopoietic Cell Transplant in CLL - Oncology Nurse Advisor ", "Tracking the epigenetic evolution of a cancer, cell by cell | Cornell Chronicle   (", "Non-Steroid Treatments Lead Progress in GVHD Management ", "Aunt just diagnosed - has no RX insurance... Hello all,\n\nThanks for taking the time to read. My Aunt was recently diagnosed with CLL and is incredibly anxious more so to the cost of treatment than the treatment itself. They are saying they are going to start her on Imbruvica - Her insurance does not have pharmacy coverage it just rolls into her deductible that is part of her medical benefits. I was able to find a place for her to apply for support from the PAN foundation, but thought I would ask her if anyone else has other sites she can visit for support. \n\nI am trying to help find mental support for her to with groups and things of that nature. CLLSociety.org has been extremely helpful with information as well. \n\nAgain, thank you and keep fighting the fight. Yeah I was going to say CLL society and patient power. CLL society is such a strong support group and when my mother was diagnosed they really came through for us. Not really much of a support group on reddit, id push her to CLL society and have her engage in the conversations, she will find so many helpful people eager to guide her in the right direction from all over the world and they know a ton about insurance coverage and all the loops. Also CLL Forum Thank you so much. I hope things are going well for your mom. Ok, thank you! Been living with this disease for 13+ years with no treatment.  Has not been entirely a walk in the park but best to your aunt. Having a specialist who does nothing but CLL is really quite important. So whatever has to be done to achieve that is key. And it seems being extra cautious with other cancers is huge too. (No smoking, sunscreen, etc) we are very successive to second primary malignancies, up to 36% more than the general population in some studies. I hope hers is as uneventful as mine. Your welcome and yes things are great thank you. I know the feeling of the newly diagnosed, but try to be optimistic because the treatment for CLL in particular has really progressed in the past 5 years and your aunt has some amazing options available to her. I truly believe that we are less than 2 years away from a cure with these combo therapies. Make sure your mother is keeping up with her vaccinations like shingles and pneumonia. Have her load up on EGCG and tumeric, in lab rats they are natural CLL cell killers at a higher dose, it probably will not cure but it will help keep the numbers in line. Exercise is also one of the most proactive things you can do to put you at the best odds for success in your treatment stage. Also, do not settle for a hematologist/oncologist, go and seek a reputable CLL specialist. I really hope this helps a little I am just trying to convey to you what I found helpful from the support group and our specialist. Feel free to reach out anytime. Oh man, that is inspiring to hear. Thank you. Her neck is incredibly swollen so they are looking to start treatment ASAP. It is also in her blood and marrow - but hoping it does not have a major impact on her quality of life.", "Acalabrutinib Plus Obinutuzumab Prompts High Response Rate in Patients with CLL ", "Any other teachers here? I teach 4th grade in a New York suburb and I have been remote teaching since December even though the rest of the school is in person. Now that everyone is getting the vaccine and the students are all back full time, the district wants me back in person full time. \n\nThey are offering all the safe guards etc but a whole class had to go remote last week because a student tested positive. \n\nI feel like besides the vaccine the only thing that has changed its that time passed, and it is still not very safe. The fact that those of us with CLL do not respond as well to the vaccine as everyone else and that is we do get covid the prospects are not good makes me very worried. \n\nSo I am curious if there are any other teachers here who have CLL and are working in person or not. What has it been like for you?\n\nI am finally getting my first vaccine shot today. I would love to go back even for the last couple of months of the school year but I am practically terrified. I would love to hear from anyone else in a similar situation.", "Danilov Discusses Therapies for Relapsed/Refractory CLL ", "CAR-T therapy with or without conditioning chemotherapy: Results from a phase I trial ", "Ublituximab Plus Umbralisib Considered for Treatment of CLL/SLL by FDA ", "ASH 2020: Dr. Wierda Discusses Phase 2 CAPTIVATE Study Data ", "Prediction of Outcome in Patients With Chronic Lymphocytic Leukemia Treated With Ibrutinib: Development and Validation of a Four-Factor Prognostic Model ", "Venugopal Considers BTK and BCL2 Inhibitors in Patient With CLL ", "Dr. Smith on Frontline Treatment Considerations in CLL ", "LLS Statement about UK Study on Vaccine Efficacy in Cancer Patients  I had a negative test for antibodies after 2 doses of Pfizer.", "Dr. Ghia on the Results From the 2-Year Follow-Up of the CAPTIVATE Study in CLL ", "Real‐world outcomes for 205 patients with chronic lymphocytic leukemia treated with ibrutinib | MDLinx ", "Study: CAR T-cell therapy safe and effective in youth with leukemia ", "Venetoclax, obinutuzumab combo meets objective in phase 3 trial in CLL ", "Venclexta-Rituxan Combo Continues to Show Survival Benefit Through 5 Years in Relapsed/Refractory CLL ", "Chronic Lymphocytic Leukemia Treatment Decision Making With Venetoclax-Based Therapy - Hematology Advisor ", "Dr. Abedin on PI3K Inhibitors in CLL ", "John Byrd, MD, Discusses Acalabrutinib vs Ibrutinib for Patients With CLL ", "Frontline Ibrutinib/Venetoclax Combo Leads to High Rates of Undetectable MRD in CLL ", "Acalabrutinib Plus Obinutuzumab Prolongs PFS Compared to Other Targeted Agents in CLL ", "Ofatumumab Plus Ibrutinib After Bendamustine Debulking Effective, Tolerable for CLL ", "Various Diagnostic Criteria by PET/CT May Assist in Predicting Richter Syndrome in CLL ", "CLL Experts Favor Social Distancing, but Vary on Treatment Continuation Amid Pandemic ", "Hematology Experts Review Impactful Data from 2019 ASH Annual Meeting ", "Startup gets NCC's T-cell-based immunotherapy developing tech - Korea Biomedical Review ", "Indolent chronic lymphocytic leukemia: What to Know (Indolent vs. Aggressive) ", "Oncternal Therapeutics Announces Presentation of Clinical Data Update on Cirmtuzumab in Combination with Ibrutinib at 2019 ASH Annual Meeting ", "A tiny pill saved my life, but at $180,000 a year ", "Interesting Stuff. June 29 2021.. (", "Scoring the Risk for Heart Problems in CLL: An Italian Model - Cancer Therapy Advisor ", "Dr. Mato on Ibrutinib-Based Combinations in CLL ", "Novartis Kymriah® demonstrates consistent efficacy and safety outcomes in US patients when used in real-world setting ", "Part 2: BTK Inhibitor Options for Frontline CLL ", "European Hematology Association- First-Line Ibrutinib + Venetoclax Is Superior to Chlorambucil + Obinutuzumab for Chronic Lymphocytic Leukemia/Small Lymphocyte Lymphoma ", "FDA Clears clonoSEQ Assay to Evaluate MRD in Patients with CLL ", "Dr. Choi on Emerging Treatments in CLL ", "Dr. Woyach on Treatment Challenges in CLL ", "Nirav Shah, MD, Discusses Dual-Targeted CAR-T Therapy for NHL, CLL  Interesting they managed to not say what the other target is. I think they were referring to anti-CD20 CAR-T therapy and anti-CD19 CAR-T therapy used in tandem as a dual.  You can read more about it here (", "Ibrutinib Plus FCR Promising First-Line Treatment for Certain Patients With CLL ", "Ibrutinib Therapy Demonstrates Sustained PFS, OS in Patients With CLL/SLL ", "Notable CLL Abstracts and Trials from ASCO 2019 ", "BTK Inhibitors in Chronic Lymphocytic Leukemia ", "COVID-19 Pandemic Restructures Care in CLL ", "Umbralisib Shows Promise Among Patients With CLL Intolerant to BTK, PI3K Inhibitors - Hematology Advisor ", "AbbVie's Imbruvica successful in late-stage leukemia study ", "Expert Discusses Challenges, Risks of Ibrutinib as Chronic Lymphocytic Leukemia Treatment ", "Front-line acalabrutinib regimen appears safe, induces complete response in chronic lymphocytic leukemia ", "A Five-Year Analysis of Randomized Trial Comparing Venetoclax-Rituximab Versus Bendamustine-Rituximab in CLL ", "Ofatumumab to Be Available Through a Patient Access Program for CLL ", "Dr. Rogers on the Safety Profile of Ianalumab/Ibrutinib in CLL ", "What questions do I need to ask the doctor? My father was recently diagnosed with CLL. \n\nI am going with him to the hospital in a few days to make sure he gets all the relevant information he needs. \n\nWhat questions do I need to ask the doctor?  I am do not know if you already know about these sites. Here are some questions which you might find useful and want to ask the doctor.\n\n(\n\n(\n\nCLL is a very individual cancer. Some people can live many years without needing treatment others need treatment fairly quickly.\nA proper assessment in which Stage the CLL of your father is and if he needs treatment are important things your doctor should tell you of course. If he does not need treatment at the moment (watch and wait phase) there should be nevertheless reaccuring checkups to analyse how his CLL is developing. \nIf he needs treatment there are possibly multible treatment options available. Before you choose to move forward with a treatment i would certainly recommend to get a second oppinion from a different doctor. \n\nYou should also ask the doctor if he intends or already did tests regarding the  ( which test for genetic abnormalities. The results of these tests can give some better indication which treatment should be chosen if necessary. \n\n( is also some information about certain test which should/ can be performend when analysing the CLL (includes some info regarding the FISH test).\n\nIf you are interested in current developments regarding cll research and treatments I would recomment to subscribe to this sub and the old sub r/CLL_Leukemia/.\n\nHope some of the information is helpful for you and if you have some questions just ask away. :) Thank you so much – this is very helpful!", "Association between ibrutinib treatment and hypertension ", "Efficacy Data Support Acalabrutinib Across CLL Settings ", "UCLA Opens Clinical Trial of Bispecific CAR T-cell Therapy for CLL ", "New CLL Survival Milestones Reached ", "Venetoclax-Obinutuzumab Significantly Improves Chronic Lymphocytic Leukemia Survival ", "Acalabrutinib Improves PFS in Relapsed/Refractory CLL ", "Hillmen Highlights Acalabrutinib’s Tolerability Vs Ibrutinib in Previously Treated CLL ", "Zanubrutinib Improves Outcomes Compared With Ibrutinib in R/R CLL/SLL, ALPINE Study Shows ", "Ibrutinib Combo in Chronic Lymphocytic Leukemia is Superior, but Costly  Do you have call? Have you done this treatment?", "AstraZeneca’s CALQUENCE® (acalabrutinib) Shows Potential in Chronic Lymphocytic Leukemia Trials ", "Dr. Logan Discusses Acalabrutinib in CLL ", "Induction radiation therapy before CAR-T reduces treatment-related toxicities ", "Liso-Cel/Ibrutinib Combo Improves Efficacy in Relapsed/Refractory CLL ", "Tumor Mutational Load Can Help Fine-Tune Prognoses in CLL ", "With Longer Follow-Up, Responses Deepen for Acalabrutinib Combo in CLL - Cancer Therapy Advisor ", "Top 5 Most-Read Leukemia and Lymphoma Articles for 2020 ", "Inflection Biosciences' dual mechanism inhibitor shows promise as treatment for CLL ", "Designing a Clinical Trial to Evaluate Multistage Treatment Approaches in CLL - Cancer Therapy Advisor ", "iLLUMINATE: Superior PFS With Ibrutinib&amp;ndash;Obinutuzumab Even in High-Risk, Untreated CLL/SLL ", "ICER Views CAR-T Therapies Kymriah, Yescarta As Cost Effective ", "Uncertain protection from Covid vaccines leaves cancer patients in limbo ", "Acalabrutinib for Treatment-Naive and Relapsed/Refractory Chronic Lymphocytic Leukemia ", "Cheson Considers the Most Effective Therapeutic Strategies for Patients With Follicular Lymphoma ", "Pirtobrutinib Mechanism of Action in CLL and SLL ", "Risk-Adapted Bendamustine and Rituximab: An Alternative for Older Individuals With CLL - Cancer Therapy Advisor ", "Dr. Fakhri on the Use of PI3K Inhibitors in Relapsed/Refractory CLL ", "Dr. Ghia on the Clinical Implications of the CAPTIVATE Trial in CLL ", "Chronic lymphocytic leukemia cells impair mitochondrial fitness (Source Linked) ", "Immunotherapy Toxicities: Early Recognition and Management ", "ASCO: AbbVie, J&amp;J pad Imbruvica's CLL case with Venclexta fixed-duration combo data ", "Ibrutinib-Based Combos Improve PFS Vs Standard BR in Elderly Patients With CLL ", "When CLL meets COVID-19 | Blood | American Society of Hematology  They really need to compare data for people who have only CLL. Not everyone with CLL is old as the hills and with four other comorbidities. Yeah, as a 40 year old with treated CLL, it would be nice to know how my peers are doing.   \n\nDoes the delayed immune response happen in people like me too?   Colds / flu are usually not a big deal, for example. Just by way of example i have none of the health conditions they cited. I am overweight and have CLL 53yrs old. Median age I have seen in a Covid CLL study was 70 with HBP and like two other conditions.", "Liso-cel With Concurrent Ibrutinib Shows Early Outcomes Improvement in R/R CLL ", "TG Therapeutics, Inc. Presents Phase 2 Data Evaluating Umbralisib in CLL Patients Intolerant to Prior BTK or PI3K Delta Inhibitor Therapy at the 23rd Congress of the European Hematology Association (EHA) Nasdaq:TGTX ", "FDA accepts BLA for ublituximab + Ukoniq in leukemia and lymphoma indications ", "If at first you do not succeed: Testing outcomes of second CAR T-cell infusions ", "Dr. O'Brien on Sequencing Small Molecule Inhibitors in CLL ", "Part 5: Venetoclax and PI3K Inhibition for Relapsed/Refractory CLL ", "Treatment Standards for Patients with Chronic Lymphocytic Leukemia ", "Dr. Smith on PI3K Inhibitors in CLL ", "TG-1701 Induces Strong Response Rates, Fewer AEs in Relapsed/Refractory CLL ", "Access to this page has been denied. ", "Stress Linked with Biomarkers of Poor Prognosis in CLL ", "Dr. Kahl on Considerations for Treatment Strategies in CLL ", "Duvelisib Granted Positive EU Opinion for Relapsed/Refractory CLL and Refractory Follicular Lymphoma ", "Ibrutinib Interruption Tied to Worse Outcomes in CLL  I had to discontinue my daily Imbruvica in order to have spinal surgery. After surgery my CLL was\n seriously out of control. So my oncologist switched me from Imbruvica to Gazyva and IVIG.", "Age-Related Recommendations in CLL Therapy ", "Understanding Imbruvica - SURVEY SURVEY LINK: (\n\nI am a graduate student working on a research project to evaluate the real-world perceptions of Imbruvica(ibrutinib). I am hoping to identify barriers to treatment, or unmet needs in people with the indicated conditions, in order to improve access to innovative therapeutic products. Any and all data collected is anonymous and we request you do not include any self-identifying information. I would really appreciate your input if you could take 5 minutes to fill out this survey. Thank you in advance! Done. Missing a few key things.  \n\nBarriers to adoption are social determinants of health like being able to pay co-pays.  That is above and beyond all other things.\n\nElderly doctors and their out of date clinics not following nccn 2018 prescribing guidelines or doing the tp-53 tests.  I asked for the test to guide my treatment plan and they refused. \n\nAlso, second generation pills like Venetoclax are now available that seem that be superior in most regards except side-effects and cost.\n\nAlso it was not clear that the this was for current patients with the med until partway through the survey.", "U.S. Medicare plans to track CAR-T cancer therapy outcomes ", " Dr. Kanti Rai to offer lecture at Emanuel on \"What Is New in Diseases of the Blood\" ", "Nitin Jain, MD, on CLL: Results From a Venetoclax/Ibrutinib Trial ", "Fungal infections uncommon among ibrutinib-treated patients despite low rate of prophylaxis ", "Test 'could change how cancer treated' ", "Four Things to Know About Providing CAR T-Cell Treatment ", "Dr. Modi on the Utility of BTK Inhibitors in CLL ", "CLL patients at higher risk of melanoma ", "Stratifying Patients With CLL to Frontline Therapy ", "Investigating CAR-T Efficacy Limitations in Chronic Lymphocytic Leukemia - Cancer Therapy Advisor ", "Dr. Brander on Targeted Agents in CLL ", "Reproductive health after CLL **If you were diagnosed with cancer between ages 18 and 49, please share your experiences in a** **confidential, 30-minute online survey** to help us learn more about how cancer and its treatments may impact reproductive health, here: (\n\nWith the Reproductive Health After Cancer Diagnosis and Treatment (REACT) Study, we hope to gather valuable information from individuals like you that will help us to better understand the highest needs and concerns are related to reproductive health—specifically for individuals diagnosed with a cancer before age 50.\n\n", "Ibrutinib plus chemoimmunotherapy confers durable responses in younger patients with CLL ", "Stratifying Patients With CLL by Stage and Risk Status ", "Higher CAR T-Cell Dosage Improves Efficacy Without Toxicity in Relapsed or Refractory CLL ", "Calquence Linked to Fewer Heart-Related, Other Toxicities in Patients With CLL Than Imbruvica ", "Patient-Reported Outcomes Considered During FDA Clinical Reviews ", "Dr. Wierda on Ongoing Research Efforts Examining Fixed-Duration Strategies in CLL ", "Venetoclax/Rituximab Maintains PFS Advantage With uMRD in Relapsed/Refractory CLL ", "The Leukemia &amp; Lymphoma Society Michael Garil National Patient Registry   A unique opportunity for blood cancer patients to join LLS to increase  scientific knowledge about how COVID-19 and COVID-19 vaccines affect  them. How does a patient register for this group&gt; I am on a computer and when I click the link there are 3 red button to click that say, \"Join Today\".  Not sure if it is the same on mobile.  Click the link in the post.", "Phase I Trial Finds Experimental Drug Safe in Treating Chronic Lymphocytic Leukemia ", "Novel Approaches to Treating Relapsed/Refractory CLL ", "Predictive Value of Select Gene Mutations Demonstrated in Phase III CLL Study ", "CLL and MCL Survival Benefit From Umbralisib Plus Ibrutinib Holds Up in 4-Year Follow-Up ", "VIDEO: Early steroids may reduce severe side effects among patients who receive CAR T-cell therapy ", "How Durable Are CAR T-Cell Therapies? ", "FCR Still an Option in IGHV-Unmutated CLL? ", "Venetoclax and Rituximab Sustains Survival Benefit After 5 Years in Patients with CLL ", "CLL Responds to Induction With RCC Regimen Plus Rituximab Maintenance | Cancer Network  ", "Zanubrutinib Tops Ibrutinib in Relapsed or Refractory CLL — Better overall response rate, less cardiotoxicity, with second-generation BTK inhibitor ", "Stunning therapy lands knock-out blow to cancer ", "Real-World Data: Ibrutinib Improves Outcomes vs Chemoimmunotherapy in CLL - Cancer Therapy Advisor ", "Dr. Smith on Using Venetoclax Versus Ibrutinib in CLL  This is really nice to know!", "Khan Implements a Treatment Plan for a Patient With CLL ", "Novel Agents Show Enhanced Efficacy Across CLL Subtypes  ...I cannot think of a way to simplify this any further.", "Insurance coverage for CAR-T cell therapies from Novartis, Gilead get Swiss Govt nod ", "Imbruvica And Rituxan Bests Standard-of-Care Regimen in Patients With Previously Untreated CLL ", "Scientists identify protein markers related to the most common form of leukemia ", "Gene Expression Approach Using Residual Cells Feasible for Future CLL Studies - Hematology Advisor ", "High Overall Response Rates Achieved With Cirmtuzumab/Ibrutinib in MCL and CLL ", "EU Panel Endorses Duvelisib for CLL and Follicular Lymphoma ", "Toxicities Increased for Patients Receiving CLL Therapy in the Real-World ", "Evaluating Neutropenia Prevalence After Venetoclax Therapy for CLL ", "Rare manufacturing glitch raises concern over CAR-T therapies: study ", "Real-World Patterns of TLS After Second-Line Therapy Dose Escalation for CLL ", "Beware of the CAR-T Hitches ", "Dr. Burger on Choosing Frontline Therapy in CLL ", "Survival Benefit at 7 Years Reported With First-Line Ibrutinib for Chronic Lymphocytic Leukemia ", "Anti-PD-1 Plus Umbralisib/Ublituximab Hits 90% Response in CLL ", "Investigators Look to Enhance Response With Novel Triplet in CLL ", "Dr. Bhat on the Role of Targeted Therapies in CLL ", "AbbVie Receives Positive CHMP Opinion for Novel, Chemotherapy-free Combination of VENCLYXTO® (venetoclax tablets) with Rituximab for CLL ", "Early Disease Progression Predicted Worse Survival in CLL | Cancer Network ", "Canada sets reimbursement for AbbVie's Venclexta for CLL - AbbVie Inc. (NYSE:ABBV) ", "FDA clears IND application for CAR-natural killer cell therapy to treat B-cell malignancies ", "Janssen Receives CHMP Positive Opinion for Expanded Use of IMBRUVICA® (ibrutinib) in Combination with Rituximab for Previously Untreated Patients with Chronic Lymphocytic Leukaemia (CLL) ", "Acalabrutinib produces durable remissions, long-term tolerability in treatment-naive CLL ", "Combination Therapies Poised to Improve CLL Treatment Landscape ", "Roche/AbbVie combination better than chemo in CLL ", "CAR NK-Cell Therapy Induces Clinical Responses in Patients With CLL ", "BOVen Produces High Levels of MRD in Patients with SLL/CLL  ", "Dr. Pleyer on Ongoing Research With Ibrutinib Plus Venetoclax in CLL ", "The Evolving Role of Prognostic Markers for CLL in the Era of Novel Agents ", "Ibrutinib/Venetoclax Triplet Demonstrates Frontline Activity in High-Risk CLL ", "Frontline Ibrutinib/Chemoimmunotherapy Induces Deep Response in Young CLL Patients | Cancer Network ", "Prior Use of Novel Agents Does Not Affect alloHCT Outcomes in CLL - Cancer Therapy Advisor ", "Dr. Woyach on Ongoing Research With BTK Inhibitors in CLL ", "Please share your diagnosis recommendations I have been on the CLL Society page which is a wonderful resource. I have had two CBCs this month, waiting on results from the third which I am fairly certain will be consistent with the first two. Atypical lymph on #1 was 48 “critically high”. Smudge cells were found on #2.  \n\nI think the next step will be a referral to a hematologist. Do I see a hematologist or go to a CLL expert to get the proper diagnostic tests?  Second question is where?  I currently live in Nashville but planning to move to Tampa once COVID is over (early to mid 2021). Do I get tested in Nashville and take my records to Moffitt or do I go straight to Moffitt to avoid having to repeat tests. It is a lot to absorb at first. The CLL Society covers everything, but one of their support groups will help you get a grasp of it in time. Go to a CLL expert! General oncologists do not have a grasp of the intricacies of CLL or the latest treatment options. An expert can also get you into clinical trials. I am having success with a treatment that I would not have gotten from my first oncologist...actually I would be in terrible shape now if I had stayed with that doctor. I switched to a CLL expert and that gave me my life back, possibly saved my life. The CLL Society has the list for you to find your CLL expert. You are going to get some more involved tests. I have had 3 bone marrow biopsies (necessary before treatment for sure) and the first one, with the general oncologist, was really unpleasant but the next two, with the CLL expert at a major cancer center, were a breeze. The experts all know each other. Hi OP,\nI hope you are doing well. I just got my CBC results back and lymphocytes shows 48 but doctor said it is normal.\nLooking at your post, did you also have a high lymphocytes reading of 48 on your first lab? I did. Do the lab results have a H next to the result? Hi, it is actually right on the boarder line so it is does not have a High marked. Anything above 48 would be high. Overall I just had a lot of results that are boarderline okay so I am kind of freaked out. Hope you are doing okay and stay healthy! Ok my 48 was a % on a differential diagnosis and it was critically high Sorry but I thought 48% is just at the high limit. Normal range was 22-48 I think. Keep your results and keep an eye on the numbers", "Expert Highlights Role of BTK Inhibition in Treatment Landscape for CLL ", "Idelalisib May Induce More Favorable Outcomes in Clinical Trial Participants, Versus Medicare Beneficiaries ", "Gilead (GILD) Announces Positive Long-Term Data on Yescarta ", "Dr. Awan on Novel Strategies Under Exploration in Relapsed/Refractory CLL ", "Evaluation of Acalabrutinib in Ibrutinib-Intolerant R/R Chronic Lymphocytic Leukemia ", "Will third doses of COVID-19 vaccines be necessary for immunocompromised people? ", "Mode of Progression After Frontline Treatment Predicts Clinical Outcomes in Patients With CLL - Hematology Advisor ", "Adding Ublituximab and Umbralisib to Ibrutinib Produced Strong Undetectable MRD Rate in CLL ", "SMC APPROVES ORAL TREATMENT CALQUENCE (ACALABRUTINIB) FOR PATIENTS WITH THE MOST COMMON TYPE OF LEUKAEMIA IN SCOTLAND - CHRONIC LYMPHOCYTIC LEUKAEM ", "Subset of Patients With Richter Syndrome May Obtain Long-Term Survival - Cancer Therapy Advisor ", "Simultaneous bone marrow involvement by CLL/SLL and LEF1/cyclin D1-positive metastatic melanoma | Blood ", "Dr. Barrientos Discusses Promising Agents in CLL ", "Rituximab/Bendamustine Combo Demonstrates Promising Results in Fludarabine-Ineligible CLL ", "Obinutuzumab plus fludarabine and cyclophosphamide in previously untreated, fit patients with chronic lymphocytic leukemia: a subgroup analysis of the GREEN study ", "Dr. Sharman on the Potential Future of Acalabrutinib in CLL ", "Combination Trials Signal Next Wave of Treatment for CLL ", "Dr. Al-Sawaf on Updated PFS Data With Venetoclax Plus Obinutuzumab in CLL ", "Leukemia Stem Cell Transplant: Benefits, Procedure, Side Effects, More ", "Acalabrutinib Effective for Relapsed/Refractory CLL at 3 Years ", "Combining cytogenetic and epigenetic approaches in CLL improves prognosis prediction for patients with isolated 13q deletion ", "Acalabrutinib Seems Safe and Efficacious in Patients With Treatment-Naïve Chronic Lymphocytic Leukemia - Hematology Advisor ", "ASH 2017: Dr. Ian Flinn on venetoclax and obinutuzumab for frontline treatment of CLL (chronic lymphocytic leukemia) ", "Treatment Holiday Possible in CLL ", "Treatment Advances in Chronic Lymphocytic Leukemia ", "Atallah Breaks Down Key Advances Made Across Leukemias and Lymphomas ", "Significant Responses Seen With Investigational BTK Inhibitor in Pretreated CLL/SLL Population ", "New CAPTIVATE Analysis Supports Ibrutinib &amp; Venetoclax as First-Line CLL/SLL Treatment ", "Cerebral aspergillosis: An emerging opportunistic infection in patients receiving ibrutinib for chronic lymphocytic leukemia?  I usually do not post stuff behind a paywall but I thought 1, someone might be happy to pay for this information if it directly effected them and 2, maybe ask your Dr. about it, just in case.  It is an alarming headline, worth keeping track of.  ", "New Data Shows AbbVie's VENCLYXTO®/VENCLEXTA® Fixed Duration Combination Demonstrates Sustained Progression-Free Survival in Chronic Lymphocytic Leukemia Patients after Three Years off Treatment ", "Ibrutinib Regimens versus Chemoimmunotherapy in Older Patients with Untreated CLL | NEJM ", "Dr. Mato on Immunotherapy Options in CLL ", "Crafting a More Efficient CAR T-Cell Industry ", "Ibrutinib with rituximab in previously untreated CLL: Indication of added benefit over FCR ", "Ublituximab Plus Ibrutinib Induces Promises Responses in High-Risk Relapsed/Refractory CLL ", "Acalabrutinib With or Without Obinutuzumab Improved Survival for Previously Untreated CLL ", "mRNA BNT162b2 vaccine safe in immunocompromised patients ", "Chronic lymphocytic leukemia increases the pool of peripheral blood hematopoietic stem cells and skews differentiation | Blood Advances ", "Three-Year Follow-Up of Acalabrutinib Plus Obinutuzumab in CLL ", "Supplemental New Drug Application for Ibrutinib, Rituximab Submitted to FDA ", "Acalabrutinib With Obinutuzumab May Be Safe, Effective in Chronic Lymphocytic Leukemia - Hematology Advisor ", "Clinical Trial Participants May Fare Better Than Medicare Beneficiaries Treated with Zydelig ", "MRD-Guided Ibrutinib and Venetoclax Combination Shows Promise in Relapsed/Refractory CLL ", "STUDY ON CANCER TREATMENT IN SINGAPORE Hey,\n\nI am looking to have a discussion with any cancer survivors or their care givers who have traveled to Singapore for Leukemia or Lymphoma treatment.\nIt will be a paid discussion (100 USD) as it is for a research study.\nIf anyone is interested please do contact me on ", "Ibrutinib Compared With Chemotherapy in Treatment-Naive CLL ", "High MRD-Negative Responses Achieved With Upfront Ibrutinib/Venetoclax for CLL ", "‘Blood cancer patients’ immune response sharply weakened after vaccination’  Thank you for posting. Damnit", "Twice-Daily Dosing of Acalabrutinib Well-Tolerated, Effective for BTK Inhibition in CLL ", "Evolving Data for CLL Set Stage for Frontline Therapy ", "Dr. Danilov on Venetoclax Plus BTK Inhibitors in CLL ", "Study Unveils Family Risk for Certain Types of Blood Cancer ", "Risk of specific genetic translocation is higher in patients of African ancestry - Study Identifies More Precise Assessment Measures for Patients Newly Diagnosed with CLL ", "Umbralisib Plus Ublituximab Improved PFS vs Chemoimmunotherapy in CLL - Cancer Therapy Advisor ", "CAR T-Cell Therapy for CLL ", "Which Mask Is Best for Protecting Patients With Cancer From a COVID-19 Variant? ", "Low Antibody-Mediated Responses to mRNA COVID-19 Vaccine Observed in CLL, Elderly Myeloma ", "Duvelisib Granted FDA Approval for CLL and Follicular Lymphoma ", "Ibrutinib Plus Venetoclax Induces Response as First-Line Treatment for CLL/SLL ", "Safety and Efficacy of CLL Treatments ", "Novartis-backed Penn study proposes boosting CAR-T responses in CLL by waking up 'war weary' T cells ", "Monitoring Patients With Chronic Lymphocytic Leukemia Treated With Venetoclax ", "Chimeric Antigen Receptor-Natural Killer Cells Shows Promise in CLL ", "Dr. Pagel on Ongoing Research With BTK Inhibitors in CLL ", "Zanubrutinib Shows High Response Rates in Single-Arm Phase 2 Study ", "Two immune checkpoint inhibitors efficiently block leukemia development in preclinical tests ", "Part 3: Considerations for Venetoclax-Based Therapy in Frontline CLL ", "Israeli study: COVID vaccine may not offer blood cancer patients optimal protection ", "Ibrutinib Versus FCR for Younger Patients With CLL ", "Investigational BTK Inhibitor Shows Promise in Chronic, Small Lymphocytic Leukemia ", "Idelalisib-Rituximab Combo Found Active in R/R CLL Regardless of Complex Karyotype - Cancer Therapy Advisor ", "Study shows combining chemotherapy with targeted drug boosts response in chronic lymphocytic leukemia ", "New Score Predicts When CLL Patients Should Start Treatment - NewsDio ", "Kahl Highlights Frontline Considerations in Changing CLL Landscape ", "Dr. Shadman on Fixed Durations of Treatment in CLL ", "MD Anderson and Cyclacel Pharmaceuticals announce strategic alliance to study novel Cyclacel medicin ", "Ibrutinib's Role in Treating IgVH-Unmutated CLL ", "Three-Drug Combo Promising Against High-Risk CLL ", "Curcumin and Vitamin D Treatment May Stabilize Disease in Patients with CLL and SLL ", "Dr. Flinn on the Design of a Phase 2 Trial of Zanubrutinib in CLL/SLL ", "Progression-Free Survival With Acalabrutinib Non-Inferior to Ibrutinib in High-Risk CLL ", "Novel Agents, Combos Transforming Treatment in MCL and CLL ", "Venetoclax-rituximab combo compared to bendamustine for R/R CLL patients ", "Cirmtuzumab-Imbruvica Combo Phase 2 Trial Enrolling CLL, SLL Patients  Where do I sign up?", "Mutational Status Is Associated With Time to First Treatment in Newly Diagnosed CLL ", "Managing Cytokine Release Syndrome in Patients on CAR T-Cell Therapy ", "Venetoclax/Rituximab Found Superior to Chemotherapy in CLL ", "CMS quit test of pricey cancer treatment amid concerns over industry role ", "Drug Duo Shows Promise in Treating Chronic Lymphocytic Leukemia ", "Dr. Barr on Umbralisib/Ublituximab/Venetoclax in Relapsed/Refractory CLL ", "Ohio State-developed drug receives FDA approval for treatment of CLL and SML ", "Clinical Challenge: Test Your Knowledge on CLL — A three-question quiz on current issues in managing CLL ", "Rituximab use may be a risk factor for severe COVID-19 ", "Combo Rx Boosts Durability of CAR T-Cell Response ", "A Phase III Study Assessing Early versus Delayed Treatment with Venetoclax and Obinutuzumab for Newly Diagnosed Patients with High-Risk Chronic Lymphocytic Leukemia or Small Lymphocytic Lymphoma without Symptoms ", "Durable Responses Demonstrated in Phase I/II With U2 Triplet Regimen in CLL ", "Calquence Significantly Improves Survival in Patients with Chronic Lymphocytic Leukemia ", "mRNA COVID-19 vaccines in patients with CLL: A systematic review and meta-analysis ", "BRIEF—Venclexta/Rituxan combo shows improved PFS in chronic lymphocytic leukemia ", "CAR T-Cell Therapy Under Investigation for Chronic Lymphocytic Leukemia ", "Autoimmune disease, rituximab linked to higher risk for severe COVID-19 pneumonia ", "Pevonedistat Plus Ibrutinib Showcases Preliminary Efficacy and Tolerability in CLL and MCL ", "Acalabrutinib Among Exciting Options Emerging in CLL ", "Healthy T cells have a fighting chance for cell therapy | Penn Today ", "John N. Allan, MD, on the Impact of First-Line Ibrutinib in Patients with CLL, TP53 Aberrations ", "Dr Brian Koffman Highlights Incredible Responses to CLL Treatments ", "Tumor Lysis Syndrome Caused by Unrecognized Richter’s Transformation of Chronic Lymphocytic Leukemia: Treatment With Venetoclax for Suspected Disease Progression ", "Pirtobrutinib Yields Promising Responses in Previously Treated CLL/SLL ", "MRD Effective as Surrogate Endpoint in CLL? ", "Liso-cel Plus Ibrutinib Demonstrates Tolerable Safety Profile in Relapsed/Refractory CLL/SLL ", "Consensus Opinion Addresses Concerns About Clinical Application of CAR-T - Cancer Therapy Advisor ", "Dr. Awan on Future of Combo Regimens in CLL Treatment Paradigm ", "CLL treatment/Stages. Hi everyone. I am just looking for some advice, I am UK based and my dad has had CLL for about 15 years roughly.\n\nUsual blood tests were conducted regularly but a few weeks ago he was told his spleen was now enlarged and they wanted him to start treatment.\n\nThe treatment they want him to start is Obinutuzumab &amp; Venetoclax. I am just wondering if anyone has had any experience or these? How were you on them? \n\nHe is 65 always been healthy apart from this, active with work (gardener) so he wants to push it down the road by the way he is talking and from me doing my reading that does not really seem like an option anymore. His spleen being enlarged puts him into the Stage C category and life expectancy seem to max out at 3 years. \n\nWould it be worth being bed bound for 12 months with no social life (he is extremely social) for the sake of a wasted year and a couple max okay ones? \n\nWould there be any questions you would ask the consultant because I am currently writing some down, my mum and dad get dazed in the moment when they are just sitting there having jargon thrown at them. \n\nAny help or advice would be appreciated :) Hi! I live in Germany and I started Venetoclax six weeks ago.\n\nI am surprised your father was offered the option of taking it with the antibody Obinutuzumab. My docs refused to combine Venetoclax with an antibody, because the antibody treatment leaves you immunosuppressed and according to latest findings it also reduces the effectiveness of the Covid-vaccine. They considered it just too risky during the pandemic.\n\nSo I am just taking Venetoclax, without an antibody. This option is said to be very effective too, but the difference is that with the antibody, you take the pills for two years. While without it you take them for an indefinite period of time, basically until they stop working.\n\nRegarding the Venetoclax pills, they are very tolerable, not comparable to chemo at all. So far, I have only felt a little nauseous from time to time, and that was only during the first 2-3 weeks. Really not a big deal, no vomiting or anything.\n\n&amp;#x200B;\n\n&gt;Would it be worth being bed bound for 12 months with no social life (he is extremely social) for the sake of a wasted year and a couple max okay ones?\n\nI am not sure I understand what you mean by this. Why bed bound for 12 months? He should not be bed bound with Venetoclax. It is a pill you take once a day. And I do not believe Obinutuzumab will affect him that much either. As far as I know it is one perfusion per month over the course of six months.\n\nRegarding questions for your doc, I would ask about the antibody situation I mentioned above. Is it really safe to get Obinutuzumb during the pandemic?\n\nI hope what I wrote makes sense :-) If not, feel free to ask! Hi thanks for your reply!!\n\nWhen I say bed bound I mean he cannot leave the house due to risk of infection.\n\nHe is a very sociable person along with my mum so I do not think he would want to be sat inside for 12 months ‘not living’ when he could be out and about. \n\nI think he was offered something I regards to tablets he could take forever (must be like you said until they stop working), but on the medical release form the options they have put down are the ones I have described in my opening post.\n\nThey have put both options down (I do not know whether they are taken at the same time or after one course has finished) so I assume this is their preferred method of treatment.\n\nIn regards to covid I know in the UK he will be having his 3rd vaccine soon due to being on the shielding list. He is had pneumonia before so covid was obviously a great concern!\n\nWould there be any questions that you had wish you would asked your consultant that you never did? Just trueing the scope out options.\n\nThank you for your reply though it made perfect sense! Oh, ok, I see. Well, yes, his immune system will most probably be weakened, but I think there is no telling to what extent and for how long.  Every patient is different. I for example am at high risk because my neutrophils count has dropped since I started Venetoclax, but according to my doc this is not typical. In my case, they were very low to begin with (which is one of the reasons I started therapy).\n\nSo it all depends on your Dad’s current condition and how he responds to the medication. Is he not isolated right now? Is his immune system okay and has he responded to the vaccine? Keep in mind that if he starts Obinutuzumab before getting his 3rd shot, the shot may not be effective.\n\nSo I guess the two options he was offered are the following, right?\n\n* Venetoclax (tablets for two years) + Obinutuzumab (monthly perfusion for six months). Any vaccine he would get within 12 months after Obinutuzumab may be ineffective, and he would probably be isolated for a long time.\n* Venetoclax (tablets until they do not work any more). Depending on his condition his immune system may not be critically affected or stabilize itself after a while.\n\nI cannot think of any questions I wanted to ask...\n\nDo you know ( though? They have several webinars where they answer questions that are truly asked from a patient's perspective. The next one is on Sept 13th. I love how they break down things for you and I have really learned a lot. I highly recommend them!\n\nEDIT: You can also watch past events on their page. I did this exact regime here in the US. I am 56 years old, had an enlarged spleen, yadda yadda yadda. My doc recommended the obinutuzimab for 6 months and venetoclax for a year or two. I traveled to MD Anderson for a second opinion. They have a cll team that helped develop many of the modern treatments currently in use. They agreed with that protocol and said one year of venetoclax is enough. I am coming up on the last month of my treatment and it is been a success. I am in remission and expect to stay this way for many years (back to watch and wait). \n\nI cannot answer about being home bound. I am most certainly not. I mask and take precautions, I am vaccinated (just had third shot), and everyone in my house is vaccinated. Whether or not I have an immune response is unclear. I think I read in this thread somewhere that it was 36 percent of those treated for cll havd no immune response to vaccines. BUT, untreated cll itself is 25% resistant. So I say do the treatment! Be careful with exposure. Go out safely and do not drive yourself crazy. Get vaccinated anyway. Hope for the best case scenario. I wanted to add my side effects in case that helps. We did a slow ramp up on the obinutuzimab to avoid tumor lysis syndrome at the recommendation of MD Anderson because my wbc was crazy high like 350k. So for my first infusion it was spread out over 3 days. The first day I threw up during the infusion. The next couple of days they gave me anti nausea stuff in the iv which helped. I was dead tired for about a week after those first three infusions. The rest went very smoothly. Just tired the day after bug not like the first. \n\nThe venetoclax has been easy peasy. Personally I have had some annoying diarrhea with it, but that is just my sensitive guts probably. No other side effects other than having to take four giant horse pills every day.", "Dr. Fakhri on Selecting the Optimal Treatment in CLL ", "Second Hematologic Malignancy Deemed a “Rare” Event in CLL - Cancer Therapy Advisor ", "Chemo-Sparing Tx Doubles Response in Medically Fit CLL ", "Safety Profile of Obinutuzumab for CLL Confirmed in Final Analysis of GREEN Study - Cancer Therapy Advisor ", "Acalabrutinib Monotherapy Safe, Significantly Improves PFS in Relapsed/Refractory CLL ", "How Social Distancing Helped Create a Sense of Community Among Some Patients with CLL ", "Real-World Treatment Patterns, Adverse Events, and Health Care Costs for Patients With CLL - Cancer Therapy Advisor ", "New cancer treatment method cuts time from hours to minutes ", "100% ORR in Frontline CLL/SLL Seen With High-Frequency Low-Dose Acalabrutinib/Rituximab Combo ", "Acalabrutinib Demonstrates Activity in Frontline CLL ", "Leukemia Rates Falling, but AML, CLL Are Exceptions ", "Venetoclax for CLL After Progression on 1 Prior Therapy ", "Gene mutations linked with death from infection in patients with chronic lymphocytic leukaemia ", "CAR-T Cell Therapy Liso-Cel Deemed Safe and Active in CLL and SLL - Cancer Therapy Advisor ", "93% of cancer patients respond to souped-up immune cells ", "Conditioning Chemotherapy Preceding CAR T-Cell Therapy Appears to Be Safe in Relapsed/Refractory CLL - Hematology Advisor ", "Dr. Mato Discusses the Safety and Efficacy of Umbralisib in CLL ", "Cost Analysis of Biosimilar vs Reference Rituximab for Treating CLL and Other Diseases ", "Zanubrutinib-Gazyva Leads to Strong Responses in CLL ", "ASCO: AstraZeneca details Calquence's heart safety edge over Imbruvica as both brace for BeiGene's rival Brukinsa ", "T Cell Therapy Shows Persistent Benefits in Young Leukemia Patients ", "Ibrutinib Plus Venetoclax in Relapsed/Refractory Chronic Lymphocytic Leukemia: The CLARITY Study ", "CLL at ASH 2020: The CAPTIVATE trial — Episode one ", "Acalabrutinib Effective, Safe for Patients With CLL Who Are Intolerant to Ibrutinib ", "Undetectable MRD Status Associated With Long-Term Survival in CLL ", "Dr. Eradat on the CAPTIVATE Trial in CLL ", "CAR-T Cell Therapy Side Effects: Know What to Look Out For ", "\"Potentially Curative\" New Drug Could Help Thousands Of People With Chronic Lymphocytic Leukemia | SurvivorNet ", "What is Chronic Lymphocytic Leukemia? Cancer Doctors Explain the Symptoms and Treatment Options ", "Expert Explains Expanding Post-Ibrutinib Options in CLL ", "Evidence Supports BTK Inhibition in Chronic Lymphocytic Leukemia ", "Hoffman Decides on BTK Inhibitor Therapy in a Patient With Relapsed CLL and Del(17p) ", "Link between ibrutinib-related hypertension, heart problems necessitates close monitoring ", "Peripheral Blood MRD Shows Promise for Assessing CLL in Patients Treated With Venetoclax - Cancer Therapy Advisor ", "Dr. O'Brien Discusses Duvelisib in CLL ", "NCCN Recommendations: Frontline CLL Treatment Options ", "Dr. Danilov on the Role of Disease Biology in Up-front Treatment Selection in CLL ", "HARMONY presents new insights in Chronic Lymphocytic Leukemia (CLL) at the EHA2021 Virtual Congress ", "Combination Therapy Achieved Durable Remission for Patients with CLL - Onco'Zine ", "AstraZeneca Halts Phase III CLL Trial Early After Primary Endpoints Are Met ", "The Connect CLL Registry: final analysis of 1494 patients with chronic lymphocytic leukemia across 199 US sites | Blood Advances ", "COVID-19 Severity in CLL Correlates With 3 Disease Characteristics ", "Vincerx Pharma (VINC) Announces FDA Clearance of IND for Phase 1b Study of VIP152 in Chronic Lymphocytic Leukemia and Richter Syndrome ", "BRIEF-Novartis Receives Health Canada Approval Of Its Car-T Cell Therapy, Kymriah I ", "Efficacy and Safety of Bendamustine and Rituximab As First Salvage Treatment in Chronic Lymphocytic Leukemia: Results of the Gimema-Eric LLC1315 Study ", "Dr. Barrientos on Advances in the Treatment Landscape for Patients With CLL  Thanks for posting these articles. Sure thing, happy to", "Acalabrutinib Triplet Highly Active in Frontline CLL ", "NCCN Recommends Zanubrutinib As First-Line, Second-Line Therapy in CLL, SLL ", "FDA Approval in CLL and FL, Partial Hold Lifted in Tazmetostat Trials, and 2019 WCLC Conference Highlights ", "Barr Evaluates BTK Inhibitors for Treating Frontline CLL ", "Lonza: Out of spec Kymriah ‘not a Novartis issue…it is an industry issue’ ", "Germline Mutations in DNA Repair Pathway Genes Associated With Chronic Lymphocytic Leukemia ", "Ibrutinib May Be Effective in Patients With Chronic Lymphocytic Leukemia Who Were Excluded from Clinical Trials ", "Govt panel OK's insurance coverage of new leukemic therapy ", "CD19 CAR NK-Cell Therapy Achieves Significant Response in Patients with Leukemia, Lymphoma ", "Dr. Davids on Investigational Doublets and Triplets in CLL ", "Transplant Status May Affect CAR-T Therapy Outcomes in CLL and B-ALL ", "Obinutuzumab Triplet Achieves Deep Remissions in Chronic Lymphocytic Leukemia ", "Memory T Cells May Predict Response to CAR T-Cell Therapy in CLL ", "Dr. Andreadis on Developments to CAR T-Cell Therapy ", "Cellectar Biosciences (CLRB) Reports Data from 20 Patients Receiving Single 25mCi/M2 Bolus Dose of CLR 131 in the Phase 2 CLOVER-1 Study ", "For CLL/SLL, Imbruvica Combo Improves Survival, Updated Phase 3 Results Show ", "Dr. Leslie on Real-World Outcomes of Patients With CLL Treated With Acalabrutinib ", "AbbVie (ABBV) Says Phase 3 MURANO Study of Venetoclax Chosen as Late-Breaking Abstract at ASH ", "OS and Time to Richter Transformation Linked With Age in Adolescent and Young Adults With CLL ", "Investigational CAR T-cell therapy induces durable responses in pretreated leukemia subtypes ", "Novel Combinations in Development for CLL ", "Dr. Kambhampati Discusses Data from the 2018 ASH Annual Meeting in CLL ", "Results from IMBRUVICA® RESONATE-2 Study Provide ... | INN  Great! My husband just began this treatment.", "FDA Approves Acalabrutinib for CLL ", "Dr. Ghia on ASCEND Trial Results for Previously Treated CLL ", "BCL-2, BTK Inhibitors Can Be Considered for R/R CLL ", "Dr. Danilov on the Need to Identify Novel Pathways in CLL ", "FDA clears IND application for CD20-directed CAR-T to treat B-cell malignancies ", "Drug combination found to keep chronic lymphocytic leukemia in young patients in remission for several years ", "cfDNA-Based MRD Assessment Is Feasible, Yields Highly Concordant Results in Relapsed/Refractory CLL ", "Concurrent Ibrutinib and CD19 CAR-T Therapy Well-Tolerated in Relapsed/Refractory CLL ", "Dr. Danilov on the Efficacy of the Combination Zandelisib and Zanubrutinib in R/R B-Cell Malignancies ", "Idelalisib Does not Increase Risk for Bleeding in Patients With CLL, Indolent NHL Receiving Anticoagulation/Antiplatelet Therapy - Cancer Therapy Advisor ", "Father is vaccinated and has CLL. He needs to continue to distance/mask but what about those who live with him? My father has CLL and is in watch and wait but he is 77 years old. We are all vaccinated and live in the same house and want to know if we should all be continuing to work remotely and socially distance given we can still transmit and get infected even if vaccinated. Anyone have advice With the delta variant I would still be cautious if you can. You can still get COVID even if you are vaccinated although you should be better off with the vaccine should you get it. I would ask his CLL doctor but I would still think he is high risk. It is possible that the vaccine may not be as effective for your father with CLL. Again, talk to your dads doctor.\n\nEdit:  Definitely have him take part in that study! My father has CLL &amp; he is 78. He had about 25% immunity after receiving his initial vaccination. About 2 weeks ago he received a 3rd shot.", "Acalabrutinib Appears Promising as Monotherapy in CLL ", "Follow-Up Data Confirm Support for Use of Calquence in Patients with Relapsed/Refractory CLL, Expert Says ", "#VisualAbstract Phase 2 trial shows umbralisib is safe and effective in patients with chronic lymphocytic leukemia who are intolerant to BTK or PI3Kδ inhibitor therapy | 2 Minute Medicine ", "CAR-T Cell Therapy Market is Expected to Expand at an Impressive Rate by 2027 ", "New Study Shows Most Blood Cancer Patients Benefit from an Additional COVID-19 Vaccine Dose ", "Examining Minimal Residual Disease Remissions in Patients With CLL ", "Certain Mutations May Be Associated With Infection Risk for Patients With Chronic Lymphocytic Leukemia - Hematology Advisor ", "Dr. Byrd on the Rationale for the ELEVATE-RR Trial in CLL ", "First-Line Therapy for Treatment-Naïve Patients ", "O'Brien Shares Overview of CLL Sequencing ", "Ibrutinib Plus Venetoclax Shows Favorable Efficacy and Safety Outcomes in R/R CLL ", "New Study Offers First Direct Comparison Between Venetoclax, Ibrutinib in CLL  \" The investigators found ibrutinib had an ORR of 71% and a PFS rate of 12%. Patients on venetoclax saw an ORR of 96% and a PFS rate of 56%. \" Thanks for the synopsis! Glad I am on venetoclax.", "Aleukemic mast cell leukemia associated with chronic myelomonocytic leukemia and chronic lymphocytic leukemia ", "Novel Prognostic Model Predictive of Survival in Ibrutinib-Treated Chronic Lymphocytic Leukemia - Hematology Advisor ", "Treatment Options for Frontline CLL Merit In-depth Patient Discussions ", "Acalabrutinib Effective, Shows Long-Term Safety in Relapsed/Refractory CLL and SLL ", "Researchers Identify Potential Approach to Overcoming CLL CAR T-Cell Resistance ", "Dr. Ailawadhi on Next Steps With Lisaftoclax in CLL ", "Chemotherapy-Free Therapy for CLL: Communication and Adherence ", "Proceed with caution: 2 physicians on what CDC's new mask guidance means for immunocompromised patients ", "Antibody Responses After COVID-19 Vaccination in Patients With Chronic Lymphocytic Leukemia ", "Considerations for CLL as an Enduring Disease ", "CURE EDUCATED PATIENT CLL Webinar ", "Acalabrutinib Triplet Impresses in Frontline CLL, Advances to Phase III Study ", "John N. Allan, MD, on Research Coming Out of ASH for CLL ", "ASH 2018: Dr. Wierda Discusses Pivotal Updates in CLL ", "Emerging BTK Inhibitors for CLL ", "Novel Regimens Take Precedence in Newly Diagnosed CLL ", "Dr. Pleyer on Next Steps With Ibrutinib Plus Short-Course Fludarabine in Previously Untreated CLL ", "Three-Year Follow-Up Continues to Support Fixed-Dose Venetoclax/Obinutuzumab in Treatment-Naïve CLL ", "Dr. Al-Sawaf on Continual MRD Assessment ​After Venetoclax/Obinutuzumab in CLL ", "Deam, that was quick Got blood work on the 21 and my wbc was 101. I had a super stressful week, more symptoms. Night sweats (I have to change clothes 3 time a night, super tired and faint, losing weight and I can see my lymph nodes now). After the Covid test dance with the hospital I got my blood work done again and it is jumped to 125 in a week. I did not know that was possible. My other counts are now dropping. I have been on watch and wait since June when my wbc was 37….\n\nSo safe to say my CLL is taking a pretty drastic turn. Going To start some brutinibs at some point in the near future but damn I feel like a bag of hot garbage. I posted last week and I think I just had a pretty big reaction to the flu vaccine since my immune system is just taking a nose dive. \n\nI know Im 28 and it can be more aggressive when young but I have not really heard of many people with it like this. Anyone relate? Or even got any tips for the future? Any stories of how yours progressed and how treatment worked or did not work for you?", "Dr. Shadman on Methods Utilized to Evaluate MB-106 in B-NHL and CLL ", "Dr. Brian Koffman: “But the most impressive thing is they looked in my bone marrow, which had been heavily involved with CLL and they could find no trace of CLL down a one in 100,000 or one in a million cells.” ", "Acalabrutinib Demonstrated Fewer Incidences of Atrial Fibrillation Versus Ibrutinib in Previously Treated Patients With Chronic Lymphocytic Leukemia ", "Scientists Attempt First Gene Editing in Live Patient Body - CLL Adjacent - ", "Factors Identified for Risk of Second Cancer in CLL Following BTK Inhibition ", "Genetic dynamics in untreated CLL patients with either stable or progressive disease: a longitudinal study | Journal of Hematology &amp; Oncology ", "1-Year DFS Rates Similar Between Ibrutinib and Placebo Following Ibrutinib/Venetoclax in CLL ", "Ofatumumab May Prolong Survival in Relapsed Chronic Lymphocytic Leukemia - Cancer Therapy Advisor ", "Dr. Pinilla-Ibarz on the Role of Chemotherapy in CLL ", "Can convalescent plasma therapy improve COVID-19 outcomes in patients with hematologic cancers? ", "AstraZeneca joins hands with RGCI to treat leukaemia patients - Jammu Kashmir Latest News | Tourism | Breaking News J&amp;K ", "Combination Therapy vs Chemoimmunotherapy for Previously Untreated CLL ", "Newly Diagnosed CLL: BTK Inhibitor Monotherapy ", "Long-Term Outcomes Remain Favorable With Venetoclax-Obinutuzumab - Cancer Therapy Advisor ", "Dr. Robak on the Inclusion Criteria of the RESONATE-2 Trial in CLL ", "Tumor Lysis Syndrome in Patients With Chronic Lymphocytic Leukemia Treated With Venetoclax - Cancer Therapy Advisor ", "CAR T-cell therapy pioneer among Time magazine’s 100 most influential people ", "IMBRUVICA Treats CLL and SLL Patients Without Chemotherapy ", "Ongoing Challenges and Unmet Needs in CLL ", "In a Rare Case, Breakthrough Leukemia Treatment Backfires ", "Study from The Leukemia &amp; Lymphoma Society Shows COVID-19 Vaccine is Safe but 25% Of Blood Cancer Patients Do Not Produce Detectable Antibodies ", "Acalabrutinib Plus Obinutuzumab Well-Tolerated, Effective in CLL ", "Ibrutinib therapy downregulates AID enzyme and proliferative fractions in CLL ", "Phase III UNITY-CLL Trial Shows Promise for Umbralisib, Ublituximab Combo in CLL ", "Zandelisib/Zanubrutinib Yields Promising Responses in R/R CLL, and B-cell Malignancies ", "First-Line Bendamustine Plus Rituximab Safe, Effective for Unfit Patients With CLL ", "The Treatment Landscape of Chronic Lymphocytic Leukemia ", "The History Behind the Development of CAR-T Cell Therapy ", "Dr. Cohen on Fixed-Duration Therapy in CLL ", "High expression of CD23 in the proliferation centers of chronic lymphocytic leukemia in lymph nodes and spleen ", "Bloodline: Familial Link Observed with Blood Cancers ", "Novel Ibrutinib Combination for Primary Treatment of CLL ", "Can Culturing CAR T Cells With Ibrutinib Improve Their Efficacy in CLL? - Cancer Therapy Advisor ", "Dr. Byrd Discusses the Prognosis of Patients With CLL ", "Dr. Brander on the Role of MRD Negativity With Venetoclax-Based Regimens in CLL ", "Fox Chase Study Indicates Benefits of Combined Therapies in Targeting Subpopulations of Chronic Lymphocytic Leukemia Cells ", "MRD Status Not Associated With PFS in Chronic Lymphocytic Leukemia Patients on Ibrutinib ", "Specialty Pharmacists Have Broad Responsibilities in Chronic Lymphocytic Leukemia ", "Preclinical Research Sets the Stage for Potential of CAR-NK Cell Therapy in Hematologic Malignancies ", "Bruton Tyrosine Kinase Inhibitors Signal Promise in the Treatment of Chronic Lymphocytic Leukemia ", "Duvelisib new drug application submitted to FDA for R/R CLL ", "Economic Burden of Systemic Therapy Among Medicare Patients With CLL ", "Impact of Ibrutinib in Quality of Life (QoL) in Patients with Chronic Lymphocytic Leukemia (CLL): Preliminary Results of Real-World Experience ", "Uncommon Mutation in CLL Associated With More Favorable Prognostic Factors - Cancer Therapy Advisor ", "Cytomegalovirus Proctitis in a Patient with Chronic Lymphocytic Leukemia on Ibrutinib Therapy: A Case Report ", "MD Anderson emerges with strong evidence for natural killer cell therapy, and Takeda looks like a winner  My dad has cll and is being treated at MD Anderson. Nothing but great respect for that hospital.", "Crossover to Duvelisib Feasible in Patients With CLL ", "BRIEF-TG Therapeutics Inc Announces Phase 3 Study Results Of Ublituximab plus Ibrutinib For High-Risk Chronic Lymphocytic Leukemia ", "Cancer stem cells get energy from protein, and it is proving to be their Achilles' heel ", "Chronic lymphocytic leukemia and stomach pain: What is the link? ", "New Immunotherapy Had Positive Results In Cancer Patients After Other Treatments Failed ", "Efficacy of Ibrutinib Plus Venetoclax for Chronic Lymphocytic Leukemia - Hematology Advisor ", "Dr. Rogers on Reducing Risk of Tumor Lysis Syndrome in CLL ", "Examining BTK Inhibition As A Superior Treatment for Relapsed/Refractory CLL ", "Zanubrutinib Better Than Ibrutinib in CLL/SLL? ", "Flinn Highlights Emerging Combinations in CLL ", "Extended Follow-up Phase 3 Data Underscore Sustained Efficacy and Safety of IMBRUVICA® (ibrutinib) in the Treatment of Chronic Lymphocytic Leukemia (CLL) ", "Study Examines Familial Risk Associated with Blood Cancers ", "Oncologist and Patient Preferences for Novel Agents in First-Line Treatment of CLL ", "Acalabrutinib Is Noninferior, Better Tolerated Than Ibrutinib in Previously Treated CLL ", "Three Fast Facts on Chronic Lymphocytic Leukemia ", "Dr. Byrd Discusses the Future Treatment of CLL ", "BTK Inhibitors Are the Path Forward in Frontline CLL Treatment ", "Dr. Wierda on Role of Rituximab Biosimilar in Evolving CLL Treatment Paradigm ", "Dr. O'Brien Discusses Combination Venetoclax in CLL ", "CLL: Evolution of Treatment (Video 1 of 18) ", " Ibrutinib Regimens in Older Patients with Untreated CLL | NEJM ", "Test or no test ? My mom was diagnosed with CLL last week. Her white cell count is 25,600. All the other counts are normal. When I asked the doctor on what to do next, he basically prescribed a few multivitamin and nothing else. He said wait and watch. \n\nWhat confused me was that, he explained that there is a test to detect the level of risk of CLL. He advised not to get it done. His logic being whatever the outcome of test, treatment would only be started once symptoms are visible, so there is no need to get the risk test done yet.\n\nThe above does not feel right. Can anyone suggest if this is ok ?\n\nAlso, what are the lifestyle changes that my mom may need to make and what are the things to watch out for.\n\nMany thanks. I would suggest the genetic test right away as some patients (~10%) are at higher risk and need to start treatment right away, especially if you are not seeing the doctor every month to monitor condition. For the majority of folks with CLL they wait about 2-3 years before their first treatment. Any treatment comes with side effects and if your mom have no symptoms you are better off waiting. This is fairly unique to CLL. \n\nSome things your mom should do is maintain her weight w/good diet and exercise and avoid social isolation if possible. Take it one day at a time CLL is a long battle Thanks for replying. The doctor has suggested monthly visits first. Given that should I still insist on the genetic test ? If she is getting seen once a month, I can see why the doctor is not concerned about the test. If further treatment is going to be needed, is going to be because of her lab #s and not the test. My dad was diagnosed in early 2018 and he just started to need treatment starting in June of this year. Before that is was just visits either every 3 or 6 months. 25,000 is fairy low for CLL, some patients can go as high as 200k or more so it seems she is in the early stages. Anemia is very common with this cancer so make sure she starts eating healthy, different color vegetables and non process foods are the best. The most important thing you can do is see a CLL expert. Visit the CLL Society website. (cllsociety.org) They have a list of experts in all states, plus support groups which you can now join from anywhere on zoom. They even have a free service where you can consult an expert for several minutes. But you will need some tests for them to interpret: Flow Cytometry and FISH being the commonly done tests to diagnose and define CLL. Bone Marrow biopsy might also be done, but some doctors only do it if treatment is indicated (easy if you get knocked out, takes some personal fortitude to have it done with just a local.) The second most important thing to do is maintain overall good health: sleep, destress, healthy eating, exercise, reduce toxic exposures, have a good social network. CLL is often a \"watch and wait\" situation but the experience is definitely more like \"watch and worry\". Try not to worry! I am an otherwise healthy CLL patient just wrapping up successful treatment. I have loads of tests done, information is important but a doctor who knows what the tests imply is crucial! My first doctor at Kaiser looked at my genetic markers which were favorable and my overall health which was good. But the bone marrow biopsy told a different story that they did not interpret correctly. I was really compromised in insidious ways by my CLL (and we are all very different patients) and when I switched to an expert and started treatment, I really was saved from some organ damage and physical decline. Unusual situation. Many CLL patients never need treatment. My treatment has been easy on me, but I have had to do it for a long time. I am seen at the City of Hope, in Duarte, California. Diagnosed 2017, symptoms 2018, treatment 2019 and 2020. Hi, 54yo here. Have her get seen by a CLL specialist. Its never too early to have the Symetry and FSH panel done. I have been diagnosed since 2018. Also on the W/W. Recent WBC is at 40,000+. No treatment since the only thing I am experiencing has been night sweats (not to frequent) and exhaustion. Basically always tired. Also have Hypertension, Cholesterorol,so on meds for all that and they dont help with exhaustion. Last year I had 2 pneumonias and a staph infection, so I was hosptalized for all 3 for a couple days each time. Main thing i can advise you to do is to make sure she doesnt get ill with a cold, flu etc. Any kind of infection is not a CLL patients friend in any way. Not to mention this evil thing Covid-19. This CLL is a bothersome pain in the buttocks, and it will be for a long time. Main thing to do is see a CLL Specialist and go from there. Def. get any and all tests they reccomend. Bottom line is to Watch and Wait not wait and worry. She will be OK. As others have mentioned I would see a CLL specialist. These tests will determine risk based on genetic markers. I am 31 with CLL and a WBC of 300,000. My only other symptoms at this time are enlarged lymph nodes. I see a local doctor regularly and also just saw a specialist at Moffit Cancer Center in Tampa, FL. One thing to note, cells can mutate and your genetic markers can change over time. I have had the tests suggested by other people here twice now. I have not had to have any treatment yet. They estimate that it will be another 6-12 months before treatment is needed based on my labs. But it could be longer. Everyone is different. Feel free to PM me if you have any questions.  300,000 sounds insane. \n\nI was diagnosed five years ago and only recently got to around 60,000. Now my doctor is talking about genetic testing to determine the best treatment.\n\nGood luck with this! Thanks, you too. I was at 100,000 when first diagnosed 04/2018. Thanks for your response and time Thanks for your response and time. Flow cytometry was done confirming the CLL. The doctor has told not to get the FISH done and see him monthly at start. Thanks for your reply and time. Covid really scares me for her. Thanks for your time. I will remember and message you as we go along. The best thing to do is to educate myself and that education would come most easily from the people themselves.\n\nAlso people keep saying CLL specialist. We went to Haemetologist Oncologist. Is there someone else we should be seeing ? My local doc is a hematologist oncologist. She did the testing right off the bat. You really kneed to do it to know 100% that it is CLL and to know your risks. She has been great. That being said, she treats many things. I recently went to someone who specializes in CLL. They basically confirmed everything my local doc told me including the recommended treatment for me. It was nice to get that reassurance. I continue to see my local doc and plan to get treated by her. I also recently found out how CLL interacts with pneumonia. Had two different pneumonia vaccinations too. CLL specialist. I live in India. Would have to check if they exist here. I have been on the \"wait and watch\" for over three years.  My Dr has explained the pros of my opting to wait and watch.   Watch for fatigue, night sweats etc ...\nTreatment for bloodborne cancers are improving every day.   Waiting to become symptomatic before i opt for treatment will give me the latest and greatest treatment available.   Treatments we discussed upon my diagnosis are not even considered.   \nKnowing every case is unique, being  open with your dr is key.", "New Registry Helps Blood Cancer Patients Manage Medical Records ", "Ibrutinib Not Recommended Over ‘Watch and Wait’ in Asymptomatic, Early CLL ", "Researchers identify biomarkers for CAR T-cell therapy neurotoxicity ", "Expert Reviews Current State of CLL Treatment ", "Durable Long-Term Responses in B-cell Lymphoma and Chronic Lymphocytic Leukemia After Anti-CD19 CAR T-Cell Therapy - Hematology Advisor ", "High Rates of COVID-19 Mortality Seen in Patients With Hematological Malignancies ", "Sequencing Therapy in CLL: BTK and BCL2 Inhibitors ", "South Carolina man alleges benzene exposure caused leukemia (CLL) ", "‘It is not over for us’: For those with weakened immune systems, COVID-19 vaccines do not mean the end of the pandemic ", "Less Favorable Outcomes With Idelalisib for FL and CLL in Trial Versus Clinical Settings ", "Emerging Combinations Shift Treatment Paradigm for Patients With CLL ", "I apologize for the incoming deluge I have been out of town and with ASH 2019 going on there has been a lot of CLL news coming out.  I try to cut down on the redundancy of some of these post but \n\n&amp;#x200B;\n\n1) I hate the idea of picking one news source for people, \n\n&amp;#x200B;\n\n2) some articles about the same report may seem redundant but are slightly different (one source is nuts and bolts data, one has a video, one is written for the lay person and easier to understand, one has a link the other did not, etc.) and most importantly, \n\n&amp;#x200B;\n\n3) there are a LOT of different combos coming that may seem the same but are different.  Dr.s are trying to find the right combination of the same 6-8 drugs that work best for patients - (Ibrutinib/Rituximab), (Ibrutinib/Venetoclax), (Venetoclax/Obinutuzumab), (Acalabrutinib/Venetoclax/Obinutuzumab), (Umbralisib/Ublituximab/Venetoclax), (Cirmtuzumab/Ibrutinib), and this is not even a complete list.  Some articles may seem the same but are actually discussing slightly different combinations.", "MURANO Shows Worse Outcomes in R/R CLL When Venetoclax is Stopped Early ", "A Tool to Select Candidates for Allogeneic Hematopoietic Cell Transplant in CLL - Cancer Therapy Advisor ", "Single-Hit TP53 Associated With Prolonged OS and PFS Vs Multi-Hit TP53 in Ibrutinib-Treated CLL ", "FDA approves Covid-19 pre-exposure EVUSHELD/AZ7442 for Immunocompromised patients This may give us at least some protection during the pandemic.  For the fact sheet see\n\n(", "Venetoclax-Based Time-Limited Therapy Well Tolerated, Effective in CLL ", "Gazyva With Chemotherapy Shows Promise for Chronic Lymphocytic Leukemia ", "Continued Benefit Seen With Acalabrutinib and Obinutuzumab Combo in CLL ", "Persky Reviews Therapies for Treatment-Naïve Chronic Leukocytic Leukemia ", "Final Analysis From Phase III RESONATE Study of Ibrutinib in CLL Patients ", "FDA authorizes extra vaccine doses for immunocompromised patients to bolster protection against the coronavirus  That is great. I would love to hear of your experience once you have had the booster, i.e. did you develop antibodies.\n\nWe do not have that option in Germany (yet).", "Pretreatment Growth Patterns of Early-Stage CLL as a Predictor of Disease Course - Cancer Therapy Advisor ", "In CLL, Venclexta-Rituxan Combo Seen to Extend Undetectable Disease ", "CLL Diagnosis Preceded by Decades of Increased Infection Susceptibility - Cancer Therapy Advisor ", "Interim Data of Cirmtuzumab and Ibrutinib Show Efficacy in MCL and CLL ", "Cellular kinetics of CTL019 in relapsed/refractory CLL - Pay Article ", "Natural Killer Cells Could Bypass Limitations of CAR T Cells in CLL, Expert Says ", "Risk score predicts atrial fibrillation with ibrutinib therapy for chronic lymphocytic leukemia ", "TG Therapeutics Announces Publication of Phase 2 Data Evaluating Umbralisib in Patients with Chronic Lymphocytic Leukemia Who Are Intolerant to Prior BTK or PI3K Inhibitor Therapy in Blood Nasdaq:TGTX ", "How do I tell my 9 &amp; 11yo Kids I have CLL? ", "Acalabrutinib Shows Noninferior PFS versus Ibrutinib in high-risk CLL ", "Dr. Kahl on Promising Research in Chronic Lymphocytic Leukemia ", "Dr. Sotomayor on Differences Between FDA-Approved CAR T-Cell Therapies ", "Study Findings Support Long-Term Efficacy and Safety of Acalabrutinib in R/R CLL - Cancer Therapy Advisor ", "Real-World Treatment Discontinuation Among Patients With CLL ", "High Disease Eradication Rate Observed for Ibrutinib/Venetoclax Combination in Relapsed/Refractory CLL - Cancer Therapy Advisor ", "Dr. Flinn on the Role of BTK Inhibitors in CLL ", "Coronavirus vaccine less effective on leukemia patients – Israeli study ", "Frontline Treatment Options Available for Patients With CLL ", "Dr. Woyach on Clinical Trials Examining Novel Triplets in CLL ", "Understanding Antibodies in COVID-19 ", "A Breakthrough Cancer Drug Has Been Approved. Now Comes the Battle Over the Price ", "EU Expands Imbruvica Use for CLL and Waldenström's Macroglobulinemia ", "Rituximab Using a Thrice Weekly Dosing Schedule in B-cell Chronic Lymphocytic Leukemia and Small Lymphocytic Lymphoma Demonstrates Clinical Activity and Acceptable Toxicity ", "Infection Control in Patients With CLL May Be Pivotal for Survival Outcomes ", "Venetoclax Monotherapy Yields Deep Responses, Manageable Safety in CLL ", "Dr. Pleyer on Remaining Questions With Ibrutinib Plus Short-Course Fludarabine in CLL ", "Dr. Barrientos Discusses Combination Strategies in CLL ", "CLL Survivors Worried About Life Expectancy, Quality of Life ", "Dr. Brander on the Safety and Efficacy of Ibrutinib/Venetoclax in CLL ", "Ibrutinib Bests Chlorambucil in Elderly Patients with Treatment-Naïve CLL/SLL ", "Ibrutinib and venetoclax combination therapy for first-line treatment of CLL ", "Novartis focusing on cutting CAR-T costs ahead of EU launches - Pharmaphorum ", "Ibrutinib EU Indications Expanded in CLL and Waldenstrom Macroglobulinemia ", "Gilead Doubles Down On CAR-T: Updates To Thesis - Gilead Sciences, Inc. (NASDAQ:GILD) ", "Ibrutinib used in treatment for Chronic Lymphocytic Leukemia ", "Ibrutinib versus rituximab in R/R CLL/SLL: Phase III results  Full text here: ", "Combo Tx Promising in Relapsed/Refractory CLL ", "Press Release: Novartis receives European Commission approval of its CAR-T cell therapy, Kymriah(R) (tisagenlecleucel) ", "Healthcare Utilization and Comorbidity in Chronic Lymphocytic Leukemia | CLEP ", "Dr. Smith on the Rationale Behind the Fixed Duration Trial for Ibrutinib/Venetoclax in CLL ", "MRD Negativity Associated with Ibrutinib Plus CAR T-Cell Treatment for CLL ", "Treatment Goals and Recommended Frontline Options for CLL ", "Promising Early Results for the Combination of Acalabrutinib, Obinutuzumab, and Venetoclax in Treatment-Naive CLL - Cancer Therapy Advisor ", "Obinituzumab vs Retuximab Can someone tell me what the differences between Obinituzumab and Retuximab are? \n\nMy mom (65F) went from roughly 65k to 30k after a month and her doctors are moving her to Retuximab to help boost her platelet count. No clue. You could try ask an expert on the CLL society website. Great idea! Thanks! As a patient who has recieved rituximab, here is what I have gathered when wondering why they were not going straight for the obinutuzumab in my case.\n\nRituximab is a little older but works great for most cd20 positive use cases, and it is cheaper.  Most insurance readily covers it.  Non-NCCN cancer centers who practice standard of care vs state of the art will tend to favor the older, well-proven meds like Rituximab.\n\nObinutuzumab works better in cases where prior rituxan administration broke off a chunk of the cd20 protein like a snapped hair, leaving cd20 stubble behind on an essentially immortal cell.   It also does better with clefted cells where the cd20 is tucked / hiding in the cleft.  \n\nThe side effects of Rituxian are well understood including how to identify and counteract them.   I do not know about obinutuzumab in they regard.  In my case, I needed 2 shots of medrol to throttle how fast it was working. \n\nEven in cases where cd20 expression is lower, or where spontaneous mutations have occurred, both have been proven to be beneficial because they can cause upregulation of additional communication paths to trigger cell self-destruct messages.\n\nI will echo the CLL society recommendation.  Mr. Koffman and his team are good people, on the cutting edge. I think of Obinutuzumab as the 2nd generation of Retuximab. Not like it is clearly better, but it is the next step in Roche's monoclonal antibody line targeting CD20.  Retuximab is older with more history and better understanding of side-effects and efficacy.  Obinutuzumab is newer and from what I gather is becoming the standard of care CD20 drug for CLL patients.  Bottom line, they are very similar and your doc will be able to guide which is better for your mom.", " With tweaks, CAR-T cancer therapy could be made safer, study suggests ", "AbbVie, J&amp;J embed Imbruvica deeper in CLL therapy with new approval - ", "Future developments in CLL reside in testing, CAR T-cell therapy ", "Dr Adam Olszewski on Growing Ibrutinib Use to Treat CLL ", "Dr. Davids Discusses Frontline Approaches in CLL ", "Venclexta-Rituxan Combo in Relapsed CLL Shows Promise in Clinical Trial ", "Dr. Abedin on the Safety and Efficacy of Ibrutinib in CLL ", "Ibrutinib and Venetoclax for First-Line Treatment of CLL | NEJM ", "BTK Inhibitor Effective in Patients With Progressive, High-Risk CLL ", "Chemotherapy may limit ability to develop effective CAR T cells ", "FDA Approves Ibrutinib/Rituximab for CLL/SLL ", "Industry Feature: The Role of Clonal Evolution and Deletion 17p in Chronic Lymphocytic Leukemia (CLL) Be part of the knowledge ", "Matthew Steven Davids, MD, MMSc, Discusses a Phase II Study for Richter’s Syndrome ", "Ibrutinib and venetoclax combo effective as front-line therapy for select chronic lymphocytic leukemia patients ", "Comprehensive multi-omics analysis categorises distinct pathogenic processes in CLL ", "Dr. Thompson on Future Research Directions in CLL ", "Novel risk score for predicting blood cancer relapse ", "Acalabrutinib Alone or in Combination Improves PFS in Frontline CLL ", "Innovative research refines the treatment of patients with advanced cancers and the use of immunotherapy - Network News, Press Releases - Hackensack Meridian Health ", "Patient-Reported Disease Burden in CLL, DLBCL, and FL ", "Jennifer A. Woyach, MD, Discusses Use of Ibrutinib in CLL at 2021 ASH ", "Ibrutinib/Rituximab Combo Retains PFS Advantage Over FCR in CLL ", "Dr. Raphael on Addressing the Risk of Tumor Lysis Syndrome in CLL ", "U2 Plus Pembrolizumab Shows Continued Efficacy at 5 Years in CLL and Richter’s Transformation ", "Novartis's Kymriah gets EC approval to treat blood cancer ", "Dr. Barrientos Discusses Ibrutinib in Elderly Populations With CLL ", "Whole-exome and whole-genome sequencing in chronic lymphocytic leukemia: new biomarkers to target ", "Immunoglobulin Abnormalities Do Not Affect Overall Survival in CLL, Study Finds ", "MD Anderson research highlights for June 30, 2021 ", "There is a magic bullet for some cancers. But often, it misses ", "Histone Deacetylase 6 (HDAC6) As A Therapeutic Target in Chronic Lymphocytic Leukemia ", "Efficacy of the BNT162b2 mRNA COVID-19 Vaccine in Patients with CLL | Antibody response in CLL patients markedly impaired, affected by disease activity / treatment  What does this mean in plain English? The way im reading it is it means the study showed that efficiency of the vaccine is relative to where you are in treatment and how far the cancer has progressed.  I think this is good news for individuals on W&amp;W, but not so much for those whos cancer has progressed and are in treatment.\n\nIf you have not already, the leukemia society is sponsoring these types of tests for ( to see how well you have taken to the vaccine.\n\nI just went for mine Saturday, should have results by the end of the week. Thank you very much!", "Rituximab Leads to Faster Response in CLL, But PFS Not Improved ", "TML Helps Predict Time to Treatment in CLL and Its Precursor, Study Shows ", "Venetoclax Effective Against CLL in ‘Real-World ", "How BTK Inhibitors Can Improve the Treatment of Chronic Lymphocytic Leukemia | SurvivorNet ", "Lenalidomide Consolidation Benefits CLL Patients Post Chemoimmunotherapy ", "Feasibility and efficacy of CD19-targeted CAR-T cells with concurrent ibrutinib for CLL after ibrutinib failure | Blood ", "mitoxantrone/low-dose rituximab combo comes up short in non-inferiority trial results from the phase IIb ARCTIC clinical trial in previously untreated CLL ", "Genetic mutation predicts poor outcomes in CLL ", "Dr. Shadman on the Efficacy of Venetoclax in CLL ", "IMBRUVICA® (ibrutinib)-Based Combination Regimen as a Fixed-Duration, First-Line Treatment for Chronic Lymphocytic Leukemia Demonstrates High Rates of Disease Control ", "CAR T-cell therapy advances in CLL ", "Dr. Fakhri on Ibrutinib-Containing Regimens in CLL ", "Acalabrutinib May Be a Therapeutic Option in Treatment-Naive Chronic Lymphocytic Leukemia - Cancer Therapy Advisor ", "Fixed-Duration, All-Oral Regimen Slows CLL Progression — Near-80% reduction in PFS hazard with ibrutinib-venetoclax versus obinutuzumab-chlorambucil ", "Characteristics and outcomes of five patients with COVID‐19 and hematological malignancies ", "Rituximab Added to Ibrutinib in CLL Shows No Improvement In PFS, OS ", "Paul M. Barr, MD, Discussed 7-Year Follow-Up Data for Ibrutinib as Frontline Treatment of CLL ", "Sustained CLL Response Seen With Ibrutinib Plus Venetoclax After MRD Negativity - Cancer Therapy Advisor ", "SEQUOIA Study Update: Zanubrutinib Prolongs PFS in R/R Chronic Lymphocytic Leukemia ", "Clinical Challenge: CLL in Adolescents and Young Adults — Patient preference is key and monitoring for complications is crucia ", "Dr. Pagel on Time-Limited Therapy in CLL ", "Ibrutinib discontinuation linked to poorer CLL outcomes - NewsDio ", "Calquence Approved for Chronic Lymphocytic Leukemia - MPR ", "Upcoming Conversation With An Expert: Highlights In CAR-T - bluebird bio, Inc. (NASDAQ:BLUE) ", "Pagel Provides Perspective on Evolving Paradigms in CLL, DLBCL ", "In Younger Patients With CLL, Adding Ibrutinib to FCR Combo Shows Promise as Time-Limited Therapy ", "Dr. Rogers on Benefits of Ibrutinib Combination in CLL ", "Dr. Brander on the Treatment Landscape for Patients With High-Risk CLL ", "Building on Current Understandings of BTK Inhibition in CLL, MCL ", "AbbVie Announces New Undetectable Minimal Residual Disease Data from Phase 3 R/R CLL - Venetoclax in Combination with Rituximab ", "Expert Addresses Add-On Approach For the Treatment of Chronic Lymphocytic Leukemia ", "Ibrutinib-Venetoclax Produces High MRD-Negative Rates in CLL/SLL ", "New mRNA Cancer Drivers Revealed in Chronic Lymphocytic Leukemia  Paywall :( Not a paywall but registration is still kind of PIA.  I am kind of getting the feeling they know when I link things from reddit.  I never encounter the registration wall until I click the link after someone here points it out.  My first time reading the articles I post is always hassle free.  Not sure how to know which will throw up the wall.   TLDR - My bad No worries :)", "One Year Update on Imbruvica - What was I worried about? Got my regular 3 month blood test.  Stellar.  Healthy people without CLL would like to have my numbers.\n\nSide effects:  Daily Fatigue, Daily Shoulder Joint Pain, Weekly Mouth Sores, Little Nausea (thanks Marinol) and weight gain?  (up 25lbs might not be related)\n\nI had a lot of apprehensions taking this drug at first, I thought I would be giving up my health. (Worry is interest paid on a debt that may never come due!)  During the course of treatment WBC hit 110,000, as the drug broke up cells in the swollen lymph nodes) now 6,600, down from 8,800 3 months ago, all organs normal.\n\nIt is one of the best results my Dr. has seen.  I wish I had not been so worried about it.  Fatigue though is a daily grind, my EBAY store suffers for it. Hey great to hear. I am at about 2.5 years. I have more stomach acid than before and seem to run closer to gout than before as it does raise uric acid levels.  \nGet some pure oregano oil at a health food store and put two drops in your toothpaste for anytime you have mouth sores.  I am investigating an arrhythmia that may or may not be connected. I will check into the oregano oil. I use a baking soda rinse all the time.  I use clove oil on the sores themselves had arrythmia too.\n\nWhat do you pay monthly for your imbruvica? Lucky to have insurance through work and the copay card so ten bucks. I am 53. The heart rhythm seems most present in like the twilight hours before waking, say 3am 4am. Its not afib.", "Dr. Bond on Second Cancers Following CLL Treatment ", "Impact of CAR T-Cell Therapy on EOL Outcomes ", "Part 4: BTK Inhibitors for CLL in the Second Line ", "Ibrutinib and Venetoclax Combo 'Impressive' in Front-Line CLL ", "Pretreatment Factors, Duration of Response Signify Efficacy of Second-Line Treatment for CLL ", "Who usually gets CLL?  Apart from the clickbait title that has nothing to do with the content of the article, this article seems to be from an uncited source and contains factually untrue statements around both the usage of radiation therapy and the course of the disease.\n\nFor example, the author claims that radiation is used to induce remission for CLL.\n\nRadiation therapy is not often used to treat CLL systemically because the disease is located throughout the entire body. It is present in the lymph nodes, blood, spleen, and bone marrow at a minimum.  It can also move into the liver, skin, and mucous membranes.\n\nRadiation therapy can be very helpful to shrink an enlarged spleen or swollen lymph nodes and relieve certain symptoms, but it is never used to induce remission.\n\nThis article should be removed for being factually untrue. That is one of the messiest websites/blogs I have ever seen. Sketchy is an understatement.", "Early Use of Fixed-Duration Venclexta-Rituxan Combo in Patients with Relapsed/Refractory CLL Effective, And Does Not Compromise Subsequent Therapy Response in Patients Who Need Retreatment ", "Allogeneic Hematopoietic Stem Cell Transplant Effective for Patients with CLL Previously Treated with Novel Agents ", "Activation-Induced Cytidine Deaminase Transcripts Linked To More Aggressive CLL ", "Umbralisib: Early Efficacy, Safety in FL, CLL, More | Cancer Network ", "Dr. Barr on Updated RESONATE Data in IGHV-Mutant CLL ", "CAR-T Therapy Shows Persistent Benefits in Young Leukemia Patients ", "Paolo Ghia, MD, PhD, on the Chemo-Free, All-Oral Regimen of Ibrutinib Plus Venetoclax for First-Line CLL at ASCO 2021 ", "Dr. Byrd on the Clinical Implications of the ELEVATE-RR Trial in CLL ", "CLL Treatment Further Refined With Venetoclax Data Updates ", "Zanubrutinib, Venetoclax Combination Therapy Well-Tolerated in Certain Patients With CLL or SLL ", "Clinical Data and Third-Line Options for CLL ", "Understanding CLL - A Common, Chronic Blood Cancer ", "Symptoms but normal blood work I have got swollen lymph nodes in my neck (been there for over a year) really bad bone pain in my legs and back along with kidney pain, shortness of breath, headaches and little red dots popping up on my skin randomly that look like petechiae. This has been progressing for the better part of a year and I have had CBC done which have been relatively normal so getting the hematologist/oncologist to do more investigating is like pulling teeth Sounds familiar  ....   i was diagnosed 4 yrs ago with CLL.  Started with the lymph nodes.  Did the whole routine.  They might be clogged\n  Then maybe an infection. Take antibiotics for a few weeks.  Go see an ear nose throat dr.  Get a ct scan.  Get an mri.  Get an ultrasound.  Go get a biopsy.   \nBingo !!   You have lymphoma.   \nBut, stay calm.  Im into year 4 and still on a wait and see program.   \nAdvances in bloodborne cancers is jumping leaps and bounds.   Yes, it stinks the insurance companies dictate treatment.  \nGet second opinion.  Listen to your oncologist.  Ask questions.  Stay off the internet.   Ask your oncologist what sites he recommends to get informed.   (Read that last paragraph..  its important!!!  )\nWish you all the best  !!  Stay chill.  Ask dr questions.  There is no stupid question  !!!! How long did you have symptoms if you do not mind me asking? My first symptom was my lymph nodes swollen.  Thought first i was getting sick.  That was August of 2017.   By the time i went through a battery of tests and scans, ending with needle biopsies, my diagnosis was confirmed on October 11th of 2017.   At my first oncologist appointment, i was given 3 options of treatment.   6 months of chemo, a daily pill that i would remain on and third, wait and see how fast it would advance.   I decided to wait and see.   It will be 4 years this October. 😊😊    i see my oncologist every 3-4 months and have blood drawn.  Besides having swelling in my neck lymph nodes, i feel fine.   Symptoms i look for are night sweats, lack of energy and loss of weight.   This is not a death sentence for me.   It is a big mental hurdle to get over to have a cancer and do nothing, but its actually my best option.  Given every medication has a window of effectiveness, the farther i can push any medication out, better the chance something even better than current medications may be discovered.    \nStay positive.  Eat a balanced diet.   Exercise.  Stay off the internet. I have been climbing to the top of mountains for the past year trying to figure out what is wrong with me the thing I am most afraid of is that it is already too late as I have many symptoms. I try to stay off google as much as I can but not knowing has taken a huge toll on me mentally ITS NEVER TOO LATE !!!!!!\nRemember, you are not a doctor.   Let the professionals do a diagnosis.   Stay chill.  A blood borne cancer, if that is what you have, is not a death sentence.   Every ache and pain you have may not be related.   Ive got plenty of aches and pains.  None are related to my cll. I appreciate the response, it is funny how someone on the internet that you would not know from Adam can help you calm your nerves I really appreciate that I was a basket case at first.   I have several workmates that have gone through their own cancer tours.   They kept me grounded and eased my mind.   \nIm just continuing their kindness.   \nHang in there brother  !!!   \nStay positive.  \nGet to your Dr \n💪💪", "Brown Highlights the Future of Acalabrutinib in CLL Treatment ", "Ibrutinib for CLL Leads to Higher Risk of Certain Cardiovascular Events ", "CLL flow cytometry: How it works, diagnosis, and more ", "VIDEO: MAJIC trial hopes to reveal best venetoclax-based doublet therapy in untreated CLL ", "CAR T-Cell Therapies Moving to Outpatient Setting ", "New Agents and Optimal Patient Selection in CLL Comprise Modern Paradigm ", "Safety, Efficacy of BOVen Therapy in Patients With Previously Untreated CLL ", "Classical Hodgkin lymphoma arising in a patient with chronic lymphocytic leukemia (Richter syndrome) ", "Ibrutinib Plus Venetoclax Provide High Rates of Undetectable MRD in CLL ", "Promising Covalent BTK Inhibitor Shows Results in Relapsed/Refractory CLL ", "How Do Age and Fitness Impact Venetoclax Efficacy in Patients with CLL? ", "Imbruvica, Venclexta Combo Offers Chemotherapy-Free Regimen for Patients with CLL ", "Top 5 Most-Read Articles in Leukemia and Lymphoma for 2021 ", "Oncologists Highlight Treatment, Patient Attributes That Impact Decision-making for CLL ", "Ibrutinib + Venetoclax Promising for Chronic Lymphocytic Leukemia ", "Zanubrutinib Shows Noninferiority, Improved Safety Vs Ibrutinib in Relapsed/Refractory CLL ", "Real-World Outcomes for Patients With CLL Differ in Community Setting - Cancer Therapy Advisor  Cant read, subscription only. Registration is free and I have literally never received spam from any of the websites that require a sign up.  I have auto-log on for most of these sites so I do not even realize at this point which require login and which do not.  No idea why so many require an email login to read about CLL studies.  The article is based on this study ( ( ) which I believe requires no registration.", "FDA Accepts BLA for Ublituxumab and Umbralisib for Chronic Lymphocytic Leukemia ", "Combo Tx Improves PFS in High-Risk CLL ", "Imbruvica May Be Superior to Standard of Care in Elderly Patients with CLL ", "Cirmtuzumab Plus Ibrutinib Shows Promise for CLL &amp; MCL Patients ", "CLL: Undetectable Disease Likely with Ibrutinib Plus Venetoclax ", "Acalabrutinib Demonstrates Superior PFS Over Standard-0f-Care in Relapsed/Refractory CLL ", "Dr. Skarbnik on the Role of Chemotherapy in CLL ", "Acalabrutinib confers equal PFS with less toxicity vs. ibrutinib in previously treated CLL ", "CAR NK Cells Demonstrate High Response Rate and Safety in Lymphoma... ", "New Directions in Chronic Lymphocytic Leukemia Care: A Review of 2019 Treatment Guideline Updates ", "Dr. Barr on the Next Steps of the RESONATE-2 Trial in CLL ", "CAR T-Cell Therapy Poised to Become Routine Care in CLL ", "Mato Explains Data That Have Led to the Current Standard of Care in Frontline CLL  If you need a break, Dr Mato has a picture in this article with the best \"derp\" face.  Made me laugh", "EDUCATED PATIENT® Chronic Lymphocytic Leukemia Webinar ", "Treatment Options for Relapsed/Refractory CLL ", "Early Results from the Phase Ia/b Dose Escalation Trial of CG-806 in CLL/SLL and NHL ", "Dr. Danilov on Utility of Rituximab Biosimilars in CLL ", "Blood Publishes Results Showing Patients With Hard-to-Treat Leukemia, Lymphoma Show Marked Response With Duvelisib ", "Precision BioSciences Announces Dosing of First Patient in Phase 1/2a Clinical Trial of PBCAR20A for Relapsed/Refractory NHL, CLL, and SLL ", "Venclyxto and MabThera combo gets approval in Europe for CLL ", "AbbVie Receives Health Canada Approval for the Combination of VENCLEXTA® (venetoclax) with Obinutuzumab for Patients with Previously Untreated Chronic Lymphocytic Leukemia ", "Secondary Cancer Risk Remains an Unresolved Issue in CLL ", "CLL Treatments Take Aim at Targeting Tumor Microenvironment ", "A Review of Treatment Options in CLL  ", "Investorideas.com - Fate Therapeutics Shares Rise 10% as First Person Treated with Its Anti-Cancer Therapy ", "Moffitt Researchers Find Dual Inhibitor May Be Safer for Chronic Lymphocytic Leukemia Patients "]