["Welcome to BrittleBones Subreddit! Hello!\nI am so glad you have decided to join this community of people with Osteogenesis Imperfecta. \n\nWhat I am striving for this subreddit is to have a community where we can all go for advice on medications, advice on doctors, advice on treatments, advice on symptoms, to sharing our stories, pray for each other (if that is what you are into), to just being there for each other through the struggles, disappointments, and happy times.\n\nLet me tell you a little about myself. \n\n27\nFemale\nMarried\nOI Type 1\n11 Broken Bones\nChristian\n\n\nI hope that this subreddit helps you and maybe expands your mind on different things!\n\nHave a wonderful day!\n\n", "Having Osteogenesis imperfecta ! Treatment Day || Long Day &amp;' Good Food || Vlog || • B - Slay With A Disability ", "Type 3 OI - Check out My Fitness Journey - Oi.Strength - Upcoming Bodybuilder  daaaamn dude you are ripped!! how early did you start? are you on bisphosphonates? did you ever cause any stress fractures by lifting? do those giant muscles now put any stress on your bones just by being?? i have always been curious about weight lifting, but i have felt that strain in the bones when lifting things and i have been worried pushing too far will cause a fracture!  Hey Tom, Do you often check comments on your video, \nWould you rather discuss on reddit or on youtube ? I Started in 2016/2017. I am not on Anything, just a good strict diet (bisphosphonates I heard is not that effective) &amp; yes many many stress fratures, BUT you can prevent that by knowing YOUR limit. I sometimes go overboard but 9/10 times i always know my limit. Pushing too far will cause problems; I have lifted heavy and got injured several times throughout my journey of being fit; You got to know the limit, and be caution of what you are training  I check all Social Medias. Any place of contacting is fine. very cool. only a couple years at it and you have seem to have a great handle on it! bisphosphonates i have seen do some amazing things, but it seems it effects kids much more than adults. my little brother was one of the first kids on it, he started at 8 years old and now he is in his 20s. when he first started, he could not even sit up on his own without breaking. now, he is a seated fencer! it is wild. i did not have as extreme of an effect from them, but it helps with general aches for me. but to think you are lifting and stuff without it is awesome! do you have any cool equipment that is better fitted for small folk? or you mostly just free weight stuff?  I love to see fellow OI people being fit and not allowing the world to tell them they cant do something. Keep up the great work! ", "Upper body, Resistance bands training, biceps and shoulders, wheelchair fitness w/ brittle bones ", "Osteogenesis Imperfecta Medication: Bisphosphonates ", "Added to our moderator team! Help me welcome the newest moderator to the r/BrittleBones team!  ( \n\n&amp;#x200B;\n\n&amp;#x200B;", "Theme Im not the best at creating a theme, so I hope you enjoy the changes that were made!", "Should I start exercising in private or in public My uni has a pretty big gym and pool, so I think it would be a good place to start, but I am paranoid I might injure and embarrass my self there. The main draw is the pool, which I have not looked up the schedule for and I am note sure if it is open. \n\nOn the other hand at my house I am surrounded my my family all the time and I have more control over the weights. I also have a pool at my house, but it is like empty and we do not want to bother filling it up till summer, and I wont be around my house by then because I am moving", "Pain Do you experience pain through out your day? If so, what have you found that has helped?", "Flairs I have added flairs to the subreddit so that you can add what type you are. If interested. \n\nIf you have suggestions for more flairs, let me know!", "I have type 3 Oi and decided to make a video on it. Thought some people might find it interesting ", "Osteogenesis Imperfecta Type 5 Type V:\nOI Type V is moderate in severity. It is similar to OI Type IV in terms of frequency of fractures and the degree of skeletal deformity.\nThe most conspicuous feature of this type is large, hypertrophic calluses in the largest bones at fracture or surgical procedure sites.\nHypertrophic calluses can also arise spontaneously.\nCalcification of the interosseous membrane between the radius and ulna restricts forearm rotation and may cause dislocation of the radial head.\nWomen with OI Type V anticipating pregnancy should be screened for hypertrophic callus in the iliac bone.\nOI Type V is dominantly inherited and represents 5 percent of moderate-to-severe OI cases.", "anyone else with type 1 on here?  I have type 1! type one as well :) Same Here! I also have a daughter that is presumed to be type 1. Me! :) Me! 23 years old and have broken 70 (give or take) bones.", "Osteogenesis Imperfecta Type 1 Type I:\nOI Type I is the mildest and most common form of the disorder. It accounts for 50 percent of the total OI population.\n\n-Type I is characterized with mild bone fragility, relatively few fractures, and minimal limb deformities. -The child might not fracture until he or she is learning to walk.\n-Shoulders and elbow dislocations may occur more frequently than in healthy children.\n-Some children have few obvious signs of OI or fractures. Others experience multiple fractures of the long bones, compression fractures of the vertebrae, and chronic pain.\n-The intervals between fractures may vary considerably.\n-After growth is completed, the incidence of fractures decreases considerably.\n-Blue sclerae are often present.\n-Typically, a child’s stature may be average or slightly shorter-than-average as compared with unaffected family members but is still within the normal range for the age.\n-There is a high incidence of hearing loss. Onset occurs primarily in young adulthood, but it may occur in early childhood.\n-Dentinogenesis imperfecta is often absent.\n-OI Type I is dominantly inherited. It can be inherited from an affected parent, or, in previously unaffected families, it results from a spontaneous mutation. \n-Spontaneous mutations are common.\nBiochemical tests on cultured skin fibroblasts show a lower-than-normal amount of type I collagen. \n-Collagen structure is normal.\n-People with OI Type I experience the psychological burden of appearing normal and healthy to the casual observer despite needing to accommodate their bone fragility.\n-The absence of obvious symptoms in some children may contribute to problems at school or with peers.\n-Significant care issues that arise with OI Type I include gross motor developmental delays, joint and ligament weakness and instability, muscle weakness, the need to prevent fracture cycles, and the necessity of spine protection.\n-Family members should carry documentation of the OI diagnosis to avoid accusations of child abuse at emergency rooms.\n-Treatment with bisphosphonates is not routinely recommended.\n-The treatment plan should maximize mobility and function, increase peak bone mass, and develop muscle strength. Physical therapy, early intervention programs, and as much exercise and physical activity as possible will improve outcomes.", "Mechanistic and therapeutic insights gained from studying rare skeletal diseases ", "Strengthen your shoulders (rotator cuff) ", "Do OI eyes look like this? I was diagnosed with idiopathic osteoporosis at age 14, im 26 and still have it.. only hairline fractured 3 bones in my life and tons of cavities. They refused to give me a genetic test... could it be?  It is possible. Usually that is a sign of at least some sort of disorder affecting collagen. Mine cover more of my sclera. What other signs of it do you have if any? I agree, this does seem possible. Just chronic back and body aches, i always made a joke that im 26 and feel like im 80. But now it might not be a joke. No other symptoms besides the femur and tibia fractures when i was 14, got them after running lol. I fell down many times after that and broke nothing (fell down a huge flight of stairs even). My mother has had osteoporosis since her twenties and is 57 now with a history of breaking her spine 4x and her hip. She has kyphosis and lordosis. Her mother has osteoporosis and kyphosis too. I bruise easily. Im 5’3, so normal stature. But when doctors look at my xray, theyre shocked that im not a 90 yr old woman. Insurance refused to pay for a genetic test :( i also suffer from benign vertigo, its pretty moderate. the sclera look white to me, but my dad's sclera were once all blue and have since reduced to a blue ring around his pupil, so it does not rule you out. Firstly, I have no idea how you managed to take such a good quality photo of your eye. (\n\nThe thing that jumps out to me is how mines a much more consistent colour. Everyone that I have met with OI is the same where the blue is pretty consistent around the eye. The thing with eyes though is that it is reported that the colour changes, sometimes they will be very dark and others they will lighten up, could just be lighting but that what other people with OI have noticed.\n\nIf you do not mind there are some other indicators of OI that might give people a better idea. How would you compare to average height? How is your hearing? How is your teeth? Finally, how flexible/double jointed would you consider yourself now and as a child.\n\nObviously what ever is said here does not substitute for any proper medical advice and for the best answer you should keep the pressure on your medical professionals. I think the genetic tests can be quite expensive hence the reservations in providing one. You could try and push for a skull xray to look for the presence of ( Hi, I have this type as well. My bones got a lot better when I became a teenager and I have not had any fractures since then. My eyes are slightly blue as well. My mother, aunt and grandmother have OI as well. I understand, i have to keep putting pressure to get a genetic test. My height is 5’3 which is average. I walk, exercise, a person really cant tell that i have something just by looking at me. My teeth LOOK fine, but every time i go to the dentist, they tell me i got 10 cavities to fix and comment on how weak my teeth look on the xray. Also having severe osteoporosis with a t score of -3.3 since at 14 is pretty huge. I also suffer from pretty mod/severe benign vertigo, but no hearing loss. Vision is horrible, im close to being legally blind. Did have a history of heart arrhythmias that were fixed. And now i always have bone pain, in the spine, legs, arms. I grew up with everyone calling me double jointed like it was a talent, but i never thought anything of it. Im not flexible at all when it comes to doing a split for example, i dont stretch enough, but i can move my shoulder so far back that i am able to lick both of my elbows at once easily. I can pull my thumb back all the way to touch my arm. They ruled out all other reasons for having juvenile osteoporosis like thyroid, etc. so i thought “it has to be some mild form OI, theres literally no other reason” Flexible joints are not a symptom of OI\n\nHave you looked into this? Flexible joints and early onset osteoarthritis and easy bruising are symptoms. \n\n That is insane because my father had aortic rupture at 50 But my concern was the genetic osteoporosis that came from my mother side, my father did not have any of those issues but aortic rupture at a young age is a sign of ED disease That is insane because my father had aortic rupture at 50 But my concern was the genetic osteoporosis that came from my mother side, my father did not have any of those issues but aortic rupture at a young age is a sign of ED disease It is possible you have two different things co-mingling, one from each side. \n\nI am not well-verses in ED, but looking at the thumbnail list of symptoms plus what you have said, it seems possible. \n\nMy kid has an unusual presentation of OI and I had to figure it out myself and take it to the doctors myself, because no doctor ever suggested it to us, even after 3 breaks before the age of 5. She is being treated through Shriners Hospital now. \n\nTake the idea of ED to your doctor and see if you can get a referral to a specialist. (\n\nMy own personal experience with type 1 and the experience of my wider family members, many with type 1 would also agree with me. I can still get my thumb backwards to touch my arm same as OP and despite being severely out of practice am still of quite high flexibility for my age, though I was bendy AF as a kid. Really? Interesting. All the symptoms lists I have seen have not included that, and our doctor at Shriners told us that was not one of the symptoms, that it usually pointed towards ED. But the understanding of OI is evolving as new forms are discovered. My child is not a 1 so perhaps that is something more common in 1. I get what you mean with the pulling your thumb back, that was one of my party tricks back in the day but I have stiffened up a these days so doing it leaves me a little sore, though it is still doable. ( hence why I brought it up.\n\nHearing loss is pretty common in people with OI from my experience, mine went at around 7 or 8 but for most it goes around late teens or early 20's but I have got a cousin in his mid 30's that is still with usable ears. \n\nThe article I linked says that most cases of OI are through a clinical diagnosis which means a physical examination though that is the NHS, France for example would give a better, more full exam and America I guess it is whatever your insurers would pay for. I would really recommend pushing for a discovery of wormian bones. They are a really strong indicator for OI and would be a cheap entryway into more definite tests. Yeah I am type 1 so all the info I have been given was type 1 related. I have been out of touch with doctors for a while but know what my body does haha.", "Getting Stronger With OSTEOGENESIS IMPERFECTA - Brittle Bones ", "OI Conference Did anyone here join the OI virtual conference this year? If so, what sessions did you join? Did you learn something new? Have anything to share regarding a session you attended?", "Personal Record... Broken. I received my first pamidronate injection at the age of 17, and a month later I broke my femur at the thickest point of the femoral head. It cost me 2 months of cast, two months of PT, and 2 more months before I was walking with a cane again. Little did I know, though, that this would be my last broken bone for FIFTEEN years!\n\nI shattered my femur on my way to the library. The front wheel on my chair caught the lip of the curb as I went to cross the street, and it flipped me out. I cracked my head (only the skin, no bone, thankfully) on the street, sprained  two fingers on my left hand trying to catch myself, and shattered my left femur into 4 or 5 pieces, three or so inches above the knee. Despite how long it had been, there is just no mistaking that buckling crunch. I cannot help but think of crumple zones in cars, and it makes me laugh.\n\nMy ortho and I discussed surgery, but ultimately decided against it for the time being. Due to the curving deformation near the head of the femur, it would have been extremely complicated, and the pieces are all close enough together we are fairly confident it will heal fine. But my God, I forgot how much it hurts. There is no such thing as a comfortable position; only less, or more, uncomfortable. That said, it is a damn sight better than the vertebral compression fractures I dealt with 15 months ago. I will take this over spine problems any day of the week.\n\nI am grateful I am stronger than I was as a kid, and teenager. I have been able to handle this with a fair amount of grace and independence. My partner feels useless, and I feel bad about that, but I also know I am safer handling my broken leg myself. And ultimately, a lot of my problems (like the insomnia, the muscle spasms, the irritability caused by the pain), he cannot help with, except to be there. I am grateful for him, though.\n\nNow just comes the tedious process of healing, and then re-strengthening my leg. 15 years is an awesome stretch! I am sorry you broke it though, I am hoping you have a speedy recovery! I went 20 and also forgot how bad it hurts You know, it is funny. I forgot how much it hurts, but I have not lost any of the muscle memory. The little shortcuts in movement, supporting the leg with the other leg, getting from the wheelchair to the floor or vice versa when I need to... none of it. It is still as easy as breathing — so long as I can control the pain. Record breaking is the only kind of breaking I cheer for :D !\nSorry to hear about your femur, those are a bitch to deal with. I broke mine recently too, not looking forward to the next time lol.", "How do you with brittle bones deal with pain? My girlfriend has this condition upon many others and is always in pain everyday and is decline by doctors after doctors. She was not even accepted by pain management. She does not know what to do and has tried everything.  i use medical cannabis. it does not stop the pain like opioids but it definitely helps me manage it better. Damn see she is scared because New York is still prissy on medical and she is afraid of her job (walmart) testing her. She is a wreck and always in so much pain, she is supposed to remove her wisdom teeth with a serious surgery and her jaw will snap I dont know what we are going to do  dude that sounds awful. i hope she is going to a dentist that is familiar with OI... i have heard new york is really strict with their weed laws too.... im sorry i do not have much other advice.  \n  \n  has she looked at all into Pamidronate? she could try talking to an endocrinologist about it. it is used to increase bone density in OI kids and there is a lot of back and forth about the effectiveness in adults, but i have had very positive results with it. a lot less minor fractures, and it helps a lot with just the general aches and pains. it is an IV treatment every 3 months and if she is getting dental work it would have to wait til after that is done because it has negative effects on teeth healing, but outside of that i have found it pretty effective. the hardest part however is finding an endo that will prescribe it... Look into kratom works for me but do your own research. I feel for u I suffer too and I have tried the pomdronate could not tell a difference but there is some long-term effects to these class of drugs that the negative s out weigh the positive s at this point in my life are not worth risking. Honestly it is criminal that she was not accepted by pain management, I would try another office. If medical was legal in my state I would choose that, but being in Alabama it is likely never going to happen. I have broken over 200x &amp; had 25 femur rodding surgeries, I would not be able to function if it was not for pain management. Unfortunately pain blocks are ineffective for bone pain, chiropractic adjustment is risky, and physical therapy can only do so much. For me, opioids are the only option. It is honestly scary to think that people like your girlfriend are being turned away. I really hope she is able to figure something out, i cannot imagine what she goes through. Thank you for your response. She recently saw an orthopedist and he told her that her best bet is acupuncture. She is not sure what to do at this point we have a few more doctors we can see but she is really discouraged. She also says you have been through quite more than she has. She is so used to being let down though it does not bother her anymore I live in germany and got all my wisdom teeth removed a few months ago. I was really afraid of the surgery but it all went fine. I told them about my condition and they tried to be \"over carefully\" which was great. Aw maybe we should travel and get better luck", "Genetic Testing Good Afternoon Readers! I am writing this post to ask you a question. \n\nHave you gotten genetic testing for your Osteogenesis Imperfecta?\n\nIf yes, were the results what you were thinking? Were they different from what you were thinking? \n\nIf no, is there a reason you have not gotten genetic testing done? Are you afraid that it might come back and say you do not have Osteogenesis Imperfecta?\n\nMy husband and I have recently ventured into seeking medical assistance to start our family because it has not happened naturally for us yet. We were told because I have OI, they want me to get genetic testing done so that they can test the embryo's, take out the ones that have OI and give me a healthy embryo instead. \n\nAt first I went along with what the Dr. was wanting us to do, but now that I have gone through the trouble of trying to get a genetic test done, I do not want to do it anymore. \n\nI do not want to limit the chances of us getting pregnant by removing an embryo that has OI. \n\nIf my grandmother can take care of two children with OI in the 50's &amp; 60's, and my mother can take care of a child with OI in the 90's, then why cannot I do the same? Medicine has advanced so much since the 1950's. \n\nMy final thought is, \"I just want a child. No matter if it has OI or not.\"\n\nWhat are your thoughts on this?!\n", "Fundraiser by Lauren Page : Brittle Bones, Unbreakable Spirit Hey, you all! I am a fellow OI-er undergoing leg-lengthening surgery in July! I am fortunate to have most of my medical expenses covered through insurance, but I will be struggling to maintain my rent and utilities while I am recovering and out of work. Please check out and share my GoFundMe below! Anything is appreciated!!", "Eyes How many of you wear glasses because of Osteogenesis Imperfecta? Do you have any issues with scratching your corneas because they are so thin?", "My friend has an awesome brand called Disable My Disability. Check it out now! ", "WORKOUT TIPS FOR OSTEOGENESIS IMPERFECTA PEOPLE ", "Question: getting my knee mobile again, any tips? Type 1 here FYI. I have been using a wheelchair &amp; crutches for roughly 3 months at the beginning of the year due to a torn meniscus; so that leg was already a lot weaker than usual.\n\nAbout 6 weeks ago, I went and broke my kneecap in the same leg. I slipped and fell, but I think I did not actually hit my knee on the floor; the sudden movement basically caused my quadriceps and knee tendon to just tear my kneecap apart.\n\nI am asking if anyone here who has had a broken kneecap in the past has any tips for me to get back on my feet! I have not had a broken kneecap but I have had 10 knee surgeries on my right knee. Unfortunately for me it never has been the same. For no you, I would try to start with light biking if you can. Do you have a stationary bike? But honestly just take it very slow. Especially with our bones you do not want to take it too hard and get hurt again. I wish you luck my friend. I broke my kneecap before but it did not require much to get it back to normal. You would probably be best getting physical therapy. Physical therapy, definitely, and add hot baths to your regimen. It loosens up the tendons. I have to do this every time I come out of a full leg cast. Which I am set to do again in about 6 weeks. Yeah physical therapy is the way to go. If you do not have access to it there are resources online with good range of motion exercises, do at your own risk.    \nI will just add, you want to start right now, time is of the essence to recover range of motion after these kind of injuries.  \nI had a similar accident a few months back and was only able to recover up to 150° of extension with daily exercises.", "My son might have O.I. And I need some advice/input please I have Hypermobile Ehlers Danlos Syndrome and so I wanted to get my sons tested that way we can start early intervention because I am miserable with my pain and dislocations etc. My first son (13) they could not draw any blood after 3 pokes I made them stop and I am going to find a different lab and my second (10) they were able to draw the blood and send the test in. I got the results today and they show he has Ehlers Danlos and he has a gene variant for O.I. He is going to see a geneticist for further testing but I am trying to figure out what to do now. He has not had any broken bones yet so I am hoping he just has the gene and not the symptoms but I am not familiar with this at all. With Ehlers Danlos the symptoms usually start when you hit puberty and that is what happened to me but like I said I do not know anything about this. \nHow were you diagnosed? What testing did they do? Did anyone here get diagnosed with no real symptoms?\nAny and all advice is much appreciated! Thank you! I have extensive family history of OI (5 generations that I am aware of), and tbh I would have expected a break by the age your kids are. My family are all on the mild end of the spectrum, but most first breaks were around 2-5 years old.\n\nIt may present differently in your child, it may be nothing. Hyper mobility can also be an OI thing.\n\nOther than making sure the kids have a healthy diet, keep the weight down, and do regular weight bearing exercise (as it keeps bones and joints healthy) just wait for the doctors to come back with their full findings I came here to say this^^^ If he has not had a break yet I would doubt it is O.I. I had 6 leg breaks by the time I was 3. If you would like to get your 13y/o tested, they can do a saliva swab instead of a blood test. My son was tested for an OI panel via blood test. My husband and I were via saliva kit. \n\nKids with OI present differently depending on the type. Do you have a specific OI geneticist? I found that not all pediatric geneticists are as knowledgable about OI and how it presents. There is an OI mutation database where they can see if another child has the same mutation and how it presents in that child. I am happy to provide you with a recommendation as best I can for a hospital/expert depending on what part of the world you are in.  \n\nI am not sure where you had the genetic testing done (we did testing through GeneDx) but many places will calculate a PROVEAN score, which is a software prediction about whether the mutation will impact the overall gene and manifest as OI. My son has a \"Variant of unknown significance\", meaning that he had a Col1A1 mutation which has never been seen before. His PROVEAN score predicted that the mutation would have a deleterious effect on the gene. And he does in fact have a clinical diagnosis of OI.\n\n( has loads of resources. There is also a very active private OI parent group that is extremely helpful. Feel free to message me if you have specific questions!!", "How is Osteogenesis Imperfecta Inherited? ", "Hi! I was wondering if there are any trans people with OI? Hi I am Elfie, I am 17, I have OI and I am a trans boy. As I am turning 18 soon I have been seriously thinking about top surgery and getting testosterone injections, but last time I went through puberty it did not exactly end well. I was wondering if there are any other trans people with OI who would be comfortable sharing their experience? It would mean a lot of me!", "Resistance bands are great for us oi people ", "Who discovered Osteogenesis Imperfecta? ", "“Preparing for Battle #blastingarms #armdays #pumpedup  ", "Lose weight easy doing the low carb diet ", "OSTEOGENESIS IMPERFECTA HELPFUL TIPS ", "Osteogenesis Imperfecta | Hereditary Ocular Diseases ", "Pregnancy in Osteogenesis Imperfecta ", "Let me hear from you! Please, share your story below. What type you have, if you are taking any medication, how many broken bones you have experienced, what state you are from, if you were the first generation or if you received it from one of your parents. ", "Should you get SCOLIOSIS surgery? ", "Osteogenesis Imperfecta Type 4 Type IV:\nPeople with OI Type IV are moderately affected. Type IV can range in severity from relatively few fractures, as in OI Type I, to a more severe form resembling OI Type III.\nThe diagnosis can be made at birth but often occurs later.\nThe child might not fracture until he or she is walking.\nPeople with OI Type IV have moderate-to-severe growth retardation, which is one factor that distinguishes them clinically from people with Type I.\nBowing of the long bones is common, but to a lesser extent than in Type III.\nThe sclerae are often light blue in infancy, but the color intensity varies. The sclerae may lighten to white later in childhood or early adulthood.\nThe child’s height may be less-than-average for his or her age.\nIt is common for the humerus and femur to be short\nLong bone fractures, vertebral compression, scoliosis, and ligament laxity may also be present.\nDentinogenesis imperfecta may be present or absent.\nOI Type IV has an autosomal dominant pattern of inheritance. Many cases are the result of a new mutation.\nThis type is characterized by structurally defective type I collagen. This poor quality type I collagen is present in reduced amounts in the bone matrix.\nSignificant care issues that arise with OI Type IV include the need to prevent fracture cycles; the appropriate timing of rodding surgery; scoliosis monitoring; the need to develop strategies for coping with short stature and fatigue; the family’s need for emotional support, especially during infancy; and the off-label use of bisphosphonates. \nFamily members should carry documentation of the OI diagnosis to avoid accusations of child abuse at emergency rooms.\nIt is also important to address difficulties with social integration, participation in leisure activities, and maintaining stamina.\nThe treatment plan should maximize mobility and function, increase peak bone mass and muscle strength, and employ as much exercise and physical activity as possible.\nMicroscopic studies of OI bone identified a subset of people who are clinically within the OI Type IV group but have distinctive patterns to their bone. Review of the clinical histories of these people uncovered other common features. As a result of this research, two types Type V and Type VI were added to the Sillence Classification. Regarding these types, it is important to note the following:\nThey do not involve deficits of type 1 collagen.\nTreatment issues are similar to OI Type IV.\nDiagnosis requires specific radiographic and bone studies.", "Daughter with OI Hey all, \n\nI have a three year old beautiful daughter with OI. She is had four fractures/breaks of the tibia/fibula across both legs, but she is taken it all in her stride. I want her to grow up to think about what she can do and what is possible, not what might happen to hold her back. \n\nMy question is this: from your experience, what did others (parents, friends, relatives) do that made the difference for you? What advice would you give your parents as a child if you knew what you know now? my mom has OI also so i had a lot of 2nd hand experience already in my childhood.  but one thing i remember my dad always doing was making sure i was included in all the child activities in a way that was safe for me, but still involved.  for example, i would play softball with the church kids, where i would be at bat, and have a pinch runner.\n\nmost important thing is to treat them the same.  do not do anything different outside of the medical needs.  if there is something you are not sure they can do without hurting themselves, figure out a safe way for them to do it without hurting themselves.  but do not ever tell her she CANT do something because she *could* break.   \n\nbreaks are going to happen.  they happen during the most mundane tasks sometimes.  it sucks.  but if you avoid everything because of the possibility of a break, we would be miserably isolated.  \n\nalso, a big thing for me as a kid was LETTING my body heal.  as soon as i felt good enough i would be up and moving again, and it led to a lot of re-fractures.  this is probably going to be the hardest part is telling your kid to chill on the couch and let them heal.  (it was VERY frustrating for me as a kid)  but, as they get older it is going to be amazing how much intuition they have over their own body.  they will know how to move and hold themselves while something hurts.  trust them when they say how they feel or how something hurts.    \n\n\nanother big thing , as a parent, YOU know what is best for your kid.  you are gona have a lot of doctors and nurses that think they know better.  but if there is ever something you are unsure of in her medical treatment, SPEAK UP.  my mom tells me stories all the time of nurses trying to move me wrong or dose me wrong and it coulda been disastrous if mom had not been vigilant in her advocacy of us kids.", "Has anyone ever met somebody else with OI? I know most people get OI from their parents which might help growing up because they have a better understanding of OI. I unfortunately got OI from a sweet genetic mutation. My family growing up did not really understand how to help me and pushed me to just be normal. This led to SEVERAL breaks and surgeries. I guess i am just wondering if having someone else who understands what it is like to look completely normal yet always be worried of a  breaking helps? Hi, I am in the exact same position. I have type 1 caused by genetic mutation. I am a bit shorter than my friends, have blueish sclera and am covered in scars from all my surgeries but other than that it is impossible to tell I have OI. My parents also did not want me to feel different from my friends growing up so encouraged me to set my own boundaries of what I could and could not do. Of course they guided me along the way but I still ended up breaking lots of bones playing tag or kicking a ball around.\nI have also broken my femur (and several other bones) from a simple slips/falls/trips inside my home so I am glad that I did not hold myself back in regards to playing with the other kids as I would still break bones anyway. \n\nThe hardest part for me growing up was having to tell people that I had this condition. I often felt I was judged or treated differently because of it. Other parents were usually the worst as I missed out on birthday parties and often was not invited to places because they were worried I would break. \nAcceptance is not easy and it took me the best part of 19 or 20 years to fully accept it and be able to talk openly about it. Surround yourself with the right people and have a good support network. \n\nI attended a meetup a couple years ago for people with bone conditions that was organised by my hospital and I met two other people with OI. One was a mother who was not diagnosed until very late in her life and she has passed it on to her kids so she was obviously upset about that but she had learned to live with it. The other was a guy about my age who had only ever broken 4 or 5 bones throughout his life and had not broken anything in over 8 years thanks to bisphosphonate treatment. \nIn a weird way I was envious of him, I had had the same treatment all throughout my childhood but still broke regularly. In my mind it sounded like he had been \"cured\" but obviously there is no cure for us. They seemed like nice people but we did not exchange info or anything. \nI am sure I will see them again at the next one. \n\nHope that helped you a little. If you want to reach out my DMs are open. I am pretty sure my OI was a spontaneous mutation too; there was no other family history I could find in my large extended family. I was lucky--my dad was a Radiologist so I had a lot of easily-accessible fracture care growing up, but I still felt some of the pressure you are talking about to \"be normal.\" I was married to someone who came from a family of power athletes, and although she acknowledged my explanation of OI, her comments always indicated she held suspicions that I needed to \"man up\" more often. That marriage did not work out, and I remarried someone who was very understanding and supportive. \n\nI do not think Type 1 OI has much of a community out there because we are not as disabled as the other types of OI, but that is just my experience put to theory. There was a website called ( (now defunct) that was an ultra-simple forum for people to share stories about their impairment from having a broken leg. When I had a major tib/fib plateau fracture, that site was a godsend to me because it shared other real and human stories of other people's experience with the disability and suffering caused from a major leg fracture. I have been thinking about creating a similar site/archive for stories about Type 1 OI. It is an uncommon and invisible condition, but we still have shared and valuable experience and insights to share with each other. \n\nIf you ever need to chat please feel free to DM me on here. i have type 5 oi and mine’s a genetic mutation too! my parents were actually the exact opposite and wrapped me up in cotton wool my entire childhood, so i never really developed any independence skills which is something i am still trying to navigate now, at 16. i have met a few people in real life with oi, purely because of my times in hospital for treatment with other oi sufferers. i have never stayed in contact with them, though. i have 1 friend with oi and we actually met on this subreddit, as he has oi too. but i have never met someone with oi for reasons other than that  Funny thing, I have OI and never even met ANYONE who has it. No family members, no nothing. I am not in contact with my dad's side of the family but you never know. Maybe one of them has OI? Hi I have type 1 Oi with blue sclera and you would not be able to tell I have it if you cannot see my surgical scars. It was passed down throughout my family (I got it from my dad (type 3), my mom and older sister are fine). My mom was alot more active in caring for me and making sure I was not embarrassed of my condition so I would go to an Oi convention thing almost every year, but because my Oi was a very challenging thing for me I did not keep in contact with anyone I met there. I wish so much now that I had a friend with Oi because I am 17 now and struggling.", "Osteogenesis Imperfecta Overview ", "Taking time off I will be taking a break from this subreddit for an undisclosed amount of time. \n\nMy mother passed away very suddenly on 9/8/2017. She was only 56 years of age. ", "Trouble sleeping... Really not fun. TW: Fatal Insomnia mention.  I have always slept well since I was a child, now I am 15 and I myself have a rare disease called Osteogenesis Imperfecta, the less serious type of the disease. My sleep horary since the pandemic has been... Messy, I used to stay up at night and sleep during the day most of the time, then I also switched horaries, it is been over a year that I do not know what it is like to sleep at night thanks to some friends I had that had far different timezones from my own. Now after going to the hair sailon + going to my dad's, last week, and not sleeping for 30 hours +, the hairdresser washed my hair in a very rough manner and I guess I was already going through sleep deprivation that day, my body and brain were put through much shock and I was pretty sleepy but then jolted up, I almost fell asleep at the hair salon but then she washed my hair in a very rough manner and it hurt me and my neck. I had a tension headache the exact same day and since then I have been having trouble falling and staying asleep. I decided to search what this was about and came across SFI/FFI I cannot exactly say that I was anxious the day I found it perhaps I was, but just not experiencing it on the body then I just kind of seemed to obsess over searching the symptoms I guess I might have been somewhat scared of what was happening to me and why I have been having so much trouble staying/falling asleep, the same day I found SFI I started feeling strange body vibrations on my body, but it is not shaking whatsoever, I have tried to fall asleep but just cannot manage to do it. I was scared at first that I had it but then managed to convince myself that I am not a unicorn because of how rare that disease actually is. But nevertheless, the vibration on my body and this headache seem to be the thing that is keeping me awake, yesterday I do not even know if I slept because of this, I feel exhausted but just cannot manage to sleep and I do not feel anxious either I just cannot explain it properly, please help. I miss the days where I could sleep well. \n\nMy GP says I am just anxious and that this is normal, but I am scared that this will only get worse even if the likehood of having what I mentioned above is literally 0, specially since I am a teen. Should I go to the hospital, ER? You are the one in your body, if you think it is something more go to the doctor. For no other reason than having another opinion could put your mind at ease. \n\nNow did your doctor prescribe you anything for your anxiety? Would that even be something you would be into? Have you guys suggested using a sleeping aid to relax you? \n\nLastly, the tension. You can put a warm towel on your neck to relax the muscles. It is possible that part of what is happening is that you suffer from bad posture, mixed with the insomnia, and the higher pain tolerance of OI. So some heat could relax the area for you. Or resting with some ice hot on your neck and shoulders. If financially possiable maybe a massage would help you. \n\nI am not a doctor, just a massage therapists with type 1. So everything you are experiencing I am or have experienced before. So I know the pain you are going through. \n\nI hope you can find any of this helpful `I started having these weird buzzing sensations on my ears. I do not know if I am hallucinating or not at this point. But I do have a scoliosis, well a big one, and my posture REALLY is not the best. Well a bit ago I was trying to sleep, and I could not get my mind off of Fatal Insomnia even though I keep trying to reassure myself I do not have it because of how rare it is, I am not sure if I have anxiety but I may be hyperstimulated, I am not sure. I did try a sleeping aid before, it worked at first I managed to get a 4 hour sleep in the afternoon, but now, not so much.`  I just really need someone to talk to right now.", "How I Reduced My Fractures (Having Type 3 OI) ", "Wishbone day! ", "Interview request Hey guys,\n\n&amp;#x200B;\n\nI am hoping to interview someone with brittle bones for a feature in a women's magazine in the UK.\n\n&amp;#x200B;\n\nPreferably female (but do not worry if you are not, still get in touch!), I would love to hear a bit first about how your life has been affected by brittle bones and any specific incidents that come to mind.\n\n&amp;#x200B;\n\nFeel free to shoot me an email if you are interested, we will pay for your time :) \n\n&amp;#x200B;\n\n\n\n&amp;#x200B;\n\nYou can read a bit about my company's sister site Talk To The Press here - (  I know this is late in the game, but if you are still looking I would love to help. I am a 24 year old female with OI. I have broken over 200x,(my parents and I honestly lost count) have had 25 surgeries and 16 full body casts. I am not shy so I could answer any questions you may have! 😊", "I have Type 3 OI / Motivational ", "Academic Survey: Mobility Hi there I am a Product Design Student at The University of Strathclyde in Scotland and I am looking into home solutions for those with mobility impairments. \nI have a quick anonymous survey for you to complete if at all possible, the results for which will be used purely for research purposes. By filling out this survey you are helping me to understand the market more which allows me to design a product (not going to market) that would be more appealing and suit the needs of the market better. \nI am also happy to answer any questions pertaining to the survey or project.\n\nSurvey on Mobility Products:\n\n", "Jeffy car  I do not get it.", "AIR BAG EXPLODING! Hey you all ! :) \n\nMy little brother just turned 18 and has O.I. Type 3. In our family you have to wait until you are 18 to be allowed to get a license. He has been firm on not wanting a license and still only rides in my backseat where he feels safest. I recently gifted him my old Toyota Camry to putt-putt around in the back pasture to understand driving. Even though he says he does not want to drive I think once he gets in he will love it. I have not told him because I  do not want him to think I feel sorry for him or something but I AM terrified of him driving. I just wanted to be the cool older sister. So my question is do you guys who have OI drive? Did you feel scared? What if he gets in an accident, his air bag deploys, what?! Will he be okay? Have you guys been in a car accident? I am so scared and simultaneously so excited for him.  I would love to hear your experiences. Thank you have a wonderful week &lt;3 Hi. I hate to be the first response because I have no help. This community is small with only a couple active members (but more knowledgeable than me). But, I think they may have some good insight. I am pretty sure one guy drives.\n\nI am not OI, but through some random experience I have researched a little on vehicle modifications a couple years prior to my daughter being born with OI.\n\nYou cannot alter the air bags. If you do and an accident happens he will remain liable for expenses to himself. And... it is illegal. However, I have seen a lot of stuff altered (maybe air bags) for medical necessity. For example I was allowed to legally not wear a belt for a surgery recovery window (exciting stuff). With medical necessity comes that window of opportunity.\n\nWith your brother, it would really depend on your doctor's medical opinions and any advice he may have, also physical and occupational therapists and stuff like that. Mobility stores are great, and they are usually really knowledgeable about stuff. OI is a little rarer, but the couple places I talked to seemed to want to make sure they gave good info and took the time to learn a little before they just answering questions.\n\nAlso, on Facebook there is a community OI page. It is pretty active. But, simplify and just ask about your brother starting to drive with OI and getting over the anxiety and you may get a lot of responses. Like many, I would say do not push him. A collision can be a big issue with the steering wheel. But, at the same time I understand what your doing and it seems your trying to be smart about it. Just keep his safety at the front of your mind. Party on Mild type 1 here. I drive, I honestly could not imagine life without driving these days. A big part of the risk management for me is to simply drive responsibly. If I am going to crash then it would naturally be better to crash at 30mph than 50mph, if I were to crash at 50 then I will make sure it is into a hedgerow with an open field behind it. You see what I am saying? \n\nAnother part is to be extra vigilant in the search for bad drivers. If I see someone lane hopping, on the phone, tailgating etc then the best thing for me to do is yield, get out their way and let them annoy and endanger someone else.\n\nAs for things like air bags and seat belts, if it was not for those then we would be hitting the steering wheel or windshield or whatever else hard object that makes a car. I would rather an airbag break my neck but keep me alive than my steering wheel break my neck whilst also collapsing my skull and everything else.\n\nA worry of mine is that after a crash someone would be overly touchy with me so I have a printed piece of paper with all my medical issues in close reach and visible. When I became a first responder I learned that with proper handling you can walk away from a broken neck without lasting injury, things like paralysis can be caused after the injury by someone being overly rough so it is important to try to keep any well intentioned 3rd parties from being grabby so the paper has enough on there to hopefully back them off and get the pros in.\n\nYou could change the seat belt, or rather the whole seat if you really wanted to. A 5 point harness will help to minimise any injury much better than your normal seat belt.\n\nTl:dr Drive responsibly, keep an eye out for idiots, airbags are softer than a steering wheel and in the event of a crash, get the pros out rather than letting someone else touch you.\n\nAlso, you **are** the cool older sister for helping your bro get his wheels and get his confidence to be behind them. I have Type 1, have been driving for 11 years, since I was 16. My dad used to be a taxi driver and taught me in an automatic (manual was too physical and hard for me). He wanted me to have experience on all roads, suburbs of Sydney and I also helped drive on road trips to Queensland while I was a learner! \n\nI love driving, I am very confident in the drivers seat, I also sat in the back-seat for most of my childhood and my mum was very concerned and I vaguely remember her taking me to getting multiple opinions. My geneticist said that the airbag becomes an issue with height - similar to a child being in the front seat, if they are in an accident in the front seat it is more dangerous.\n\nBut its been a massive help to my independence and managing my fatigue. I am able to do fun things and go to appointments without relying on friends and family too much. My friends have a running joke that I will drive any and all distances, no matter how short, if im late its because of parking and i will leave an event whenever I want haha, driving has given me confidence 😅 \n\nI would recommend lessons with driving instructors, and also maybe a defensive drivers course. My dad got me started and it was great to have professional lessons too (could be a fun activity that you do together!) I have been in situations of near misses and its been super helpful to know how to manage myself and the vehicle, and anticipate others actions to avoid crashes.\n\nHope this helps 😊", "How To Not Break While Having Osteogenesis Imperfecta Listen to the most recent episode of my podcast: How To Not Break While Having Osteogenesis Imperfecta  ", "Osteogenesis Imperfecta Type 3 Type III:\nOI Type III is the most severe type among children who survive the neonatal period. The degree of bone fragility and the fracture rate vary widely.\nThis type is characterized by structurally defective type I collagen. This poor quality type I collagen is present in reduced amounts in the bone matrix.\nAt birth, infants generally have mildly shortened and bowed limbs, small chests, and a soft calvarium.\nRespiratory and swallowing problems are common in newborns.\nThere may be multiple long-bone fractures at birth, including many rib fractures.\nFrequent fractures of the long bones, the tension of muscle on soft bone, and the disruption of the growth plates lead to bowing and progressive malformation. Children have a markedly short stature, and adults are usually shorter than 3 feet, 6 inches, or 102 centimeters.\nSpine curvatures, compression fractures of the vertebrae, scoliosis, and chest deformities occur frequently.\nThe altered structure of the growth plates gives a popcorn-like appearance to the metaphyses and epiphyses.\nThe head is often large relative to body size.\nA triangular facial shape, due to overdevelopment of the head and underdevelopment of the face bones, is characteristic.\nThe sclerae may be white or tinted blue, purple, or gray.\nDentinogenesis imperfecta is common but not universal.\nThe majority of OI Type III cases result from dominant mutations in type I collagen genes. Often these mutations are spontaneous. Similar extremely severe types of OI, Types VII and VIII, are caused by recessive mutations to other genes.\nGenetic counseling is recommended for asymptomatic parents of a child with OI Type III before any future pregnancies.\nSignificant care issues that arise with OI Type III include the need to prevent fracture cycles; the appropriate timing of rodding surgery; scoliosis monitoring; respiratory function monitoring; the need to develop strategies to cope with short stature and fatigue; the family’s need for emotional support, especially during infancy; and the off-label use of bisphosphonates.\nIt is also important to address difficulties with social integration, participation in leisure activities, and maintaining stamina.\nThe treatment plan should maximize mobility and function, increase peak bone mass and muscle strength, and employ as much exercise and physical activity as possible.", "OI Diagnosis My daughter had a broken humerus bone on her right arm when she was born. Genetics doctor ordered genetics test but result is inconclusive. She also had low tone muscle and has been on physical therapy since 5 months. Her weight gaining is very poor, weight and height are both 1% although she is eating ok. Yesterday( she is 10 month now)  we took her to do another skeletal review and\nAfter xray her bones they found another fracture on her right mid clavicle and dr also said she has thin tubular bones, wormian bone. The clavicle fracture surprised us because she has not cried and not appear to be in pain. Question: is there any chance she might have mild form of OI that the genetic test could not find out? What is the best hospital and doctor on OI that around the new jersey/ new york area? Can you guys share with me how you got OI diagnosis? This sub is not the most active, if you have Facebook i would recommend the OI Community Forum. OI has a lot of various features depending on type, and luck of the draw. But, the Facebook page is pretty active. If your child does end up having OI there is also a closed parents Facebook page you can join when you find out.\n\nThere are a few who post here, on reddit, they may be able to help more. i am not sure how much help i will be - i was diagnosed when i was a baby so i really do not remember the process much and i am from england so i am sure the system is different over there - but i can tell you what i know of my story. \n\ni have type 5 brittle bones, which is a moderate type and is very rare. i was a planned c-section when i was born, and if i was not i would have probably died in childbirth. my parents did not know i was disabled until after i was born. when i was born, i already had fractures. the doctors realised and established that i had some kind of problem. i am 17 now so this all happened in 2004, medical knowledge of brittle bones was not all too great yet so they thought initially that i had type 2. then they realised i was one of the rare ones with type 5. i was very lucky in that the doctors figured it out so fast. \n\ni am not an expert on the other types of brittle bones, but i am sure there is a chance she has oi. the thing that sticks out to me is the fact that your daughter does not appear to be in any pain - it is common for us to have a high pain tolerance because we are so used to fractures, though this usually develops in later life. for example, a few years ago, i had a fractured leg and did not even realise and carried on walking on it and hiking until we realised. \n\ni cannot talk for professionals in new jersey, but if you look online for anyone with knowledge in metabolic bone diseases, that is a good start. i speak to a professional called professor nick bishop, he is located in sheffield children’s hospital in the uk, and as far as i am aware he is one of the leading oi specialists in the world - especially in children. it may not be easy to get in touch with him but it would be worth a try and he could at least tell you if her symptoms sound right and could direct you further on how else to explore this. \n\nlike i say, i am no expert and all i have really done is waffle on for a bit but i hope this helps. and i would like to say that you seem like an excellent parent and that your daughter is very lucky to have such a proactive parent that very clearly wants the best for her. There are types of OI that genetic testing cannot identify. My child and spouse have OI but it does not match any of the current known genetic types. However, new types are being identified regularly. Their samples have been sent to a doctor in Montreal who is the leading expert in this to be tested for some new types he is identified. \n\nIf there is one near you, see if you can go to a Shriner’s hospital. They can do more detailed testing and help you, and if you cannot pay or your insurance does not cover the treatment or testing, it is free. They have helped my daughter so much.  The Shriners in Philadelphia does Orthopedics. \n\nI wish you and your family the best. Good luck in your journey. Thank you. Do you have the name of doctor on Montreal? No, it is being done through our doctor at Shriners. Just seeing this now. You should call Nemours DuPont in Delaware. Dr. Bober is a world expert. Nemours is one of the best and local to NJ/NY(Montreal Shriners and Omaha also among the best). My son has a variant of unknown significance meaning he has a genetic mutation in the COL1A1 gene but no one has ever had it before. His mutation was spontaneous. Feel free to private message me. I have lots of resources. I just went through this with my son (9 months). ", "DEALING WITH DEPRESSION WITH OSTEOGENESIS IMPERFECTA ", "Height i am a type 3/4 OI guy, 19, and I am really curious about the height others with OI are. i have been told I am sorta tall for OI and i do not know if that is true or not. a couple of the OI people i know are about 2-3 feet tall, and I am 4'11\" so is that tall for us?? id love to know what u guys think you are definitely a tall one! there is 4 OI folk in my family. i am about 3'5, my mom and brother do not really stand so they are probly around 3ft. my sister is our tallest and she is only about 4'1. oh interesting. luck was on my side i guess Lmao you are tall. I am 4’6 and I have always said I would kill to be 5 foot 😂 \nI have never been “typed”, but since I had a family history and had a broken arm and leg in utero they did not make me have a bone marrow biopsy, which was the only way at the time to get a diagnosis of which type. Luckily I have Typ 1 and I am 5'2", "Back workout &amp; pushups with Brittle bones ", "Osteogenesis Imperfecta Type 2 Type II:\n-OI Type II is the most severe form.\n-At birth, infants with OI Type II have very short limbs, small chests, and soft skulls. Their legs are often in a frog-leg position.\n-The radiologic features are characteristic and include absent or limited calvarial mineralization; flat vertebral bodies; very short, telescoped, broad femurs; beaded and often broad short ribs; and evidence of malformation of the long bones.\n-Intrauterine fractures will be evident in the skull, long bones, or vertebrae.\n-The sclerae are usually very dark blue or gray.\n-The lungs are underdeveloped.\n-Infants with OI Type II have low birth weights.\n-Respiratory and swallowing problems are common.\n-Macrocephaly may be present. Microcephaly is rarely present.\n-Infants with OI Type II usually die within weeks of delivery. A few may survive longer. Cause of death is usually respiratory and cardiac complications.\n-OI Type II results from a new dominant mutation in a type 1 collagen gene or parental mosaicism. Similar extremely severe types of OI, Types VII and VIII, can be caused by recessive mutations to other genes.\n-Genetic counseling is recommended for parents of a child with OI Type II before any future pregnancies.\n-Significant care issues that arise with OI Type II include obtaining an accurate diagnosis, getting genetic counseling, the family’s need for emotional support, and management of respiratory and cardiac impairments. Infants with OI Type II who can breathe without a respirator and those with severe OI Type III may be candidates for treatment with bisphosphonates. ", "I have type one, but my bones are almost normal, kind of. I am 21, and unaware what my bones density is currently. I have blueing in my sclera, and bad joints of course, but no none breaking since second grade (toes do not count)\n\n When I was little, my parents agreed for me to be part of a beta test drug to improve my bone density and have an almost normal life. They fought for me to be in the real drug, not the placebo, and I have not broken a big bone since I went off the drug, but I also have not really done anything extreme. I was not allowed to do sports of any kind growing up, not even gymnastics. I am still afraid to do anything even slightly dangerous because I do not want to break anything. I know my bone density is much better than it was, but I am still afraid.\n\nOi runs in my family, and I grew up watching my mom be in pain all the time, breaking so easily, and I worry ever day that I will be like her. On top of that she has extremely really onset Alzheimer's, at 30-35 years old and that is terrifying to me.\n\nBack to oi though, Is a drug or medication to improve bone density an option nowadays for people with type one? Type two? I never heard anything about the medication being approved, or what happened after the study. It obviously worked for me, so I wonder if it changed anything in the OI community. Do you remember the name of the drug? I could probably ask my parents, but I have no idea. I was really young when I was on it, and my parents never really talked to me about the results. I hope it helped other people like it did for me, but I do not know there is!  i was on Pamidronate.  (sp?)  i was on it for a few years until i lost my endo and could not find another that would put me back on it within my insurance.  (still looking)   i would get a treatment with it every 3 months and my strength improved and my aches decreased significantly.  it helped a ton.    \n\n\nmy brother was one of the first kids put on it when he was 8 years old (about 23 years go?).  his OI was so severe he could not sit up on his own, and would hiccup and break ribs.  after his first treatment he was sitting up and playing.  after a few months, there was significant change to his bone density.  (the first scans they thought the machine was broken because his bones were so thin)  \n\n\nthere is been a lot of back and forth about whether it works, but in my experience it does.  and what i have seen when it is given to kids they are growing without bone curves and living with significantly fewer fractures.  i do not think it is become the norm yet though, sadly.  i wish it were easier to find an endocrinologist that would support it, because i have had little luck. I think the drug I was on was just a bit different, it was a pill taken once a day, and because I was a little snot as a kid and would not take pills, they dissolved it in a little shaker with some water and I had to drink it. I stopped taking it once I turned about 7 because they said it would not help anymore. Glad to hear there is medications out there though! From what I was told by a genetic counselor: With type 1 you typically stop breaking bones once you hit puberty and then again as you get older you can start breaking bones again. \nAt 23 I was officially diagnosed with type 4 that mimics type 1 because of my gene \"kink\". By 7th grade I had 9 breaks and I was much like you in that I stopped doing anything that could potentially result in a break.\nThe last bone I broke was in 6th grade but then at 31 I broke my ankle in 3 places walking down steps and missing one.\nI was always told nothing will help me, but I am always down to learn more! Maybe I have type 4 then? I do not know, my parents and I do not communicate well. I have whatever my mom has and she has broken bones pretty much throughout her life, it just slowed down through her young adulthood because she is never been a very active person. The only way to know 100% is by genetic testing. Maybe your mom has had it done in the past?\nIt was kind of cool when I got my results back because at the time I was the only person in the national database with my genetic mutation. I am an x-man with terrible powers. Haha that is true, it is an awful awful power haha some might say useless, but I say otherwise! I will have a talk with them soon to figure out more, I think it is important to know what is going on with my body. I tried asking my doctor my bone density, and what it means for how careful I should be, but I was met with a firm: ¯\\_(ツ)_/¯ It is so important to know! If you plan on children, they have a 50/50 chance of having whatever type you have as well. Plus, if you do get confirmed with it you can get one of those stylish bracelets JUST IN CASE. People will know how to handle you because we are fragile flowers that need extra care. I have never had a bone density because I was never told it would make a difference. When I had my ankle surgery the surgeon told me had I not told him about the OI, he would not have known screwing a plate and screws into my bones. I have been meaning to get a bracelet or necklace, but I have not yet. I do know that I have been confirmed for oi, I just have no idea what type. I dunt even know my blood type though 😬 I should really talk to my doctor lol", "Brittle bones mental health Anybody else feel not okay sometime ? My life is great and I am very thankful for how blessed I am but does anyone else just feel stuck in their bodies sometimes ? Idk I feel like I have Trumatic memories from the hospital/fractures and sometimes it is hard to cope. I feel like I get phantom pains and flashbacks or something... idk I think I have just been down lately and regular people do not understand so it is hard to talk about. (I never get to you all about it) I guess I am just wondering if others feel like this too. I do not have OI, but my son does, so I am hoping it is ok to reply to you. OI is a traumatic and painful disorder. I seek mental help to help me cope with his OI diagnosis and once my son is old enough, therapy and mental health support will be part of his treatment plan. Talking to people going through similar challenges is so important. Are you a part of the OI community group on Facebook? Seems like it is more active than this sub.\n\nAlso, it is possible you are not having phantom pains but actual bone pain. Do you see any OI experts? It is worth going for a clinical review if you feel you have anything physical that may need to be addressed. \n\nBe well! I will try the Facebook group I did not even think about that ! And I hope your son is good and well! I know my mom had her own traumatic experiences raising/caring for me so do make sure your mental health is all okay ! I am glad you guys are going about it in a healthy manner As well, there was not any support groups when I was growing up! Thank you for the advise tho I appreciate it I am definitely going to try to meet others and move past my own issues. \nGod bless I do not have OI but I do not feel okay sometimes, I think as humans we all go through that -hugs-. My little brother (18) has OI type 3 and I literally have never once heard him complain not even after he is broken bones. I am scared he is holding it in and putting on a brave face but he actually seems so carefree I do not know that he actually even cares. I get sad sometimes thinking he has not opened up to me or expressed being mad because I am mad at the world for him. I told him I want his life and we joke all the time that he has it made. He gets to stay home all day play in the woods (Trac chair) have friends over go places with people and has no monetary worries because my parents gave him his own space in the house. So I think he might have just realized it is nice not to be a wage slave but I am still mad at the world for him. I wish I could be there on a deeper level for him and help him if he is hurting. I wonder but never pry. Idk there was not really a point to my story I guess it is just nice to talk with others. Have a wonderful night &lt;3 Thanks for sharing it means a lot Apologies in advance for this stream of conciousness reply! But I hope helps!\n\nI have Type 1, 27 and this has been happening to me increasingly I think its because of the pandemic. Its just a new layer of anxiety! I havent been down the therapy road, but maybe in the future if im comfortable and bothered to go haha.\n\nMore recently I am concerned about how I will manage my condition as I age, I have also had a few experiences that have reminded me that I am not 10ft tall and bullet proof. It is hard to talk to my 'normal' friends about things, and I am also the only one in my family with it. Because of this it is created strains on relationships because I am \"treated differently\", I have had boyfriend call me a brat because they did not understand how fatigue affects me and what I can/will do.\n\nI think the biggest one is that I realise I do not process injury events the same way as others. I dont remember the event very well and almost black out the moment of injury. Sometimes I get flashbacks and remember vivid detail about scenes when I have had a break and go into a cycle of reliving the lead up and afterwards of incident, this is very stressful.\n\nAlso when I am going to be in a new situation I imagine all the different ways I could fall or break or hurt myself. Alot of my breaks have been due to other people's actions, so I am hyper aware in public spaces or crowds. When I worked in retail I went to my gp because I thought I was sick for a week or 2 with a cold and fever, she explained that sweating, feeling faint and blurred vision was a panic attack. I had this so much I thought I was \"just a bit nervous\".\n\nI think the toughest part is that there is alot of \"inspiration porn\" around disability and we are expected to overcome and excellent despite the odds! It is tiring, I have learnt a few things that help me and that I try to stay on track with..\n\n-do not put pressure on yourself\nWhen Im anxious/down I try to give myself a mental holiday, like if I was physically tired and needed to rest my muscles, I try let my brain rest and just do things that feel nice eg. Sit in the backyard and take a nap. No guilt!\n- do what you can!\nSomedays for me this is just eating 3 meals and staying hydrated, other days I do all my housework and go to work and meet up with friends!\n- stay connected\nMy favourite is phone calls! Can chat for hours without the physical excertion, can also be once a week movies with friends\n- boundaries are excellent!\nI drive everywhere so that I can leave whenever I want! Feel uncomfortable? Leave. Too crowded? Leave. Too far to walk to the next location? Drive to keep energy levels.\n- NO is a full sentence\nDo not feel like you need to explain yourself! Especially when you think the other person will not understand, or if you simply do not have the mental space for explaining.\n\nSometimes the most difficult part of OI for me is that my brain wants to do things but my body cannot. So we have to come up with creative solutions!\n\nMy brain might want to go to a concert and be front row in the mosh pit. But my body cannot, so I comprise with balcony seating and earplugs for the volume, I have someone with me, drive there and back, and sit in the seat until the crowds have moved on to leave so I can go slowly.\n\nI used to miss alot of school in highschool, and my peers used to think I was just skipping school and I never cared to explain why. One of my teachers (knew my condition) pulled me aside after I had not come to school for a week and said to me that she was really glad that she was really happy to see me in class and that I did not have a \"woe is me\" attitude and that I \"just got on with the job. She knew my limitations and was stoked to see me doing the best I could, that stuck with me that I want people around me that are understanding when im low but stoked when I am doing my best.\n\nI hope this helps 😊😊 I think we have a lot in common thank you for the advice ! You are a positive person which is a great trait with this condition I hope you continue to stay this way ! Thank you so much ! Flashbacks are a thing.", "Follow Osteogenesis Imperfecta Foundation on Twitter ", "Child Abuse VS. Osteogenesis Imperfecta ", "Join us in 2018 for the Osteogenesis Imperfecta National Conference ", "Hearing loss associated with Osteogenesis Imperfecta ", "Massages are beneficial for us! ", "Seasonal variations Hello !\n\nEvery year around April-May, i have severe headaches in the afternoon. My doctor says it might be linked to heat and clock variations or it could be neck pain and brittle bones but she is not sure (since i have chronic pain in my body parts but not in the head).\n\nThe thing is that I have never headaches in the rest of the year.\n\nDoes it occur for you too ?\nDo you have headaches and how often ?\n\nBy the way, i feel a lot of pain where I broke during winter. Especially when it is damp or cold.\n\nWhat about you ?\n\n Weather does have effects on my body. You could also have seasonal allergies and your sinuses might be blocked. Are the headaches always located in one spot on your head? Hi there. First of all, nice to meet you. Please do not hit me if I am doing some things wrong, as I am new to reddit, but willing to learn.\n\nI am Marlén, 29 years old from Germany, OI type 3.\n\nThe summer season does wonders on my health usually, as the sun seems to soothe my heavy scoliosis pain, but this month was the painfullst since the year started, including a unusual amount of headaches.\n\nBut, also no clue why it is so hard this summer. So just you know you are not alone.", "Scoliosis Hi there.\nAs I am experiencing a confusing time at the moment, I wanted to ask you if you experience stuff like me.\n\nAs said earlier, I am female, Type 3 OI, 29 years old. 21kg and 1 meter tall. I have a heavy scoliosis, ever since I can think of.\n\nFun part is, I feel it moving. And you can see the progress every few months. As a teen, it affected my lungs. Now in my late 20s, it seems to affect my digestive system. \nI went to see my doctor and all he saud was \"huh. Usually your spine should be done moving after you are done growing\" but I am done growing since I am 14.\n\nDo you suffer of similar effects or is it just me, the alien?\nThank you and have a nice day!\n You are not an alien. I have had doctors do complete 180s on me.my whole life -saying the symptoms i expressed were very concerning then after tests come back negative, saying my symptoms are perfectly normal. I still have no answers. It is very frustrating but they are only people too and probably have more expertise with their more common problems. That Is what i tell myself, anyway. \n\nIs there a forum for you, do you know? There are lots of forums that are health-specific (graves disease, multiple myeloma, etc.), if you re-ask there you may find the doctor that is right for you! Thank you for your kind words and experience &lt;3\n\nI as a kid was part of the OI society, but I never felt like fitting in, mostly because of my grave humour I guess ^^ the last good Doc I knew refused to treat regular insurance people after a while, so I have not found an alternative yet. \n\nBut to be honest, I do not give much on their words either, as I am way over the point where something could be corrected without heavy issues I am not willing to take at this early age. Therefore, Painkillers and dark humour it is :D\n\nThe whole symptoms thing is as it is - at least I am glad they do not try to sell me some BS. My doc is cool enough to admit that he has no clue what is going on and why. \nIts cinema for both of us to watch my spine, I guess :D\n\n Hi.\nWhen you say you feel it moving, does it cause severe pain ?\n\nIn my case, I have pain on Lumbar (lower back) according to the way I sleep and I feel that my pelvis evolves. I am a bit younger than you(25) though.\n\nDigestive system is a problem I have since I am a child. But i am not sure how to speak of it.\n\nI will make some research this week-end. I have a constant back pain level of three. Every day. I have noted that the spine moves in waves. It usually starts with belly pain a few days prior. Then i have 3 weeks straight where i usually can barely breath withour heavy pain and painkiller use.\nAfter those weeks, it gets better for two or three months, than it starts again.\n\nI had a break of about 5 years from that, but since last year, there seems to be a heavy phase of shifting. We will see when it stops. \nIn my case, its mostly the ribs on my right side. And you can see it most clearly on the height of my sternum bone.\nPelvis is normal, or at least it is so out of use that I do not even recognize it.\nAre you of small statue too?", "Brittle Bone Disorders Consortium ", "5 things to Avoid with osteogenesis imperfecta ", "Current Research Studies for Osteogenesis Imperfecta ", "I forgot I had OI once Because of my OI I get really bad bone pain sometimes and one day I forgot I had OI (I have been diagnosed my whole life)I said to my sibling who does not have OI \"Why does my bones feel like they physically hurt.\" And they responded with \"Oh, I do not know, maybe because you have a BONE DISEASE?\" We both burst out laughing. Sometimes I think about the doctors who told me there was no such thing as bone pain, when I was little. I hope they are better educated, now. Honestly, me too. I was also constantly told that there was no such thing and that it was just \"growing\" pains, until I found out it was related to my OI. Is not it funny how it is easy to just mistake symptoms for normal life when you are used to living that way. Do you take any medication or do anything for the pain? It is sorta funny. And no, I do not take any medication for the pain what I usually do is sit through it until it goes away. I am literally in a cast right now and sometimes I just forget and i go “why cannot I make a fist” when face palm because my hand in a full cast. 😂😂 its hilarious to me how habitual these things become.", "I know the article is UK specific but I am curious of perspectives of people around the world, have you been told you are more at risk? Have you been given vaccine priority? Have you already had COVID?  21 yr old type 1 from Ireland here. \nI have been told my condition will not give me priority as it does not put me at a higher risk and does not affect my immune system but I do have asthma so will be slightly higher up the queue for that reason only. Not sure exactly how it works over in the UK but from reading the article it seems that people with brittle bones could maybe qualify under the \"rare disabilities\" section. I would advise you to contact your local GP to get some clarification.\n\nAll the best! Thanks for your input! At the moment I have been told absolutely nothing, hence why I am putting out some feelers. From the things I have found online it seems like we should be given some priority as even mild sufferers are more susceptible to heart and lung problems.\n\nOver here we are moving into the next 2 groups in priority which are over 65's and people with underlying conditions, the latter being where I think people like us should be listed. At the start of this I told my boss that I want to work from home as I believe I should be in this group, I am concerned that this group is going to come and go and I will have not been vaccinated in it. My boss will then start asking questions about the reality of my OI.\n\nEither way, I do think an email will be on it is way to my GP soon.\n\nThanks again!", "MY WORST FRACTURE I HAVE DEALT WITH / BREAKING 3 BONES AT ONCE / OSTEOGENE...  I once broke 5 rips it was so much pain ouch, how did that happen &amp; how did you recover? i broke a rib once, not 5 lol I fell on a car while playing outside. It is hard to remember since I was only 4 or 5.", "Recovery tips for osteogenesis imperfecta ppl ", "Managed to get 6 hours of sleep, not feeling well rested whatsoever, help...  \n\n# \n\nI managed to get some sleep today, but I do not feel rested at all... I felt like I got knocked out at around 6 a.m, then woke up again at 9 am, went to sleep and woke up at 1 pm. OI type I does not affect the brain in that way. I am almost 100% sure that this is not anxiety...\n\nI still have: tinnitus, inner-body vibrations, brain fog...\n\nI am only a teen, after going to that hair salon 2 weeks ago it is when this all started, I never even had trouble sleeping or staying asleep my WHOLE life...\n\nI just do not know what I should do anymore.\n\nI would willingly do a sleeping test but my parents just do not let me they still think it is anxiety when I do not even feel anxious...\n\nI do not know how much time I have left at this point. Type 1 here, Im glad to read that you are getting sleep, and I hope this has not continued.\n\nDo you have a geneticist that diagnosed you that you can contact?\nI try to get in touch with mine when I have concerns like these, my understanding is that type 1 does not affect the brain.\n\n\nIve developed a relationship with my general doctor (GP) who us also very helpful when I have non OI health concerns. I would encourage you to advocate for yourself when it comes to your health concerns, finding drs that believe you and will appropriately investigate. Sometimes it is good to go without parents, I would get frustrated that drs spoke to my parents and not me, also they can minimise your experiences sometimes even when they try to help.\n\nIn my personal experience my fatigue gets so bad that I am so physically exhausted and cannot sleep a wink. It also manifests as motion sickness, nausea, dizziness, brain fog where I cannot even hold sentences. It is hard to regulate mood sometimes. It took some years to work out what my body battery was and the signals of fatigue so that I could rest or slow down before it is got really bad and gave me sleepless nights and body pain.\n\nI know type 1 affects hearing and with prolonged exposure to loud noises you can get tinnitus and hearing loss. For me this is brought on for a few days by hair-dryers in a salon.\n\nIt might be worth looking into fatigue symptoms and reading up on that. As well as anxiety, for example I never knew that I had been experiencing panic attacks when I was feeling down about my condition or in situations that were risky to having an injury.\n\nI have found a good help is reading up about OI asking specialist for material, ask to see research, and also find drs that believe and understand you", "Follow Osteogenesis Imperfecta Foundation on Facebook ", "Let me hear from you! How is everyone doing today? Let me hear from you! Who is here? What type of OI do you have? How many breaks have you had? Any surgeries?", "Osteogenesis Imperfecta Slide ", "Where to start with exercising? I have got OI and struggle to do half a pushup, but would like to improve that in any way. I have been told swimming is a great way to exercise but I do not have access to anywhere that I can swim. Any good suggestions?", "Anyone with type 5???? So look, i have type 5, i have the over calcification, and the  unusually uniform skeletal structure along side with pamidronate since i was a baby. I have not actually found or talked with anyone with the specific type, is there anyone here with it? Well, for better or worse, you are a rarity among rarities. I am not sure if there are many Type Vs here. The rapids might be more treacherous and rockier for some, but we are going through life on very similar boats. If there are not many Type Vs here, you are still amongst friends and supporters and we would gladly discuss our shared, as well as your particularly unique, experiences. I have never been genetically tested. My fiance thinks I am type 5 but I do not know what that exactly is. So when you fracture do you get massive callus formations around your joints, also how is your wrist rotational movement? My vertebrae remain fairly alined and straight. i believe for type 5 its femurs that really get us, I had 4 femural fractures in 2 years. it took its tole mentally i wont lie, im alright now truly better than ever. No, I have not had callouses form around joints when I fracture. I did break a ligament in my right wrist once, but other than it occasionally hurting because of that, my wrists operate normally. You probably do not have type 5; Its very prominent callus formations around the elbow and femoral head that is indicative for type 5, those callus formations then affecting movement. I would venture to guess you have type 1 or 4. I think I have type 1. I was told that vitamen c increases collagen production and this is helpful in type 1 people, and vitamen c dramatically helped my fracture rate when I was a child. I have type 5! Over calcification galore lol. Do you also have dislocated elbows? late reply, but i have type 5 and i have dislocated elbows! sorry for the very late reply, but i have type 5 too! i have been having pamidronate since i was born too, and i have only ever spoken to a couple other people with type 5", "Are you an adult with OI who still sees a pediatrician? my partner (not on reddit) is 34 years old and experiencing a lot of comorbidities. he is bouncing back and forth between a LOT of doctors, none of whom really understand his condition. my question is: should we be seeking out a pediatrician since this is a congenital condition? are there adult specialists in OI? we have had a hard time finding one. he is seeing a rheumatologist, neurologist, orthopedic specialist, ENT and a primary care doc. nobody really serves as his case manager for condition or medication management and i feel that a pediatric orthopedic doc may be best. has anyone had luck going this route?  Hi there. \nI have a type 3 and I must say, its pestilence to find a doctor who is willing and able to say anything of substance about our cases.\n\nPersonally, I think most pediatricans will be as overasked as the regular docs. \nI had the luck that my ex pediatrician held me as his case until I left my parents home at 16. But he knew me since birth and gained an understanding and he would have continued helping if i werent 550km away now.\n\nUnfortunately, this is a luxury situation not everyone has.\n\nHave you ever been in contact with OI society? They once had a list of doctors who are specialized in our cases. Good luck for you both, and keep your heads up &lt;3 thank you! we will! ", "Osteogenesis Imperfecta Type 6 Type VI:\nOI Type VI is extremely rare. It is moderate in severity and similar in appearance and symptoms to OI Type IV.\nThis type is distinguished by a characteristic mineralization defect seen in biopsied bone.\nThe mode of inheritance is probably recessive, but it has not yet been identified.", "Training with resistance bands for brittle bones people ", "Arm wrestling with type 3 OI  bro, please stop encouraging OI people to arm wrestle. that is great that you can, but this is a HELL of an irresponsible thing to do.    \n    \ni also have oi, and so does 3 other members of my family. we have done a ton of dumb shit in our time, including swing around from flesh hooks. but i would never encourage someone to risk so much like this. fractures never fully heal man, and the older you get the weaker those fracture points get.     \n    \ni think it is pretty irresponsible of you to encourage this in the OI community.  kudos to your muscles and all, but anyone with OI without your workout routine is going to SERIOUSLY injure themselves. bro 😎💪 Im not encouraging", "Osteogenesis Imperfecta Clinic Directory ", "My 9yr old has OI My 9 year old son has type 1 OI. We have known since he was born. My wife has it and the give away was the blue sclera. We got his lab results the day he broke his elbow at 1. Around 3 he had bisphosphonate treatments. He is had around 20 breaks. Mostly when he was very young. He is been very good with the treatments. Some minor breaks. Recently he is hurt his foot, and just last week he broke his elbow clean off. He had emergency surgery on his elbow. When he hurt his foot, he told my wife “I hate me.” Now with the elbow, he is in a lot of pain. He did not leave his room all day yesterday, and he looks terribly sad. He is now fully aware of his situation and it is breaking my heart. I think I am going to talk to wife about him talking to a therapist. Anyone have experience with this? Are there therapist that specialize in cases of people with physical disabilities or ailments? Any comments, thoughts, and experiences are appreciated. Thank you in advance. I am sorry, this sucks and it is always terribly hard to see our kids hurting in so many ways.  If you are not a member already you might want to consider joining the ( group on Facebook.  It is pretty active and you will likely get some pretty good advice.\n\nMy daughter is 17, and has been receiving infusion treatments since she was a baby.  Knock on wood she has not broken in awhile but whenever she did, she would end up getting pretty down as well.\n\nI hope your son has a speedy recovery. Thank you. Best of luck to you and your daughter! Hi, I only found this subreddit. I am 21 years old and have OI type 1. It is mild enough. I have had about 30 fractures in my lifetime and around 18 of those required surgery. Growing up with the condition is really tough both physically and mentally. I would definitely recommend getting a therapist for your child or encouraging him to share how it makes him feel when he breaks. It is really hard being \"different\" especially at that age and it gets worse through the teen years in my experience. Kids can be cruel. I was often teased or was made the butt of a joke. I had acceptance issues which stemmed from that. It took me 19 years to finally accept my disease. That was with 4 years of therapy, a loving family and amazing girlfriend to support me. I was in denial for a long time and everytime I broke something it threw the disease back in my face. It is an extremely emotionally draining process. It is tough not being able to play sports when you are a child too. Kids are so full of energy. I have broken several bones playing chasing (tag) or football (soccer) with the other kids just because it is too hard to resist when all your friends are doing it. Encourage him to try some  non-contact sports like archery or table tennis. Books are great and of course video games and YouTube/TV are really good too but in smaller doses :). \nThe mental side of the disease is often overlooked. I went through 2 years of really bad depression from 17-19 and it definitely was caused by issues stemming from my disease. Does he have any siblings? Try get him to talk to them. I always found it easier than talking to my parents. \nDefinitely try to nip it in the bud as I was 16 before I got any proper help and I could definitely have used it before then! If you have any questions or want to get in contact feel free to pm me :) Thanks for the response! It is very helpful. Sorry I just noticed it. I am not very active on this account to begin with, and then I took a social media hiatus.", "Scared, exhausted, unaware of what to do at this point.  \n\n# I tried to sleep today, yesterday, I had gotten at least 7-8 hours of sleep after being awake for 38 hours. But today, when I tried to go to sleep I could not fall asleep I was not even anxious, it is been 22 hours, I also have a rare disease called osteogenesis imperfecta type I, i keep telling myself that I do not have it but I am just scared that the disease (osteogenesis imperfecta) is affecting my brain and that I just developed SFI out of nowhere after going to the hair salon. My symptoms: tinnitus, pressure headache, inner body vibrations. My doctor says that this is anxiety but I do not feel anxious.... How does OI affect Type I people's brains? Listen to your doctor. OI is a mutation in collagen production/retention. The other things you describe better fix under anxiety (or something similarly related). I have the same thing.  If you need to talk about the Type I experience, please reach out to me.", "Blue Jeans for Better Bones THANK YOU for your dedication and support of the Osteogenesis Imperfecta Foundation!  Our mission of improving the quality of life for people affected by OI through research, education, awareness, and mutual support, depends on your unbreakable spirit® to move it forward. Past Blue Jeans for Better Bones events have helped raise over $75,000 in support of the OI Foundation and more importantly, increase awareness about OI across the globe.\n\n\nOrganizing an OI Foundation Blue Jeans for Better Bones Day event or campaign is EASY, FUN and EXCITING! Everyone loves jeans, so your Blue Jeans for Better Bones event can be done anytime during the year. \n\n\nIt is as easy as 1-2-3! \nInvite members of your office, school, or church (or your friends!) to join your BJBB team.  You can use this poster to spread the word.\nEveryone on your team will donate an agreed upon gift amount of $3, $5, or $10. \nOn the day your team chooses to run its campaign, all participants wear blue jeans, and their awareness sticker or wristband (provided by the OIF), to show their support for the OI community. To order awareness stickers or wristbands either complete the Event Leader/Materials Request Form and send it back to us or order via the OI Foundation Online Store to on the right side of this page.\n\n\nThe great thing about this campaign is that you can tailor it to meet your specific needs. Pick any day to hold your campaign! Already wear blue jeans to work?  Dress up!  Make it Hawaiian theme day! Not allowed to “dress down”? Wear an OI awareness bracelet or a blue shirt. Stickers and promotional materials for your campaign are provided by the OI Foundation and can be ordered by clicking on the BJBB Store icon to the right. \n\n\n", "A Question About OI and Bone Hardening Hi you all, OI sufferer here with Type 4 and I have a question for those who may be a bit more in the know. So our bones tend to harden post-puberty so we do not suffer as many breaks as we may have done as kids, but I am curious whether anyone knows if the bones are expected to soften again in later life?\n\nI only ask as I have had a few scares recently which has me contemplating whether I am doomed to suffer the same amount of pain in later adult life that I did as a kid. Pretty much yeah, unfortunately as we grow older our bones grow less dense. They normally start slowly around age 30 but pick up speed towards the mid 40s and early 50s. Women especially have to be extra cautious due to the menopause.\n\nThe good news is that they are currently doing research to find a drug that should slow or prevent it. If you google \"Topaz trial osteogenesis-imperfecta I am sure you will be able to find out more about it. Oh God, please tell me you are kidding. Is this the same in all types of OI? It is less a result of OI and more a result of human development so I would be confident to say yes. The 'cure' for this however is well on it is way though so I would not worry too much. Have a look into that Topaz trial I mentioned above. Yeah, osteoporosis is a thing", "I have been told I am not disabled enough for covid vaccine Hi everyone! I am kn Australia, 27 with type 1, I have had breaks and related health problems, but on the OI scale I think I am on the mild side.\n\nSo recently I have been trying to get an appointment with my Geneticist to discuss were I am at in my life and also the big question of the covid vaccine, but as yet I have not got an appointment to discuss if there are any concerns or risks for me and OI specifically. I am not in a big rush because Australia is ok, I do not mind having little isolations when things flare up, and the governments roll out of the vaccine is terrible anyway.\n\nAbout a month ago a friend of mine (not disabled) recently shared that she was about to get her final Pfizer dose, when I asked how she got it she very casually said \"my brothers a doctor, so the whole family gets it\"\nSo with this new information at my next GP appointment I ask if I was eligible, she clicked on the computer for a bit and said \"you are not disabled enough, you are too young and healthy\".\n\nI have been seeing her for years and I know she did not mean anything by it. But I  was a bit taken back by the confirmation that im not eligible and that comment. I have faced this issue alot of people deciding 'how disabled' I am, but in a pandemic and by the government stings a bit more.\n\nHas anybody else had issues with accessing the vaccine? Being eligible?\nOr even finding out specialist information in relation to OI before making a decision?\n\n*** if anyone has insights, things they would like to share from medical professionals or anecdotal pros and cons about the vaccine, or their experiences would love to know It sounds like you have hit the same issues I would hit a few months ago in January/February. I was in the exact same boat of trying to pitch my case and being rejected, no matter what I put forward. It sucks, especially when you see others have been vaccinated and you are left asking how and why, \n\nFor resources to take to your health professional I found the best places were ( or ( The OIFE has some published studies linked there that say that even in people with mild OI there is significant changes in things like our lungs and heart. If you can get your health care professional to read some of them you might be able to change their mind. I suspect the reason I failed here was because my GP decided to not read any of them as I would sent them the same documents before to get a flue jab and it worked that time.\n\nThat is in the past for me now because I have had my first dose of the Pfizer vaccine a month ago what with me being in the UK. I had no issues with it at all apart from feeling a little groggy the next day. My sister (also has OI) has had 2 doses of the Oxford/AZ vaccine and has also had no issues apart from feeling crap for a few hours afterwards. The vaccine is not that bad, it is trying to get access that is the nightmare.\n\nAnyway, I wish you the best and hope they do not leave you waiting too long. Have a look at those research studies linked by the OIFE and push them under the nose of your health care professional if you can, they are your best bet to getting the proper recognition. It seems that your comment contains 1 or more links that are hard to tap for mobile users. \nI will extend those so they are easier for our sausage fingers to click!\n\n\n(\n\n\n\n----\n^Please ^PM ^( ^with ^issues ^or ^feedback! ^| ^( ^| ^( i am type 3 in the US.  i have had both shots from pfizer.  i had no complications or even hardly any symptoms.  i was a little bit tired after the first one but that is it.  but even with type 3 i did not qualify for any of the high risk rounds.  i was not able to get mine until they were open to the general population here. Yeah I have Type 1 and has little to no symptoms as you mentioned here. I did not get it early either which does not make sense with our risk for respiratory issues… yea i was pretty surprised too.  especially since heart and lungs are what are most effected and those are big for us. Yeah my dad literally almost died about 2 years ago now from heart complications and he was 67 at the time. We have a lot of shit to worry about… Late answer, but I was also pretty much the last person in my family/circle of friends to finally get the jab.\n\nNot working with customers? Not pregnant? Not asthmatic? Lowest priority it is.", "Doping for Google ", "Volunteer Opportunities ", "Help, at least advice, please!  \n\n# Help, please!\n\n&amp;#x200B;\n\nNEED HELP! My sleep schedule has always been messy, but now it got worse, I have a rare disease, called Osteogenesis Imperfecta. I have been getting multiple insomnia episodes after going to the hair salon and staying awake for 30 + I struggle hard to fall asleep, it is been 2 weeks, I have only been getting 2-3 hours of sleep. I am worried that this will only get worse, now I have been awake for at least 40 hours, and getting a lot of brain fog, today I went to the doctor and told my symptoms she says it is just anxiety but I do not even feel that anxious, some weird symptoms have been showing up on my body, from headaches to tremors and tinnitus, a loud ringing inside my head that does not let me sleep... I do not know what else to do, I am only 16. I do not want to leave my family behind. Hey, that sounds awful.. \nGo back to the doc if possible, ask for some meds to help with your anxiety or even some sleeping pills. \nMaybe try asking on another subreddit too. I know mental illness does often accompany osteogenesis but you would probably get better advice there. \nAll the best!", "Support Groups and Local Contacts ", "Update on my situation I did manage to get 7-8 hours of sleep once I got to bed.\n\nThis was a pretty terrifying situation, my head was literally in clouds yesterday.\n\nI really do not suggest staying awake for that long, unless if you really have to. In this case, I really could not sleep before. ", "WHAT TO DO AFTER AN INJURY WITH OSTEOGENESIS IMPERFECTA ", "OI and having children I have OI type 1. Fortunately in my case the disease has been very mild and I am in quite good shape, above average height, and besides the blue-greyish sclera no outside symptom of having any disease.\n\nI am getting to the age of wanting to have children though, and I know that there is 50% chance of having a kid with OI, so I have 2 questions which maybe someone can answer:\n\n1. Is there any way of testing for mild OI when it comes to fetuses? Perhaps some genetic testing that can tell early in the pregnancy that the child will have OI?\n\n2. Even though I have a very mild case - could a child of mine end up with a more serious case of the disease than me? Hi there. Fellow type 1 here. I believe that ultrasounds now are advanced enough that it can be detected early and since you yourself have the condition you can advocate better for yourself and the baby. But do not quote me on that. As I am in a similar boat as yours. \n\nNow to the other question. I am going to share something that happened in my family. I was blessed with OI through my mother's side. I am her 50% odds. Of the 6 children my grandmother had, 3 of them had/have (yes 1 died not related to OI). \n\nThis information is about my uncle with OI, and yes we all have type 1. Three of this children are fine, to the point o think he forgot that he was carrying it. His fourth child was born with type 2. You know what happened. Prior to this happening, I was raised to believe that the child would never have OI worst than the parents because that is what the data through our family implied. So it is possible and it happened in my family is the point. \n\nHis fifth child has type 1, and her story infuriates me. She should be as normal as most of us with type 1 are. But unfortunately they raised her in a bubble and did not let her play or do anything like normal kids. So she did not build up muscle to protect her bones. She suffered far worst fractures than myself, mother, aunt or her father. She is overweight for her age and wheel chair bound because her body can not support her weight without fracturing and the muscles and bones are no longer strong enough. I am not sure what puberty will bring her. Since in my family puberty usually brings an influx of fractures.\n\nI share all of this not to scare you but because maybe hearing it and knowing it will help you in some way. Genetic testing can be done if your form of OI has been genetically identified. Have you had genetic testing snd had your form of OI confirmed? If so, you would pass on the same form of OI to your child, so if yours shows up in genetic testing, theirs would to. (My child turned out to have an unknown form of OI, and it appears my husband does, too. Their genetic testing did not show any known variants, but they share the same mutation on a gene associated with OI). So if your form of OI is not known, it would not be able to show up in testing. However testing can be invasive and dangerous, depending on how they have to do it. I did not have it done because we did not know my husband had OI at the time, but I did have some signs in pregnancy that, after the fact, indicated OI (fetus had abnormally short arm and leg bones in scans).\n\nAs far as knowing if your child could have a significantly worse form of OI than you, I do not think so because to get it they would inherit your mutation, and different forms have different genetic mutations. But that would definitely be something to talk to a genetic counselor about. My child’s form is a little more severe than her father’s (he is had 4 breaks in his life, she is already had 5 by the age of 7) but their physical abnormalities are practically identical (height, some back and rib cage issues, etc). Hey! \n\nNew member here. My wife and I just had our second. My wife has OI type one and was mild. Few breaks. Our first didnt. \n\nWe were told (as of March-august 2020) the only way to test was with the procedure where they go in and take a sample of the fluid. I forget what it is called. Slightly risky. \n\nAnyways we did not do that. Got him tested right after birth and he has it. We know it is type 1. But it could range to a lot of breaks to a few. And there is no way of knowing. We talked to a specialist in NYC who said there is studies that link the baby type to parent, so if you were mild baby may be mild, but nothings definitive. \n\nI can tell you so far our 2nd is hitting all his milestones. He is low tone which could be a sign but nothing more. My wife’s brother who also has OI, he had a lot of breaks and his daughter has followed suit. So maybe there is something to that. \n\nAnyways hope that helps. I know this post is old but just saw it when I joined Hey, I also have type 1. I am also the first and only person in my family to have OI.\n\nIm not sure if its different where you are in the world but my geneticist sequenced my DNA a few years ago and when I was about 18 he told me that when I was thinking about having kids I needed to have a chat with him first.\n\nRecently (I am 27 now) I have had further chats with my gynaecologist (who is a fertility specialist as well) she was very pragmatic about explaining a brief overview of the safest way for me to go about having kids.\n\n1. First option was to have a baby the 'natural way' this would mean 50/50 chance of passing OI to the baby. She explained that there would be a risk the baby might have a more severe OI within type1, but this would only be known after birth.\n\n2. Other option was IVF collecting my eggs like they would for regular IVF they would be able to test at the early stage and the desicion would be made to implant one without OI. The ivf route is alot longer and has more expenses involved but as she explained alot of the unknowns and complications can be taken out of the equation.\n\n3. Less likely option would be the ivf, but using a surrogate. She highlighted the stresses on the body of carrying a child to full term, to have serious conversations with my team of doctors about the pressure of carrying a baby \nAlso the long term post baby body issues, and the effects on bone density.\nThat a surrogate might be a good option\nI am not 100% on the legalities of using a surrogate in Australia (i think I would have to file to legally adopt my genetic child, which stresses me, also it might be technically illegal)\n\n\nSorry if this is a bit incoherent, bit of a rant. But interested to hear if advice is different country to country, Dr to Dr\n\n😊😊 Most children get the same severity of OI as there parent. There is still a chance for more severe cases occurring, but it is rare. One a side note does anyone remember a couple years ago there was researchers implanting stem-cells to pregnant women whose child would have OI? I cannot seem to find the results, but as someone with OI and who wants to have kids one day I pray there something more we can do. As someone who grew up with type 1 (and never really got over it), I just have to ask:\n\nWhy not just adopt a kid?\n\n&amp;#x200B;\n\nI am not a woman, so I will not pretend I know what it is like to want a child in that way. \n\nBut the thing is, I would not wish what I went through as a kid on my worst enemy. \n\n50% is a coin-toss I would never take, and I have been in this situation with my girlfriend many years ago.\n\nI know this post is probably inappropriate, and I know and respect that it is your decision in the end. Not inappropriate at all, I understand where you are coming from.\n\nObviously if I had felt that my type of OI was debilitating or had signficant effect on my QOL, then having a kid would not be an option at all - but in my case I have not had many issues or defects.\n\nIt is a discussion I will have to have with an expert in the area, as I am mainly curious of the risk that the child would have a worse form of OI. If that risk is too large and there is no way of pre-screening, then I agree with you; it is not worth it potentially putting someone through suffering. I dont want to like... pile on... but my dad has type three and so do myself and my sibling... yet were both significantly more severe than my dad, I am even pretty much permanently wheelchair bound... he was a firefighter, lived a largely normal life, so be it other genetic factors or circumstances growing up or whatever, just know that it can happen, and know like... I have to agree with the other person... would not wish it on my worst enemy.", "Just found out my unborn son has osteogenesis imperfecta Me and my wife just found out that our unborn son has brittle bone disease. We are at a loss for words and have no idea where to begin with how to take care of someone with this condition or how it happened to us and our family. All we know is that we need supports and ideas on how to be the best parents for him If you are on Facebook, look up the Osteogenesis Imperfecta Foundation Forum, OI Parents, and I believe there is a group for those expecting a child with OI! These are filled with information and parents who have been where you are now. You are not alone! My son is now over a year and a half. He is a joy to be around. There is lots of help out there both medically and emotionally. Contact Shriners Hospital. Hopefully there is one near you. Osteogenesis Imperfecta (OI) is one of the disorders they specialize in and they are a great resource. If they are near you, they can provide care, free of charge if your insurance will not pay. Either way, they can help you with finding resources in your area. \n\nDid they tell you what form your child has? I assume you did some genetic testing. There are many different types. OI 2 and 3 are the most severe and OI 1 is the mildest, followed by OI 4. \n\nIf you know what form of OI they have, that makes a huge difference. I know this seems scary but there are people out there who can help you. first off, CONGRATS ON THE NEW FAMILY MEMBER!!! how exciting!  \n\n\nmy mom has OI , and she had 2 kids, me and my brother, (only one of us inherited from her)  and then she adopted 2 more kids also with OI.  so there is 4 of us total in my family of 6.  it is tough sometimes but it is manageable and with the right support they will flourish.  so if you have any questions, i would be happy to help to the best of my knowledge.  im not a doctor, but i have been doing this for 35 years now and i like to think i have got a decent handle on it.  (knock on wood.)\n\n  \nalso if i may suggest finding an endocrinologist who supports pamidronate treatments.  i have had a lot of success with those treatments, and so has my brother who has a more severe type than i do.  when he was born he would hiccup and break ribs, and after a few years of pamidronate he was able to compete as a seated fencer.  it is pretty amazing.    \n\n\nbut yes! congratulations to you on your new family!  this is very exciting and awesome news, despite the surprise.  treat them like you would anyone, with the added bonus of knowing they are going to be extra adorable. (yes im a little biased).  plz feel free to message me if you have specific questions.  im not a parent, but i would be happy to redirect the questions to my mom also.  (she is not on reddit, but she was once the OI coordinator of our area and knows a thing or two about a thing or two.) Congratulations!!! \nI have osteogenesis imperfecta. I am a woman, I am 28 years old. My parents also knew before I was born, and my older brother also had it. This might sound really obvious or strange, but to me one of the most important things is to be very open with your kid about what he has and what it means. I was really overprotected (which I guess makes sense, I am not a mother yet and I cannot even begin to imagine what it must be to have two children with OI like my parents did). But I never really got an explanation of what was “wrong” with me, and I was told “no!!” to things constantly and I really did not get why. In my family, appearances are really a big thing, so this was kept a secret, even, with other members of our family like uncles or aunts and cousins even though my mom, my brother and I had it, so in our family of four it was normal. I am happy that as I grew older I was very open about it with everyone I met and explained it to new friends almost as I met them. My point is that as parents I think it is great to normalize it, and to talk about it openly, and never treat it as something shameful. My three year old daughter and wife have this condition. Our daughter did not break anything until 2and a half, and had had four femoural breaks this year, bilateral. We have already decided we will not let it limit her at all (within reason) and have normalised it by continuing with life as normally as possible when she has broken a bone. She is been at daycare with casts on (after the first week or two), we still take her to playgrounds and try to work around it to keep her life as normal as possible.", "How I lost weight with #osteogenesisimperfecta ", "Nutrition Advice for those who have osteogenesis imperfecta ", "OI and mental health Hi all! \n\nI am a 29 year old female with OI. I dont know my type exactly, I got it from my mother and it is common in her family, but in the rural where they are from no one knew about it so they were not diagnosed. My brother and I both have it, we were born in a bigger city and that is when my parents got to know. \n\nThe reason why I am posting is because I am curious about the effects of growing up work OI. My brother and I were very overprotected, which I understand. Raising children knowing that they cannot “learn by doing” when it comes to physical activities must be hell (I do not have children yet). I do not judge them as parents but I cannot deny this disease has had a big impact in my mental well-being. As a child my physical well-being was of course a priority but now as an adult, when my condition is more stable with less fractures, I can tell I have many problems rooted in this. Fear of absolutely everything, codependency, lack of confidence in my own body, neglect of my health, extremely low self esteem. In my case the condition is non detectable (except for the blue esclerae) and I always had the habit of making up excuses (my parents would tell me to tell my friends that o could not join on a trip because I am picky with food, for example, instead of encouraging me to being honest and telling people that I could not go because it was dangerous for me).\n\nAs I grew older I started to be open about this with my closest friends. I thought it would bring me safety, and it did. I started owning my own story instead of letting my parents guide me in what I should say to others. But still, I think it is extremely interesting to talk about this: how to communicate this condition to kids so they do not end up like me, feeling constantly vulnerable. Especially in cases when it is invisible to others. I once saw a post by someone in here or some other group: “my kid has OI, any advice?” To me this felt really important but it did not lead to a discussion and I am really looking forward to seeing what others have to say about this and their experience. 25 male, with around 270 breaks. I have a particularly rare form of oi (I think it is classified under type 4, less than 20 known patients). I also have no visible indication of oi (eyes are a bit bluy/grey, but that is it). \n\nHowever, I got oi through spontaneous mutation. No family with it, and it was diagnosed when I was 4. Got To say, that element definitely made it feel lonely. I tried to hide it the best I could, but 270 breaks is too many to reasonably hide. Most friends/family friends knew about it, but the first time I actually wore that shit on my sleeve was at my mom's funeral in March of this year. And that was more because she deserved the recognition of caring for me than me actually being ok sharing. \n\nI definitely have the fear (and anger) of having my body fail me again. I often feel like I have worked so hard to stay mobile, that every break feels like it is taking me away from that. \n\nBut we long as we are talking about mental health, I will say that I have been in enough pain in my life that I was ok with dying by the time I was 12 (I remember the break that did it). It is a mentality I know a lot of people do not share with me, but I have never really talked to other OI patients, so I am curious on responses. Hi, my version of OI sounds very similar to yours in that it passes as an invisible disability but it sounds like our early years differed quite a bit. We knew I had OI really early on as I inherited it from my father and subsequent tests proved I had it. From early on the advice my mother was given was to not \"wrap me in cotton wool\" and she took that to heart so I lived a relatively \"normal\" (for lack of a better word) life. I had a few restrictions such as not playing some sports like Rugby but I still participated in other things like Football. It would be fair to say that I participated more than I was excluded.\n\nI think that even though my childhood was different I still picked up a few mental health issues as a result of OI. The first thing that comes to mind is body dysmorphia. Because OI makes us smaller and weaker than average I always had to deal with feeling less of a man than others, it was as a teen that this took hold the most severely and I used to hate my body to the point that I would purposefully beak a bone as a form of self harm.\n\nOne thing I remember is that I was never allowed to blame anything on my OI so when I was playing a sport I never felt like I was disadvantaged because of it. I think that because of this I developed a real \"go getter\" attitude and always gave my all to try and keep up with others.\n\nI had many years of things like low self esteem but it is hard to say how much this was down to my OI. I have always felt like I had a good understanding of my bodies limits and what I can and cannot do.\n\nOne thing that really did effect me as a child was losing my hearing. I was unfortunate in that my hearing started going at around 7. That was a bigger thing for me than my OI in general as it did change how I do a lot of things.\n\nThis kind of life did obviously lead to a few more breaks but I think it was the right thing for me. I am 29 now and do not have too many issues due to the beaks (other than the odd ache). I am not planning on having kids but I have a young niece and nephew who both have OI and it seems like they are being raised in a similar way, though with more help now that there is more understanding of what can help.\n\nIf you have any questions feel free to ask away and I will do my best to answer. Thanks for your answer. I also never spoke to any other OI patient so reading these comments gives so much insight. It is very emotional for me to read about someone who is at 270 breaks, my case is way milder.\n\nThe feeling of having the body fail you is something I can still relate to. I wonder how it feels for people without OI when they are in the middle of a fall or something that we know will most definitely lead to an injury. My mind is already there: the fall, the break, the months of immobility, the pain, the “same old story again” feeling, the “of course it is another failure” guilt. \n\nI am looking forward to more answers and discussions. Sorry to hear about your mother. I hope you are doing ok. This is so interesting, thanks for your comment. It is so nice to hear about someone who was not so overly protected and encouraged to live as normal as possible. The truth is that in my latest checks my doctors have told me my bone density is quite decent so I should live a pretty normal life, but these feelings from my childhood are so ingrained in me that I do not really process that information, as if I did not believe them or they talked about someone else. \n\nA lot of what you mentioned reminds me of my brother too. I think it affected him a lot socially because of more manly sports. He once had a pretty bad fracture playing football... it definitely affected him in similar ways. \n\nI relate to the issues of body dysmorphia as well.  Being told that I should not exercise as a kid stuck with me and still today I have no idea about how to take care of myself. I basically see my body as if it had nothing to do with me. \n\nBut! Overall I am healthy and I am planning to have children so reading this makes me even more confident in how I would like to approach this if they had OI. I am glad you have found some confidence from my comment! One thing my sister always says with regards to her kids and OI is that a break is a case of if, not when so it is about preparing for it rather than trying to prevent it. In any case, I wish you all the best! It is worth noting that although I have had more breaks than many oi patients, I try to stay physical. I took martial arts for a few years (was testing for my black belt when I had a break to severe to continue, eats me to this day), and held my own in a few \"physical disagreements\" (was bullied quite a bit by people who thought I could not fight back. No one expects a cripple to talk back). \n\nAs for the falling, I have a fun little store. On December of 2020 my brother got a new ATV. Before you can just store and ATV for the winter you are supposed to run it around a bit to get fluids though the lines and what not. We were not doing anything crazy, just going around a flat trail for awhile. Because of that, I had my 4 year old niece on the ATV with me (believe me, I know. Dumb decision). Basically the ground gave away over this little incline. The biggest upside to martial arts was learning how to fall correctly. Rolling, weight distribution, etc. So as we started to fall (about 2-3 feet) I started to go for a roll. Would have protected me, but I realized my niece would smack her head, whiplash her neck, or maybe the ATV would land on her. I have never had so much time to react to an injury I knew was coming, and I realized either I was totally screwed, or she might get hurt. Long story short, chose her, braced her neck and held her close,  and landed straight on my left side (locking my right leg to keep the ATV from rolling). \n\nWhile worth it, this little maneuver cost me:\n- 8 broken ribs, all on the left side disconnected from the spine\n- pelvis broken in 3 places (ATVs are pretty heavy, lol)\n- broken vertebrae\n- partially collapsed lung\n- just a sprinkling of internal bleeding\n\nI do not know why I said that, but I figured other people with oi might appreciate that thought process more than the people around me. The mental aspect of this is overlooked, and the Type1 experience is unique in that you can pass for ‘normal.’  There is a wisdom that comes with it, but it is an odd kind of shit sandwich.  It affects the whole family. I agree! The aspect of “passing” has really been an issue for me at work also. Now I have an office job I can do remotely but in the years where I had to do side jobs to start earning money, I was so confused about what to do about it. Sometimes I would not say anything and get a job at a store, but then I had problems the one day they would schedule me to unload a truck and I had to say that I should not carry weight. Then another time I dared to say it after the interview process was over and I had gotten the job but before signing, to be honest with them, but then the employer deciding not to hire me because I had kept this information secret to them. Wtf? \nAlso, in my country of birth I have a disability certificate. But in the country I live now, they say they cannot give that to me because I seem normal. A doctor said that. It is daunting to justify this all the time. I have impostor syndrome when it comes to this, which is crazy to me.", "Looking for support and advice. ", "We interviewed the parents of a 13-year-old boy with brittle bone disease Hi there, we are new on Reddit and recently did a feature on brittle bone disease which we thought might resonate with you guys. Would love to hear your thoughts on the story.\n\nHere is the story and video: ("]