["ground breaking fsh new  Scientists make ground-breaking discovery on FSHD gene\n\n#### 19 July 2019\n\nScientists from Fred Hutchinson Cancer Research Center (USA) have identified a new role for ( the gene that is mutated in FSHD. The researchers studied DUX4 in different types of cancers. They found that some cancer cells use DUX4 like an invisibility cloak, to avoid detection by the body’s immune system. This also protects the cancer cells from immunotherapies.\n\nThis discovery suggests that drugs that block DUX4 could be used to boost effectiveness of anti-cancer therapies. This is good news for FSHD, as it could potentially mean more money and resources being directed towards the development of DUX4 inhibitors.\n\nFor more information, read Fred Hutchinson’s ( Those are some really sneaky cancer cells Oh my god 😂", "FSHD Virtual Family Day- Saturday, February 20th ", "new in cell news (", "Fulcrum Therapeutics Announces Results from ReDUX4 Trial with Losmapimod in Facioscapulohumeral Muscular Dystrophy (FSHD) Demonstrating Slowed Disease Progression and Improved Function  sooooo does it work?   hoping to find something that works ASAP before things get much worst. Short answer: yes They are live presenting today.. signup here to watch\n\n How long before this goes to market I think it is not totally clear since it does not appear to reduce DUX4 expression (which was it is supposed success mechanism)-- but somehow it still seems to have made a difference functionally for the people who took it. They talked about difficulty in measuring the DUX4 expression so maybe it does reduce it and they were not able to measure somehow?\n\nPerhaps the most telling thing is that 99% of those who were involved in the trials opted to continue taking it. They admitted that their way of measuring Dux4 expression was flawed. They created their bio markers from the results of their pre clinical trials and their theory of how they think Dux4 expression should be measured.\n\nThey went on to say that because almost all of their other markers were met, they must be measuring it incorrectly since theoretically the only way these other markers would improve is if Dux4 expression is reduced This article explains it a bit better   The way I understand it is:\n\nThey measured DUX4 reduction prior to the trials in vitro so they knew it would have some effect\n\nThe trial showed the results of DUX4 reduction, improved (statistically significant) metrics... eg: measurable results\n\nThe 'primary endpoint' of actually measuring a reduction in the muscle tissue failed but this is down to the way they are trying to measure. Not only is it difficult to highlight the biomarkers but they are so spaced out and happen so rarely that it is like finding a needle in a haystack.\n\nYou could take two biopsies, from the same muscle, at the same time and have two completely different results depending on whether you hit a point with active DUX4 expression.\n\nThey showed the results of DUX4 reduction (secondary endpoints) without being able to show a slide saying 'here is before and here is less after'\n\nThe failure was in the measuring, not the drug or it is effects.\n\nWhat I am now curious to see is where things go from here. Are they going to liaise with the FDA and try to go straight to market, having the 'phase 3' after it is available on prescription or are the FDA going to request further testing before approval?\n\nIt certainly shows a measurable benefit which is high on the FDA's list, so who knows?! It is a waiting game and we are (reluctantly) all good at that.\n\nPotentially this could be available by the end of next year which is a great relief to those of us who cannot afford to wait. I keep my fingers crossed for an even speedier approval process.\n\nNice to have a bit of good news though, is not it? Is the full presentation online yet?", "considering genetic testing for fshd? I have family members who have physical symptoms of it but they only appear to be men. My moms fine she is almost 60. She is got osteoporosis and RA but that has nothing to do with fshd (has no mobility issues or muscle issues as I can see). My aunts got an actual gene for it nearly 50 with no symptoms. There was also a great aunt with it quite healthy who passed it to one of my moms maternal cousins who is male. My grandpa had more of a mild fshd I suppose but was diagnosed as a child with it. I think his genetic diagnosis was 35 kb but the genetic test seemed kind of inconclusive. it mentioned there was a translocation between 4q35 and 10q26 and that it showed a possible FSHD deletion but they were not sure. Anyone see this in their family? its hard to know what the risk is to myself and my mother or if its a weird type of fshd which mostly appears in men.", "Scapular Fixation/Fusion I have had the blood test for fshd muscular dystrophy and am awaiting the results.  I asked if I could wait until the new year to find out. \n\nI have many of the symptoms particularly the scapular winging.  Have some mild scoliosis and mild thoraic kyphosis.  Difficulty standing upright, walking difficulty, with abnormal gait and foot drop.  Widespread pain.  \n\nI saw another shoulder specialist today and he mentioned scapular fusion surgery.  It can attach the shoulder blades to your ribs.  Told it does not fix everything though and some can be unhappy after but some successes.  Has anyone had this done?", "Meeting tonight Quick Reminder: \"See\" you Tonight! Thursday March 7th, 7pm - 8:30pm All are welcome! Join us virtually from anywhere! Join online:  Or call: 669-900-6833, Meeting ID: 442 453 571 Kathy Senecal and Sarah Pashe invite you to come support, empower, share and network with the FSHD community.", "When a Rose is Not A Rose in Muscular Dystrophy | Psychology Today ", "Frustrated ", "Scapula winging improvement Was not born with FSHD but probably started around 4 .. had winging but in my high school teen years I tried hanging from a bar everyday and it seemed to fix it. Late 20's now without hanging over 15 years and it is about the same. I guess be careful and try standing / have someone help .. also if you cannot raise your arms high be sure to spend a couple minutes on the bed with your arms bent over your head to maintain / improve range of motion ", "Albuterol 8mg ER Tablets Has anyone been prescribed / taken this medicine? I was recently  prescribed it but it seems impossible to find. It is the medicine that the study was done on awhile back, but cannot find the 8mg ER (Extended Release) tablets anywhere. Even tried Amazon.   \n\n\nHas anyone had better luck or know where I may be able to find a pharmacy that has them? Give it a try. I tried it a while back at around that dosage maybe 5mg. Did not do much for me and after a month or two I dropped it. Some studies show it can help with protein synthesis and can preserve lean muscle. \nYou might have better luck finding it under its other name:\nSalbutamol", "Some good news... muscle regeneration This is relatively new, an Australian team experimenting with macrophages (the little ambulances that go to an injury site and fix things) in zebra fish.\n\nThey removed the fish's macrophages, so it could not heal itself and introduced a substance (NAMPT) externally instead, in the water they 'breathe'.\n\nThe muscles repaired and grew.\n\nThey then put a patch (like a nicotine patch) on a mouse with a muscle wasting disease (I am still trying to find out if it was FSHD) and the muscles were significantly repaired.\n\nWhat this means is there could be a patch coming that allows us to stay ahead of muscle wastage!\n\nThe lead researcher said \" This is perhaps the discovery with the most therapeutic potential we have ever made \"\n\n ( Some more info here:\n\n(\n\nLooks like it was a 'happy accident', all the best breakthroughs are.\n\n \n\n“This is perhaps the discovery with the most therapeutic  potential we have ever made,” Professor Currie says. “There are massive  areas that are central to the human condition.”\n\nThe  first is for genetic muscle disease such as muscular dystrophies, for  which at the moment there is no therapy except a standard of care.\n\n“Once  you lose muscle mass, the therapies are not geared towards replacing it;  they are geared towards stopping it happening further. So we could try  to reverse the process.” I love hearing good news like this. I cannot wait to remember hearing about this ten years from now and wonder why I never heard anything about it again. Like CRISPR being used to silence dux4. \n\nNeat though. It would be exciting if I had not already been reading exciting discovery articles for 20 years; each one promising some therapeutic breakthrough just around the corner", "Another article to read \n", "New York Times article on FSHD ", "More exciting news a cure is on its way  It sounds interesting, but it also says they are only at the point of seeking funding for clinical trials.  I do not know enough about it to know in what test circumstances it is been shown to work, but it does not sound like it is been shown to work on humans.\n\n&amp;#x200B;\n\nThere is nothing I really want more than a cure, but until clinical trials show a working treatment, I will be sceptical but optimistic. Fulcrum therapies has been exciting to follow What are Fulcrum therapies?  I could not see that phrase on the linked website.", "Ways to help Hey, my Girlfriend has FSHD and its really bothering me to not be able to do anything when she feels pain, exhaustment or even aching when she is stressed or just tired after a long day. She always has aching when she is stressed and I was wondering is there any way i could help her? Like in form of a special massage or anything else. Im willing to try anything to make it atleast a little bit easier for her. Thank you in advance It is tough because being overbearing is not that great but being aware if you need to help out without making a huge fuss would be great ! However I would say the biggest thing you can do is both remain healthy. Sounds silly but the pain can simply be exacerbated by not getting enough sleep and not eating well. Also mood plays a big part.  Having fshd myself is a drag but the most important thing about life is having some sort of joy and make sure you have an avenue that can give you some amount of quality endorphins :) Everyone with the condition has it differently, but if my partner were to ask me where I would like to get massaged. It would be the neck, shoulder and arms. Between the scapula is not actually that painful but the muscles that compensate are the tiring ones. Message me if you need some more questions. Happy to help someone who cares !", "Hi there What are your thoughts about this?\n\n(\n\nI hope that you do not misunderstand the reason behind why I am posting this. I dislike those who advocate this kind of stuff as it mostly invalidates our experience and struggles.\n\nAlso I am not posting this as some kind of quick fix, nor to claim that we can cure ourselves by changing our mindset or affirmations. \n\nI am just curious if there exists some or any truth in what is being said in that article and I thought of sharing that here. Since, if there is some truth to it, at least most of us can confirm whether we have somewhat similar thought patterns.\n\nAccording to this article \"Illness however mild or severe is an indicator of your emotional state, caused by your thoughts and focus.\"\n\nThe writer goes on to list most illnesses and their associated thought patterns. I will save you some time by copying what the author said about muscular dystrophy.\n// Muscular Dystrophy: \"It is not worth growing up.\"\n\nHaving said that I rarely subscribe to such viewpoints. I am a firm believer that our genes manifest as we go through life in a way that depends on the thought patterns, attitudes and emotions/actions that we choose to bring forth.\n\nSo my question is, Do ideas of growing up or lack of growing up resonate with any of you? It actually does resonate with me, so I will continue with a little of my own story for some context. \n*Feel free to stop reading here, the rest may not be at all informative.\n\nI am 32 years old. Started noticing scapular winging when I was 13, which led me to visiting a few doctors until I was diagnosed. At the time I could not really understand the impact FSHD would have on me and I acted all my life as if I am accepting of my situation. I never really complained to anyone and rarely ever talk about it with any of my friends. Noone ever asks me how I am feeling or how it is affecting my life and I mostly feel alone in it. I sometimes get the urge to complain to someone but hold myself back because I know that ultimately all I would be getting out of it is self pity which would never help. I think deep down I am angry and frustrated, yet if you ask any of my family/friends they would tell you otherwise. Writing this post is the farthest i have come to discussing my thoughts and feelings with other people, this is actually me putting myself out there.\n\nOn the topic of growing up. I have always been a shy person and now at 32, I still am. Although I used to be confident with who/what I am as a kid, as I grew older I am not. I started a smoking habit since 16 (hash/weed) which quickly grew into an addiction. I have been smoking daily for about 15 years now and I am having a very hard time quitting it. \n\nI think I actually HAVE been resisting growing up for such a long time. Here are my reasons as to why I think that:\n- I graduated university at 21 but actually started having some sort of financial dependency at 29.\n- Since being diagnosed, I have mostly made no effort in trying to slow the progression. Rarely exercised, chronic smoking, alcohol and other drugs (all of which I have quit now except for smoking - any drugs that I successfully quit was not out of willpower, rather lack of convenience, for ex. Alcohol tired my body and was not enjoyable anymore, thanks to my now older age I guess.)\n- I am not comfortable in my own body, lots of anxiety, fear of public speaking, mostly unable to handle myself in social situations that include anybody other than my few closest friends. Cannot seem to overcome my lack of self confidence.\n\nI can go on but it is starting to feel more of a therapy session which is making me uncomfortable as I think I may have alterior motives from talking about myself, of wanting attention or validation. Which again is childish behavior you see. So let me just conclude by saying that I blame noone but myself for having turned out that way as a (grown up?). I believe that throughout my life I have been aware of my wrong and destructive behaviors and their impact on the development of my character, yet chose to do them anyway.\n\nIf you have read all the way through to here, I apologize for taking you on a trip through my disorganized mind. The thought patterns you list may be good to explore and go over with a therapist. That said FSHD is a genetic disorder that can be diagnosed before a human is old enough to have any thoughts at all about \"growing up\" Actually not, though the genes are there they are not always expressed. For example none of my family members have any symptoms. Add to that that the human genome includes a huge amount of genes that are simply turned off. For example we share 50% pd our genes with bananas.\n\nYes you can diagnose whether FSHD is there genetically before you are born but you do not have any indication whether it will manifest physically or not. The severity and age of manifestation also vary and we do not know why\n\nCorrect me if I am wrong Your right. My aunt has a genetic diagnosis of FSHD and is healthy. She is nearly 50. My mom and I may possible have it genetically and neither of us have manifesting symptoms. My great aunt had it also with no symptoms but my moms cousins did as well (he got it from my great aunt) as my maternal grandpa. The majority of my family that has it are more mildly affected though thankfully. that said it is still a genetic disease with probably multiple causes (environmental, epigenetic, etc). Exactly. Thank you for sharing.\n\nAs I mentioned at first, I am in no way claiming that this article is 100% true and I am not attempting to give anyone false hope, yet several studies have confirmed that gene development are affected by our environment.\n\nI shared this article for 2 reasons:\n\n1. Looking for others with MD to reflect upon themselves and either validate or invalidate. Yes or no are the two replies that I am looking for.\n\n2. Even if 100% false, it may be a catalyst for some to change their perspective just a little bit and perhaps be a cause for some reflection and personal development.\n\nPersonally, reading about this, regardless of being true or not, has helped me reflect on my own attitude, while at the same time realising that this is no cure. My disorder will most probably remain the same. While I think there is an associated effect between mind and body I do not think it is particularly relevant with FSHD.\n\nI have seen stories of a man who was misdiagnosed, told he had months to live and gave up on life. Things progressed till he reached the ICU nearing end of life. Then they discovered he would been misdiagnosed, told him that he would be ok and sure enough he started to recover.\n\nSo the mind has a powerful effect on the body, just look at the power of placebo.\n\nTo address your point, I was not diagnosed till 40 although I would always been skinny to the point where people felt the need to point it out.\n\nThing was, back in that transition into adulthood I would tried to get on the weights (which did not really work) but I never felt I developed into 'a man'. I was unaware back then so it was strictly my physicality holding me back, which I then internalised and concluded it must be me, some fault with my personality etc.\n\nIt is a chicken/egg situation but I think it wise to lay the blame at genetics' door.\n\nFrom a psychological POV, we can only play the cards we are dealt and in a world where our physicality defines us as 'less than' or 'other' we develop strategies for dealing with the world. When we feel vulnerable it is natural to deploy tactics that minimise our perceived risk, one of those could be to act more childlike so we are not seen as a threat and will not incur any wrath. I am not saying that is the case but I can see how that could happen.\n\nBefore I write a dissertation just hear this. You are enough, it is not your fault, you can only do what you can do and no more. \n\nWhen we truly accept ourselves the need for validation diminishes.\n\nI still want to get a tattoo that says 'Stay Strong'. Thank you for adding this perspective. I can only wish to internalize such a unique understanding by 40.\n\nPersonally my aim is to have a strong mind. I have made that decision a long time ago for the purpose of compensating the weakness of my body, although that is not what drives me anymore. In that way I am grateful for my weakness.\n\nTatto or not, you will stay strong. No one person is burdened with more than they can handle.", "Tips on dealing with FSHD Hi guys this is my first ever post on this sub.\n\nI am a 17 year old guy and my 13 year old brother was diagnosed with FSHD when he was around 7.\n\nIt has been very difficult watching him grow as my family and I could see his symptoms worsening. At 7, he could lift his arms above his head. He stopped being able to do that at 10. Because of the weakness of his muscles, he also falls down a lot. He used to be able to get up from the ground himself, but he no longer can. Last night, he was crying because it really hit him about the severity of his problem and he was sad that he was no longer as strong as he used to be.\n\nWatching him cry because of his disorder really hurt me as every time I think about that moment, I have the urge to cry. I love him very much and want to be his best self.\n\nThere are really two reasons that I am posting here:\n1. What are some things that I should expect in the upcoming years regarding his condition? What new symptoms develop and how much worse does it usually get?\n2. What are the best ways that I can help him? How can I make his life easier and more enjoyable? \n\nI currently do everything that I can but I do not think that I am doing enough. I love him and want to make sure that he always feels safe and loved.\n\nThank you in advance for your answers! Well I will answer the second one first. Just be there and listen. I think people get weird around mortality and change and it is really hard to watch someone else struggle with something that is incurable. That being said support and love and patience and all the things required of us as humans is and will always be more then enough, love especially! \nAs for question one that is tough. I have had FSH since I was 14 and have undergone both scapularthoracic fusions at Boston children’s to stabilize my shoulders. I work and have always worked as a cook and for the most part have not had many issues minus some degeneration and sensitivity due to metal and wires and new bones being part of the normal. My confidant on the other hand was completely wheelchair bound by my age(28 year old male). Same disease different results. I was told it is on a spectrum, it is bilateral in males meaning we tend to be effected more and usually it is the right hand side that is more severe. This is a strange illness so there is no how to or comparison really. It is important to reconnect with a sense of normal as well as best you can. I encourage therapy and continued emotional support for both patient and family and filter your research. There are potentially cures possible but it is a ways off. I am not saying loss all hope of recovery but I will say mange expected outcomes and comparison is the thief of joy. I would encourage your brother to strengthen is mind. He could be the one to create a cure if given the opportunity and ability so to speak. This disease does not come with a death sentence. With technology being the way it is not and all the progress we have available who knows what kind of options with be found. Thou he may never be Arnold there is not reason why he cannot live as normal a life as anyone else. My friend eventually passed away but thou he could not move he had a wife and kids and very successful law career as an environmental lawyer. I would also recommend medical cannabis once he gets older, it really helps with pain and comfort within ones skin. This was also recommended to be by my comrade and the staffing at Boston children’s as I was 20 when I finished both shoulders. There is hope for sure and at the end of the day I do not see a single human who has not been dealt a raw card. It may seem like a lot and give yourself credit it is, but it is also a part of life and being human. I believe 100% that you and your brother will both have an amazing life! before I forget! Lions mane mushrooms help. It is a naturally occurring mushroom that contains compounds that help with nerve diseases. You can get it at health food store, I use a company called host defense, it definitely helps me feel less tired and even as it supports all the systems effect by md. Take vitamins like b12 ,cOq10 ,d3 all of which you can get at most stores help as well. And swimming, if you can ,helps with workouts without stressing any supporting muscles which compensate for loss of muscle mass. And keep moving and strong in anyway possible. Physical therapy works as it allowed me to get strong enough to have my shoulder drilled and fused to my ribs. Its important to not over do it and avoid injury as it can set you back but a balanced physical therapy will help deal with some of the burning sensation of muscle fatigue. If your brother finds himself in pain a lot avoid taking a tone of anti inflammatory drugs and instead seek an alternative as larges quantities and the nature of the disease being incurable means you need a lot and over time they are not the best on your body. Again this is all generally what works for me may not for him but I have kept up on research and have lived with this for 15 years now. It requires strength but you can manage and accomplish an epic life! Hey,\n\nI am Chris, 31M, FSHD (diagnosed at 16)\n\nProgress of the disease is in every case different. Bit I will try to help you as much as I can.\n\nIn my case \"schedule\" looked like this:\n\n16 - could not lift up left arm, my eyes keeps open up when I was sleeping\n\n17 - could not lift up my right arm\n\n19 - my abs went to shit, I need to slingshot myself from position on my back to be able to stand up\n\n19-31 - year by year regression of my legs, first was my foot, could not lift my toes higher than heel. Later I was unable to move my heel closer to the butt (regression of the biceps of the tighs), \"duck walk\", every step on something even slightly wet or slippery made me finish on the ground.\n\nOf course muscles were weaker year by year, and so was the fatigue. \n\n2. You know your brother better than anyone else. Make him as comfortable as you can and treat him as a human being not the disease.\n\nIn my case I was furious about everyone trying to do everything for me...\n\nask him if he want any help before you try to help him himself and accept it if he refuse.\n\nThis is the my perspective. Remember that we, people with FSHD, can be weak and fatigue but we are still humans with flame of ambition and dignity which can be taken from us easier than from other humans and that is scares a shit out of us. Be his brother, be by his side when he needs you, and you will be fine ;)\n\nPS:\n\nOf course you can always be a researcher and find a cure for us all, but do not put whole world on your back ;P Hey man, thank you very much for the advice. I think I understand the situation quite a lot more thanks to your post. Also I have already had plans to go into the field of medicine, and my goal is to become a medical researcher! Glad to hear that, I hope you will succeed where I fall...\n\nIf you want to know more about the disease and research visit: ( &lt; they have a lot of data for the start.\n\nBest! I want to thank everyone for the feedback and I will be sure to listen and follow your advice! I would encourage him to do things that he can be good at with FSHD.  I had a severe case as well. I could sort of play sports at around 8. By 11 I was in a manual wheelchair. By 14 a power wheelchair. I am 39 now.\n\nIntroduce him to gaming and programming.  For me, coding has had a tremendous impact on my life.  It gave me a great career and gives the opportunity to make enough to retire young, which in my case with fshd is important.\n\nAlso, always try to eat clean. Losing weight with fshd is hella hard. Thanks for the info and tips! If he is falling down because he is tripping over his feet, he can prevent a lot of future falls with awareness. Walking the toes should be pointed outward and heel first .. both feet together would look like a v kind of .. practice walking with awareness then walk backward then forward", "Pain Management Do you all have any tips for non-pharmaceutical pain management?\n\nThe area under my shoulder blades has been killing me all day and I am trying to avoid chronic ibuprofen use.\n\nLaying down sort of helps but I am at work so that is sort of a no-go. Actually, ibuprofen works best when not allowed to \"run out\" in your body. It will not work well if you let the pain build. It takes much longer to cause damage than just a few doses taken the proper 6 hours apart. Beyond that, alternating ice and heat does work for temporary relief. Ice can cause muscles to hurt more at first so leave packs on at least 10 minutes to get relief. I also use a vibrating heating pad, set on low. Takes about 20 minutes to feel relief. I am more just worried about gastrointestinal side effects from chronic use. I did end up taking some ibuprofen earlier and do feel better. I use CBD oil and find that it works really well. MMJ *Cries in Alabama* I am in an illegal state too. But you got to do what you got to do. I found a guy who helps me get what I need from a more enlightened state.", "Just a thought; what if there is already a natural cure we do not know about? So, I am thinking, there could be people out there who have FSHD but do not even know about it because they take a certain supplement or eat a particular food which counteracts the DUX4.\n\nSo my question is, is there anyone in your family who has had a blood test, confirmed FSHD but shows very few bad effects?\n\nIf so maybe we could build a list of their diets/meds/supplements and see if there is any correlations?\n\nJust a thought.... There was fairly recent (published May 2020) study in mouse models that berberine can downregulate DUX4 expression. See this: (\n\nHowever, to my non-doctor brain, one problem is that berberine is not always well-tolerated (can cause stomach issues) and sufficient quantities may not reach the right places in the body unless you increase absorption. In my opinion it is something environmental that causes gene mutations or damage at the level where your dna becomes altered thus the disease occurs and then can be passed along if you have a child and they inherit the gene. Myself and my connect who is 40 years my senior have similar family history with zero occurrences up until both our diagnosis and our symptoms showed early. With all the pollution and chemicals and blah blah blah I would not be surprised if our modernization is a factor. As for plant medicine it is completely possible if not probable as to find something that naturally occurs in plants that would be so hyper specific to such a rather odd and rare mutation seems slim and although a healthy diet is no doubt good it will not prevent a disease such as ours because it is our literal coding that is off. Maybe one could be derived or a medicine manufactured, If you could administer something that repaired or rewords gene coding but that is in essence what our modern gene editing programs are working on! I am totally with you. I believe there are lifestyle and wellness solutions out there that are making people with FSHD less symptomatic. \n\nI have been trying to get a student researcher to do even a survey to find out what people are doing and have success with. \n\nHave you checked out myFSHD? It explains why some people are less symptomatic Thanks for sharing this link. Appreciated. Thanks for this, very interesting. Where can I read the whole study? Correct. That is why it is not like we should all start taking this right away, and really it needs more study. I think if you took it with grapefruit juice it would help absorption. Berberine has some research related to diabetes, so there is evidence it helps for some things. See this is what I mean though, that is led me on a little journey...\n\nBerberine affects DUX4 production, what is Berberine, turns out it is a mild AMPK activator. You know what is a better AMPK inhibitor? Metformin.\n\nAre there FSHD affected patients who are also diabetic? If so did they notice an improvement in their symptoms when they started taking metformin?\n\nIt is all interesting... You would love the FSHD facebook group. It is filled with people who think the right mix of supplements (Vitamin D, proteins, etc.) do something meaningful. I do not think that is true, but I understand the desperation. I joined Facebook just to join that group but I am probably going to delete my account because the group is filled with crackpots. Ok, sure, but what you are saying here is not good science or good logic, so you should be very careful. Just because berberine activates AMPK does not mean that the AMPK activation effect of berberine is what downregulates DUX4 expression. That is not at all what the study says. You are making wild inferences here. I am just asking questions, looking for correlations.\n\n(\n\nCould a protein kinase activator like metfomin help with fshd? This is not how to look for correlations, though. It is using the internet to conduct uninformed medical research, and that can be dangerous and can help spread misinformation. See a doctor. Read what doctors write. You are not going to find something that the hundreds or thousands of doctors studying this have missed, unless you get specific training.\n\nFor example, one study mentions FSHD, cAMP and PKA: “Among those, β2-adrenergic receptor agonists and phosphodiesterase inhibitors, both leading to increased cellular cAMP, effectively decreased DUX4 expression by &gt;75% in cells from individuals with FSHD. Of note, we found that cAMP production reduces DUX4 expression through a protein kinase A-dependent mode of action in FSHD patient myotubes.”\n\nHowever, regarding metformin: “The molecular mechanism of metformin is not completely understood. Multiple potential mechanisms of action have been proposed: inhibition of the mitochondrial respiratory chain (complex I), activation of AMP-activated protein kinase (AMPK), inhibition of glucagon-induced elevation of cyclic adenosine monophosphate (cAMP) with reduced activation of protein kinase A (PKA), inhibition of mitochondrial glycerophosphate dehydrogenase, and an effect on gut microbiota.”\n\nNow, you combine these ideas. \n- cAMP production may reduce DUX4 expression. Woo hoo!\n- But how does metformin affect cAMP? Does it increase it or decrease it? \n\nFurther research shows some debate, but metformin appears to reduce cAMP production. So this would be net negative, right? Maybe it increases the effects of FSHD to take metformin? Oh no! \n\n\n\nAnyway, the point is not that you are wrong. Maybe you are right. The point is that you should not be doing this unless you are a doctor or have medical or science training. I should not be either, which is why I do not. \n\nDevote time and energy to supporting others’ research, or to fundraising for research. I would not recommend spending time on the internet trying to solve exceptionally complex scientific questions that many, many scientists are trying to solve. It will not be fruitful and you could make your condition worse.\n\nScience is slow, which is frustrating for those of us suffering today. But you cannot speed it up without potentially damaging yourself. (\n\nThis supports your comments about PKA suppression and would probably result in an increase of symptoms.\n\n(\n\nThis shows the distinction between berberine and metformin, berberine increase PKA\n\nSo metformin's ruled out, that is a win.\n\nI think you and I must be at different stages, maybe you are either less affected and feel no time pressure or are later than myself and already resigned to where you are at.\n\nI am in a last ditch attempt to try and make a difference before it is too late. I am sure everyone with this kind of condition goes through this stage at some point.\n\nI am still looking, still searching and still fighting.\n\nBack to the original point of the post though, it would be amazing to discover something that is already out there. Unlikely to find it on a board like this though with such low participation. I hear you. I know it is frustrating. I do not really talk about myself on the internet much, but I can say I have been through your stage of considering anything. I would recommend, if you can, to talk to therapists and doctors about how you feel. There may be some ways to help you with the feelings and anxiety. Also, maybe the Facebook group “Living with FSHD” would help you. They talk a lot about supplements, various braces or therapies, etc. It just was not helpful for me - too much crazy. \n\nI would be happy to talk to you more (DM me, maybe we can have an email pen pal relationship). We could help each other understand medical research, maybe be a sounding board. And maybe just searching and DOING SOMETHING will feel good, even if it is not actually fruitful in the end. I just do not want anyone to to injure themselves or make things worse because of misunderstanding or bad internet advice.\n\nI feel for you, friend. The thing that makes any sort of hypothesis of this nature difficult to test is that we know FSHD phenotype is, in general, wildly variable between patients, even patients with similar D4Z4 deletions. It is probably not possible to attribute differences in symptoms to anything environmental, given the long spans of time over which symptoms worsen and the vast numbers of variables that need to be accounted for. My father is 53 and was diagnosed with fshd 3 years ago but he looks like a bodybuilder. He is a healthfreak, takes a lot of suplements and works out 4 days a week. I still think that you are lucky when you do not get symptoms at a young age. Yea. My aunt has the gene but she is not clinically affected I think she is 45 which is unusual.She only got tested due to curiosity. I have not seen any woman in my family clinically affected by it including my own mother who is almost 60. I am also not clinically affected. the only clinically affected people in my family that I have seen were boys before the age of 20. \\`I have two women confirmed with fshd in my family which was my great aunt who did not have symptoms even at 70 and passed it to her son who had symptoms before age 20. we only knew my great aunt even had it because my moms cousin was showing signs of it in his teens. thankfully the fshd in my family is relatively mild. I definitely think some people do not really develop it and we dont know why. Im almost 30 and so far dont show signs yet. I might get tested if I plan on having kids though since its very possible I could be a carrier. my grandfather had it for years and I believe he only needed a wheelchair when he turned 60 or 70 although he did have an onset before 20. I think alot of it depends on the specific type ur family has. mine seems to have some kind of sex based affect but some families might not. My aunt was told by her doctor that it might possibly affect her one day but no one knows if that would happen or when? They do not even fully understand the genetics of this disease I think tbh. She does have a little son though so were concerned about him. Thanks for this, it is likely your family only has slightly shortened d4z4 repeats.\n\nFSHD is a disease of inflammation among other things, estrogen plays a big part in modulating inflammation:\n\n(\n\nIt is possible that estrogen (in the women of your family) is enough to combat a relatively weak version of FSHD.\n\nJust my musings, and thanks again for sharing. Yea my grandpa's was 35 kb ? and I feel like his doctor may have suggested women might be affected less. At least that is what I was told. It is really weird lol.", "Things in the pipeline Just a couple of updates on potential drugs/treatments in the pipeline\n\n(\n\n *we have successfully reached and exceeded our goal of identifying a novel inhibitor for DUX4.* \n\n *we demonstrated that both compounds can rescue DUX4 dependent cell death and significantly reduce DUX4 target gene expression.* \n\n&amp;#x200B;\n\n(\n\n *Our results show that in addition to being efficient in reducing  DUX4-induced damage in skeletal muscles, this microRNA was able to  target an essential component regulating skeletal muscle size.* Thanks for posting updates - I very much appreciate it! This is good news if anything comes of it.", "Breaking great News  TL;DR They have lots of compounds that show promise in vitro, where increasing dosage leads to increasing results in DUX4 suppression yet no cell harm, but there are no in vivo experiments yet.  Several of the compounds are those used for other medical conditions, but they are not being taken forward due to various reasons.  Further testing awaits, but no description of what this is, and no mention of human trials.\n\nFingers crossed they find find a compound that works soon.", "If not now WHEN???   “The purpose of life is not to be happy. It is to be useful, to be honorable, to be compassionate, to have it make some difference that you have lived and lived well.” ― Ralph Waldo Emerson\n\nThe best way to not feel hopeless is to get up and do something. ... (\n\n“No one is useless in this world who lightens the burdens of another.” ... (\n\nThe greatest hazard in life is to risk nothing. “The person who risks nothing, does nothing, has nothing, is nothing, and becomes nothing. she may avoid suffering and sorrow, but she simply cannot learn and feel and change and grow and love and live.” \\~ Leo Buscaglia (", "Does anyone else have issues with swallowing and loss of voice? Hi everyone, we are trying to find out if anyone else with FSHD has issues with food getting stuck in their throat and or issues with their voice? Mine is worse when I am tired or fatigued, my mum has more regular problems. I cannot find anything online and my DR has suggested an endoscopy because FSHD does not affect throat muscles apparently. no issues here, I might choke on my spit once in a while though I do that too. I choke on liquids all the time. It is incredibly embarrassing.", "From the University of Rochester patient recorded outcome measures Check out  Tweet: ", "Losmapimod Q2 results ", "Spine and Blood test I had an x ray of my spine and found out that I have  mild scoliosis.   Was told I do not need surgery but dont know what can be done to fix things.  I have pain in my low back, curve, hips pain, legs weakness.   I can barely stand upright and walk normally, abnormal gait.  \n\nFinally getting the blood test soon.  Think its the only one that can confirm it or rule it out?  Knowing my luck it will not be conclusive.  \n\nExercise makes the pain worse.    Better getting a physio that is tailored towards this sort of thing?   Anything, even supplements that have helped a little bit? I feel your pain, quite literally. Definitely find a specialist, if you have one near you. There is no known treatment. Some studies say physical therapy can help, even modestly. \n\nI do not believe in the supplements as there are no human studies of their effectiveness. Others may give you lots of suggestions on those. I think they could do more harm than good. \n\nSome people like the FSHD Facebook groups. I did not. I do not know many specialists near me.  0physio therapy made the pain worse but I could try again.", "I cannot get my jacket on because my arms are too weak - any suggestions? ", "Does this look like Fshd?  No sir. No No, but I am not really sure what your concern really is here.", "Superbowl ticketz  This is a scam website that is not associated with the MDA, Muscular Distrophy Association, which is the generally regarded as legit charity organization.", "Funding to receive treatment outside of the U.S. After years of reading, researching, networking, and wishful thinking, I have found a center outside of the US that treats muscle atrophy. Although they generally do not treat MD patients, the doctor is willing to try the treatment on me. No guarantees, but progress will never be made without trial and effort.\n\nThe problem is I need funding. \nI can share details of the treatment, but I want to focus the discussion on funding -really needing help here..\n\nI am willing to do a GoFundMe but I dont think I can get enough from just that.\n\nI have also reached out to the FSHD Society and they are not willing to fund this as the treatment is not FDA approved.\n\nAny ideas, no matter how crazy you may think they are, will be useful to me.", "Did you know this? Or read this  ", "Its silly season again “There is a sucker born every minute.” ― P.T. Barnum   well it is that time of year again and I do not know how others feel but I know it is mostly about market awareness. We are been bombarded this time of year with walkathon’s telethons filled the boot in many other requests for donations from associations and societies who have failed us and line their pockets with the coin donated to help people like us.\n\nThere are associations and societies who state they are raising money to help us to provide support for us, but I must tell you that the dollar that is donated does not come to us\n\nIn 1950 MDA was founded Paul Cohen, who is believed to have FSH, but in the 40+ years that I have suffered with FSH not once have they ever assisted me. I have repeatedly asked for assistance and the thing I heard was the spin of a rolodex and word why not try calling someone else.\n\nThen the society….  At one time it was true .it was started by Carol Perez for people by people who are affected by FSH.  Currently it is listed as having 13 employees, but no actual building or structure po. Boxes and its employees must have knowledge of salesforce. If you are unfamiliar with salesforce it is becoming the leading fundraising software. Much of the money raised is going to pay salaries \n\nwhile there are plenty of smoke and mirrors it still the people who are affected by those who state they are working for the cause. (and being paid over 100k to 200k a year)\n\nso next time you are asked to fill the boot, to Walk for those who cannot, to give to you cannot give anymore   remember CEO of the society was paid over 250,000 and the CEO of MDA over 500,000 I look forward to the Walk &amp; Roll, but I understand how you are feeling and thank you for your post.\n\nThe FSHD Society does make me feel hopeful and less alone. I look forward to the ( in particular. I am happy they exist and happy for the opportunity to organize and raise money to support them.\n\nI am glad that the people who work for the society get paid well. I think 250k is a little high, but maybe that is the going rate for CEOs. I do not really know. Lol the radio show is great but he is not an employee he is a person who is affected who volunteers his time\nIt was something that he started that he did with his own time and money and I applaud him for that it seems the society likes to take credit for things they did not do but like to have their name attached to it to try to give themselves some credibility that last sentence was totally out of order.  I have stepped up for numerous clinical trails which are funded by the NIH.  I have given muscle blood and more.  I have travel all over the globe to be poked probed and treated like a guinea pig , to assist finding a cure.\n\nI have raised more and done more than you imagine. \n\nThere was a time the FSH society was for people who had FSH, But now it has changed.  It is now The FSHD Society and its main goal is to take money out of the pockets of people affected and from their family and friends\n\nbut if you want to discuss this personally i am easy to find Hey, did not mean any offense. It was supposed to be a fun encouragement to participate in the event despite how you feel about the society. I like the event because it gives me a space to talk about and recognize the disease with people I normally would not.   I was not intending to say you were a free loader or something like that. \n\n&amp;#x200B;\n\nI will remove the last sentence from my previous comment. Did you know? Carol Perez's son was given over $200,000 in separation agreement to leave the", "I need help because I am losing the ability to drive. My legs are getting weaker and it is making it super hard to hold the pedals down. Do you guys have any advice? I thought about using an ankle weight while driving to compensate for the weakness, but I have no idea if it will work.", "I have had symptoms for 6 years (i am 23), matches pretty close to FSHD… but i have daily, body wide twitches/fasciculations. Is muscle twitching (not spasms, but rapid, fine twitches) a symptom of FSHD? I have had 3 EMGs since 2016 and none showed enough signs to be diagnosed with anything. but i am slowly, consistently losing muscle and have had a rough time with back and shoulder weakness/pain. Thanks so much for any input you can get a CK test easily. Or just have then do the blood test if you think it is FSHD thee can receiveth a ck test easily.  'r just has't then doth the blood test if 't be true thee bethink t's fshd\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout` EMG tests sucks for FSHD. In my experience the atrophy allowed the probe to go too deep, so they got a normal result by accidentally testing the muscle underneath what they were trying to test (Serratus Anterior esp.).\n\nSome people on here have talked about incessant twitching before but I have never experienced it myself. I occasionally have twitching. I have never really seen it listed as a symptom and it is not a primary symptom of mine, but it makes sense since muscles under stress may not be able to absorb nutrients as efficiently. Best thing you can do is stretch every night before bed...I mean real stretching for like 15-30 min, drink plenty of water, and have one electrolyte packet (I use a brand called Ultima Replenisher) with a glass of water per day.  This should help alleviate some of the twitching. If it does not, you should go for a full blood panel testing an array of vitamins (b, d, c, e, etc) along with CPK and Aldolase levels. Elevated CPK and Aldolase will be your first indicators letting you know if you need further testing for FSHD. From there, if you have supporting blood work and no real answers from the EMG (which is what it sounds like), the only real option is getting a chromosome test, which is unfortunately very expensive. I suppose you can get a muscle biopsy to see if fatty/scar tissue is starting to seep into/replace your healthy muscle tissue, but I do not imagine that being cheap either. I hope you do not have it, but if you do, stay positive and know that there are ways to manage that can help give you a normal life. Good luck! ", "Save the Date   \n\nSave the Date: Connecticut Walk &amp; Roll to Cure FSHD\n\nPlease mark your calendars: the 2019 Connecticut Walk &amp; Roll to Cure FSHD has been scheduled!\n\nWe hope to see you on **Sunday, October 6th, 2019 at Hammonasset Beach State Park in Madison, CT!**\n\nVisit the ( now to ( Make a ( or learn more about ( Thank you for your support!", " Tommy adaptive #TommyHilfiger Great clothing but worthless customer service ", "Diagnosis For the past two years I have been experiencing progressive weakness and now have difficulty holding a toothbrush up or holding my neck up straight along with other muscle weakness. I saw a neurologist who did an EMG that was normal and upon my insistence did a FSHD type 2 test which came back normal. However they did not help with doing a type 1 test as well and told me I was fine. Is there somewhere I can get the type 1 test done on my own? I am willing to pay out of pocket as necessary. I would go to mda.org they have tons of resources… personally I do not have it but my husband does and they have helped us so much with treatment as well as what doctors can diagnose and treat it. Hope this helps. Good luck to you Two suggestions: Peter Jones does a saliva test for free but it is not FDA approved for clinical trials. Contact  Second: FDA approved PerkinElmer  ", "Time to step up ", "Recently diagnosed with FSHD As the title says. Im going on 32, last two years started noticing I was getting a lot weaker and losing muscle. \n\nAnybody have there own personal treatment that seems to be working? Exercise, diet, some weird supplement that seems to work. Just looking for what other people are doing. \nAny other forums people use? I am surprised the community on reddit is so small I have some things that help me maintain: \n\nSupplements:\n-\tq10 200 mg\n-\talpha lipoic acid 200 mg\n-\tcreatine\n-\tvitamins d and e\n\nExercise:\n-\talthough it is usually discouraged, I have found that maintaining an active lifestyle is they key to my success in maintaining. \n\nI also had scapular fixation. I have noticed a big improvement from that. \n\nIt is interesting that you say that you just noticed it at 32. That is quite late and generally considered an outlier. Have you not noticed difficulty putting on muscle mass during your 20s? Perhaps your job is quite active and helped mitigate the atrophy? Are you type I or type II? Type 1 I believe. I was misdiagnosed since I was in high school. I was told by doctors that I had a bilateral nerve injury in my shoulders. It was not until I was 28ish I started to notice my legs getting weaker and other things. I always had trouble putting on mass, but thought it was a shoulder injury. Indeed. I am type II, so I am not as familiar with type I, but you should confirm your diagnosis. Type II is from a genetic mutation (I assume type I is as well, but if anyone can confirm the details, please correct me if I am wrong). The reason I mention this, is because it is probable that your siblings or one of your parents also have the disorder. Something worth considering. I had genetic testing done, and was able to track it back to grandfather, with several relatives also being diagnosed after. Is scapular fixation at all limiting in any way  ? \nI cant imagine doing pull ups or falling off a bike being ok. ? Or is it pretty sturdy It is pretty sturdy. I cannot do a pull up, but I can hang from the bar no problem. Deadlifts are good too. I do not view it as limiting, compared to the strength and mobility of my arm/shoulder pre-surgery. I still play hockey and ride my dirt bike with it - I just do not really notice it. However, there is a slight restriction in mobility, as I cannot scratch the center of my back like I use to. I too take supplements:\n\nD, Bcomp, C, zinc, iron, coq10 and 5htp, oh and CBD\n\nThe last two are more mental than physical.\n\nFSHD society have recently done a good series with a physiotherapist. It is not so much focused on exercising as it is maintaining 'ranges of movement'.\n\nAs your body declines muscles weaken and other muscles try to take up the slack, then those weaken and you stop being able to do things.\n\nI do not know what stage you are at but try to keep the main muscles going and rely less on the supporting muscles. It is possible to regain lost functionality but you have to start small and build from there. Consistency is more important than effort. A little bit everyday will serve you better than trying to do too much.\n\nGet into meditation, my personal technique:\n\nBreathing through the nose, quite shallow breaths, long on the exhale. Really focus on that exhale, sit on it as you push it out your body.\n\nFocus on the middle of your chest and try to find a sensation of warmth, allow that warmth to grow and spread, to your shoulders and down your arms.\n\nIf you are doing it right your veins should be up on your hands.\n\nIt is like telling the body where to focus the energy and I find this really helps how I feel the next day.\n\nTLDR: keep doing what you can do, do not try and do too much, eat well, do not drink alcohol... you know, all the stuff you are meant to do.\n\nWe have got to keep our bodies going till they find a cure and there is lots of promising therapies and treatments on the horizon. Crazy that you can hang from a bar. I had my first arm done in 2001 and my other arm done in 2004, I cannot lift them that straight up to hang like that. I can lift them way better than before the surgery. It takes some getting used to. I cannot swing a baseball bat, golf club, I have to put deodorant on the same underarm as I am holding the deodorant with. Overall I would still have the surgery again but there are for sure some limitations with it. Putting on a t shirt is a bit of a bitch to deal with as I cannot put both arms straight up enough so it is one arm then stretch the crap out of the other sleeve to get my arm through. Just do not stop being active I have been diagnosed since I was 4 I am 35 now and it is really progressed in recent years but I have adapted well so far.  I have been replacing all of my heavier tools  with lighter ones I hunt and I have been replacing all of my wooden stocked guns with synthetic it weighs a lot less.  It can be very hard at times mentally one thing that really has gotten to me is the inability to skateboard like I use to.  I love skateboarding and I have done it for 20 years now A days I mostly just ride around no more kickflips off stairs or and real sick tricks any more but I still have fun.  I guess what I am saying is you just have to adapt think outside of the box  keep your head up and carry on.  No mixture of any meds will work so do not believe any of that I do take melexitine wrong spelling but it is a heart drug that greatly helps with muscle stiffness and I smoke pot or eat treats for the muscle pain.  Hope this helps some if your interested in the meds I can get you the correct spelling Ya I am always interested when people say it has progressed. For instance I can still walk and do about 4miles a day, however I can not really run for anything longer than a minute or two before my legs stop working. For instance with my right arm which is significantly weaker than my left and my dominant, getting a full Britta out of the fridge is not easy. I am wondering if this is a similar progression? I am almost 32  The proper spelling for the meds I take is Mexiletine and it is for muscle stiffness from myatonia another mild form of muscular dystrophy that is found along side fshd in some people (lucky me).  I basically have no biceps, or pecs, and my calf muscles and thighs are starting to deteriorate.  I have very large hand/thumb muscles and forearms that help to some degree and I will starting to form a muscle on the top of my shin kind of weird and I have no idea what it would be called but by staying as active as I can I try to keep the unaffected muscles as in shape as I can unfortunately you have to be careful not to over due it or you will pay for it for the next couple days. I second all of this and recommend lions mane mushrooms as it is a neuroprotectant!", "Arrowhead Trim progress (\n\n&amp;#x200B;\n\nStill early days on this one but it is another avenue being explored and it appears to be working.\n\n *“Preclinical development of ARO-DUX4 has produced very promising results  that we believe strongly support advancement into clinical testing. In  our preclinical studies in relevant models, ARO-DUX4 achieved deep  knockdown of DUX4 and its target genes. Importantly, in a transgenic  mouse model of FSHD, treatment with ARO-DUX4 prevented and reversed  tamoxifen-induced increases in DUX4 and DUX4 target gene expression. In  addition, ARO-DUX4 prevented and reversed DUX4-induced body weight loss,  muscle fibrosis, and rotarod performance loss. Collectively, these  preclinical results suggest that ARO-DUX4 achieved good target  engagement, which led to a downstream beneficial physiological change.  We look forward to initiating our clinical program and translating these  results into humans. A significant unmet need exists in FSHD, an  indication with no currently available treatments.”*  \n\n \n\n* Prevented and reversed a tamoxifen-induced increase in DUX4 and DUX4 target gene expression \n* Prevented DUX4-induced body weight loss \n* Reversed DUX4-induced body weight loss by day 17 allowing a return to baseline body weight by day 22 \n* Prevented and reversed muscle fibrosis \n* Prevented rotarod performance loss \n* Reversed rotarod performance loss by day 15 Good to see you out there researching and finding stuff! This looking very promising. I will probably try to signup for the trial. Anyone else ever try to get in these trials? Wondering what the process is like Same here. I would like to do these trials especially now since they can do MRIs instead of biopsies They did both mri and biopsy (needle) in the losmapimod trial.", "Join us tonight ", "Which developing potential treatments are most exciting to you and why (over another developing potential treatment)? It looks like the closest one on the pipeline for FDA approval is Fulcrum’s Losmapimod.\n\nThere is also Arrowhead. They put out a press release regarding their intent to file for regulatory clearance to begin clinical trials on ARO-DUX4.\n\nThere is also Dyne. I am not exactly sure where they are in their potential treatment. \n\nAre there others or are these the big ones?\n\nWhat are your thoughts? The Fulcrum drug, based on their mixed-at-best trial results from last summer, does not look promising to me. That does not mean it will not be approved and sold at $50,000/year to a lot of desperate people, like the latest Alzheimer's drug, though.\n\nThe Arrowhead drug has only been tested in the mouse model thus far, but as it operates at the much lower level of RNA transcription, and was found to /completely/ reverse muscle loss rather than merely producing the expected effect on some biomarkers, I am actually excited, if not optimistic, about this one.\n\nDyne has only tested their candidate in vitro so far, so who knows.\n\nPersonally, I take a pretty cynical view of the motives of the many small companies developing drugs for rare diseases, and I suspect that we will not see an effective treatment until directly modifying live patients' genes with some CRISPR descendant is feasible in 20 years or so. But I would be happy to be proven wrong.", "A new dawn maybe coming Check out  Tweet: ", "Possible fshd I have not been diagnosed with fshd but have many of the symptoms.  I have scapular winging.  Severe pain in shoulders, shoulder blades, neck and both arms.  Overhead activety is very difficult. Arms and biceps and chest are very skinny.   Cannot seem to gain or retain weight.   Lost so much muscle.  .  Been told I have some lumbar lordosis.  Stiffness all over.  Have difficulty getting up from a chair after sitting long.  Can barely stand upright.  Have difficulty walking normally and cannot walk long distances.   I think I have foot drop but doctors have not paid attention to it.   Emgs and nerve conduction studies were apparently normal, which was disappointing.  I have not had the genetic test for it.  Have appointment with neurologist.  Was not going to see me again but persuaded to have another look. Where in the world are you? There is a place you can send saliva sample to they can test. Whither in the ordinary art thee? thither is a lodging thee can sendeth saliva sample to they can test\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout` Belfast, Ireland How old are you? Male? I am 29, been like this since I was 24 in September 2016.  Gotten worse as each year has passed.  Yes, I am male. I sent you a DM \nThat is the place that does saliva test mail in Sorry to say it does sound likely from your description. Belfast is N.I right so you should have NHS access. Ask for an appointment with neuromuscular, they will arrange a genetic test after a physical assessment.\n\nHoping it turns out to be something else. Keep us posted. Yes that is right.  Have seen a neurologist and\n did emg and nerve conduction which were apparently normal.   I still have all these symptoms though.  I have an appointment on Wednesday and will ask then but afraid he will say no.  It would almos4 be a relief if I do have it as I would have an explanation for my symptoms and be taken more seriously. welcome to the club. shit sucks :( They did a nerve conduction test on me first too, the genetic test followed soon after.\n\nI was always skinny but it did not pose too much of a problem... until it did. Then I got the diagnosis and then, like you said, my whole life made a lot more sense. In a way it was a relief.\n\nThey have made a lot of progress in the last couple of decades and there are people actively pushing towards a treatment and ultimately cure so there is at least a little light at the end of the tunnel. Can you still have it with normal nerve conduction? I have read that the best way to diagnose is the genetic testing.  I am in so much pain and agony.  I can hardly walk normally.  Difficulty having a normal life, regardless of covid.  Doctors just give medication which does not make any difference or has made me worse or suggest exercise which I am not able to do.  Fobbed off so many times.  They dont spend time \nwhen its more complex. Doctors definitely like the easy to solve problems and the mentality is 'common things are common' so they always go through the most obvious things first.\n\nTook me a long time to get a diagnosis too, years. I was told I was 'lucky' to be 'lithe' and people would love to be in my situation. I am a guy btw so being skinny is not enviable in my eyes. I was told to eat a Mars bar every day and stop worrying about it.\n\nThere is no drugs you can take plus like you said exercise is tough. 'Do something' would be my advice, whatever you are able to do, do it regularly. There are some videos I can dig out on youtube, if/when you get your diagnosis.\n\nTry to eat better, if you do not already. Vitamins I take daily:\n\nD (2200 iu) - this made me feel a lot better when I started taking it\n\nC - antioxidant - helps with inflammation of the muscles\n\nB- energy\n\ncoQ10 - antioxidant - helps with inflammation of the muscles\n\ncreatine - helps muscles retain fluid\n\nprobiotics and psyllium husk for fibre.\n\nI would advise anyone to take that combo, they definitely make a difference for me. Yeah probably seems worse being a skinny guy.   A few years ago my neighbour said to me \"Do you not like food?\" Totally judgemental and wrong.  Was hard to stay calm but tried to be the bigger person.  I eat a balanced diet, 3 meals plus snacks, even unhealthy foods like ice cream chocolate and crisps at times and cannot seem to put on much, if any weight.  A doctor once said the scapular winging is because I am thin.  Been fairly thin my whole life but only had the winged scapula about 4 years ago.  Do your shoulder blades stick out?\n\nExactly there is no point taking drugs for the sake of it if they are not suitable for your specific condition/symptoms.  I would only want to go back to physio if it was tailored to what I have got.  \n\nTried so many supplements and have not noticed any difference.   Will possibly think about those suggestions.  Have wondered about creatine.   Does it help?  Does not seem to be much side effects apart from for those who have kidney problems. Agreed. Get this test. \nEmg results for Fahd often come back normal. Mine did. Beat best is to get the myFSHD test. Free and you will get results quickly Yeah I had that a lot, and each time it was like a little dagger. I wish I would known back then so I could have told them there was a reason.\n\nWinging started early along with ab weakness, then arms... now pretty much everything. Still walking for now.\n\nBody builders take creatine indefinitely so I am not seeing an issue there. There was a time they would talk about having a 'flush' but it is not needed. My blood tests do not show any issues and I have been taking it for some years now. My neurologist agreed to do the test.  Says I have some of the symptoms but does not think I have it.  Thinking of FND, which is disappointing.  I almost hope I have confirmation of fshd.  Dont want to be labelled as functional. Thank you for the link 💞I also suspect I may have it, but getting a doctor to listen to me seems impossible. I had to get aggressive just to get my neurologist to consider diagnosing my severely symptomatic scapular winging.", "Covid-19 and FSHD Hi all, this community does not look too active, but I may start posting here with questions or articles I come across.\n\nFirst question - has anyone in this group had coronavirus?  (I hope not). If so, and you have recovered can you re-cap your experience?\n\nA few months ago I heard that the symptoms may be worse for those with FSHD if the muscles of the chest wall are weak.  Also, I know of an individual who does not have FSHD and was hospitalized with covid-19 for two weeks.  They lost a lot of muscle mass in their legs due to being restrained to a hospital bed the entire time.  Luckily for him he is recovered and can regain that muscle overtime.  If I were in that situation I am not sure I would be able to regain the muscle mass. No im lucky to be in Canberra Australia. I was worrying about that seeing as my lunges get so wrecked after flues. :/ Yeah, I am in the US in a major city.  We are having a record number of new cases here so I am playing it safe and staying in mostly.  \n\nWhat issues have you had with the flu?  I have never had issues with colds or flus.  Just regular symptoms. I usually get them longer than everyone else. Not sure its fshd related but ill recover from the flu then be left with copius amounts of phlem. So covid sounds very real for me. I hope things are leading in a better direction for you guys soon ! I have not had it but I am also being extra careful and isolating. From what I have seen and know, FSHD patients are not “at any higher risk” than anyone else for COVID itself. However, because the diaphragm and muscles in the rib cage wall are effected, this already causes breathing and coughing issues. That also means we are more prone to contracting pneumonia as it is. \nIt would also be extremely bad to be put on a ventilator for any amount of time. I remember going to an FSHD conference and learning that within a few weeks of being on a ventilator, depending on how progressed the disease is, the patients esophagus muscles can atrophy. Not only would they be dependent on the ventilator but their body would not be able to regulate or swallow on its own. Eventually, within a very short time, they would die from asphyxiation on their own fluids. Wish I could link a source but like I said, was a talk at a FSHD conference. Just remember it because I had not realized that would be a thing and it was terrifying. Makes sense though. \nDo everything you can to stay safe. Isolate, wear a mask, clean everything and often, do not go out unless you have to. It sucks but COVID is far from over. We are seeing the second spike which is worse than the first. We are also seeing patients who are contracting it again. Meaning because people are not being careful and continuing to spread it, asymptomatically or otherwise, the virus is mutating and evolving. Every new body it effects, it has a opportunity to get stronger and change to where the antibody’s someone has from the first round no longer help prevent it now.", "Follistatin gene therapy strengthens muscle in FSHD mouse model  \n", "FSHd online meeting **Log onto Connecticut Connections: Thurs. April 4, 7pm - 8:30pm***All are welcome! Join us virtually from anywhere!*\n\n**VOTE for the CT Walk &amp; Roll to win a BIG donation!**\n\nKathy Senecal and Sarah Pashe invite you to come support, empower, share and network with the FSHD community. This month, We are excited to be hosting **Katelyn Daman**, Postdoctoral Associate with the Department of Neurology, Wellstone Program, from the University of Massachusetts Medical School. Patients, caregivers and family members welcome!\n\nHope you can join us! We look forward to seeing you, or if you are new to the group, welcome!\n\n\\-Kathy Senecal, Connecticut Chapter Director\n\n**Join online:** ( call: 669-900-6833, Meeting ID: 442 453 571**\n\n( Your vote is needed!*** A local legal firm is celebrating their 30th anniversary by holding a charity contest - the cause with the most votes will win a **$5,000 donation**!!! Support the FSH Society today by voting for the **Connecticut Walk &amp; Roll** \\- click ( or on the button below!\n\nThe contest ends April 5th - so get all your votes in this week! ***THANK YOU!***( 7pm ET happens when this comment is 3 hours and 2 minutes old.\n\nYou can find the live countdown here: \n\n---\n\nI am a bot, if you want to send feedback, please comment below or send a PM.", "Dyne Therapeutics also making progress Dyne reported their findings based on their Force platform:\n\n(\n\nI have not read too much into this yet but it is another therapy in the pipeline that is making progress About the FORCE™ Platform\n\nThe proprietary FORCE™ platform drives Dyne’s efforts to develop targeted, modern oligonucleotide therapeutics with the potential to be life-transforming for patients with serious muscle diseases. Dyne designed the FORCE platform using its deep knowledge of muscle biology and oligonucleotide therapeutics to overcome the current limitations in delivery to muscle tissue with the goal of stopping or reversing disease progression. The FORCE platform leverages the importance of transferrin 1 receptor, TfR1, in muscle biology as the foundation for its novel approach. TfR1, which is highly expressed on the surface of muscle cells, is required for iron transport into muscle cells. Dyne links therapeutic payloads to its TfR1-binding fragment antibody (Fab) to develop targeted therapeutics for muscle diseases.\n\n&amp;#x200B;\n\n", "Fulcrum Therapeutics Announces Completion of Enrollment in Phase 2b Trial of Losmapimod for the Treatment of Facioscapulohumeral Muscular Dystrophy (FSHD) February 26, 2020 at 7:00 AM EST  ( 7:00 AM EST happens when this comment is 18 hours and 53 minutes old.\n\nYou can find the live countdown here: \n\n---\n\nI am a bot, if you want to send feedback, please comment below or send a PM.", "FSHD and testosterone Hello, i have been taking a TRT dose of testosterone once I found out I had FSHD. Does anyone do this. Any results? I am hoping the testosterone will balance out the muscle wasting. Just looking for others who have tried this approach. \nThanks Never tried it.  I have always had the impression that supplementing testosterone had negative effects.  I thought your body compensated by lowering its natural production.\n\nBack in my teens I used a lot of creatine (I was a lot stronger then) and recently been using it a little.  I read that it acts as a slight myostatin inhibitor.  Myostatin inhibitors are an area of promise in treating muscle wasting diseases and also general strength training for athletes. Ya I am just surprised I cannot find more studies on the topic with relation to FSHD. I can only find one study that looks like it may be starting soon, that is testing low dose testosterone and HGH on patients. The dose of Testosterone looks like it is so low that it is doing more harm then good.\nTestosterone seems like a substance that can preserve muscle and grow new muscle so I am curious why it would not work for FSHD patients, but cannot find any literature on the subject. I have not arrived at a final diagnosis yet, but so far my testing is possibly pointing to FSHD. the doctors so far have eluded to possibly doing a steroid or testosterone therapy once I get to a diagnosis. I will keep you posted on what happens. My doc told me exercise and good luck. I should not laugh but same here. When I got my diagnosis they sent me to physiotherapy. The guy literally said 'I do not know much about this, I did a google search' (which was still open on his computer) 'exercise but not too much and good luck'\n\nThat was it, one session and his parting words were 'good luck' I know I am a month late, but the wasting appears to be entirely caused by myotoxic DUX4 protein which kills off the nuclei of myocytes. So while steroid supplementation may make healthy muscle stronger it would do little to hinder or reverse damage to muscle where DUX4 has already been expressed.\n\nMy expectation of the testosterone/HGH study is that they will observe increases in strength with little/no increase to the mass of already effected muscles.\n\nSee: (", "Possible treatments/muscle atrophy delays? Hello fellow FSHD warriors. I am checking out a couple possible treatments - has anyone happened to get a muscle transplant? Specifically from leg to bicep? \n\nIf so, did this procedure help and are you noticing if this new muscle is atrophying as well?\n\nI am also considering taking testosterone despite having normal levels to get some sort of strength back. Does anyone take extra T and notice a difference here? I do not think you will find doctors willing to transplant muscles because they simply would not last. I was speaking Dr. Peter Jones a couple of years ago about potentially using stem cells to buy a bit more time and he said any benefits would be short-lived because of the naturally 'toxic' environment inside our bodies, when it comes to muscle.\n\nThe best bet is to stop dux4 production at the source, before it has a chance to cause cell death. There are a number of ways to achieve this but only one trial running currently for an already well tested drug.\n\nThe thing is muscles are normally pretty good and they grow quickly so as soon as they find something that stops dux4, if you have got ***any*** muscle left it could potentially grow quite quickly and for those areas which do not there are ways to start things off in those areas.\n\nThe trouble with FSHD is that we are fading all the time, getting weaker and weaker by the day. Personally I find that really stressful, the clock is always ticking so for me a treatment cannot come soon enough. I want to be independent for as long as I can be but that day where I cannot continue on my own is getting closer.\n\nThey have just had a conference on the current research efforts, some limited info here:\n\n(\n\nYou can also check this link and see ongoing studies, but also check the completed ones to see what people have tried and whether it is had an effect:\n\n( Test will help for strength, but it will become a lifetime thing. I do a TRT dose, strength has gone up but no muscle. I think it is most helpful in preserving what is left, but it is not going to reverse anything Makes total sense that any muscle that is transplanted will simply end up atrophying as well - unfortunately . Makes for a better plan to hold out for the cure to stop it at the source and if needed, pursue a muscle transplant. Thank you for the thoughtful response! I think I will pursue this then. Preservation of the existing muscle until the cure comes out is the name of the game for right now Again I am not sure existing muscle, but I have kept my strength to a degree Do exercises with good form, if you cannot do an exercises the normal way, try to modify it / get on the bed, the most important thing is to use the muscles otherwise they will atrophy so even doing random things like crawling and rolling around will use a lot of muscles .. walking in a pool I dunno my grandfather had FSHD along with his nephew. My aunt and my great aunt are just carriers and never were clinically affected..which is weird but anyway. I remember he used to do like physical therapy alot which was sort of helpful (medicine balls, etc). Swimming was also good for him too. Playing piano helped to strengthen his hands. there is not alot to do about FSHD unfortunately but trying to stay active as you can without straining yourself seems to help a little. Never mentioned muscle biopsies to me. Thankfully FSHD is usually slowly progressive and my grandfather had a pretty normal life and was able to be able out of a wheelchair for most of his adult life and lived almost to 90. The most important thing that he learned from his diagnosis I guess was adjusting as he grew progessively weaker. I have heard of some studies recently and hopefully they find a treatment soon!", "Something to read ", "Scapular Winging  FYI, can see your face and the camera man in the mirror. The thing about winging is some people have it due to bad posture. Some people have it because a lack of muscle between the scapula. Your back looks like mine. I cannot properly tell because of the angle but I too have mild scoliosis and my right scapular wings more. Attempt the same photo but with your arms straight infront and straight to the side. I cannot do either. Yeah I see now.  Did not realise at the time", "Join us via Facebook Live on Wednesday, January 30th, at 8:00 pm Central / 9:00 pm Eastern time  Done Thanks", "Amazing fsh news ", "Fulcrum Therapeutics Receives Orphan Drug Designation for Losmapimod in Facioscapulohumeral Muscular Dystrophy  So it sounds like there is an ongoing clinical trial that ends later this year if I understood it correctly.  I look forward to the results, and hope so much that they will find it works as an effective treatment.", "Possible Treatment  I think so, I read their Q1 financial report and they talked a lot about how they are excited to release the results in June (24th or 25th I think) and the fact they have applied for fast track (why would they do that for something that does not have at least some benefit?). They have also just started the roll over trial for the current phase 2b of Losmapimod which is where anyone who is currently on the study can continue taking the drug if they want, which, again, why would they do if it was not at least somewhat beneficial.\n\nI am pretty sure something which is at least helpful is going to come from this drug, Fulcrum seem positive and their half way point results show that it reduced the amount of DUX4.\n\nWill just be interesting to see when they present the final results in a month or so how much difference the reduction in DUX4 makes. Been following this for about a year now would love to hear more  For anyone following  this, here are the results ", "Hello I am new here.. I am 38 m was diagnosed with Fshd at 25 and was also diagnosed with MS two years ago.. does anyone else suffer from multiple diseases??  I have fshd in my family. my mother has RA but does not have FSHD and neither do I. none of my affected family members have autoimmune disorders. it is not related. MS is a different disease process than FSHD. FSHD involves DUX4, which I believe is a gene that is supposed to be shut off after birth but weakens the muscle because it is kept activated, and not the spinal cord or brain lesions which I believe is a part of MS. My grandfather had I think very early onset but he did not have an autoimmune disease while my mother did but my mom's RA came from the other side of the family because her other sister has a different autoimmune disease.", "Hi everyone, I am looking for some wisdom on dating someone with FSHD I really like someone who has FSHD and I want to hopefully date them. I have been doing my best to educate myself, I know the medical side but I know I do not and cannot know what it is like to live with it. What are some important points I should know to try to be a supportive partner to someone who lives with fshd?\n\nThank you for any advice. I am a person with fshd who got married 4 years ago at the age of 36. I was genetically diagnosed around the age of 33 and started really showing signs around the age of 38. People with fshd are just like everyone else. I think it is important to see if that person is interested in you. And if they are, go out. The most important thing is to have open and honest communication in any relationship, but when you are in a relationship with someone who has a progressive chronic disease, that open communication is even more important. The disease progression is so unique to each person, it would be difficult to give you any other advice. She is interested, but I feel like she is apprehensive because of her fshd, she is afraid I am going to go running for the hills lol but that is not the case. I do know it is very specific for each person and how it effects them, I was not sure if there was some sound advice maybe I have missed or knowledge I have not acquired yet. I just want her to be as comfortable about it as possible. We have talked a good deal about it, she is becoming more comfortable about opening up. I just wanted to see what others might input. Not sure if this matters and how far she has progressed, but stats say around 20% end up in wheelchair. If you want kids, she may not and if she does she may not be able to do many tasks, which will put the burden on you. Just a few things off the top of my head, not trying to discourage the relationship just putting the info out there She is mostly in a wheelchair now. I am ok with everything, she is an amazing person and that is all that really matters to me. Kids I could go either way but I would say that is probably wayyy down the road and ultimately up to her since it is her body. I am just wondering like for date nights or other things, what I should check for, how I could make her feel comfortable in those situations. I should probably just ask her lol but I wanted to see if there was any great outside advice. Honestly? Just do not make a big deal about it.\n\n\"is that ok?\"\n\n\"can I get that for you?\"\n\n\"do you need help?\"\n\nIf she is already self conscious about things then my advice would be just make everything as normal as possible for her. Let her ask for help if she wants it. Do not make it the main talking point, do not bring it up at all.\n\nJust show her a good time, laugh, engage, give her the opportunity to forget about things for a while and get lost in the moment.\n\nIf you are really serious about pursuing something just let it evolve naturally, be fun to be with.\n\nThe classics are classics for a reason, get some nice food, does not even have to be in a restaurant, go have a picnic.\n\nThere will be time to learn what her particular needs are but for now focus on building something you both want to be a part of. Yeah I agree, we have our first date on Friday and I think it is going to go well 🤞 She may need help with lots of little things here and there, and to begin with, asking for help may be a little uncomfortable. But as you get used to each other, it will get more natural. How did it go? lol It went well lol Glad to hear! :p", "Has anyone tried Losmapimod on their own? Looks like you can buy it online (pricey) for some reason for research purposes It was identified as a potential therapy only last month, yes?\n\n\n\nIf that is the case, I would suspect no one has tried it for FSHD even at the clinical level.\n\nPersonally, I would avoid the self-administration of mostly untested drugs, as we know very little about adverse effects and dosing requirements. This drug works by modulating transcriptional pathways, so the effects could be very wide spread.\n\n\n\nThere is a COPD trial currently under way (I think), which should give some idea of potential dosage and adverse effects when it completes. Yeah I did not see any official results for fshd patients, only that they tested on healthy individuals for a heart thing but did not work .. maybe I have been watching too much Netflix where scientists inject themselves whenever something goes wrong in space Sure, I would try it. Only problem is you would need a lot to see a difference and it does not rebuild muscle. Rather try follisatin", "We could have told you this a long time ago  This has to be a joke. Did they really expend the resources to study whether folks would want to take part in research/clinical trials? Of course they did...", "Fulcrum presenting this week Anyone else looking forward to the presentation this week?\nCannot wait to see the phase 2 results to get a better understanding of the treatment and what to expect. Where can I watch?  Not sure but news will slowly becoming out and will probably be on there website after For sure (", "Does that mean FSHD i have been diagnosed with FSHD by my doctor, and I have the current symptom in my shoulders, shoulder winging,90 degree shoulder, but i can walk properly and i have a strong muscles in my legs, but i cannot raise my hand above shoulders, I did an emg examination and it said that i have weakness in the deltoid muscle, and i have no other weaknesses in my body. By the way in 20 and 6 months old. I hope you answer me and I hope you suggest things to do if I have FSHD, and what kind of exercise i can do at home to strengthen my shoulder muscles, and am i able to do other muscles workout. Oh i missed to mention that I have eye muscle weakness and mouth muscles weakness. \n\nbut since i stop playing that much of video games my eyes got better and they look much better than 3 weeks before. \n\nAnd sorry for my bad English. When it comes to exercise my best advice is to be safe.  Do not push yourself too hard.  I have tried lots of different exercises over the years and I have learned when trying something new it is best to test the waters for a few weeks or months to see how my body responds.  My worst experience was getting a Peloton bike and riding a few tomes a week.  I ended up developing foot drop within a couple of months.  That was the quickest acceleration of muscle wasting I have experienced so far with FSHD and I definitely regret not being more cautious trying a new exercise.  Also I have yet to be able to target and improve any muscle that has been majorly impacted by FSHD. That being said I have been able to strengthen healthy muscle and improve mobility with moderate exercise.  I have had good experiences with yoga, body weight exercises, and free weights.  When I try to target areas/movements where I am weak I try to find physical therapy type exercises and modify them as needed to help me through the movements. ty for the information, but if you please, is it helpful i mean the exercises. Becuase if it is so i will start doing them. Yes, exercise has definitely been helpful for me.  I keep it moderate and frequent. Dm me your email I have an fshd exercise sheet from my specialist that may be helpful for you. ", "New FSHD Biomarker ", "What is going to happen with Losmapimod? I thought their statement was a bit vague... 'We are going to talk to the FDA' so I am looking into things while we wait.\n\nFulcrum not only has Orphan Drug designation but is also part of the accelerated approval program. What does that mean and how may it affect what happens next?\n\n*The FDA instituted its Accelerated Approval Program to allow for earlier  approval of drugs that treat serious conditions, and that fill an unmet  medical need.  Approval is based on a surrogate or intermediate  clinical endpoint.  A surrogate endpoint is a marker, such as a laboratory  measurement, radiographic image, physical sign or other measure that is  thought to predict clinical benefit but is not itself a measure of  clinical benefit. The use of a surrogate endpoint can considerably  shorten the time required prior to receiving FDA approval.* \n\nSo from that it looks like Losmapimod may meet some of these requirements, they have the MRI data showing reduced fat infiltration, improved strength tests and slight improvement in reachable work space.\n\nThe fact they did not mention a phase 3 leads me to believe they will be trying to go straight to market if possible. We could possibly expect a timeline of 18 months and hope for shorter. This would give them sole rights for FSHD treatment for a year I think which gives other research units time to further test their candidates.\n\nMy hope is that we get a treatment that reduces symptoms, then a better one that reduces/reverses them, then ultimately an mRNA injection that simply turns it off completely.\n\nI am very interested to see how the next few months play out, the light at the end of tunnel seems a little brighter... I sure hope so.  Glad to see others on here talking about it. Any Canadians on here who know what early FDA approval might mean for approval in Canada? I think that is what we are going to see also. Arrowheads treatment looks awesome and the crispr advances, this looks like a bridge treatment Really appreciate the digging you have done there. Thanks! Afaik Canada pretty much just follows USA on this stuff. For better or worse. Feels good to see everyone here. \n\nI am wondering what steps we should be doing to prepare ourselves for expanded access so we can start taking it ASAP. What comes to mind: Getting tested (if not officially done yet) and discussing with your doctor so you can send all the necessary documents. Any other ideas or thoughts? Thanks for posting. I am wondering where the estimate of up to 18 months comes from with no phase 3. I would have thought sooner. I watched the fulcrum webcast and I believe I remember one of the experts saying it can range from 14-18 months to get an approval/go to market. Anyone else who watched can you confirm? Yep, I saw that. He said it takes companies a year to collate their data and present it. The FDA then 'tries' to look at the data within 6 months instead of the usual 10.\n\nThings can happen quickly,  I would think a bare minimum of 8 months but we are nowhere near that kind of thinking yet, Fulcrum and the FDA do not know what they are going to do yet so there is no point building our hopes up for now... that is why I thought having 18 months in mind (if things go well) would be a good guide timeline.\n\nThey have approved drugs with less evidence (even recently) so I am happy to be at least a little hopeful but you never know with this kind of thing. sole rights for a year would be devastating, this drug would have to be taken every day for minimal if at any effect and does not even target the original problem vs. a gapmer treatment that has immediate significant results and is probably a short term treatment ", "Article from Psychology Today on FSH  ( Hi there. I have FSHD and am a psychologist advocating for the disease. I hope you enjoy my article! Thank you posting us I would love to invite you to our next Connecticut FSH Zoom meeting it is online March 7th at 7 p.m. I can send you the link if you wish would love to have you join us Yes I would love that! Thank you very much!  This month, we plan to discuss:\n\n* Volunteer Leadership meeting Kathy &amp; Shawn attended in Chicago\n* Hospital for Special Care meeting February 20th\n* Updates on the Walk &amp; Roll\n* Potential picnic gathering in June\n\nHope you can be there! Join from PC, Mac, Linux, iOS or Android: (\n\nOr iPhone one-tap :  \nUS: +16699006833,,442453571# or +16465588656,,442453571#  \nOr Telephone:  \nUS: +1 669 900 6833 or +1 646 558 8656  \nMeeting ID: 442 453 571  \n", "Effect of Losmapimod on Cardiovascular Outcomes in Patients Hospitalized With Acute Myocardial Infarction A Randomized Clinical Trial  Effect of Losmapimod on Cardiovascular Outcomes in Patients Hospitalized With Acute Myocardial Infarction A Randomized Clinical Trial \n\n&amp;#x200B;\n\nI have the pdf if you want", "I need you to vote so we can get $5000 for the FSH Society ( a charity ) from a lawyers group I need you to vote so we can get $5000 for the FSH Society ( a charity ) from a lawyers group\n\nGo halfway down the page to see the FSH logo press the tab view details to vote\n\n", "Who we Are   Facioscapulohumeral Muscular Dystrophy (FSHD)… the most prevalent form of Muscular Dystrophy, is a devastating, muscle-wasting disease and the FSH Society, is a 501(c)(3) charity dedicated to solving FSHD. The FSH Society has led the way in the fight against FSHD thanks almost entirely to generous donations from the society’s members and those who want to make a difference\n\nMake a (\n\nWe are focused on the two components that will propel us to success. First, we are directing our funding to research and infrastructure that will greatly speed up the development of treatments. And second, we are enlarging and activating our community, and empowering our stakeholders to raise awareness, engage, and advocate for the resources we require.\n\nMany of our seed grants and starter projects have generated data and insights that help with screening for FSHD, improve genetic testing, and ultimately improve the speed and accuracy of diagnosis.", "What (part time) job can I do if I have FSHD? Hello everyone. I am taking time off of school and I am looking to spend my time through a part time job or volunteering, but I have FSHD and I feel like that really limits the opportunities I could have since my arm muscles are severely affected and I cannot really lift anything. I am also scared of getting covid since I do not want to be put on a ventilator and have my lungs or other muscles atrophy, and because I do not want to get my parents sick, so that makes me scared of getting an in person job. I unfortunately have no work experience, and very poor social skills, so that will probably make getting a job harder, especially during the pandemic where even ordinary people are already having a hard time getting jobs… Sorry if this comes off as whiny, but I just feel sad/frustrated about my situation. Any advice is appreciated. Totally understand your frustrations. Know that you are not alone in them. I find it best to come to terms that it will be tough to help people with tasks involving your arms and start to think of other ways you can help with the cards you are dealt (however you can). Personally, I am learning to code through Codecademy.com. I am hopeful that some sort of program I create can help someone or an organization, or I can find an employer with a vision that inspires me. \n\nIf you would like to hit two birds with one stone and work on your social skills - I would suggest checking out a charity hotline (think suicide prevention or others). Both these options provide ways to minimize your risk of getting covid and also stimulating your mind while also potentially helping others. Really hope this helps and feel free to PM me. **I found links in your comment that were not hyperlinked:**\n\n* (\n\n*I did the honors for you.*\n\n***\n\n^( ^| ^( ^| ^&lt;3", "WALK AND ROLL TO CURE FSHD 10/06/2019   \n\nDear friends,\n\nFacioscapulohumeral Muscular Dystrophy (FSHD) the most prevalent form of Muscular Dystrophy, is a devastating, muscle-wasting disease that impacts the lives of an estimated 1 out of every 8,333 of our friends and neighbors have it. As one of the many who is personally impacted, I am asking you to volunteer to Cure FSHD by to raising vital funding and awareness.\n\nAll proceeds from the event benefit the FSH Society, a 501(c)(3) charity dedicated to solving FSHD. The FSH Society has led the way in the fight against FSHD thanks almost entirely to generous donations from the society’s members and those who want to make a difference. The Society has become a world leader in serving patients and driving research for treatments and a cure. Plus, the organization has earned the coveted Charity Navigator four-star rating, demonstrating that it is worthy of your trust. \n\nIt is Easy… People of all ages rely on their smartphone’s day-in and day-out for a multitude of tasks, and making donations are no different. Our FSH donation pages are mobile-optimized, and we also offer fully responsive sites. Donors can go through the entire donation process with just a few taps on their phones, with confirmations and receipts sent right to their inbox. \n\n(\n\nIt is easy, there is no handling of money, it is fun and family orientated it is a day at the beach\n\nTogether we can put an end to FSH Muscular Dystrophy and give back the quality of life to the 870,000 men, women and children worldwide affected by this debilitating disease. \n\nWith Warm Gratitude,\n\nShawn Welch - I have FSH, I volunteer, I donate my blood and muscle to research \n\nConnecticut Walk &amp; Roll to Cure FSHD Coordinator\n\n 203-640-0930\n\n... is a life-changing event that unites families, friends, neighbors, and local businesses to forge powerful connections and strengthen our families and our community. We are working together to make a difference for those living with FSH Muscular Dystrophy!\n\nSunday, October 6th, 2019 Walk and Roll to cure FSHD \n\nHammonasset Beach State Park\n\n1288 Boston Post Road\n\nMadison, CT 06443", "Anyone here workout consistantly Happy Thanksgiving!  I am just curious I would anyone here works out consistantly? My son does. He is 18 and at gym about 5 to 6 days a week.  He is obsessed with working out despite diagnosis.  Allows him to build muscles in unaffected areas, helps with mood and pain levels, and makes him hyper aware of small changes in his body.  He is still progressing, though.  He does 30 to 40 min of cardio and alternates weights (upper versus lower) each time and then does his PT exercises. I think more detail is needed here.\n\nWhen I was in college and did not know I had FSHD, I worked out like a maniac.  I built good definition in some areas but could not understand why I could not build strength in others.  Now I know.  As I aged, my 6-pack abs went to a 4-pack, then a no-pack to a beer belly.  Just lost the muscle in that area.  \n\nThese days, being in my 50's, the best thing for me was getting a dog and walking him almost every day (make my son take him on most weekends as one my ankles will swell at the end of the week).  \n\nSo I think workout depends on age and status.  I think the walks have helped my core, but I am not about to try to do Tricep dips with 100 lbs between my legs as those days are long past. Heck, tricep dips with body weight are gone down the river at this point. Should have explained more:\n\nI worked out with weights well into my 30's.  I think some of the strength I have left in my shoulders is still a result of how much muscle I built up in those days, but I could be wrong.  \n\nIn any case, I neither regret nor do I think my current status was impacted by my workout routine when I was young.  I came from a perspective of ignorance since my mom felt guilty and did not fully explain the genetic impact of her FSHD (she felt guilty and I understand fully now that I am older).  \n\nI just knew at the time that I was not as strong as many others my age and I worked hard to correct that.  \n\nYour son, knowing that he has this disadvantage can be more cognizant of what he can and cannot do and I hope he can focus on strength rather than becoming the next Arnold  Schwarzenegger.  \n\nOnce symptoms start showing up (for me it was into my 30's) you have to let go of your pride and embrace assistance (in my case leg braces) to avoid injury such as falls due to being too proud to get help.  \n\nI wish your son luck and hope that he accepts what he has and lives his life to the fullest. I  have always wondered I have been doing powerlifting  for a few years now  respectable lifts but nothing impressive.   I am 34  I started working out seriously in 2007.  I took a few years off 2013- Oct 2016.  I have put on alot of muscle even in my affected areas.  But I never really read about anyone working out seriously with fshd. I joined a US Navy Special Forces Unit when I was 19. I was an all state football player and diagnosed when I was 27. I am 30 now. I still workout/exercise very hard despite the diagnosis and “doctors orders”. I used to, diagnosed at 28 and now I workout very moderately 2-3 days a week. Went from being able to bench over 250, run a mile in under 5 minutes, dunk, do over 20 pull-ups and hit a golf ball close to 400 yards. Had scapular fixation surgery in 2017 and am too scared to workout hard now since I have atrophied so bad in my upper body that I am scared to make it worse. My advice is to keep active but do not do anything too strenuous, looking back I wish I would have done so. I would give that up man. I went down the same path in my early-mid 20's only to look like a skeleton above my waist now. I was a personal trainer/gym owner for over a decade and ended up having to switch careers and sell my gym due to the worsening/atrophying of my upper body.", "World FSHD Alliance Research Congress Highlights from Dr. Jessica De Greef  Fulcrum's Re-DUX4 timestamp here: \n\nAn impressive overview and great explanation by Dr. Jessica De Greef of a number of different FSHD research studies.\n\nObviously the Fulcrum trial results are the big news, but I was genuinely surprised by the amount of positive news from everything else. Is there an estimate on when it will hit the market or the cost? I do not remember any cost or approval timescale estimates from the highlights vid but some here on reddit have suggested ~18 months for approval as a ballpark. My key take away from this was that she said we would probably take parallel treatments because there would be 'leakage'. Eg: One drug does not stop all the dux4, a combination of 2 (or more) may eradicate expression completely.\n\nThis is also kind of good news for other companies exploring different mechanisms for reducing dux4 as they will not be barred if Fulcrum get approved with orphan drugs status. I know a little more about this than when I posted previously...\n\nFulcrum are going to spend 3-5 months collating the data and presenting not only for peer review but also to the FDA who could take up to 6 months to review. Fulcrum would be ramping up production pipelines and logistic channels in the meantime if approval looked likely.\n\nIn theory 18 months seems viable. 8 months could be possible but unlikely. Thank you for the response. I really hope this works.", "Help the FSH Society win 5k by voting for us There is a lawyers group that is giving away $5,000 to a local charity the FSH Society is made up people with the most prevalent type of muscular dystrophy if you could vote we would appreciate it\n\nI need you to vote so we can get $5000 for the FSH Society ( a charity ) from a lawyers group\n\nGo halfway down the page to see the FSH logo press the tab view details to vote\n\n", "Buzhong YiQi herbal medicine Hey everyone, I was wondering if anyone has heard of or even taken this herbal mixture before? \n\nThis  article seems to think it could have good benefits for fshd.\n\nI would be interested to hear if anyone has found this beneficial. While interesting, I do not think this was peer-reviewed and it should not be considered as evidence of anything. They say directly that the patient was given other interventions, and we do not know what other treatments they provided. They also are all doctors at an herbal medicine hospital, so there is obvious bias.\n\nThat said, interesting work and it would be interesting to see if it is ever repeated. Thanks mate, good point about it being a biased study. \n\nI came across it whilst searching for anti inflammatory information, I have been doing an anti inflammatory diet which has been super beneficial so was just interested if anyone had any experience with any additional supplements. Looks like it is worth a try. Doubt there is any sides beyond some stomach issues. Will report back, bought some on Amazon will probably take a few months to see affects Oh cool, I was going to do the same but the only one I can find on amazon is like £50 for every 10 days.\n\nPlease do keep us posted Not sure where your from but is not this it?\n\nBu Zhong Yi Qi Wan- Strengthen Qi Pill- Revive -200ct  Yh it is that, I am from the UK and that exact one on the UK Amazon is almost £50 which is what like $60-$70? Damn US is $12 for 200ct.\nNot sure but did you have a little Tokyo or China town around you? I bet you can find there for dirt cheap. I am assuming the shipping is what kills it If there was a \"cure\" for FSHD let alone an herbal medicine I would have came across it already .. I have tried a lot of stuff including herbal medicine that is been stewed for 24 hours straight, one time drink from a guy in the countryside that has 100s of followers, months of herbal medicine from someone that helped cure a bunch of cancers\n\nhonestly the best thing is to gently exercise the body you have, not forcing any tears like muscle building / strength training because that seems to speed up the bad muscle cell growth which dies and then check in once a month on crispr cas13 news since that does not cut anything", "getting genetically tested wish me luck my mom and I are doing the spit test with Peter jones pretty nervous about it but it seems like my deletion size is mild so glad for that. I will update when I have more info.", "Advice  ", "Supplement Has anyone tried BCAAs or any supplements that have shown any benefit?  Tried bcaas but feel exhausted, maybe unrelated but strange. \n\nCannot seem to put weight or muscle no matter what I eat. \n\nAnybody had and relief with the scapular winging and spinal issues?  Scapular wings on left side, a little on right.  Have lordosis in back. It is tricky, I am doing research on this kind of thing all the time.\n\nThey did a trial with Berberine which showed potent dux4 inhibition, however it also downregulates mTOR and although the mice in the study showed increased strength, similar to the 'wild-type' mice, overall their muscles were smaller.\n\nAnother candidate is N-acetyl cysteine, I could only find one study against this compound which also helps with glutatione production. It impaired muscle recovery when participants were not allowed to rest after several days of strenuous exercise.\n\nOne I am looking into today is Quercetin which also inhibits the p38 mapk, I have not found a contrary study on this yet.\n\nI cannot help feeling the answer is already out there however inhibition of P38 seems linked to mTOR so I do not know if that is the equation, you can stop the bad stuff being expressed but that will always come with a downside. It would be very cruel if that is the case. Berberine in general is a good supplement to take as you age. It helps with insulin resistance. \nWhat has worked best for me is HGH. \nDo your own research but it is the only thing I have taken that actually seems to work, this includes a one year TRT dose that did nothing for me Btw, today's thought...\n\nI would already outlined the link between Covid and p38 mapk here:\n\n(\n\nSo I did a little digging. Ivermectin is known to have a significant effect on COVID and the pathway I have already outlined above.  \nSo that got me thinking, was there any research linking the two?  \nI found this:  \n(   \nIvermectin also potently down-regulates p38 expression.", "Couple of bits of news First is Fulcrum are doing a stage 3 trial, they will be announcing details in the next 10 weeks.\n\nThe other is that Pfizer has partnered with (\n\nBeam focuses on Gene correction and gene silencing to correct inherited diseases and Pfizer is well.... Pfizer. Could be a big injection of cash to move things forward for us all.", "Webinar: Kiera Berggren on swallowing and speech in FSHD Wednesday, February 13, 12-1pm EST Webinar: Kiera Berggren on swallowing and speech in FSHD\nWednesday, February 13, 12-1pm EST\nReigstration is still open for the upcoming live webinar with Kiera Berggren, a research speech-language pathologist (SLP) in the Department of Neurology at Virginia Commonwealth University. Berggren was previously part of the FSHD Clinical Trial Research Network (CTRN) site at the University of Utah and moved to our newest CTRN member site at VCU. She is well-versed in FSHD and presented at the 2018 FSHD Connect conference in Las Vegas. She will take your questions during the live Q&amp;A portion of the webinar.\n\nAdditional details &amp; registration can be found on our Event page. \n \n\nClick here to register for the Webinar with Kiera Berggren\n\nCopyright © 2018 FSH Society, All rights reserved.\n\n\n\n", "Acceleron Receives FDA Orphan Drug Designation for ACE-083 in Charcot-Marie-Tooth Disease | Business Wire  Blazing a new trail - Good read", "What do you all wear? Really REALLY skinny people problems I hate trying to find clothes, especially shirts. As a rule, I pretty much only wear long sleeves to minimize the degree to which I get treated like a leper, but all the shirts I find that fit my torso have sleeves that are too short....and if I find something with appropriately long sleeves, it is guaranteed to be incredibly baggy on me. Even skinny-fit shirts from brands that lean towards a slimmer market.\n\nMale, 20s. What do you guys do? I tailor all my dress shirts with the ZipSeam, I got a 15.5 neck and all the shirts that fit me collar wise are super baggy, even the extra slim fits. Good tip. I did not even know those existed  Man, I am 45 now and I am still extremely picky with what I wear. I have both shoulders fused so smaller t shirts are a bit of a hassle to put on and take off. My stomach muscles are shot, my chest muscles are shot, with my shoulders being fused my back is flat. Nobody understands why I wear button up shirts but it is the only thing I think I look slightly normal in. It is tough having a belly, no chest, no back muscles, squared off shoulders and a skinny neck. At this point I just find long sleeve or short sleeve button up shirts and stick with ones that fit decent. \n\nSpeaking of finding shirts that fit, look at classic tees website, I have not purchased yet but every review seems like they are amazing as far as fit goes.  Maybe they would have something. Yeah, it is pretty much all button ups for me as well, for the same reasons. Thanks for the tip btw", "Confusion if fshd is an autosomal disease? I am confused about it because my aunt is asymtomatic and unaffected but has fshd and is now going around saying she has MD but runs completely fine. My mother is unaffected as am I. I am about 30 and my moms 60. Alot of studies seem to suggest there might be alternate explainations for alternate dna mechanisms besides the D4Z4 array. My mom wont get genetic testing so I cant really get covered for it. Apparently i need a genetically confirmed parent. Is the genetic testing worth it? Everything I read about it seems confusing as best and it isnt clear if it is autosomal dominant. I think my grandpa had 8 repeats and his sister(great aunt) was unaffected into her 70s but had an affected son with the same number of repeats.Also curious if my kind of family is common place or rare. Anyone else have families like this?", "2021 FSHD Family Day Saturday, February 20, 2021 8:45 am – 2:10 pm Online please contact me for link\n\n Morning Session: 8:45 – 11:45 am 8:30 – 8:45 Zoom Log-In 8:45 – 9:00 Welcome/Opening Remarks Rabi Tawil, MD Director, Fields Center for FSHD &amp; Neuromuscular Research University of Rochester Medical Center\n\n 9:00 – 9:40 Promising New FSHD Therapies Focused on Blocking DUX4 Gene Scott Harper, PhD Associate Professor of Neurology Ohio State University \n\n9:40 – 10:20 Getting Ready for Upcoming Clinical Trials Rabi Tawil, MD Director, Fields Center for FSHD &amp; Neuromuscular Research University of Rochester Medical Center \n\n10:20 – 10:25 Comfort Break\n\n 10:25 – 11:05 Physical Therapy and FSHD Katy Eichinger, P.T., PhD, DPT, NCS Assistant Professor in Neurology University of Rochester Medical Center \n\n11:05 – 11:45 Tracking FSHD Disease Progression with MRI Leo Wang, MD, PhD Associate Professor of Neurology University of Washington\n\n&amp;#x200B;\n\n 11:45 – 12:00 Lunch Break \n\nThe 2021 FSHD Family Day was made possible through the generous support from the Gigliotti Family in Memory of Audrey J. Fanning, the Leiden University Medical Center, the University of Rochester Medical Center, and the FSHD Society. THANK YOU!  \n\n 2021 FSHD Family Day Saturday, February 20, 2021 8:45 am – 2:10 pm Afternoon Session:\n\n 12:00 pm – 2:10 pm\n\n 12:00 – 12:40 Patient Advocate Lexi Pappas \n\n12:40 – 1:20 FSHD Society Community Updates Beth Johnston Chief Community Engagement Officer FSHD Society\n\n 1:20 – 1:25 Comfort Break \n\n1:25 – 2:10 Question and Answer Session Patient Panel Speaker(s): Shawn Welch Lexi Pappas Presenter Panel Speakers(s): Katy Eichinger Scott Harper Beth Johnston Rabi Tawil Leo Wang", "Something interesting  Early onset markers for fshd severity", "Important meeting more news to come  Awesome. Kudos to Lexi!", "I am convinced I have FSHD  Try arms out Infront with a picture from the back. How good are you at these?\nWhistling,\nBlowing up a balloon,\nSit-ups,\nPull-ups,\nSlowly raising your arms in front of you and then above your head I do not see concave chest at xyphoid process. Concur with question about whistling and balloons.  Do shoulder blades stick out?  If you have all of these get your GP or neurologist to order genetic test I feel as though this was just an excuse to post photos… you cannot diagnose based on photos Wait so do I have concave chest? You need a genetic diagnosis and to be seen by a specialist in neuromuscular diseases if you want to be diagnosed with it. It also does not always have obvious symptoms or signs so a picture will not do anything lol..", "You saw it here first ", "dux4 vs pax 7 (  \n\nFor several years, DUX4 has enjoyed center stage in the yet-unfolding story of facioscapulohumeral muscular dystrophy (FSHD). DUX4 was first identified in 19991, but only in the past five to 10 years have scientists reached consensus about the full underlying genetics of FSHD. Since then, researchers have worked tirelessly to understand how DUX4 causes muscle toxicity and cell death2, and how it prevents muscle regeneration.\n\nRecently, however, a Snow White-like story is unfolding, and scientists are starting to pay attention. While no one questions the foundational role of DUX4 in the pathogenesis of FSHD, three separate groups of researchers are now also calling attention to a protein called PAX7 and its close cousin, PAX3. It seems that DUX4 is like the evil, jealous stepmother who banished and put to sleep the “fairest one of all”—the kindhearted princess, PAX7.\n\nBoth DUX4 and PAX7/3 are members of a family of proteins known as “transcription factors.” Transcription factors bind DNA to regulate expression of genes that are important in embryonic development and in differentiation of cells into specific tissues. PAX7 and PAX3 are key regulators of the formation of skeletal muscle, though PAX3 generally operates during embryonic development while PAX7 generally operates later in development and in adult muscle regeneration3. In our Snow White story, PAX7 is the princess that everyone wants to see prevail.\n\nAbout 10 years ago, Darko Bosnakovski, DVM PhD, and Michael Kyba, PhD, then at the University of Texas Southwestern Medical Center, discovered that in a cell culture model of FSHD, the presence of DUX4, the evil queen, causes the function of PAX7 to be suppressed. When researchers manipulated the cells to artificially increase expression of PAX7, the FSHD cells survived more robustly. This indicated that the function of PAX7 may somehow counter the deleterious effects of DUX44.\n\nLast year, these studies were resurrected and greatly expanded upon. A team at the University of Washington, led by Daniel Miller, MD PhD, found that in early development, FSHD stem cells have normal expression of both PAX7 and PAX3 as they differentiate into muscle cells, consistent with the observation that most children with FSHD have normal muscle development and growth. Interestingly though, DUX4 expression was not observed at the predicted rates in individual cells also expressing PAX7 or PAX3. This indicates that in early development, conditions promoting PAX7/3 expression may counter DUX4 expression, and that expression of DUX4 and PAX7/3 may be mutually exclusive5.\n\nIn parallel, Christopher Banerji, PhD, and Peter Zammit, PhD, at King’s College London reanalyzed several gene expression datasets previously generated from muscle biopsies from patients affected by FSHD. They found that the *suppression* of PAX7-regulated genes is, in many instances, actually a stronger and more reliable biomarker of FSHD than the *expression* of DUX4-regulated genes.\n\nThe network of genes regulated by PAX7 and suppressed in FSHD could also explain many FSHD phenotypes, including less effective antioxidant properties, cell death, inability to regenerate muscle, and the expression of DUX4 itself. These researchers also manipulated healthy cells to co-express both DUX4 and PAX7, and found that they mutually inhibited each other’s ability to activate their target genes6.\n\nHowever, exactly how DUX4 and PAX7 interact remains to be deciphered. It seems that the relationship between the two is more complex than a simple, direct competition model would suggest6. Some non-mutually exclusive hypotheses that have been put forth include 1) DUX4 and PAX7 compete to bind DNA at a few key toxicity-related sites, and/or 2) DUX4 and PAX7 compete to interact with a third, yet-unknown protein necessary for their activity, and/or 3) DUX4 may interfere with the DNA-binding capabilities of PAX7.\n\nI hope that at this point you can appreciate how DUX4 and PAX7 seem to have an antagonistic, seesaw-like relationship. As Drs. Banerji and Zammit explain, it appears that DUX4 operates in two ways to cause FSHD: 1) by direct activation of certain genes that results in muscle cell death (the evil queen is simply toxic), and 2) by suppressing the work of PAX7, such as in muscle regeneration (the evil queen puts Snow White to sleep). In theory, if Snow White were awake, she may help counter the toxic effects of the evil queen.\n\nIt is clear that scientists are just starting to get to know PAX7, our Snow White, and what role she plays in the FSHD story. And understanding PAX7 biology is valuable because it may shed light on additional therapeutic opportunities. We will continue to watch this Snow White and the evil queen storyline unfold with great interest, as it will inevitably lead to an even greater understanding of FSHD pathogenesis, and may help contribute to a more “happily ever after” for FSHD sufferers.\n\n**Footnotes**\n\n1. Gabriels J et al. Nucleotide sequence of the partially deleted D4Z4 locus in a patient with FSHD identifies a putative gene within each 3.3 kb element. *Gene.*1999;236(1): 25-32. (\n2. Lemmers, RJLF et al. A unifying genetic model for facioscapulohumeral muscular dystrophy. *Science.*2010: 1189044. (\n3. Buckingham, Margaret, and Frederic Relaix. PAX3 and PAX7 as upstream regulators of myogenesis. *Seminars in Cell &amp; Developmental Biology*. Vol. 44. Academic Press, 2015. (\n4. Bosnakovski, D et al. An isogenetic myoblast expression screen identifies DUX4‐mediated FSHD‐associated molecular pathologies. *The EMBO Journal.*2008;27(20):2766-2779. (\n5. Haynes, P et al. Expression patterns of FSHD-causing DUX4 and myogenic transcription factors PAX3 and PAX7 are spatially distinct in differentiating human stem cell cultures. *Skeletal Muscle.* 2017;7(1): 13. (\n6. Banerji, CRS et al. PAX7 target genes are globally repressed in facioscapulohumeral muscular dystrophy skeletal muscle. *Nature Communications.* 2017;8(1):2152. (\n7. Bosnakovski, D et al. The DUX4 homeodomains mediate inhibition of myogenesis and are functionally exchangeable with the PAX7 homeodomain. *J Cell Sci.*2017: jcs-205427. ( ", "24yo Australian Male looking for somebody who understands FSHD and similar myopathies Hi there anybody who is reading this — over the last 5 years I have been noticing progressive weakness in my shoulders (talking on the phone, brushing teeth), hips (walking up hills, stairs), abdomen (situps, posture difficulties) and my face as well (everybody thinks I am depressed or angry all the time, I cannot smile properly and I look stoned all of the time.\n\nI have really run the gauntlet in terms of medical specialists and common diseases over the years. First it was things like iron deficiency, hypothyroidism, depression etc, but nothing ever fit. I was feeling very fatigued and had a fair amount of back pain, so I went to a rheumatologist who cleared me of any joint or bone disease.\n\nI have seen a neurologist now, but I was so distressed after waiting 8months between referral and my appointment, and my life had basically fallen apart (I have very little social support), that by the time I saw her I was in extremis psychologically and she brushed me off as psychosomatic/functional.\n\nI suppose I am wondering:\nIs anybody here from Australia? Does anybody know of any doctors of organizations here I could contact who are well-versed in FSHD and similar scapuloperoneal diseases?\n\nThank you for reading (if you did). Ahh well ive yet to find a specialist that actually knows what they are on about without palming me off again and again but I just found out about an app built by mdaustralia.  the app is called \"the loop\"  \nI am apart of an excerise group that moderates fshd effects via strength based training. This is in Canberra and its filled with multiple types of people with MD mostly fshd and its good to see and talk to people who have the same condition group is about 20 people that come and go mostly between 40 and 60. Im an outlier there at 26. Ive only been 2x so far but that is where im going to make my conections and the people are nice. \n\nWhat im trying to do with this group is not feel alone in this never ending battle. Im educating myself by learning excersises that i can do at home/ or gym when they open again. Im looking at doing the same with aquatics too. Starting in 2 weeks. Sorry about the info dump im getting through this too :) hope this assists you. Just yesterday through a referal by a neuro i visited this place  and although the people seemed useless they have refered me to a dietition/ ndis dedicated social workers/ mental health workers which has been the biggest step ive taken so far..  fire more questions at me if you want this community is still very small. You are in luck! One of the worlds leading FSHD research centres is in Aus.  and they are wonderful to talk to through their Facebook page. Fast to respond and will happily answer all your questions!\n\nI have it as well.  Every female in my entire extended family tested positive. You need to seriously consider children because it is very likely it will be handed down. Hi! I am from the states so I am not familiar with any Australian specialists, but I do know the best ways to find out if you do have FSHD or not. First, there is something you can do on your own. Only about 5% of FSHD cases are from genetic mutations (basically you got it all on your own), the rest are genetic. So odds are, if you have FSHD, one of your parents do as well. If you are still close with your family, talk to your parents to see if either of them have experienced weakness or if anyone in their families did either. If that pathway does not work, the only sure way to diagnose FSH is with genetic testing, so you could express interest in that if you have enough clinical symptoms, which to me it sounds like you probably do.\n\nIf you do have FSHD, do not worry too much! It does suck sometimes, but it is manageable. It looks like they will come out with a treatment within the next 5 years, so there is still hope. There are a ton of great communities on Facebook in the meantime to share tips and stories, and just vent if you need to. Good luck! I share my quick story in case it helps you. \n\nI am based in the US.\n\nI noticed a pretty sharp decline in strength 2 years ago. My back was also in a lot of pain as well as a lot of lower leg cramps / muscle spasms.....in my forearms as well. I started out going to a spine specialist and doing physical therapy. \n\nSpine specialist said there is nothing wrong with my back and referred me to a neurologist. \n\nmore then a year later I am still with a 2nd set of neurologist and I believe we are close to a diagnosis as I just had a muscle biopsy operation done and I am waiting to hear back with the test results. \n\nThe nuerologist do specific test to see if your issues are either autoimmune or genetic. Here is the list of test that they have done on me:\n\n1. EMG - nerve conduction (electrical signals in various parts of your body to see if your nerves are responding\n2. EMG - muscle contraction (stick needles in your muscles to listen to how your muscles are contracting\n3. various blood panels\n\nI would expect your neurologist to start with blood panels as a first step. You should ask them to do this if you have not. \n\nall this being said, you are on the right track with going to a neurologist. This is the type of doctor that will arrive at an FSHD diagnosis.......it sounds like you might need to find a better neurologist though. \n\nI hope this helps. Hit me up if you have questions. Are your issues asymmetric?  Did you do genetic testing?  Is your CK elevated?  I had what seemed like FSHD without any facial features.   FSHD has been ruled out twice.  We tested twice and about a decade apart since it was the best fit but it was still negative.  Working my geneticist and we are trying to identify some new form of MD. My issues are pretty symmetrical. I decided to hold off on the genetic test for now. Instead I went straight to a muscle biopsy...I just happened to have recieved my results today. They seem to be predominantly pointing to IBM (inclusion body myositis) first time I have heard of it. Still no treatment for it. Not great that you have a disease but great that you have answers.  Even if there is no treatment doctors underestimate how important a diagnosis is for various reasons. True. I am glad to have an answer as well :)", "Another article to read \n Very interesting. It looks like the access is restricted, do you know if there is a PDF available? Yes", "Good news ", "The fulcrum trial failed   Bit of a strange post to make, also an oddly negative slant on the news from Fiercebiotech, all wrapped up in a weird google link.\n\nHere is a more direct link:\n\n(\n\n&amp;#x200B;\n\nHere is what I said in the other post that already existed when you posted this:\n\n&amp;#x200B;\n\nThe way I understand it is:\r  \n\r  \nThey measured DUX4 reduction prior to the trials in vitro so they knew it would have some effect\r  \n\r  \nThe trial showed the results of DUX4 reduction, improved (statistically significant) metrics... eg: measurable results\r  \n\r  \nThe 'primary endpoint' of actually measuring a reduction in the muscle tissue failed but this is down to the way they are trying to measure. Not only is it difficult to highlight the biomarkers but they are so spaced out and happen so rarely that it is like finding a needle in a haystack.\r  \n\r  \nYou could take two biopsies, from the same muscle, at the same time and have two completely different results depending on whether you hit a point with active DUX4 expression.\r  \n\r  \nThey showed the results of DUX4 reduction (secondary endpoints) without being able to show a slide saying 'here is before and here is less after'\r  \n\r  \nThe failure was in the measuring, not the drug or it is effects.\r  \n\r  \nWhat I am now curious to see is where things go from here. Are they going to liaise with the FDA and try to go straight to market, having the 'phase 3' after it is available on prescription or are the FDA going to request further testing before approval?\r  \n\r  \nIt certainly shows a measurable benefit which is high on the FDA's list, so who knows?! It is a waiting game and we are (reluctantly) all good at that.\r  \n\r  \nPotentially this could be available by the end of next year which is a great relief to those of us who cannot afford to wait. I keep my fingers crossed for an even speedier approval process.\r  \n\r  \nNice to have a bit of good news though, is not it? The summary that was published strikes me as exactly the kind of information that tends to be put in a press release....mostly spin.\n\nAside from the lack of observed genetic effects, the very small improvement in function that they claim to have observed after 48 weeks does not pass the smell test. Most FSH patients go through periods of greater than 48 weeks with no change whatsoever in symptoms, interspersed with periods of muscle deterioration. The claim that study participants \"reported feeling better\" is scientifically laughable. The metric of upper body range of motion that they used also is so broad and subject to so many other variables that the very small improvement that they report does not strike me as anything but noise.\n\nThe way I read it, they are trying to spin it as \"it works, we swear, but we do not have the evidence yet\" I watched the full presentation of the results. Pretty amazing. No “spin” as some would argue from just reading a PR. Sure the one biomarker they aimed for did not correlate as thought, but the fact that fat infiltration was lowered and range of motion and strength was improved seems like a solid step forward and definitely worth taking. Nothing “laughable” about it. As patients we know there are good days and bad days but if overall you feel better than your body must be doing better and that is what we need. Due to fast track designation and the proven safety profile I feel confident this drug will be available sooner than most. I concur.\n\nWe should absolutely maintain a critical view with regards to possible new advances in treatment for FSHD, but ignoring the positive secondary endpoint data from a \"randomized, double-blind, placebo-controlled\" trial such as this would be ridiculously counterproductive for us.\n\nI look forward to how this pans out and how the data might also benefit other similar teams working towards their own trials. Do not forget the measured reduction in fat infiltration and increased strength (12-27%) in two key muscles.\n\nWhat I would not give for a 12% improvement per year, let alone 27%.\n\nIt is good to not get your hopes up to avoid disappointment but the fact they are still pushing ahead despite failing the primary endpoint speaks to the strength of results in other areas.\n\nIt is definitely not nothing and I am sure many of us are at the stage where we will take **any** improvement.\n\nImagine a crowd of 1000 people, that is a lot of people... One of those people is wearing red socks.\n\nNow imagine you get to shine a light on one of them, a random person, your chances of selecting the right person is slim. Even if you DO hit the right person you have difficulty untying their shoes to see if the socks are the right colour so maybe you still miss them even though you were lucky in finding them.\n\nThat is why the secondary endpoints are more important, to actually show real world benefits in patients obviously holds a lot of sway otherwise they would be a lot more downbeat about the results and there would be no mention of discussions with regulatory bodies.\n\nI agree FSHD society's post is a bit 'spinny' but there are definitely positives worth celebrating.", "Big money  What is the significance of this to FSHD? Fulcrum Therapeutics putting the money towards FTX 1821 a P38 inhibitor and a possible cure for FSH Nice! Thanks bud.", "To all of you with FSHD that are feels bad, let me tell you my story... Hi,\n\nI am Chris, 31M, Poland\n\nIt all started when I was 16. My left hand could not get on position above my head. Not one year pass and the right hand joins. Than I was hospitalized for 3 days for tests, after that the judgment day has came. FSHD, you will never be able to be strong, you will be fatigued, maybe you will need wheelchair...\n\nI was back than a little fury closed in a flesh. I was sword fighting, climbing, martial arts, thinking about joining the army (my family has 7th generation of military tradition, I am the only son who cannot ever be considered of joining, just imagine how my father felt about this...)\n\nAfter that day the fury was unleashed. In my country medicine is at lower level than average European standards, back than was even worse. So I did not get any specific details about disease, did not get any psychological help. Everyone got young vigorous teenage in it is puberty alone with this...\n\nSo my dumb little self thought, if my life will suck thank I have no regrets, no holding back.\n\nAlcohol was my poison... I was found drunk (almost to the border line) many, too many times...\n\nOf course with progress of my drinking almost all of friends and family turn away from me which makes me even more bitter, I was on the verge of darkness.\n\nIt took me 14 years to understand what I am doing with my life. I am so grateful that I am still alive.\n\nI was not able to kill myself with drinking and did not have the guts to something even more stupid. \n\nRight now I am sober over a year, I have got the pack of very close friend and has support from many people. I do not give a slightest fuck about anyone who thinks of me as of \"not a man\". They know nothing about hell that I went through and walked back alive... It made me stronger than some of healthy people. I walked this year 10km straight in 2'20\" min (which I am damn proud of)\n\nBut looking back on my past If I would be consulted with psychologist, and given more information, I would be prepared and should not have to walk through all of this, and I would lost 10 years of my life for sorrow. \n\nSo if you consider what to do after diagnosis, please, do not do my mistakes. Consult with specialist. Start reading everything about (to be prepared for what can come at you), eat healthy (cliche ;P), and last but not least, do not ever, EVER, for a slightest moment think of yourself that you are a worse man/women. You are who you are and no one has a right to tell otherwise.\n\nBe safe all my brothers ans sisters! If you need any information, help, or just want to talk with someone with FSHD, do not be a stranger. In my mind fate bound as all with the similar genes, we are not a strangers ;) \nIf you or someone you know is contemplating suicide, please reach out. You can find help at a National Suicide Prevention Lifeline\n\nUSA: 18002738255\nUS Crisis textline: 741741 text HOME\n\nUnited Kingdom: 116 123\n\nTrans Lifeline (877-565-8860)\n\nOthers: \n\n I am as far from that thinking s it is possible, thank you bot ;) Great story man. Good work and keep it up. Much like your 10 km, keep on walking. Thanks for sharing Chris.\n\nI did not get my diagnosis till 40. I had always complained to my doctor that I was too skinny, could not put on muscle, joined a gym in my mid 20s, worked really hard and got nothing back. I thought 'surely it should not be this difficult'.\n\nMy doctor just said 'oh you are young, you are lucky to be 'lithe', just eat some more chocolate.'\n\nI was pretty active until I could not continue any more, I was always going out on the bike every day, it was hard work but I did it.\n\nWhen I did get a diagnosis everything suddenly made sense. I had always known 'something' was wrong but I did not know what. Even when I was very young (5?) I knew that I found any exercise very difficult and it was frustrating to see everyone else doing well when I was struggling.\n\nThe reason I reply is because of something you said, do not think of yourself as a worse man/woman.\n\nI never felt that I grew up into 'being a man'. It is tough when you fail at all things 'manly' and I had struggled with that all my life. I never felt like a man.\n\nWhen I got my diagnosis I forgave myself, it was not me being weak, I was doing the best I could but I was dealt an impossible hand of cards that could not win.\n\nI think back to that little boy, at the back of the countryside race, struggling through the mud and rain while all the other children had run ahead... to that 25 year old trying their absolute hardest in the gym... to the guy who was exhausted but still riding that bike down the road... and I gave myself some credit.\n\nMy physicality affected who I was, I was incredibly anxious and could not really keep eye contact with some people because I was so uncomfortable in my skin and it showed.\n\nSince I got my diagnosis I accept who I am and I own it. My personality has changed massively and how I feel about myself has also improved. I joke with people 'trust me to get the disease where you look like an anorexic drug addict!'\n\n;)\n\nI just wanted to say kudos to you for finding your fight and keep on going. Our lives are harder than most and it takes special people to carry on in spite of that.\n\nKeep fighting and let us hope that treatments will be with us soon. Thank you very much. I will surely do ;) Thank you very much for your story. This days the only thing I am really ashamed of is that it took me so long to embrace myself rather than hate myself. What you have said about childhood, It is becoming clearer to me right now that the signs of my illness were everywhere, I was just blind and oblivious... Keep fighting too! All the best! It is a hell of a diagnosis, that is for sure...\n\n\"Yeah you know all those problems you are having? Well it is only going to get worse and there is nothing you can do about it. There is no treatment, no cure and we cannot even tell you how it is going to go. You may end up in a wheelchair.\"\n\nIn a way I am glad I did not get a diagnosis when I was young, like you were. I am not sure I would have handled it very well. It took me at least a couple of years to come to terms with things properly and that was at the age of 40.\n\nAgain, credit to you for getting to the other side. Do a little every day, whatever exercise  you are comfortable with and keep it going.\n\nI wish more strength for us all to keep fighting\n\n:)", "Fsh Society Who we are What we do   \n\nFacioscapulohumeral Muscular Dystrophy (FSHD)… the most prevalent form of Muscular Dystrophy, is a devastating, muscle-wasting disease and the FSH Society, is a 501(c)(3) charity dedicated to solving FSHD. The FSH Society has led the way in the fight against FSHD thanks almost entirely to generous donations from the society’s members and those who want to make a difference\n\nWe are focused on the two components that will propel us to success. First, we are directing our funding to research and infrastructure that will greatly speed up the development of treatments. And second, we are enlarging and activating our community, and empowering our stakeholders to raise awareness, engage, and advocate for the resources we require.\n\nMany of our seed grants and starter projects have generated data and insights that help with screening for FSHD, improve genetic testing, and ultimately improve the speed and accuracy of diagnosis.\n\nFSH Society seed grants launched the international effort that culminated in the discovery of the complex genetic mechanism by which D4Z4 contractions on chromosome 4 result in expression of the DUX4 gene in FSHD Type 1. FSH Society grants also contributed to the discovery of SMCHD1’s role in FSHD Type 2 and as a disease modifier in FSHD Type 1.\n\nIn therapy/treatment, we launched two groundbreaking nutritional research projects covering creatine, MRI/MRS, and better biomarkers and techniques to measure clinical trial outcomes and endpoints.\n\nThe Society helped advise, network, and consult with clinicians, patients, and Wyeth Pharmaceuticals to bring about the clinical trial of the myostatin inhibitor myo-029.\n\nThe Society met with Acceleron Pharma to make the case for FSHD as a candidate disease for their myostatin inhibitor ace-031.\n\nIn 2014, the FSH Society worked with aTyr Pharma to recruit volunteers for biomarker studies in association with aTyr’s launch of a Phase I clinical trial of a novel therapeutic compound for FSHD.\n\nIn 2016, the FSH Society helped launch the nationwide FSHD Clinical Trial Research Network and collaborated with Acceleron Pharma to convene focus groups around the ACE-083 clinical trial.\n\nWith FSH research The Hutchinson Cancer Center neurologist and molecular geneticist Dr. Stephen Tapscott broke a decades-long stalemate with a common form of muscular dystrophy when they identified the mechanisms that cause it. This opens the door for future treatments for the disease and, potentially, some cancers. Tapscott’s team first showed that it took two genetic changes on chromosome 4 to cause FSHD. Later, they determined that a certain protein called DUX4 —normally found in germ cells that give rise to sperm in males and egg development in females—was abnormally active in muscle cells, causing muscle mayhem. Tapscott’s research has the potential to lead to a vaccine to treat cancer.\n\nShawn Welch - I have FSH, I volunteer, I donate to research, muscle, blood and time\n\n  (   ( ", "Do not be fooled is the money going to fund a cure   When you decide to support a cause you care about, you want your donation to count. Doing some research and planning your giving can help ensure your donations get where they will do good.\n\nthe data is clear about what nonprofits are facing right now. which was generally consistent with other surveys of nonprofits in recent months, was sobering, to say the least. Almost 90 percent of organizations said the pandemic was having a moderate or significant negative impact on them\n\nBefore you give to a society or an association, review their IRS 990 forms Have they given themselves bonuses and or increase in pay while cutting services to the parties they serve? Who does the most work the volunteers or the employees of the nonprofit?? Have they closed and moved into a mailbox?? Friends of FSH: (\n\n* Executive compensation: $0\n* Contributions: $622,388 \n\nFSHD Society: (\n\n* Executive compensation $287,615 \n* Contributions: $2,344,902\n\n&amp;#x200B;\n\nMDA is not solely focused on FSH. Here is their info:\n\nMuscular Dystrophy Association: (\n\n* Executive compensation: $1,262,752 \n* Contributions: $103,881,886 \n\nCharity Navigator is a great site to evaluate a charities giving.  Here is the 2018 data for MDA.\n\n\n\n\nIncome Statement\n    \n(FYE 12/2018)\nREVENUE\t \nContributions\t \n   Contributions, Gifts &amp; Grants\t$37,265,502\n   Federated Campaigns\t$268,675\n   Membership Dues\t$0\n   Fundraising Events\t$66,043,368\n   Related Organizations\t$0\n   Government Grants\t$304,341\nTotal Contributions\t$103,881,886\n   Program Service Revenue\t$0\nTotal Primary Revenue\t$103,881,886\n   Other Revenue\t$6,775,667\nTOTAL REVENUE\t$110,657,553\n \t \nEXPENSES (Adjusted)\t \n   Program Expenses\t$77,180,725\n   Administrative Expenses\t$13,919,454\n   Fundraising Expenses\t$16,696,853\nTOTAL FUNCTIONAL EXPENSES\t$107,797,032\n \t \nPayments to Affiliates\t$0\nExcess (or Deficit) for the year\t$2,860,521\n \t \nNet Assets\t$9,946,503 What is \"executive compensation\"? Is this what one person makes our the combined salaries of the whole organisation? This is usually the top person.", "Having alot of issues and wanting to see a doctor! I was denied medical assistance today so I made a gofund me. Thanks in advance! ", "Are/were you going to a psychotherapy because of FSHD? Lately I have got a lot of self worth issues and was wondering if I should try therapy... You should try therapy. Speak to a psychologist or a hotline on the matter.  What country are you in ? maybe not a psychiatrist i think they are for more serious mental problems. Not sure\nSpeaking as a recently diagnosed fshd 4months ago age 26.\nI will be seeing a psychologist for depression corelated or not its something i cant do anything about all by myself. HOWEVER i can straight up tell you, you are worthit whatever condition you have ! This condition forces you to be unique and i see that as a positive outcome, however much it makes life challenging. Shoot me a msg if things are too hard for yourself :) It is completely understandable, especially I feel, as a guy.\n\nI was a skinny kid, then a skinny adult with lots of self image issues. I gave myself a hard time for not being 'normal' and no matter what I did I could not gain muscle.\n\nI did the best I could for many years and it was not until I had a back issue that I went to physiotherapy and took my top off that they went 'well that is not right' and I said 'I know!'\n\nIt was not long after that, that I got an official diagnosis with a blood test.\n\nIf anything it really helped me getting that diagnosis. Sure it was awful to be told there is no treatment and it is only going to get worse, but beyond that it allowed me to cut myself some slack.\n\nI would carried on all those years feeling terrible about myself, trying my best to hide my body from the world with lots of layers of clothing even in summer. I would get so frustrated not being able to do certain things and not considering myself 'a man'.\n\nThat had a massive effect on how I conducted myself with people, I was so insecure, did not want to make eye contact, did not want to be seen.\n\nWhen I finally understood that it was not my fault, that I would been dealt a really bad hand of cards and that I would done my best, I had a lot of empathy for the younger me.\n\nIt allowed me, finally, to accept who and what I am.\n\nNow I hold my head high and I just tell people, hey can you help me with this, I have a muscular condition.\n\nThe only choice is acceptance otherwise it is going to be tough. The road to acceptance is not easy but worth the effort.\n\nOne of my core mantras is 'I am enough'. You are not defined by your physicality, it just makes things more difficult. If you are open and honest with yourself others relate to that energy.\n\nYou can only be you and you are enough.\n\nStay strong. That means much to me, thanks a lot. I will definitely send you a message sooner or later, having a FSHD-Friend would be cool, now that I think about it :)\n\n(To answer the question for now: Germany) Thanks a lot for sharing this. I almost cannot believe how kind some online strangers can be.\n\nI am sorry for the shame you felt, you probably had it worse than I right now. Thought, that makes me even more hopefully that I can achieving acceptance one day. Thanks again, it really means a lot to me. No worries, I basically slipped through a lot of nets and I did not get a diagnosis until I was 40, needless to say it was a revelation.\n\nIt is important to remember there is a lot of people working hard on finding a 'cure' and there is lots of different approaches. The FSH society is set on having a treatment to market by 2025. That may slip but hey, it may not and they achieve their goal!\n\nThere is hope that one day we will all have 'normal' bodies. I joke with people that it is a bit shit that I have got the condition that makes you look like an anorexic drug addict ;)\n\nFeel free to drop me a message if you ever feel the need. Thanks again! What is the best news source for FSHD related news? (\n\n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n(\n\n&amp;#x200B;\n\nSome are not strictly related to FSH, but MD in general. Others are not updated often but those are my links for keeping up with what is going on.\n\nLosmapimod is the main trial to follow at the moment. Very promising in the early stages and already tested on humans with a good safety profile.", "Sad sad news ", "Does this resemble fshd?  Raise your arms forward and take another picture. \n\nAs is, it just looks like there is a slight muscle imbalance causing very slight winging (I guess that could just be the lighting). Also what are your main concerns? Are you experiencing functional impairment? Dude, you keep asking this so much that I think you are trying to convince yourself. I am pretty sure someone has told you before to get the genetic test done. Coming to the internet is not the right place, see a doctor and get the test.", "Do your muscles react badly to certain medications? Whenever I take Benadryl, benzos, or muscle relaxants, my muscles get super floppy to the point where I cannot walk at all. Now obviously some muscle weakness is expected with these kinds of medications, but the effect is so extreme for me that it was actually one of the first indicators I had that MD. Does anyone else have similar experiences?", "Neuromuscular Electrical Stimulation \n\nHas anyone ever tried something like this?  If so what was your experience?  According to the study, the small number of participants had good results. Would be interested to hear about this as well", "FSHD linked to Covid19 Who woulda thought it!\n\nLong story short, covid researchers have shown a lot of the bad effects of covid are caused by activation of p38 so they are looking for a way to stop that happening.\n\n(\n\nYou know what else p38 does? Triggers DUX4 and causes FSHD.\n\nThere is a lot more money for Covid research than there is for FSH and if they can find a suitable treatment with lightning fast approval, like the vaccines, then there could be something approved for use that we could take as a treatment for FSHD.\n\nIt is not much but it is a little ray of light and I will take all I can get! *\"The authors conclude that “safe and well tolerated p38 MAPK inhibitors that are already in clinical development could be readily repurposed in randomized, controlled trials enrolling patients at risk for serious COVID-19 complications.”*  \n*Dr. Kevin Grimes and colleagues at SPARK are now gearing up to begin clinical trials of compounds to treat COVID-10 along this pathway.\"* Wow. Nice research. How did you find this connection? I think this is where the losmapimod trails for fshd came out of. It was covid leftovers. Look it up. I could be wrong. Any updates on this? I find this very interesting Sadly not, they chose the 'vaccine' route rather than treatments. Anything other than vaccines must be squashed at any cost. Btw, I did a little digging. Ivermectin is known to have a significant effect on COVID and the pathway I have already outlined above.\n\nSo that got me thinking, was there any research linking the two?\n\nI found this:\n\n(\n\nIvermectin also potently down-regulates p38 expression."]