["I think I might have this but nobody believes me Hello I believe Iight have his condition but nobody believes me not the doctor or endo or parents but my face is at least 2-3x larger than before and I have a lot of the symptoms of this condition. Please there has to be a way I can find our for sure!! I need somebody to believe me. Any help is welcomed! Request lab work. That is the true indicator for it. See what your IGF-1 Levels are and go from there. I see. I did those 6 months ago and they came back normal. My doc says I do not have acromegaly. Maybe it is puffiness from being control. But then IDK some of these symptoms are not normal  There are lots of other endocrine disorders as well (not suggesting you have something) but you may want to explore those avenues. Ok. That is good to know. Thank you so much! just the face?\n\nI also have symptoms in the face, how old are you? I am 26 yrs old. I doubt it is acro but still high T could cause changes I am guessing I have to get tested, I have rough facial features, thick lips, large nose, bimaxilar protrusion, thick skin, etc.\n\nbut nothing in the hands, so I also do not believe I have it. are you a mouth breather? Not sure who you are talking to but yes lol. Thought Idk how you knew that XD Mouth breathing is the no 1 cause for long faces.\n\n Wooooowww I did not know that thanks a million!! Also is it reversible? what is strange is that it grew at this age, that is not normal, it is dificult to reverse, probably cirugically, but you may want to look into mewing, although I only discovered that yesterday, it works for children but do not know for adults. Hm, interesting. It is pretty much the jaw area that had this effect. It is still boggles my mind. But thank you so much for the videos and suggestions! You are the best! Ah I see. I really pray you do not have anything at all and that you are normal. I never prayed so hard in my life when I suspected and then my prayer worked because all my results came back normal. Dont take pictures from close range it makes your face distorted. Take it like 2m away... That is a good idea. I should invest in a selfie stick. I was like no wonder That is a good idea. I should invest in a selfie stick. I was like no wonder", "Extremely worried i have acromegaly Hii. 22m ,i have large hand and feet and big head . though i am 22 i look like i am in my 30s . i am worried if i have acromegaly . Can anyone help with it. I am sorry that you are going through this. It is always stressful when we think there is a chance we have a very serious condition and it is always good to catch acromegaly early. However, just having a big head, hands, and feet, especially at such a young age, may not be acromegaly.\n\nI did notice that your other post indicates that you are a med student. I am truly not trying to minimize your concern, but I do wonder if you might have medical student syndrome, after studying up on acromegaly. \n\nThe only real way to know for sure would be to get evaluated by a doctor and maybe get some blood tests. \n\nI hope everything works out. Thank you for your valuable suggestions ..every now and then i have been stressed about it .. i will see a doctor and be clear about it..", "GH levels are normal? But my symptoms still persist? I do not understand and I do not know what to do. I just got back from the endocrinologist and he said that my GH levels are normal which realized surprised me because the blood test before determined that my GH and IGF was high. He also said that I have a small abnormality in my MRI but it is not currently significant because of the recent glucose suppression test results. (Sorry I do not have the numbers he does not give out paper copies of results and I cannot access electronically)\n\nSo the endo says he will see me in 3 months to check for prediabetes, he thinks there is a high likelihood that I have prediabetes. He also said that I do not have acromegaly based on the results. However, all of my symptoms still persist?? I honestly do not understand how it came back normal, because I am still getting an increasing number of lumps in my breasts (so there should be at least some GH related to that I would thing?), but my orthodontist confirmed that my jaw is still growing. I also still have insomnia, my acne has gotten really bad, I have severe fatigue, high cholesterol, excessive sweating, foot growth, mood swings, and a course face.\n\nI do not want to abandon this diagnosis, because it just does not make sense. What do I do at this point? Who can I go to instead? I am really discouraged that everything is coming to a haunt. Where do I go from here? How can I get someone to keep looking into the diagnosis? If possible, it might help put your mind at ease to get a second opinion. Not to say that your endo is wrong, but it might be worth going to that effort to feel more confident in the results. Your IGF  1 levels can be elevated,creating symptoms Have they checked your thyroid, liver and kidneys? IGF 1 is a very easy hormone to convert into and all three organs have the capability to do it including the thyroid.   Also your condition could possibly be genetic based as mine is..    best if luck to you. 21 years they suspect with me.  I understand 14 years and I am still not diagnosed and my gh was normal. I completely understand how you feel and what you are struggling with.     Hang in their and try and find a support group. Did you by any chance have covid between the GH IGF tests and the glucose tolerance test (GTT))", "Question for you beautiful ladies.before and after DX already DX with acromegaly So I know those of us with acromegaly have trouble with menstrating, and are not always regular. \nWere any one of you lovely ladies able to have children? Before or after DX? My husband and I have been trying for basically 10+ years. I have had a couple chemical pregnancies, and one miscarriage prior to surgery. (The miscarriage. The CP’s were after.)\n\nMy endocrinologist is also a reproduction Endocrinologist, as well. She has done several blood tests and the HSG(? Where they insert dye and check if your tubes are blocked.) They are 100% clear. Not even a little blockage. I get my cycle every once in awhile. Last year: May, September. I also had one in January. I also know I ovulate at those times, as seen on ultrasound done by her and I feel it in my lower abdomen/ ovaries.\n\nBlood tests: LH, FSH, prolactin etc are normal. Not in any way going through early menopause. (I am 33. Tumor found July 2004 right before 18th birthday - August. DX Acromegaly at 25 in sept 2011. Saw neurosurgeon beginning of Dec 2011. Surgery - 2.22.12 (supposed to be Jan 9th. Pushed back to feb 8th. Surgeon got sick, so changed to 22nd.)) I am on 90ML (mg?) of somatuline Depot injection every 12 weeks, if that helps.\n\nHave any of you beautiful ladies had successful pregnancies and births? \n\nMy endocrinologist also wants me to be under her care when I get pregnant, until she can release me to my OB (when I am pregnant. I also have to let her know ASAP when I get pregnant/ positive test, which will be followed up with a blood test and qualative blood test if positive.) Does anyone know why I would need to be under her care during early pregnancy? I do not have any advice I can offer I am afraid. Just wanted to send you some positive vibes &amp; a hug xx Hey :) Personally, I do not have children and never tried, so I cannot help you there. But in the acromegaly support facebook there are loads of women who have conceived naturally and have had healthy children. So that does not need to be a concern perse. However, I do not know if they would had regular cycles or not. But all hope is not lost. \nI was told (being on 120 mg somatuline every 4 weeks) that if  I wanted to try for pregnancy, I would need to stop the medication. And I think that is why she wants you to be under her care. During pregnancy, you cannot take somatuline, because it is unclear if it has an effect on the unborn child. Hugs from me. We tried for three years before becoming pregnant. I was undiagnosed and perfectly regular menstruation when I got pregnant at 27yrs old. Never had another period, but was nursing when I unexpectedly got pregnant 18 months after my first was born. Had my second baby. After I stopped nursing, I had no more periods.  5 years later, I thought I was not able to conceive again. Then I was diagnosed with the tumor, and decided to not try for anymore children. Used birth control for the first time. Had brain surgery, got fantastically healthy, including menstruation. At my 3 mo. post op MRI, took a pregnancy test just to be sure, and was pregnant again. I gave up trying to control getting pregnant, and had one more before getting tubes tied. I remember wanting so much to conceive, I brought home a kitten, and dressed it in baby clothes. And how much it felt like a gut punch when my friends asked when I was going to get pregnant again after my second baby when I thought it would never happen again. It was a lonely, desperate feeling to not be able to conceive. It happened for me and hopefully it will for you too. You have the right doctor, sounds like. Have you asked whether you should go off drug therapy in order to conceive? FYI,  my last pregnancy, my 100% successful surgery was reversed and a new tumor grew, this time around my carotid artery.... no surgery possible. My doctors think the pregnancy was a factor in the return of a tumor. Good luck. Not that I know if - but I have just been diagnosed and my LH/FSH are both basically nonexistent. I have also had a contraceptive implant (nexolanon) since about 2012 and have not menstruated since I had female roommates. At this point I am not sure that childbearing is going to be in my future, it truly seems like every medication I am on is cautioned against using while pregnant - and I cannot imagine life off of everything for the course of trying to conceive and carry a pregnancy successfully. \nGood luck. I sincerely hope you get what you are looking for and stay healthy 💜", "Surgery My transsphenoidal pituitary surgery is theoretically in two weeks time. Anyone here have any advice or heads-up? I have two pre-op appointments, but it would be nice to have some idea of how long I may be in hospital and how long I will be unable to work. I am a bundle of nerves. I had it done twice. Surgery was several hours but was only in the hospital for 3 days first time and 10 days second time because I had a brain fluid leak they had to go back and repair. Returning to work depends the meds and your doc... Probably not more than a few weeks, if that. I was in the hospital for 5 days because I got temporary diabetes insipidus. Was out of work for 2.5 weeks, working from home after that because of Covid which made things easier. Depending on what your GH and IGF-1 levels are at pre-surgery you might wake up feeling way better than before surgery like I did. Make sure you have good chapstick because you will be mouth breathing for a while. Good luck! Hi Friend. I am on my third tumor (have had two resections and a Gamma Knife procedure that apparently did not take). My current adenoma has grown a bit even on meds. Do not think surgery is on the table yet, but am concerned. If you are amenable to answering - did you require a shunt after the CSK leak? Were they able to stop the leak with another procedure? This is my biggest fear if I require surgery again. It is going to hurt. Be prepared for that. Use as much time as you can to rest. Stay on top of your pain meds initially after you are discharged. Do not wait until you are in horrible pain to use them. Be sure to connect with the neurosurgery office for your post op appointments. And lastly - good luck. I hope it goes smoothly and you get relief. I am on tumor #3 now and do not look forward to the day I have to repeat another surgery. I had my first surgery in 2014 and just had my second surgery about three weeks ago. For my most recent surgery, I spent the first night in the surgical ICU and then 2 nights in the hospital. I took a total of two weeks off of work and felt almost completely back to normal during that time (actually felt better in many regards as my hormone levels normalized).\n\nWhile you are in the hospital, you can expect a fair amount of drainage from the surgery through your nose. It will likely be uncomfortable. The pain surprisingly was not too bad for me and was able to be managed with tylenol and oxy. \n\nAfter getting home from the hospital, the biggest issue was feeling congestion in the nasal passages and not being able to breathe comfortably through my nose. I went to see the ENT for a follow up about a week after the surgery and she cleared my nose out. By that point I would say I pretty much felt back to normal.\n\nBest of luck to you and feel free to reach out to me if you have any other questions about the surgery or if there is anything I can do to help or support you. Mine was a surprise so I did not have any prep or pre-op appointments so I cannot help you with that side sorry. My surgery took 4 hours for a macroadenoma. I was in the ICU for 3 or 4 days due to a CSF leak and remained in the hospital a further 2 days due to Diabetes Insipidus. I went back to work 4 days after I was discharged from hospital but I really struggled. I still had DI for a few weeks which meant I woke up regularly to drink or use the bathroom. I ended up back in hospital due to my CSF leak and was on bed rest for a few days. Eventually all of my hormones bounced back excluding reproductive hormones and my thyroid. Happy to help with any questions, it can be an unsettling time. I just realised this question is a month old 😑 It is all good! I just had my surgery a couple weeks ago and am in recovery, so any info helps. ☺️ How did it go and how are you doing? Is your GHF-1 back in normal range? Happy to discuss anything :) The surgery went pretty well! My surgeon got most of the tumor out, save for what is wrapped around and bound to my carotid artery. I will likely have to be medicated and/or get gamma knife radiation. My growth hormone went from something like 85 ng/ml to 4. \nI am dealing with some surgical side effects still. My right eye is currently paralyzed, I have no sense of smell, still cannot breathe through my nose, and I am also constantly needing to pee (though I did lose like 10 lbs of water weight in the first week). However, it is infinitely better than how I was feeling pre-surgery. I cannot drive yet (because of the double vision from the eye), but I should be returning to work officially on Monday.\nThanks for asking. It is comforting to talk about this to someone who understands. When other people ask, I cannot really explain everything in a way they would get. 10 lbs is 4.54 kg Ugh the constant need to pee is the worst! The majority of people do recover from that thankfully (according to my endo). Are the rest of your hormones looking ok? It is almost like having a really bad cold, are you snoring really loud? My husband woke me up a few times in the night after my surgery because he was worried about how labored my breathing was lol. I have to admit I found it so hard not having anyone with real experience to talk to, even now as different things in my life happen. Thank goodness for that. I have an appointment with my Endo at the end of April, but so far my other hormones seem to be looking good from one of the immediate post-op tests. I feel like I most be snoring really loud, given how clogged my nose feels. I have mostly been sleeping with my mouth open which makes me so thirsty and that makes the peeing worse, lol. \nYes! The people I tell seem to simultaneously treat me like I am going to break from fragility and totally not understand how severe and life altering this tumor and condition have been. Late to the party I apologise but I just wanted to add, I completely relate to the two swings of attitude! Do not be afraid to seek therapy to help YOU come to terms with it all. I was surrounded by either complete non-believers (“You do not get bigger feet in your 30’s!That does not even really happen!”) or people trying to wrap me in cotton wool (Are you sure you can do that?”) &amp; I went into a kind of denial about it all  then PTSD too - it was not pleasant! I ended up seeing a psychotherapist who was a HUGE help. You have been through something major &amp; life changing, and it is not easy to come to terms with that surrounded by people who have no understanding of it, and honestly, most of the non-tumour medical personnel o met did not even understand if let alone lay people. My GP before diagnosis just told me I was obese &amp; afterwards just would not acknowledge it! But you need to know &amp; be comfortable with what you have been through for your own sake, anyone who will not ask you, or will not listen to you, well life is too short. Educate yourself &amp; educate those you care about, ignore the rest. 💜 x Did your HGH drop immediately after surgery or a little later on? I am curious when you knew your growth hormone had normalized. Mine did not normalize post surgery. In fact, it actually went up. Slightly concerned but I am hopeful further testing will show normalization. Mine dropped immediately after surgery. I have yet to get it tested again now that I am two months out. \n\nSending hopeful, healing thoughts your way. Good luck, dude Thanks. Ya kind of concerning but I guess I will just wait it out and see what the Endo and neurosurgeon say about it. Mine also went up after surgery. They were only able to get at 40-60% of it. My wife says that they made it angry. Gamma knife was the next step then on to medication control.", "Forehead changes from age 21 to 25 - possible acromegaly?  I do not believe so. I would expect to see more of a pronounced brow ridge. It does not look severe enough.Acromegaly DX you would experience several symptoms If you have had other symptoms, I would not rule it out, but to be honest if you have had other symptoms the best thing you can do is see a doctor &amp; get some blood tests done. My forehead did not look so severe either so they only way to really know is by visiting a doctor.", "Post-Surgery Remission Hi All!\n\nNew here, but I was diagnosed about 4 weeks ago. I did read and posts from this group after diagnosis. Some made me feel better, others did the opposite. I am extremely surprised by the number of people of have had recurring tumors or unsuccessful surgeries or treatments. Mine was a 1cmx1cm GH secreting tumor. Had Transsphenoidal endoscopic resection last Wednesday. Surgery went well. 3 days in hospital, still have a pretty nasty headache and some fatigue 6 days later. \n\nAnyways, I was wondering for those who had successful surgeries, how long did it take for your HGH/IGF-1 levels to normalize or at least begin normalizing? Also wondering when and if your other symptoms began to clear up?\n\nAny info is great. I am also more than willing to share more about my own diagnosis and experience if anyone is having a hard time or scared or w/e. \n\nTHANKS!!! I am on my third tumor, have had 2 resections. Your IGF-1 levels will normalize immediately after surgery. If the tumor was removed, you should no longer be hyper producing growth hormone. The trick/catch is - did they get every single cell. That is why you see so many posts about recurrences. If even one cell is left, it can begin to grow again and years later - another tumor.   \nYour acromegaly symptoms should be clearing up pretty quickly. I imagine some symptoms will take longer than others and certainly if you had any bone growth, that may not reverse fully. Sorry that you have had such a rough go with your resections. I am not sure that IGF-1 will always normalize immediately after the surgery. For example, one publication I read recently states \" The mean duration from the time of surgery until IGF-1 normalization was 10 months (range, 3 days-57 months). Twenty-seven patients (59%) reached normal IGF-1 ranges within 3 months of surgery, whereas 19 patients (41%) experienced delayed (&gt;3 months) IGF-1 normalization. Eleven patients (24%) recovered normal IGF-1 levels 12 to 57 months after surgery.\"\n\nI was wondering what experiences other patients have had with their levels, and how long it took them to normalize. For instance, did they have their IGF-1 tested every week after surgery and see a gradual decrease? Just curious about when and how they knew their surgery was a success.\n\nSide note, who did your surgeries and what size tumor did you have? Did it invade your cavernous sinus? Also curious about IGF-1 vs HGH levels. I think IGF lowers before your HGH normalizes as well but I do not know all that much about that relationship. Here is a pretty informative article if anyone is looking for information: ( 1. Important to recognize that the people in support groups have some serious self-selection bias: the people doing well *do not tend to need as much support* and are not watching message boards the way people who are struggling do. Some tumors will not be accessible via transsphenoidal approaches, and some will never be able to fully come out without *seriously radical surgery,* depending on how long they have gone undiagnosed/if the tumor encircles your carotid etc\n2. People who have successful surgeries often talk about rapid changes to soft tissue (hands and feet shrinking down, hair loss and thinning etc) - though as you note, it can take longer. Frankly, if you are able to remove the majority of the burden from mass effect etc, you are able to medically manage whatever disease level may remain post-op more easily.\n\nHope your headache etc improved. Though my surgeries were not \"successful\" in that they could not remove the entire tumor, my chronic headaches all but disappeared, and my optic chiasm has since healed itself after a period of compression - so my peripheral vision is back!  \n\n\nGood luck Glad to hear your surgeries were able to help you regain some comfort and vision. Thanks for the response!", "Is there any Canadians on here that can give me some advice on working with our healthcare system? Also, is there anyone willing to mentor me through the process? So I have to wait two months before my next MRI, and my endocrinologist is severely unavailable. My family doctor will not help and will always say “talk to the endo”. Ultimately I am facing issues getting the help I need, I am also not able to get many answers either (they real have been leaving me in the dark).\n\nHowever, my symptoms these days have been through the roof and really hard to manage (mostly the insomnia, the mood swings, the depression, the sweatiness, and the severe acne). Im so tiered I feel like I am going mental. \n\nI asked my endo for support groups or specialists…etc. and he just said he does not know of anything. I feel like I have absolutely no one helping with this. How long does it normally a person to be diagnosed and treated? Im just feeling super lost and hopeless with this process. I live in Quebec. Healthcare system can vary between provinces.Getting a diagnosis for a rare disease can take years.For acromegaly on average,it takes eight years.If your sighs are not severe, Drs will not even think about this uncommon diagnosis.Because of Covid,it can complicate everything now for the process of getting tests and endocrinologist visits.Acromegaly symptoms in most cases are physical and commonly enlarged hands,feets,tongue,jaw… Which Dr have you seen that suspected acromegaly? Because the symptoms you mentioned, it can be almost any disease. Good luck in the process of getting any sort of diagnosis. Hi there! Sorry for the slow reply. I have enlarged feet and jaw. I cannot confirm for the tongue and hands. I also have high IGF and GH levels.  My MRI also showed an “abnormality” which my endocrinologist said is not a concern, but he also cannot explain it. My endo said that I might have pre diabetes, but probably not acromegaly- which is very odd considering how healthy I am (and also considering all the other symptoms). Needless to say my endo is a young doctor that specializes in diabetes. My next appt with him is this Thursday, but I am not expecting much. I also have an appointment with an “acromegaly specialist” in Vancouver (which took months to get), but I am worried that this specialist will not give me answers either. \n\nAhhhggg this process is so frustrating! And it would just be so nice to have all my symptoms stop for once. The insomnia and mood swings get to me sometimes. I also hate the jaw growth and the acne. I would also like my cholesterol and blood sugar levels to be normal. I am not even going to get into the rest, but I hate this.", "Thyroid connection Hi all! I am still in the process of being diagnosed but I was told I have hyperthyroidism on top of everything. I also have an elevated level of calcium and apparently there can be a connection between that and a hyperthyroid. I was wondering if anyone has had a high level of calcium, hyperthyroidism or both? I was also diagnosed with thyroid issues when I was diagnosed with acro- for me it was hashimotos- hypothyroidism. Thyroid issues are super common, so I think they are just often found out at the same time when an endocrinologist starts doing tests. Both thyroid issues and pituitary issues are really common, but at this point I would insist on a referral to Genetics. Especially if there is any family history of pituitary/thyroid/autoimmune issues, there might be an Endocrine Neoplasia that runs in your family. That would be really helpful for other family members to know, as they can get appropriate monitoring done by their own physicians and head off potential problems early, rather than waiting to get their own strange diagnoses!! That is what is going on in my family after I (29f) was diagnosed with acromegaly and my sister (25F) had a 5cm thyroid nodule diagnosed and removed in the same year 😒", "Ionized calcium Hi all, my endocrinologist has been running tests non stop since January and one result that always comes back elevated is my ionized calcium. Just wondering if anyone else had this issue and what the connection might be. Thanks! I think they are still working out how covid affects the acromeglic population I FIGURED AS SUCH.    MY NUMBERS HAVE BEEN WORSE THAN EVER. Was first told it was stressed induced,  then when my calcium shoot through the roof and started seeing deposits bone density increase and vit D dropped to single digits. Then he was concerned", "Source: New England Journal of Medecine ", "Elevated IGF-1 but OGTT failed? I have many of the general symptoms of acromegaly, and I got my blood tested for IGF-1 and it was 421 (normal range: 93-250). Then a week later I got my GH levels tested, but around 120 minutes before I got my blood drawn I ate approximately 80-90 grams of glucose (it was not officially an OGTT, I just visited a private clinic and got it done, without them knowing why I am taking the test). The result was simply \"less than 0.05 ug/L\", which means I pretty much failed the OGTT test.\n\nHow likely is it that I still have acromegaly? What else could explain my over the top IGF-1 levels? Do not worry about it. GH level in OGTT is more specific and it is level less 1 ng/ml after glucose load rull out acromegaly in most cases. \nRepeat IFG-1 in another lab. Other possible reasons for its increase are pregnancy and pubertal period.", "Doping for Google ", "Doctor is suspecting Acromegaly but I am not sure So I am currently a 28M 6 foot 280lb, in 2018 I started having horrible vertigo and got an MRI done to if something was going on. Nothing related to vertigo showed up by my pituitary was enlarged at 10mm (age reference is 6mm +- 2mm) but they did not see a tumor exactly. Met with a neurosurgeon who ran tests and saw my IGF 1 was high (first test 394 ng/ml and 1 month later 472 ng/ml from reference range of 60-329 ng/ml). Said it is high but nothing to worry with let us check again in 2 years. So now In 2020 I took tests again in July and had another MRI. No change in pituitary size and no specific tumor identified. IGF 1 lab was high again at 376 ng/ml. He sent me to an Endo who ran an OGTT which lab messed up twice so results were inconclusive. So now I am going back in two weeks to get everything rechecked. Endo suspects Acromegaly due to constantly high IGF 1 over a 2 year period. She said if it is high again she wants to do an echo on heart and ultrasound on thyroid. All other labs constantly normal other than testosterone which is 220 ng/dl from a 304-1227 reference range. Only other Acromegaly symptoms are sweating a lot, possible sleep apnea, and high blood pressure (all of which can also be explained due to being very overweight). I do still exercise often and lift weights a good bit but do not take any supplements. I guess what I am asking is has anyone else been in the boat where labs show something before real symptoms began? I am terrified to have a surgery for something that may or may not be there. Are there any questions I can ask my doctor when I meet again? Am I being obtuse for doubting the doctor? Oh and I was tested two times for diabetes and I am not diabetic or pre diabetic. The acromegaly community Facebook group is a wealth of information. When I was diagnosed with Acro, I was 29, I did not think I had many symptoms, until after my surgery when they all disappeared. They come on so slowly it can be hard to tell. I am shocked your doctor had you wait 2 years before sending you to an endo.... there is a chance the tumor is somewhere else, and not in your pituitary. You are not wrong to be weary of surgery. You should find a neurosurgeon who specializes in transphenoidal surgery, and travel for it if necessary- a lot of people do, and funds can often be available to help. I had mine done by Dr Swearingen at Mass General. Where do you live? Hey yea the Endo said I should have seen her 2 years ago. I have had the OGTT done 3 times and each time I think the lab keeps messing it up. Every reading says 0 for growth hormone when she said it should be showing at least something the first time. If I do have the surgery I would still stick with this neurosurgeon. I am in New Orleans and he seems to be the guy for this. He is the one the big hospital chain down here sends people to for any skull base or pituitary surgery. He seems to think due to the size of the pituitary there is a tumor the mri is not picking up but my Endo wants to do everything she can to eliminate everything else before going that path since it is not as cut and dry. I just have so much medical fatigue right now. With the vertigo I have had so many tests and doctors appointments and now this issue, which they say is completely unrelated, is just more and more tests with nothing conclusive. I am sorry to hear about your OGTT results, that sounds so frustrating. I really recommend connecting with Jill Sisco- the president of Acromegaly Community. She is the one who runs the FB group, but also this website:  Jill can tell you about the best doctors in your community. And help you learn what questions to ask, how to advocate fir yourself, etc. \n\nGoing to an experienced acro surgeon is maybe the most important decision of your life. I am in remission become if it. Your first surgery is your one chance for remission, to avoid a lifetime of medication. \n\nI also had vertigo, and it is absolutely connected to acro. \n\nLet me know if you want to talk, or have any other questions. I know how stressful of a time it is. I am three years out from surgery, and have never felt better in my life. You will be on the other side of it all too. Thank you so much for the resources. I am sure I will be picking your brain further. Hi there. I work in the field of endo research, and I have been involved with many patients with Acromegaly in various clinical trials. I am sorry that you are going through this period of confusion.\n\nAcromegaly is very difficult to diagnose and it is symptoms are both numerous, varied and often underlying. It sounds like your endo is being proactive in her investigation (besides the OGTT bumbling of course) for suspecting Acromegaly. \n\nAlmost all cases of Acromegaly (&gt;99%) are the result of a growth hormone secreting pituitary adenomas (tumors). These tumours are detected via MRI, and tend to be quite large. Very rare cases of Acromegaly can be the result of a microadenoma, that is undetectable via MRI visualization thus requiring an alternate method(s) of investigation, which tend to be more invasive and surgical. By the sounds of it, your repeat MRI results are promising despite the slight enlargement as the images lack any sign of adenomas. Though your IGF-1 results are indeed elevated to some degree and persistent in nature, your endo will need much more justification for a pituitary surgical procedure. Echo and thyroid U/S will assist in potentially ruling out the diagnosis. An abdominal U/S ruling out gall bladder polyps could also be a good idea.\n\nI am sorry to hear of your unpleasant experiences of vertigo. Im not sure how extensive your physical examination with your endo was but there are a few things you should keep an eye on. Tingling, numbness, and/or swelling in your extremities. Aches, pains and or swelling in joints. Have to you noticed any pain in your jaw? Try your best to speak to your doctor of any physical symptoms you may have, even if they seem insignificant to you.\n\nI hope any of this helps you and I wish you luck. Please feel free to reach out! Has your doctor suggested a possible ectopic source? This would be a growth hormone releasing hormone tumor found in an area outside the brain (e.g., the lungs, GI tract, pancreas, etc.). This also leads to hyper-secretion of growth hormone and results in hyperplasia of the pituitary gland. I hope that you are able to figure everything out! \n\n&amp;#x200B;\n\n(", "Somavert side effect question I am on day 3 of 10mg of Somavert. I completely understand that you need to give it time for side effects to dissipate. However, has anyone experienced bad pain in their hands, anxiety out of the blue, feeling foggy-headed, dizziness and lightheadedness, and rapid weight gain? I had some bad fatigue and foggy-ness and some weight gain. I actually attributed the weight gain to finally getting the hormones under control. I figured without all the extra IGF-1, I had to actual eat a little healthier and it is much harder for me to drop extra pounds now that my levels are normal.  I started taking my shot right before bed, seemed like a good time to be fatigued and foggy-headed. I do think there was a bit of a hump. I pushed through it after about a month and feel much better now. I wanted to give it a real shot because it was kind of my last, best hope for control. Thank you! I really appreciate you taking the time to respond and share. I have an atypical case of acromegaly, where my growth hormone is perfectly on target and my IGF-1 is high. I also have a lot of autoimmune symptoms, but aside from a decently high ANA level, those specific tests are all negative. Doctors are guessing that it is acromegaly, but they sort of have their hands up in the air. I am working on getting a second opinion, but until then, it is nice to know that some of these side effects might be “normal” and may dissipate over time. Have you had an MRI to check for an adenoma on your pituitary? I know GH is hard to measure because levels fluctuate. I do not know who you are working with or even if you are in the US but there are a few facilities across the country that specialize in acromegaly and other rare endocrine issues. The Mayo in Minnesota is one of them.  I have and I have seen a neurosurgeon. Doctors are torn as to whether it is an adenoma or a cyst. The issue is that it is in my pituitary stalk, as opposed to being on the actual gland, so it appears to be inoperable, since the chances of damaging my pituitary gland are quite high. That is too bad, I really do not mind the Somavert from a side effect perspective.  Daily shots and refrigeration and all that is a lot. \n\nNot to jump onto your treatment team or anything, but another option may be Gamma Knife radiation if the can avoid the gland. Injections for acromegaly have all bad side effects", "Oral Treatments Has anyone had success with MYCAPPSA oral treatments? Not familiar with it. It is an adjunctive therapy to injectables? It is a possible replacement for SSA injectables. Interesting. Seeing my endo this week. I will ask about it. I would be curious to hear how that goes Well, found out that basically Mycapssa IS octreotide, just the new oral formulation. \nIt is a newer type of medication in the way it enters the body from the small intestine. \nSo for now, I am staying on Somatuline 120 but may consider moving over to Mycapssa in the future.\nI am still struggling to get my IGF-1 Levels under full control. We are adding Cabergoline to my regimen now to see if that helps drive the IGF-1 down to a normal level.", "My looooooooooong story of getting diagnosed with acromegaly. ", "Hey.. am I good? Is this a normal situation? As blood glucose goes down, GH goes down. As it goes up, GH goes up? ", "Can you guys share your IGF1 values? I think mine may be high, but I am on medication that may affect it. I cannot find any info on if that is a possibility. I am experiencing bigger hands, feet, and jaw even though I am 22 F. Normal is supposed to be 11-37 nmol/L according to my test paperwork. If comparing, take note of the units used, as they could be different.\n\nPre surgery 1 I was in the 150's. After the first surgery I was in the 50's. Then pre surgery 2 I was back up in the 70's. After the second surgery, I am in the normal range. If you do not mind me asking what type of symptoms did you have? Levels very by age and gender. Different facilities can have different values also. Before my first surgery, carpal tunnel in my hands, shoe size went up about a half size, sweating a lot, and oily skin were the most noticeable symptoms. Also snoring. Before my second surgery, sweatiness (not as bad as before), oily skin, snoring, and joint pain, especially in my hips. With acromegaly, do feet just swell or actually grow in length? Could be both, or either. You may retain water and have swelling. That is what can cause carpal tunnel symptoms. My doctor checked for swelling of my feet and ankles. But your bones can actually grow, too. Your feet can get longer. Your hands can grow. Bones in your face can grow. Everyone can have symptoms present a little differently. Ok thank you for answering my questions, it is so hard to find information on this so I appreciate the feedback 42-53iml So you can also check your z score, which is your IGF1’s deviation from “normal” adjusted for your age etc. +/-2.0 is considered a healthy z score.", "Got my blood work back - now I am being referred to an endocrinologist. I need some more advice! FIRST OF ALL I WANT TO SAY THANK YOU TO EVERYONE WHO TOLD ME TO PUSH FOR THE SPECIFIC GROWTH AND INSULIN GROWTH TESTS ON MY PREVIOUS POST!!!! My insulin growth hormone is 3.58 (while normal ranges are below 3.26) and my human growth hormone is 10.1 (while normal is below 8.0). I am now being referred to an endocrinologist. Please please please give me advice on the next steps - you guys were a huge help last time! I told my doctor that I think it may be acromegaly due to my other symptoms and she just said “I will just have a discussion with the endocrinologist and refer you”. What questions should I ask my doctor and endocrinologist going forward? Are there things I should specifically ask for? What do I need to tell them? Also, at what point do I ask for a brain scan to see if there are tumours??\n\nSorry I am a wee bit panicked, bc I was hoping this would not be the case - but again I am so glad you guys helped me get to where I am today. Also, I just called my doctor again and she said I can follow up in two weeks if I have not heard from the endocrinologist…is this too long of a wait? Acromegaly is measured in years, not in weeks or months. You have lots of time to sort stuff out if you get diagnosed. Your levels listed based on your reference ranges are high, but not crazy. If you are a young person, I do not know what an endocrinologist would say, but there will likely be more testing.  \n\nFor reference my igf-1 level was over 1000 ng/ml with a normal range for me between 40-292 ng/ml. And my GH was 14 times higher than it should have been. Everybody is different and every case of acromegaly is different but it is a good thing that you are going to talk it through and consult with an endocrinologist. Do hormone levels get progressively higher with age, if left untreated. I am thinking mine are not excessively high because I am 23, and have only been experiencing symptoms for 3 years. But I do not really have the knowledge or experience to verify if I am correct.\n\nAlso, thanks for your response! That is a huge relief!! I have been a little stressed about this. The high levels that cause acromegaly are generally caused by a growth hormone secreting benign tumor on your pituitary. I do not think there is a known rhyme or reason to why some tumors produce more than others, but they can develop at any age and some produce more than others. They are generally very slow growing. I do not think it would be wrong to say that as a tumor grows, it would likely start producing more hormone. Sorry last question, at this point should I be asking my doctor for imaging to see if there is a tumour or should I wait until after I eventually get an appointment with the endocrinologist? I do not think I can provide an educated answer to that question. I would talk to the endo and see where it goes from there. Endocrinologist will prescribed MRI to determine if you have a pituitary tumour.Microadenoma : a small tumor Macroadenoma : a large tumor. You definitely need to chill out. Like another poster said you measure acromegaly in years, not weeks. Take in consideration that some people inject themselves with growth hormone. Acromegaly is more of too much of a good thing, than just a bad thing. Excess GH over a long range of time is bad.\nSo relax, talk to your doctors and use the time to educate yourself.\nI am on my second year of acromegaly and thankfully caught it very earlier to the point that the adenoma (benign non cancerous tumor) is not visible on MRI. My mother on the other hand was not so luck and had some severe effects from it. She passed away last year. I dearly loved her. As soon as you have a high IGF1 read, you should ask for a confirmatory MRI. If your doctor is reluctant, tell them you want their refusal documented in your chart with their reasoning Have you seen a geneticist to see if you have FIPA? (  \n\n\nAs someone newly diagnosed, this might be a really helpful set of articles. This Medscape link has information about guidelines for treatment, common co-morbidities that you should be screened for, the medications you will probably hear about, all kinds of stuff. You might end up wanting to print things that you find helpful to keep in a binder -- I have brought scientific articles, pituitary society guidelines, all sorts of stuff to my physicans' appointments to get questions or concerns addressed!  \n\n\nI am a firm believer that knowledge is power. You will need to advocate for your care in really frustrating ways at times, and it always helps if you have a support-person you can bring to appointments. You should listen - they can take notes.\n\nGood luck! Good point! That is where I am at right now. I have asked my doctor twice for an MRI and she refused both times and said I have to wait for the endocrinologist to make an MRI for me. Bummer thing is: the endocrinologist has not responded to my referral either.  RIP to me Thank you!!!! This is so handy! I find that my doctor is extremely unhelpful when it comes to this whole process, so I sincerely appreciate this!!!!!! I am actually waiting on the results of a genetic test that my doctor ordered to clarify that. I appreciate you pointing that out. &gt;I am actually waiting on the results of a genetic test that my doctor ordered to clarify that. I appreciate you pointing that out.\n\nSO important for people to be part of research -- particularly if they are on the younger side when their tumors are diagnosed! Hope you find out if you have an AIP mutation or another familial issue. I will finally see a geneticist next month, and fully anticipate that FIPA diagnosis (my grandpa and his mother both had pituitary tumors, and what cousins remember of my great-grandma's diagnosis, she heard an awful lot of familiar things at her doctors appointments!) - but that is enormously helpful to my siblings and cousins, not even considering future generations! Results came back negative for FIPA, so it does not seem to be familiar.\n\nThanks for the suggestion.", "Interesting story about raising awareness in Canada.  Thank you for sharing this. She is truly an inspiration. ", "Is this extremely high?  I have a spinal Csf leak. One of the ways this presents on a brain mri is an enlarged pit gland. Which mine is measuring at 11 by 11 by 11. Because of this just to make sure not pit tumor and just from the leak we did a dedicated pit mri with and without contrast. They could not find a tumor but radiologist said still a possibility since gland is big. I asked my neurologist (I am being seen at Mayo Clinic) to run all my pit gland related hormones as I am trying to conceive soon and want to make sure hormones are fine and it is not a tumor. My tsh, prolactin, lh, acth, and fsh have all come in perfect. My growth came in at this, 5.65 where labs threshold shows 3.61 max.  Waiting on my igf-1 results to get in and very anxious I have this condition. What were your guys gh levels when first getting diagnosed? Should I be concerned? Hands and feet totally normal. Sometimes I do notice my face looks a bit different but I have lost weight so assumed it was that. Would any other hormones be off if I had this or no? Also, I have had a recent echo and thyroid scan-both clear.\n\nThanks Need more info was it your HGH, or igf1 or igf1, and when and under what circumstances was the test done It was my hgh taken about 5 pm after a neurologist apt. I was a bit emotional after news I still had a spinal leak, not sure if that matters but including. Still waiting on igf1 results to get in but was worried after seeing a high hgh so asked on here Its up and down during the day, depending on meals also, best time to take that test is In the mornings /u/Representative_Ebb73, I have found an error in your comment:\n\n &gt; “~~Its~~  up and down”\n\nTo me, it seems that you, Representative_Ebb73, mistyped a comment and ought to have said “~~Its~~  up and down” instead. ‘Its’ is possessive; ‘it is’ means ‘it is’ or ‘it has’.\n\n ^(This is an automated bot. I do not intend to shame your mistakes. If you think the errors which I found are incorrect, please contact me through DMs or contact my owner EliteDaMyth!) It is not too high, you still in the single didgets Thank you for the insight! Hope my other test comes in regular but we shall see Best of luck to you Do you think there is any possibility to have this level and not have elevated igf1? Thank you That gets complicated really fast I can only speak from my experience MEN1 Carney.  Which is multiple things at workq Ok this is not extremely high GH, you are not terribly far from the standard “average” level - as echoed, hormone levels can change through the day and are dependent on other hormones. If acromegaly symptoms do not sound true to your life experience over the last two years, I would not strongly consider this a potential diagnosis. There is a reason it takes so long to diagnosed for so many people: the symptoms can be really generalized, but you would likely KNOW when looking at a disease description of acromegaly. \nBest of luck getting your CSF leak under control - that is for sure your primary concern. After it is stable, then a lot of these hormone levels will be more meaningful to your team. Sending love - the Mayo Clinic know what they are doing and it is so important to have multidisciplinary care! Just try and stay calm, eat right, and excercise. Cant stress that enough I am a raw vegan and exercise 5 days a week.  I have never been healthier in my life so hopefully all is well. Anxious on this result, ha! My hormone levels are all perfect except this one and waiting on igf1 result to get in. Besides that they have all been exactly in the middle of standard range. LH, TSH, Prolactin, LH, FSH, and ACTH. I have looked at the symptoms and do not see any relating to me except now I keep looking at my face and seeing small signs. Hoping that is just anxiety from this test result, ha! Thanks for responding!", "Somavert side effects Does anyone here take somavert and if so do you experience any side effects if you have a minor lapse in between Injections; something like uncontrollable nerve pulses that mainly effect the face and upper extremities?", "Extremely worried that I have Acromegaly I am super worried. I just turned 18 and am male btw. I have been experiencing some horrifying brow and jaw growth with pain in my brow, nose, jaw, and teeth, and it seems like my rib age also has grown. My tongue and bottom lip look bigger and now my bite in my mouth feels really uncomfortable and like it has changed. No changes to feet/hand/height. I also have fatigue, trouble waking up too early from my sleep, headaches, and a voice that seems deeper than it did earlier this year. Should I see a doctor immediately or am I just overly anxious? At 18 and especially being male, you definitely could still be growing. If you feel something just is not right you can schedule an appointment with your doctor. But I think these changes are most likely normal for being your age. Well.. if you do have it you are at least catching it early.  I went 25 years before I was diagnosed.   Good luck I just feel as something is not right because I already had an average male prominent brow and now I am having forehead bone growth, more brow bone growth, and now even some extreme orbital rim bone growth. Nobody in my family or extended family has any of this. In that case, it would be worth visiting a doctor for this Tell your doctor if you are concerned. There are blood tests your provider can order. GH and IGF-1 are good. Glucose tolerance testing (GTT) is great too, but is a bit more laborious. Other tests that can indicate if you have a pituitary tumor are: Cortisol, ACTH, prolactin, LH, FSH, TSH. If levels are abnormal your doctor may order a MRI. \n\nIf you are noticing loss of peripheral vision you can see an ophthalmologist to perform a visual field test. \n\nIf MRI indicates a pituitary tumor you will want to see an endocrinologist and possibly a neurosurgeon. Consult endocrinologist have IGF 1 and growth hormones blood tests done.It can take years to get diagnosed correctly with acromegaly I went to my doctor and he said he would not give me any tests or refer me to another doctor. I am extremely upset as I cannot see a specialist unless I get a referral through him. What a pos. I am sorry this was your outcome! Can you visit a different doctor to get a second opinion? I am 23 and in the same position as you. I got my growth spurt at 13, completely stopped growing by 15. Then the skin on the bottom of my hands and feet and on my face got thicker back when I was 16. My tongue seemed to get larger too since my teeth now leave marks on the side of it. My voice suddenly got husky or thick sounding too around the same time. Idk how to explain it, the pitch was not lower but it sounded normal before and now it sounded weird. \n\nAlso while the thickened skin, lagre tongue and husky voice has never gone away, my symptoms with the jaw and chin pains, lower bottom tooth tingling, and pressure in my nasal bridge and forehead always come and go. Sometimes a day, sometimes it lasts for a couple of weeks, etc.\n\nSince then my facial features have slowly surpassed all my male relatives. I have getting way too much growth to my entire forehead (like the entire thing bulges forwards), brow ridge and orbital rims. My eyes look super super deepset. Even my cheekbones are massive, jaw is wide (all bone not masseter muscles) but also has grown so much down vertically, chin's massive too, and my hands and feet are way too wide for their length. Finger joints are thicker too.\n\nAlso my bite's been feeling off since around 2018 but I have always had a pretty bad overbite with a slightly recessed lower jaw, so I am pretty sure that if acromegaly made my jaw longer, it would have a bunch of headroom before I would get an underbite. Probably why my dentist never thought it was weird. Also I feel like I am compensating for it moving forwards by forcing it back when I bite.\n\nMy ribcage does not seem massive from the front, but it sticks out too far when looking at it from the side and I guess the ribs look a bit bulky?\n\nThe worst of it was when I was 18-19 and was getting horrible migraines, etc. That is the time everyone else noticed that I looked weird too. Well apart from my family that saw me every day. \n\nI did not even know what acromegaly was back then, but my family doctor did every test he could think of and they all came back as normal. Including the blood glucose, etc which should have been worse from acromegaly (No IGF-1 or any pituitary stuff)\nI finally had an MRI done right before I turned 19 and it was clear, although again, they did not specifically check my pituitary gland, just my whole brain.\n\nI have not gotten many migraines since around then but the thickened skin has not gone away and my face still seems to be getting more and more masculine and larger.\n\nI literally cannot find a man with facial features as exaggerated as mine now. Like not all of them at once. And even then, their faces are always still smaller than mine.\n\nAlso, when i finally realized that I probably had acromegaly given all my physical symptoms, etc. I finally asked my family doctor to test for IGF-1. And ofc the test came back as normal. 251 out of 120-338\nMaybe I would have much higher numbers if I had it done over a month ago when my symptoms were more constant?\n\nBut idk what to even do now since after all these tests and not having my lower jaw protrude past my upper teeth nobody really believes me. \n\nThey just say that I just have strong jaw genetics, etc. Since if i really had a pituitary tumor I would have a severe underbite and be super tall. Not like my growth plates were probably fully closed by 15 which is when I completely stopped growing any taller...", "Oral acromegaly therapy maintains efficacy for most initial responders at 62 weeks ", "Has anyone ever had dizziness? I have had dizziness for about 10 years now. Bright red flushing and heat/sun intolerance comes with it. More recently the flushing has been on one side of my face instead of both. I also have a slightly droopy eyelid on that side. Blood pressure has always been normal. The reason I am curious if anyone has had dizziness is because it is been a symptom I have long struggled with and it has kept me from enjoying life, really. I am not a depressed person by any means but I have no friends because of it. Even a short trip to the store can make my head spin and in the summer with the heat its bad. \n\nFor years I tried hard to fix it but eventually doctors all said it was nothing and I gave up on an answer and I just sort of fight through it the best I can. The reason I am curious if anyone else has had dizziness is because in the last year I have also noticed my feet have grown half a size. I have also noticed my chin is larger and my zygomatic arch on one side of my face sticks out more. \n\nI have a hard lump in one hand on my palm that feels like bone and two of my fingers kind of curl which is odd but one hand is slightly bigger than the other too and for some odd reason my fingernails on one hand are also smaller than the other. I am not talking lengthwise. I mean the nail beds actually start much higher compared to the other hand. I am not sure if one hand is shrinking or one is growing. \n\nI have some odd asymmetrical growth going on nonetheless. More than anything I would like to get the dizziness resolved so I am just curious what people’s experiences are and if anyone has had it as a symptom. I did search this sub but could not find much. I should add I am also a female and 5’4” and now wear a size 10.5 shoes in women’s so my feet have always been disproportionately large which is rather frustrating.", "Is anyone diagnosed that would be happy to answer some questions? ", "Buying a San Gabriel Valley ", "Face wash? I am a week or so late on sonatuline depot injection this month. My face has been breaking out pretty bad and seems oily. (I always had dry skin before acromegaly ruined my life. I seriously avoid mirrors and pictures getting taken.\n\nDo you all have good ideas for sensitive and oily face wash? Please I had used Plant Apothecary’s Wash Your Face cleanser with a lot of luck for years, but recently got into Drunk Elephant’s jelly cleanser as part of a night kit. It is expensive AF but the glycolic night serum has been a gamechanger for me.", "Asking just out of concern Hi, so i have just come across this, and i want to ask to make sure, i am 6 foot 5 (197 cm) and i am 19,20 in a month, i have always been known as the tall kid growing up, not extremely tall just taller than most if that makes sense, i did not have a growth spurt i naturally grew taller and did not bother noticing myself growing naturally as someone normally would, judging by the symptoms listed on the NHS website, the closest thing i got to was sweating too much which comes from skin changes, which i assume is not the case since i have been like that all of my life.\n\nI just wanted to ask since i am an extremely anxious guy and gets scared quickly lol and i want to put my mind at ease since i am not really comfortable with my tall height in general.\n\nThanks in advance", "Widened face and body due to slightly elevated IGF-1 and high HGH? Over the past year, I have been experiencing odd changes to my appearance and novel symptoms:\n\n* Female pattern hair loss\n* Hirsutism\n* Masculinization of body (increased upper body and trunk mass, wider calves, flatter and more square glutes)\n* Dry, hardened skin on knuckles\n* Excessive sweating\n* Occasional visual disturbances (blurriness)\n* Occasional face and nose widening (eyes sometimes protrude too)\n* Unexplained joint pain (wrist and hips)\n\nWeirdly, the face/nose widening occurs on a temporary but recurring basis. Some days it will widen and a few days later it will return to normal.\n\nSome pictures: (\n\nNo health conditions but I have confirmed impaired glucose tolerance and am awaiting a possible PCOS diagnosis.\n\nMost of my hormones are okay except for above normal DHT (1287 pmol/L - reference: 83 - 1266) and TSH at the high end of normal (3.79 mIU/L - reference: 0.35 - 5). Came here to ask about these two biomarkers:\n\n* IGF-1 = 303 ug/L (reference 93 - 297)\n* HGH = 9.12 ug/L (reference 0.13 - 9.88) My endo tends to discount HGH because it can fluctuate based on how and when the body produces it. Your IGF is not too high, your endo is the best person to talk to. I would keep an eye on it. I had all the symptoms you described, but minimally elevated igf-1. I ended up failing the oral glucose tolerance test and finding a small tumor via mri that secreted growth hormone once I found an Endo that was willing to run the right tests. I hope that you find the answers you need ❤️ Thanks ❤️ it is been frustrating to experience these symptoms and to have your endo dismiss you as a hypochondriac. Hopefully it is nothing and that I can get an endo who can help me order tests to confirm that.\n\nWhere was your tumour found? Did you have surgery to remove the tumour or are you just taking hormones to treat the symptoms? My endo was unfortunately very dismissive and would cut me off when I had concerns so I am in the process of finding a new one. It is possible that I drew blood when my HGH was high but I think I read that IGF-1 is an average over a period of time (I forget the source unfortunately). My IGF-1 seems to be within range by other standards online so hopefully it is not cause for concern. If you fail an Oral Glucose Tolerance Test, it is standard practice to then order an MRI of the pituitary (you will get your whole head done, with and without contrast)  \nIf you current endo is being problematic, tell them what tests you want ordered very specifically. If they are dismissive, tell them that you want their refusal and reason for it documented in your chart. Sometimes all it takes is the right words to get your doctors to take you seriously", "If it is not Acromegaly then what?? My best friend has Acromegaly. When we met, in the nicest way possible she asked/ suggested I may have it.\n       I laughed and said no I did not think so. I wear a woman’s shoe size 15. I am almost 6’1. A deep voice.\n  I told her I grew 13 inches in one year at age 5. And my feet stopped growing at age 13.\nWe met when I was 32. So nothing kept growing in the 20ish years.\nCan Acromegaly start then lay dormant for years?\nI see an endocrinologist regularly. She suggested i may have crushing syndrome. I just had an mri today.\nI have so many symptoms. I am trying to educate myself on things that happen because of the Pituitary gland.\nI will list my symptoms and feel free to comment what you think it could be or any suggestions . Thanks \n\nDiabetic \nThyroid cancer \nBuffalo hump\nRound face\nXxxl hands ( large boned, long fingers, not fat or puffy)\nSize 15 feet. I have 5 extra bones in my feet and the are EEEE\nPink stretch marks. I had the majority of them before age 21 no new ones\nThin long arms and legs\nVery fat midsection \nPendulous abdomen \nObesity \nMale pattern baldness \nHirsutism\nOthers stuff too…..", "Does this look like Acromegaly? 1-2 years ago:\n\n(\n\ntoday:\n\n(", "Are these early signs of Acromegaly? So, I have (19F) been having sudden headaches especially on a side of my face, behind the eye, thus it changes from side to side. This pain has extended to the rest of the face, neck, behind the neck, back, shoulders, and arms. Also, I have been experiencing pain in my chest as well as a burning sensation, however, I do have mitral valve prolapse so that might tell something.\n\nI have not experienced any changes in my feet, face or hands (maybe a little swelling on my hands but I think is just my mind being anxious) \n\nI almost forgot to mention, I have also experienced a lot of fatigue and tiredness like I am always sleepy.\n\nWhat do you think? Do you think this might be Acromegaly?  I am freaking out right now and people tell me is stress and I have no money or insurance to see a doctor.\n\nSorry for the bad spelling, English is not my first language.\n\nExtra info about me: I am 5’4 and 100lbs. I do have two medical conditions Mitral Valve Prolapse and Mild Scoliosis. Also, I do not drink, smoke or do drugs. I experienced other symptoms before having constant headaches. My headaches also stayed localized to my head. I would be more inclined to suspect acromegaly if you had other common symptoms. But sadly, no one can really diagnose you until you get some blood work done.", "I think I might have acromegaly but my doctor shot it down and said it is impossible. Should I keep pushing or is it likely something else? Okay, I am very happy I found this sub in the midst of this never-ending medical nightmare. Basically, I am a 22 year old female, and for the past year I have been trying and failing to fix what is been causing my various symptoms. I brought up the possibility of having this condition to my primary care doctor and he said it was more likely for me to fly than actually have acromegaly. Needless to say I did not push for any testing because I am timid and stupid. He ordered basic blood work and a testosterone test which came back normal. I am still on the fence about acromegaly and I am hoping you guys can help me determine if my symptoms indicate anything. \n\nFor one, my face is just...different. My forehead looks like it has a dent in the middle and its changed my side profile drastically. My jaw is also misaligned, and my smile and face are now very asymmetrical. I attributed this to me no longer wearing my retainer, but the actual bone structure of my face looks like a new person when I compare current selfies to older photos. My skin is oilier than it is ever been, and I have pronounced, deep lines between my eyebrows and around my mouth and nose. It is like there is extra skin that was not there before and it is aged me horribly. My pores are so huge they look like acne scars. The cherry on top of this mess is my hair loss. It is the first dramatic symptom I noticed and my hair continues to get thinner and thinner. I have also noticed crazy amounts of body hair on my lower stomach, inner/outer thighs and face that I never experienced before. \n\nDoes any of this sound like acromegaly to you? As far as non-physical symptoms, I have been finding it hard to take a full breath and I am tired *constantly.* I am in school and I have a job, but I am used to that schedule as I have been doing it for three years now. Recently however I cannot escape feeling tired no matter how much I sleep. I am at a loss and I just want to feel normal again. I hate making doctors think I am overreacting, so I am hoping you guys can give me some insight. Thank you so much and sorry for the rant. Obligatory I am not a doctor\nI do have acromegaly though, and I feel for you at your frustrations not knowing what is causing your symptom, whatever it may be.  \nYour doctor is right, acromegaly is rare, but not as rare as he is making out, obviously! I still meet medical professionals who have either never heard of it, or have but do not know what it is, never mind be able to diagnose it. But there are people who can. Have you seen an optician recently? What about a dentist? Again it is not a run of the mill everyday diagnosis but it can be found &amp; diagnosed by both opticians or dentists based on the changes in you that they observe.     \nMy first thought reading your post was thyroid issues rather than acromegaly, but again I stress I am not a doctor. I do not know where in the world you are, how your health care works or what standard things your doctor would look for in a basic blood test. A basic blood test cannot diagnose acromegaly but I would assume there would be some basic red flags appearing on that year that would lead a doctor to order the further tests needed for a definitive diagnosis.  (A glucose tolerance test is the ‘gold standard’ test but it is not a simple test of giving a vial of blood and I understand for your sake &amp; theirs why it is not immediately been requested) and an MRI scan to confirm. \nI would go back to my GP and ask him to tell you exactly why he dismisses this as a potential diagnosis for you, yes it is rare but it obviously exists, at least if he could point to something in your blood tests that would definitely rule it out, you can stop pursuing the idea and refocus to find your real cause. It may also be an idea to ask to be referred to an endocrinologist. He may be telling what he thinks it is not, but he is hardly helping by not telling you what he think it may be. Or offering you any help with it.    \nI cannot say whether your symptoms are or acromegaly, and I doubt anyone online could either. I did not have some of the symptoms you mention but I did have other symptoms I would think you would notice but you have not mentioned. But I know it is more complex than a simple checklist, each of us is different and even within the narrow field of acromegaly, it can affect each of us in subtly different ways.      \nGo back to your GP and ask him to do some further testing. If he thinks it is not acromegaly, that is great news but what does he think it actually IS? And more importantly how can he help you with it? \nGood luck The other comment posted a lot of good stuff. I want to stress that you should not accept your GP's answer to your concern if you feel there is something going on. There are other tests that can be done to see check your hormone levels, not just for acromegaly. If your insurance allows it I would find an endocrinologist in your network and schedule an appointment with them. If your insurance requires a referral then try to get one from your GP. I wish I knew what to ask and say earlier, so you are one step ahead. I had a similar GP to yours, who just ordered basic tests and swept me under the rug with my complaints. Then when I switched, at my very first appointment, she asked if I knew about acromegaly. She was very astute.\n\n\nBased off my limited knowledge, and not being a doctor, some of these symptoms could possibly be acromegaly-related, but some other ones really do not seem to fit. So I strongly encourage you to not pigeonhole yourself into thinking you have acromegaly (as bias as I am: you do not want this). Best of luck in figuring everything out! I am not a doctor but I can see why you would suspect acromegaly. Although with some of your symptoms that do not exactly fit with acromegaly (tiredness and shortness of breath for example), I would also consider something thyroid related. Everyone is symptoms and experience is a little bit different though, so I think it would be worth checking and getting blood tests. Has your doctor checked any hormone levels other than testosterone? You may need to be persistent about checking at least growth hormone, IGF-1, and thyroid hormones, or get a referral to an endocrinologist. Thank you so much, I cannot tell you how amazing it is to get an such in-depth response like this. I wish my doctor seemed half as concerned as you.  I spent all day Friday calling endocrinologists who take my insurance and I made an appointment with my GP to hopefully get a referral. I was doing some research and apparently it typically takes multiple doctors (like 14!) and an average of 10 years before an acromegaly diagnosis is made. Even if I end up having something else, it is so disappointing that getting genuine medical care is such an uphill battle. \n\nYou are not the first person to point out thyroid issues! My GP said my thyroid panel came back normal and nothing seemed abnormal on my other blood work. I was concerned about PCOS, so I asked for a testosterone test but he said it was unlikely. I got the test ordered anyway from a doctor on an app that lets you speak with MD's for a small fee (it is been a godsend). They also checked my DHEA which was slightly low, but my testosterone was normal. Also, you mentioned seeing an optician which makes me wonder if another one of my symptoms could be related. I am in college and for the past few moths I have noticed during lectures that my vision gets really blurry to the point where i cannot read what is in front of me. It is not constant and seems random so I figured it was caused by allergies or something. \n\nI managed to get an appointment with my GP tomorrow and I am hoping to be more assertive, but I know that in the moment I can get shy and worried about being overbearing. My insurance will not cover specialists unless the primary doctor feels it is necessary so I have my fingers crossed. Thank you again. Thank you! Even if it is not acromegaly, I know that something is up with my body and it is so     upsetting to be immediately shot down by a doctor. My last GP was incredible and took the time to ask questions, listen to me, and was never dismissive. She is no longer on my insurance and I guess this is a wake up call that finding a doctor like her is pretty rare. I have an appointment with my GP tomorrow and I called a bunch of in-network endocrinologists until I found one accepting new patients. Hopefully I can get the referral without too much hassle. He had my DHEA levels checked (they were a little low) and my thyroid panel came back normal. He did point out that my lymph nodes are very swollen and that I should keep an eye on them. They have been noticeable under my jaw on each side for months now and I am not sure if it could be related to my other issues. They do not hurt but they are definitely big enough to spot by just looking at my neck. Again, a lot of acromegaliacs have vision issues, but it is not blurry vision that is the problem either again, although that can be a sign of thyroid problems. \nI am not going to offer any more medical advice because I am not a doctor, and a endocrinologist will obviously have much better knowledge &amp; experience than I, but have you looked at Hashimotos disease? That is awesome you are taking such a proactive approach. It is definitely better than being blindsided. I honestly wish you all the best with figuring everything out. Good luck with the referral, and as friendly as possible: hope to never see you here again. ❤️ The lymph nodes being swollen is concerning but I am not aware of it being related to acromegaly. Sounds like something is going on though, do not give up on your health. I hope you find answers quickly.", "For those who got diagnosed in your late teens, what were the first symptoms you noticed? I am 17M and I stumbled across acromegaly whilst doing some reading online and I have notices a few similar symptoms in myself. Although no one believes me, my jaw and chin seemed to be getting longer compared to last year. I am 5’10”, but I have been told that my hands and feet are pretty big, but I am really skinny so that could make them appear bigger than they are. I have mild hyperhydrosis on my hands, feet, and armpits. Also, I have mild pectus excavatum(sunken chest). I have always had a pretty big head(does not help that I am skinny), but then again, so do some of my relatives. Should I be worried? Or am I being paranoid? Thank you for reading. If I go to the doctor, I know he would disregard it, so it would be really hard to get an mri. At what age did you stop growing? I think I am still growing just a little bit I think that if it was you would have gigantism but get a blood test. an MRI is not your first step. It should be lab work. Long-term acromegaly patient here and a nurse. You need to get some blood work done, should be fairly easy enough. If your doc refuses, ask that his refusal to order the labs be documented in the chart and I would look for another provider.  \nYou definitely need a growth hormone level (which naturally fluctuates throughout the day) and an IGF-1 level (this is a more accurate representation of how high your growth hormone gets over time). They may also order some other endocrine labs.   \nBut that is step one.   \nIf your IGF-1 levels are high, they may also order a Glucose Tolerance Test.   \nYou could just still be going through puberty, but it is worth getting checked out. He is 17, he is not done growing. That is just natural development of an adolescent. And just to clarify, you only develop gigantism if you have acromegly before your growth plates fuse. That is why most adults with acromegaly present with other symptoms and do not actually become a giant. Thanks for your reply, I had a general (I am guessing) blood test done around 4 months ago for my yearly doctors appointment and he said everything was normal. Would indications of acromegaly be shown on that blood test? from what age would someone with too much growth hormone develop acromegaly instead of gigantism? I do not know what tests you had done.\nIGF-1 is your typical first step lab to see if there is a problem. It has to do with your growth plates (bones). Gigantism is just the effect of acromegaly on a skeletal system that has not done fusing. Adults can still have some bone growth but likely not height.\nI was not diagnosed at 16. I bled into my pituitary tumor which cause me to do into diabetes insipidus. I needed surgical intervention to remove that tumor. They did not get it all. The acromegaly developed after that initial incident. It was diagnosed with lab work and confirmed with a pituitary MRI. Ok thanks for the info. In your professional opinion, would you think I had acromegaly? &gt;I was not diagnosed at 16\n\nsorry, my bad then.\n\nthat is what I understood at your topic. I do not diagnose. You need to see a doctor and get lab work done and go from there. It would be impossible for me to make that assessment based on what you have shared.", "Elevated IGF-1 I just had my GH suppression test yesterday and am awaiting results. I am curious about others with acromegaly symptoms. I have not noticed any changes in my hands or feet. I do have Raynaud’s, which I read can be associated. They have not been able to determine why I have Raymaud’s. Some days my face and body are extremely oily but others not so bad. I have developed some body odor I did not have before. I have hirsutism that has gotten worse over the last year. The only difference I can tell in my face is that my wrinkles are horrible and deep and I am only 27. I also cannot gain any weight. I lost about 30 pounds when symptoms presented 2.5 years ago. I have gained back 11. I just can eat and eat and eat and never gain anything. I do sweat badly most days and have terrible night sweats. I also have increased arthralgias. \n\nThe back story is, I had a very lightly elevated prolactin and some other abnormalities. A 6 mm pituitary adenoma was found but my prolactin had gone back down. At the endocrinologist, my IGF-1 was about 80 points too high. \n\nI guess I am just curious about other users with acromegaly and how they knew. I would not think I have acromegaly since I do not particularly notice any actual growth of extremities or face, but some of the other symptoms fit. Prolactin can elevate your IGF-1; I know certain medications can exacerbate it too. I could be completely wrong too, but that is just my experience. There are other things that can elevate your IGF-1 too, and it does not have to be acromegaly.\n\n\nI have no clue how early/subtle symptoms of acromegaly are when it first starts developing. I had no clue I had it until my doctor diagnosed me with it. I gained around 50-60 pounds during the period I was undiagnosed. My symptoms were more than just bone growth, but also sweating and swelling, changes in my bite, changes in mood/energy levels, coarser skin texture, etc.. I know it is not very helpful, but the best you can do is keep working with your endocrinologist. Thank you for your response! I truly do not have many symptoms of acromegaly. Originally, my prolactin was elevated. It was normal on second round of labs and my IGF1 was then elevated. It is all just so confusing honestly. Can I ask what changes in your mood you had? \n\nI will be interested to see what is elevating it because I do not think I have acromegaly. It is all so frustrating. My endocrine system is a mess and it does not seem like my tumor is truly the cause since all my labs just fluctuate. That is kind of what I was leaning towards too (you not having it), but I am not a doctor and cannot say for certain one way or another. There are plenty of hormones that an adenoma can mess with that could be causing your symptoms. Then sometimes the adenoma is just there and does not affect what your pituitary secretes.\n\n\nWhen I was undiagnosed I had my deepest depression ever--complete debilitating depression. Once I had surgery some energy came back, and the depression lessened to some extent, but it did not cure anything.\n\n\nI hope you get some answers. It is frustrating not knowing. I am so glad you are feeling some better. How long did it take you to get diagnosed? I am glad you got your life back somewhat. I know how hard that is. \n\nI definitely feel like I would know if I had acromegaly and would have notice changes to my hands and feet. I just do not know what to think with my prolactin and IGF1 being wonky. I am glad to have an Endo for sure. My life has been in turmoil since my hormones started fluctuating so much. Hey, i used to have  kind of the same symptoms as you.\nAs a 32yo, I had acne, sweating and strong body odor, my hair were growing a lot too, my hands and feet got bigger as my nose, lips, tongue and i have pain like arthritis in arms and knees, I ve gain 20 pounds and I was snoring as an orc.\nI ve got my surgery last February and since there is a bit of a tumor left, I am having injection since 3 month.\n\nI ve lost 12 pounds since, the snoring/sweating/stinking disappeared, my hair grown is back to normal as my skin, my face got thinner as my finger and feet, tho i guess it cannot be totally the same as it used to be. Well, I ve gain nice lips, hairs and big boobs and I learnt makeup contouring, so I guess I have got that goin for me ¯\\_(ツ)_/¯\nStay strong!!! You dropped this \\ \n *** \n^^&amp;#32;To&amp;#32;prevent&amp;#32;anymore&amp;#32;lost&amp;#32;limbs&amp;#32;throughout&amp;#32;Reddit,&amp;#32;correctly&amp;#32;escape&amp;#32;the&amp;#32;arms&amp;#32;and&amp;#32;shoulders&amp;#32;by&amp;#32;typing&amp;#32;the&amp;#32;shrug&amp;#32;as&amp;#32;`¯\\\\\\_(ツ)_/¯`&amp;#32;or&amp;#32;`¯\\\\\\_(ツ)\\_/¯`\n\n ( Thank you for replying! I am so glad that you have had some progress. Will they try to take the rest of the tumor out or will you stay on the injections? \n\nI do not know what is going on with me. My GH suppression test was normal. My IGF1 is back normal. My prolactin is elevated again. It is like I am fluctuating between the two hormones or something. They thought they had all the tumor, but since the shit was close to the carotid artery, they thought I might have to use it, so i guess they did not dig enough, turns out the few leftovers who were invisible at the mri after the surgery started to grow back again so I am getting Lanreotide injection, but I do not know yet how much looking I ll have to need it.\nAbout your hormonal troubles, I do not know, I do not think I had quite the same.\n\nAbout the wrinkles trouble, I did not got a lot since I m taking extra care of my skin, I drink a lot of water, I do not smoke, I use UV cream Everytime it is sunny, I wash my face with extras cold water and I moisturize twice a day. I do a lot of moisturing and exfoliating mask, so with the weight loss the wrinkles went away. Yeahhh, it is way best to leave it alone when it is close like that. Do you tolerate the Lanreotide well? I hope you do not need it too long. \n\nI have not met anyone who has had the same as me with the fluctuating levels. I will get it sorted out eventually! \n\nI have trouble gaining weight. I think my wrinkles would fade if I could gain some. I will try to start moisturizing and exfoliating more though! Thanks for that insight.", "Acromegaly story &amp; looking for some hope! I am new to Reddit, partially because after being diagnosed less than a year ago with a pituitary tumor and acromegaly I have looked for online success stories, resources, etc. and I am unable to find a lot because of how uncommon diagnoses are. To share a bit about my story...I am in my mid twenties and all the sudden my health started declining after I finished college- a ton of weight gain (75 pounds), ice pick/migraine like headaches, skin tags, general swelling of fingers, toes, face, nose, and my appearance started changing. I blamed it on poor eating habits, life changes, weight gain, until one day I had enough and went to the ER and they found a macroadenoma approximately 3.5 cm on my putitary gland. Within the next month, I underwent transphenoidal surgery and I was feeling amazing for a few months. I got my life back. I am lucky to have had one of the top surgeons at a pituitary clinic operate at one of the nation’s top hospitals. The neurosurgeon got all of the tumor (what you can see on an MRI), and my IGF-1 levels went from 1,300 to 350 in just a few months. Fast forward six months: my headaches started returning, I am noticing darker skin around my neck, knees, armpits, like I did before, and I am about to get my 6 month MRI. I also had bloodwork done and my endo contacted me with the results and said that we would talk at the appointment, but my IGF-1 levels are rising (I am not sure how much, I have not seen the tests yet) and that if the MRI comes up clean, medicine would be needed and in the next 6 months I can get my levels back under control. I am extremely anxious and worried; has anyone had this happen to them? I am understanding that in patients with Acromegaly, even after surgery, it is tough to reach a 100% biochemical cure without medication. Is this true? If I am taking medication (Somavert daily injections, for example), will that suppress any further growth of the tumor? Has anyone had a second surgery? Thank you and I would love to hear any stories/experiences with medications for regulating IGF-1! Hi There.\n\nI have a similar story. First diagnosed in 1998, had surgery, then recurred in 2002. I had a gamma knife procedure in 2006 that seemed to work, however I was just rediagnosed this past August with my third recurring tumor.\n\nI am taking Somatulin (every 4-week injection) in an attempt to shrink it. Will attempt another transpheniodal removal in late spring.\n\nUnfortunately, if this does not work for me, I may end up on the medication for the rest of my life as well.\n\nI would speak to your neurosurgeon about the prospect of gamma knife, I know it is not always the appropriate intervention but it may work for you.\n\nThere are risks associated, just like with any medical intervention.\n\nI have been trying to connect with other acromegaly patients myself just in an attempt to discuss treatment options and other's experiences. Thanks for replying! In the next few days I will be getting an MRI and meeting with my neurosurgeon. I am waiting to see his plan of action, but from what the endo said, medication can regulate my levels. If there is a visible regrowth of the tumor, I am sure my surgeon may think otherwise. If you do not mind me asking, did your levels of IGF-1 ever return to normal after any of the surgeries? My surgeon was very pleased with my progress and levels dropping significantly after surgery. He said that most patients do not see a bounce back and there is about a 50% reoccurance of tumor/HGH producing cells. I will have to ask him about gamma knife and see what he thinks. I am just really let down and disappointed with what is going on. Looking at pictures of myself pre-diagnosis compared to post-surgery was emotional, and I do not want to ever return to the way I looked and felt during that time. I am coming to terms with this being a life-long disease, but I want reassurance that it is in fact manageable and it will not take over my life because I am still young and I have basically just started a career/post college life. Yes. But not after surgery. Only after my gamma knife procedure was I off meds and my levels were fine for about 9 years. All my MRI's were normal as well. They are not really sure why it came back. It is definitely frustrating, so I feel you there. \nI have been dealing with this since I was 16 (that was my first pituitary tumor diagnosis) so I completely identify with the feelings of accepting a life long illness.\nMore than anything right now, I struggle with the side effects from the Somatuline (lanreotide). It kills my gut and gives me terrible diarrhea, so I just do not eat a lot anymore. It is been difficult but manageable.\nI hope you have a good support system in your life and have someone to talk to about this as well. Hello - I am sorry to hear that your levels are rising. From my experience, some of the non-surgery options can be effective. My situation is not quite the same as yours, but it is similar in some ways. I had the transsphenoidal surgery about 4 years ago but it was unsuccessful. As a result, I had gamma knife about 6 months later which has been successful in shrinking the adenoma. I have an annual vision test to confirm that the gamma knife did not cause any damage to my optic nerves and so far it has not. \n\nAt the same time as the gamma knife, I started the monthly Somatuline which reduced my IGF-1 levels significantly but not to normal levels - after adding Cabergoline (and some time for the gamma knife to work) my levels came down to an acceptable level. \n\nI am lucky that I do not have many side-effects from the Somatuline, but the Cabergoline makes me dizzy and nauseous - I just need to be careful when standing up too fast, etc. In the grand scheme of things it has not been too bad for me. My hope is that I can stop some of the medication in the next few years.\n\nAnyway, I wish you the best of luck with your continued treatment. If you would ever like some additional first-hand info about my experiences with gamma knife or medication, I would be glad to talk through any of it. Thanks! This week I met with my endo and neurosurgeon. I was put on Somatuline as well. I will probably do my first dose in a week or two. I am hearing that the side effects are nasty. I am hoping this works; my endo says it could even possibly keep the tumor from growing. The neurosurgeon said he cannot see the tumor at this point. IGF went from 250 post surgery (almost normal) to 500. I have a great support system, which makes all this much easier! Thanks for your insight! My doctor explained all the medicine treatments to me, and from what I understand many of them can be paired up and doubled up and they all work to different extents depending on your situation. I am now going to be on monthy injections of Somatuline; I am hoping I, too, do not have side effects! Thanks for the support. Please see my (f45) post to sadelvenmermaid. Am new to this sub (and reddit) but I will answer any questions i can. I had surgery in 2007 but have been on drugs before and ever since because my levels wont return to normal(ish) without them.\n\n Some drugs shrink the tumor, but some just counter the effects of the hormones w/o acting on the tumor itself. Some can kind of do both. If you have a strong preference, talk to your endo to make sure you are managing it how you want.\n\nI used to take somavert (daily shots), but am currently on somatuline depot (lanreotide) + cabergoline.\n\nBtw: Some of the drugs have definitely shrunk my feet, but they are still bigger than usual. :(", "US Resources for those with Acromegaly  \n\nNational Endocrine and Metabolic Diseases Information Service\n\nA service of the National Institute of Diabetes and Digestive and Kidney Disease (NIDDK), National Institutes of Health (NIH)\n\n(\n\nPituitary Network Association\n\nLearn more about pituitary disorders, get contact information about hormonal health hospitals near you, and get answers to frequently asked questions.\n\n(", "Anyone interested in answering a few questions? Hello!\n\nI hope this is ok to post.\n\nI am a swedish writer and  in the book  I am currently writing, my lead male character has acromegaly. I want to portray this as accurately and respectfully as possible. I know a little about the disease as  we suspected my husband might have it a few years back but he did not. \n\nI was wondering if anybody would have the time to answer any questions? Greatful for any answers even if you do not know anything.\n\n1) What, if any, symptoms can one expect even with medication and surgery? What cannot be avoided?\n\n2) What, if any, symptoms can be totally reversed?\n\n3) Has the science evolved a lot  lately? Let us say someone was diagnosed as a teen in the nineties (I understand it is pretty rare for teens but not unheard of), would he have experiences a lot of different medications/ procedures?\n\n4) Anything about how the day to day life of aomeone with acromegaly differs to someone else...\n\nIf you want , you can answer through DM.\n\nThank you in advance 1.  Anger, frustration, headaches, excessive sweating, sometimes diabetes.  Cannot think of anymore at this point but there are more. \n2. That is tricky.  I have always been of the opinion that the adenoma can shrink but never really disappear.\n3. The medication has improved.  They just came out with an oral medication that levels hormone levels and many acro's report their headaches stop.  Teens can certainly have acromegaly or giantism.  It may not be diagnosed as much as it should, but my husbands acro most definitely started in his teens.  He is been on many different meds over the years.  He has been on at least 2 if not 3 clinical trials.  \n4. Yes -  its rough on family.  The highs, the lows, exhaustion, headaches, arthritis, lack of trust in the medical field, dealing with medical insurance companies, anger management issues.  \n\nIf you have more questions you can DM me.  I have been dealing with this (hubby has it) for close to 30 years (maybe a little more). Thank you sooo much for your answer. This is so helpful! And thank you for your offer to DM, I might take you up on it!", "Radiation Treatment Right now I have a lot of tumultuous feelings in my head. So if anyone has experience with receiving radiation I would appreciate if you share your experience, and if it affected your pituitary gland, thyroid, or other things. Right now my radiation oncologist wants to go with stereotatic radiosurgery, but he also mentioned I might have to do the fractionated stereotactic radiotherapy (more treatments over a longer period of time). Of course I would prefer the one high dose of radiation, but it all depends if my adenoma is too close to my optic nerve, or if they cannot map out a way to avoid it receiving too much radiation. \n\n\nIn another post of mine someone said it did not take years for them to see results (but never responded if anything else was affected); however, all of my doctors are telling me it will take around 10 years to fully know how it affected the adenoma, the pituitary gland, the surrounding tissue, my thyroid and body in general. For over two years I have been getting blood work done 1-3 times a month, and MRIs roughly every 3 months. Receiving radiation will only guarantee that will continue, unlike if my levels were able to be normalized through surgery and/or medication alone. Then the Somavert I am taking apparently has a 50% (?!) chance of enlarging my adenoma. Though it seems if combined with radiation it reduces that risk, so that is a little reassuring. I am frustrated, and a little sad; I do not enjoy being in limbo unsure what route we are taking. On a semi-bright note I get to keep the customized face mask I will be using for my radiation treatment. It looks pretty cool, I guess, lol. Hi there. I finally posted a return response about how my pituitary was affected by radiation.  Short answer is I had no adverse affects to pituitary function. Also no adverse affects to thyroid or anything else. Best of luck with radiation. I know can feel uncertain.  After 9 years, Im still glad I did it. I hope your outcome is good too. Im glad to find someone else who is fascinated by the mask. I asked what other patients did with their masks in hopes they might donate them to the Odyssey of the Mind team I coach. The nurse looked shocked and replied that some patients ran over them and others burned them. My team ended up not wanting to use mine, so I have used it for a halloween costume. I would like to use it to make a mold and cast a bust of myself. I would also like to heat it and form it to another object. Ideas for what object would be appreciated. What would you all like to do with your masks? Yeah, all this uncertainty and waiting makes me feel uneasy. I know it is nothing I can control, so it is nice to hear about someone having a positive outcome.\n\n\nWhen I asked what people do with their masks I was told one patient said they would use it as a colander! I am not sure what I will do with mine. Maybe I will use it as a fruit bowl, lol, or put somewhere in the dark recess of my closet to forget about it. So a little update, in case anyone ends up going through this experience too. Maybe it will help you know what to expect.\n\n\nI got my MRIs done for radiation oncology about a week ago. There was a fairly long wait to schedule my MRIs. There were two of them. The first one was longer than the normal MRIs we usually get. The second one was fairly short. Both were with and without contrast.\n\n\nMy doctor's office called to follow up late last week, and I just called them back today. They wanted me to come in tomorrow, so I get to go in and get a CT (with contrast) done. They emphasized I drink plenty of fluids--more than usual.  We will also be going over my treatment plan then as well, from my understanding. As of now it appears we are going forward with radiation. Hopefully I will know more tomorrow. Ended up getting my appointment pushed back to today. It was not what I was expecting. I got fitted for my mask, and had some CT scans done in it. The whole appointment took around two hours. They also scheduled me for my radiation treatment. Everything feels like it is moving very fast. I put off radiation treatment, because as the date approached I was getting more nervous. I also wanted to wait for January's blood work to see where I fell. Surprise: I was outside the acceptable range. So I will be going on daily injections and re-scheduling my radiation treatment. It is been over two years of treatment without success in getting my levels to a stable, acceptable range. So word of advice: if you are going to do radiation make sure you are going to go through with it. Apparently I got lucky my mask did not get thrown out (a very common occurrence), but we still have to refit it to make sure it is a snug fit. I had to have another follow up appointment with the Radiology Oncologist, and will be doing another CT scan with the mask on. I did my radiation. It was not as scary as I was worried about. As long as you stay still the procedure is fairly quick. There is a smell though when the machine is moving around you, at least for me there was. It is kind of a chemical-like smell. It is not pungent, but it is present. Overall, it was kind of a cool experience, and I got to keep my mask, haha. Afterwards I had a slight headache, and felt a little fuzzy or something, but overall the SRS treatment went well. Guess I will know in 2-3 years how successful it really was... good luck to everyone out there.", "Managing Dental Pain Hey all - I (29F) was finally diagnosed with acromegaly 7/2020 and am now recovering from my second transsphenoidal tumor resection (it was a beast of a macroadenoma by the time someone finally ordered imaging). In the last two years I developed TMJ and my bottom teeth have spaced out a bunch - typical acro stuff, but for me it was just another mystery. The dental pain especially is intermittent, and right now I am really struggling with the pain in my teeth. A few days before my most recent surgery I realized that my mouth was starting to ache, and frankly it is only gotten worse. I am now a week out from surgery but still in that period where I should avoid ibuprofen (bleed  risk). Acetaminophen has never been helpful. Does anyone have any tips for dealing with the mouth/jaw pain that accompanies your body still growing uncontrollably as an adult?\nTLDR: my mouth hurts, if you know how to get it to stop I would be really grateful", "Risks connected to the surgery for acromegaly My dad was diagnosed with acromegaly about a month ago, and he is having surgery in a week. It is all gone very sudden, and very out of the blue, as he has very subtle symptoms.\n\nDue to the nature and sound of \"surgery in the brain\", I cannot help but be quite anxious about it - I have tried to calm my nerves a bit by researching the probability for complications post surgery - especially more severe ones, but I have not been able to find anything relevant.\n\nSo here is my question, does anyone have some stats about the specific surgery done on patients with acromegaly? Or any other words of comfort?\n\nIf this question is not well suited for this sub, then please let me know! I am sorry to not answer your question directly, but I will say in preparing for my own surgery, everything I saw stated that having a skilled surgeon who performed the operation regularly improved outcomes.  His surgeon should know their own stats for complication and success rates. My surgeon was able to tell me that a chance of CSF leak was less than 5% and the chance of an arterial leak was, I think, 2-3 percent. He then was able to tell me that if they did damage the artery, there was a 50% chance of repairing it without any brain function loss. The chance of pituitary damage was higher, something like a 15% chance of needing hormone replacement after surgery.  Everyone is tumor is different and in a different spot, it could be close to the optic nerve, it could be close to or wrapped around an artery, it could be putting pressure on the pituitary, it could be into the brain tissue. There are just so many variables. As with any surgery,there are risk and complications Are you talking about pituitary adenoma removal? If so, I have had it and can chime in! One thing to make clear: your pituitary is not brain tissue. It is in the same zip code as your brain, but on the other side of the blood brain barrier and not made of either gray or white matter.\n\nTranssphenoidal endoscopic surgery is a relatively safe procedure, though any anaesthetic encounter comes with an element of risk that is unavoidable. A surgeon who does a high volume of surgeries is the best predictor of success. \n\nFor acro, often surgery is really necessary (especially if the tumor is pushing close to the optic chia am and compromising vision, which is often restored given time and decompression)\n\nFatigue is real. Acro is insidious and systemic, and your dad needs people who can help him advocate for himself. Even if you are not in the UK, I think their site is super comprehensive. There is something on Google for every level of experience reading medical literature, but remember that your dad is an individual, not a statistic. Rest, eat well, ask questions of professionals and hold them accountable for their jobs\n\n Just wanted to add my upvote for The Pituitary Foundation. An incredible amount of resources (they sent my GP stuff as well as us), and one of the best sources of support and advice we found.", "Why Health Screenings Are Important ", "Concerned with the symptoms - are my symptoms aligned or does it sound like something else. So I am 23 yes old and I have had some decent health issues that seem to be really aligned with acromegaly - but is it too early to know? What are some tell tale signs? Also, if it is the case should I get referred to an endocrinologist right away or stick with my family doctor?\n\nAnywho, here are the details:\n\n\n(1) I am very very very sweaty ( and it has a bad odour). I cannot wear any colour other than black because I am sweating nearly all the time despite the temperature.\n(2) my bottom teeth have all spaced out and my dentist said that my jaw has grown. And I have an partial overbite.\n(3) I have acne and oily skin \n(4) I lose feeling in my feet because of the tightness of my shoes\n(5) my forehead is larger\n(6) painful hips\n(7) fatigue\n(8) serious insomnia\n(9) abnormally high cholesterol \n\nI do not have skin tags and I really am unsure if my hands have changed (I have not been paying attention). I also do not think my voice is lower per say (again I have not been paying attention to that). Also, besides like my face changing I have not had excessive growth spurts in my adolescence.\nAnyway, I feel like my doctor keeps beating around the bush at some of these symptoms. Like for my alarmingly high cholesterol levels my doctor keeps telling me to stop eating fast food…but I eat a plant based diet with no processed sugar, gluten, or dairy. I just want to get to the bottom of this. What kind of testing do I need to ask my doctor for?\nThanks I am advance yall I really appreciate it! I am always amazed to hear that doctors are so reluctant to order a simple blood test. Personally, if I were in your situation, I would want my IGF-1 and GH levels checked. If they were normal, the doctor could say, “I told you so.” But why not be preventative and maybe catch something early. Switch doctors! At your first appointment request growth hormone and IGF-1 along with all thyroid, adrenal gland hormones, and prolactin. If a doctor is not listening to you now, that will not suddenly change. SWITCH. Your symptoms sound just like mine and I had a cherry sized tumor on my pituitary that gave me acromegaly. I had a similar situation with the high cholesterol and clean diet. Demand the simple blood test, it could save your quality of life and your life. Can you tell me what your symptoms were, and a little about your journey My first symptom I noticed began three years before I got diagnosed; I lost my period. I went to my graduate school's doctor and she attributed this to the stress of starting a competitive, high stress grad program. Over the year it took to get my masters degree, I also developed persistent facial acne, swollen finger joints, chronic fatigue, and digestive problems. Along with this, my weight began to climb, despite a very active lifestyle and intensive dieting. When I returned to my hometown, my parents commented that I looked different in the face, like I had lost baby fat and I had very prominent facial bones. I started running to combat the weight gain. I was running 10 miles every other day and doing other exercise routines in between, all while constantly reducing what I ate. My fingers became thick and twisted, my eyelids looked swollen, my shoe size went up two sizes, and my mental state was at an all time low. I went to another doctor. She said it was stress and I was just getting older and suggested I exercise more and eat less. By the time quarantine starts, I have developed persistent splitting headaches and severe fatigue. My vision seemed to be getting worse and none of my clothing fit. I could not sleep through the night and I had developed night sweats so severe I was drenched when I woke up. It took me until November of 2020 to try one more doctor. He noticed my cholesterol was fairly elevated despite my lifestyle and recommended I get a battery of specialists and tests. \n\nFinally, in February of 2021, I find out I have elevated growth hormone. I go in for an MRI. They find a cherry sized tumor on my pituitary. The headaches are constant and I have agonizing neck pain. I am so light sensitive, I can barely function without sunglasses. I am constantly sweating a foul smelling stench. My jaw and teeth ache intensely. I have breakdowns several times a week. \n\nMarch 2021, I get my surgery. I have one of the best neurosurgeons in the world. He removes 98% of the tumor, because it turns out the tumor is attached to my artery as well. I stayed the hospital for three days to recover. My right eye was paralyzed by the surgery and I have dizzying double vision. I had a transsphenoidal surgery, so I also cannot breathe. However, I notice immediately that the headaches are gone. No pain whatsoever besides at surgery sites (I also had a fat graft placed on the artery for when I eventually receive game knife to get the rest of the tumor). I did have temporary diabetes insipidus, but that resolved quickly.\n\nI am now three months post surgery. My eye is working again and I am currently taking thyroid medication, as it may have been damaged. However, all of my symptoms have either reduced or completely disappeared. My igf is still too high, but my doctor is confident that gamma knife will set that straight. 10 miles is 16.09 km", "How quickly did you notice changes/what were your symptoms before diagnosis? I am starting to think I have this disease, but I am afraid to go to a doctor to get it diagnosed because I have been going through a lot of health issues for the past year and a half and I am starting to be accused of being a hypochondriac. I am 25f.\n\nLast April I developed insomnia, just constantly waking up for no reason. Then last August I developed daily headaches and hyperhidrosis. I started noticing that the tip of my nose looked a little bigger in pictures around March (not selfies, pictures other people took of me) but I chalked it up to being swollen from crying a lot due to some other health issues. In May I had a bunch of lab tests done to try and figure out what was causing my insomnia and sweating. My thyroid hormones, prolactin, estrogen, progesterone, lh, fsh, hba1c and igfi levels were all normal.\n\nBut since September I have noticed a lot more changes to my face, and I keep feeling pressure and tingling all over it. I have had to make the nosepads of my glasses wider twice now, and it feels like bone directly under skin, not swollen skin. My eyes have become more hooded and my eyebrows look different. A few weeks ago I had weird pressure in my throat for a few days and now my voice sounds a little flatter. Did anyone notice changes to their appearance this quickly? They say you do not get diagnosed until you have roughly had the adenoma growing and doing its thing for 10 years. Talk to you doctor and get your GH tested. I am assuming the \"igfi\" is meant to be IGF-1? If not get that tested too.\n\n\nI noticed changes slowly over the years, but I chalked it up to the weight gain, and the weight gain because of my depression. Then when I had surgery you know what happened? I lost 50 pounds over the course of a few months. Acromegaly affects so much of your body. I have been at a stable weight for over a year now (surgery was over two years ago). So I 100% believe the adenoma was the cause of my weight gain and ALWAYS feeling hungry even when I just ate. I chalked up the swollen joints, hands, feet, legs to the weight gain (or eating salty meals). I chalked up being more sweaty to the weight gain; the more oily, course face to the weight gain; the widening of my face to the weight gain. It hid very well. I wish mine was diagnosed a lot sooner. So, I think your first step is to get your GH tested too, because that is the only one I did not see listed. Does anyone else see the changes you are mentioning in pictures? Are there any other pictures you can use for comparison?\n\n\nBest of luck. Did you realize what you had and asked for the testing, or did your doctor suspect acromegaly and send you for testing? Nope, I had no clue. Hi, my physical symptoms manifested over 12 years. In my late 20's, I could not get pregnant for 3 years. At 28, in my 1st pregnancy, I thought I had arthritis when my elbow ached for several months. Then it moved to my shoulder, then my knee. At 30, in my second pregnancy,  I could not twist the door handle. (More arthritis?), but it was probably bone pain due to growing hand bones. At 32,  I thought my very round face was due to weight gain. At 34,  I went to see my doctor about why I still had milk. He tested me for prolactin producing pituitary tumor, but turns out not. It was really a  HGH producing tumor which was preventing my milk from drying up completely. That is when I got my first, small, infrequent headaches. At 37, after successful removal and subsequent return of the tumor, over a year's period, my bottom jaw grew too large to connect to my upper jaw. Did you have any facial bone changes before the tumor removal, or just swelling and weight gain? Do they know why your jaw grew so quickly after it returned? Your set of symptoms sounds similar to my friend who was eventually diagnosed with a low thyroid, celiac disease and Hashimotos. Her thyroid tests all were negative, even though her experience with thyroid medication was remarkably positive. Apparently,  thyroid tests sometimes have false negatives. A trademark of Hashimotos is a lack of hair on your arms.  I would think the IGH-1 and growth hormone tests would be pretty comprehensive for ruling out Acromegly, but an MRI would be conclusive. My friend also found a compounding pharmacist helpful in regulating all her hormones, but it is a try and test approach that takes 6-8 weeks to see results. Good luck with your discovery. First, to clarify the weight gain: I had water retention which caused a round face prior to the first removal. After recovery from surgery, about 3 days, I started peeing out nearly 2 liters of water every time I used the bathroom for at least 2 days. I had to return a pair of shoes I had just purchased because my feet grew too small for them. 3 years later,  my tumor returned. Before I knew it was back, my jaw grew over a years time. It was not much growth, maybe 3/8\" or maybe 4 millimeters wider. Just enough so the molars no longer line up. I hope that answered your questions. Sorry, I replied in the wrong location. Please see my post replied to your original post.  Thanks", "Did your face (Jaw) go back to normal? Will it ever go back to normal after successful treatment of acromegaly in the next few years? I think the increase in bone in lower jaw is not related to the cortical bone rather its \"Hyperplasic\" means that the cells are too much or over grown. So my theory once the gh levels are stable for years they will go back to normal numbers and so the jaw will get back to its normal shape.", "Wondering How long it takes arthropathy (joints enlargement in hands and cervical and lumbar spine) to reverse if its still too early For some people things never go back to how they were pre-diagnosis. I am 13 years post surgery, I do not &amp; never need to take any further medication, and I am considered as ‘managed’ but neither my hands or my feet ever shrunk back to pre acromegaly days. \n\nMaybe this website can help? It is real patients discussing their symptoms &amp; treatments. I found It really helps to hear the other experiences of real people who have been there rather than even the best intentioned book learning of a medical team. \n\n Thanks so much for this information sir, i never heard of that community before i would gladly join them. A piece of advice for you about hands and feet size i tried honey i was like drinking it everyday like a maniac and to be honest it had huge effects on reduceing my hands and feet to normal size sir its no joke you shouod try it and see 1 jar of honey per 2 days. Good luck! &lt;3 Well actually it is Miss, I think after 13 years I have accepted it will not change for me.     \nAs pleased as I am that things went back to normal for you, it does for some &amp; just does not for others.   \nAnd honestly, I am a huge honey fan too but I really doubt the honey had anything to do with it.... Sorry for my miss spellings as i am typing in mid night with one eye open, I am a certified dentist overseas and I have studied this condition alot in my school years. Actually i believe honey really contributed to it as the results were instanteous it was really obvious. But here i am not talking about regular amount of honey, i did like 1 jar a day of honey i was litterally drinking it. I asked my endocronologist about it he told me that actually honey in large doses is a natural antioxidant that can cause miracles that are unproven in medical books I am a dentist my self i have a huge background on how these meds work to treat patients with acromegaly and I can tell you that miracles happen. So try it you wont lose anything ;) Not that I am doubting your credentials or your endocrinologist, but I really cannot see how an anti-oxidant can reverse bone thickness and growth. And how this simple miracle cure would not be known across the world. Honey very well may have miraculous medicinal properties, but  given the cost of half a jar of honey a day, do not you not think it would be a damn sight cheaper and less dangerous to prescribe this then rather than transphenoidal surgery, laser surgery, radiotherapy or a lifetime of drug treatments? I am pretty sure if it worked that well the other unanimous agreed on treatments of choice by the top medical minds in the world would be redundant by now.   \nI respect your opinions my friend, but it just sounds like you were one of the lucky ones whose body did revert almost immediately, and the honey was just a happy coincidence.\nAs an aside, impaired glucose tolerance (IGT) or diabetes mellitus (DM) are considered a frequent side effect of acromegaly so actually eating that amount of honey is definitely not recommended either. When I talked to my neurosurgeon about this he said two years, and that it was a 50/50 chance. That is just based off his experience. Did it go well for you? Arthropathy wise My acromegaly is still not under control, so I cannot provide any personal experience. I wish you very good luck with your future health status and battling this disease ❤️", "Can anyone relate? So, I had an elevated IGF1. On recheck my IGF1 and GH suppression test were normal. I have excess sweating, oily skin, and body odor but not every day it is more cyclical. I had a colonoscopy and was found to have hyperplastic polyps at a young age, which can be caused by acromegaly. I have skin tags and abnormally large hands also. My doctor seems to believe that with my clinical features, I am in the incipient stages of acromegaly. He said once my IGF1 was consistently elevated, we would remove the tumor. He talked about me being an oddball because I have clinical features but not a steady consistent elevated IGF1. Interestingly, he took one look at my hands and suspected acromegaly the first time I met him. I do have a 4x6 mm pituitary adenoma. He said he just does not want to rush me to surgery until it is absolutely necessary. Has anyone else had fluctuating levels? He did say he would not rely on GH suppression because in some cases that test is unreliable despite being the standard diagnostic test. He is intrigued that I might be one of the first presenting cases of cyclical acro. That is definitely fascinating. I have just regular acromegaly but there can always be edge cases.\nI would continue to monitor labs. Use meds as neccessary.\nAre you seeing both an Endocrinologist and a Neurosurgeon? Did you have your tumor removed? If so, how is quality of life after surgery? He is going to keep an eye on my labs. I will go back in November, which is a bit away but he said acromegaly tends to develop slowly. I am seeing an endocrinologist for now. He does not want to refer me to surgery just yet. I have had 2 resections (bc it kept growing back) and I had a gamma knife procedure (radiation) but my tumor just LOVES to keep on growing. Life was fine after surgery. There is a recovery period obviously and that is kind of brutal. I am on injections now and managed by meds. It is ok but wish I could get rid of the tumor permanently.\nI am not a candidate for surgery now unless it is causing another problem. That sounds so rough. I am sorry you have had to go through so much with it. How old were you when you got diagnosed and how did you know? I have heard gamma knife can be brutal. I worked in oncology for a bit. We had a patient with a pituitary tumor they shrunk with that method. Was yours a macro? I think it is macro.\nOriginally diagnosed in 1998, 16 years old.\nRecurred in 2002.\nGamme knife in 2006.\nThe gamma knife procedure was actually the easiest one. It was an outpatient procedure and very noninvasive.\nIt is been a journey for sure, but it also helps me appreciate every day because you really do not know how much time you have.\n:) Agreed! Thank you for your response. You are awesome. I wish you well in the future. Fingers crossed in hopes your tumor stays well behaved! Thank you. You as well. It is a journey with ups and downs but there is good medicine and evidenced based practices out there to help get us through!", "Symptoms Does acromegaly cause a rapid heart pulse?", "New skin allergy after tumor removal I had a pituitary adenine removed in November 2019. About a month ago, I started to get severe skin irritation/hives, which I deduced to be sensitivity to laundry detergent. I had never had any issue like this before. Is it possible that this is tied to the changes in hormone levels that I have experienced the last few months as they returned to normal? Has anyone else experienced anything similar? I have not had this experience but it could be hormone-related, especially with the hives. The sensitivity to laundry detergent can develop anytime, sadly, regardless of hormones, but I would definitely mention both to your endocrinologist. Thanks for the advice\nThe first time I mentioned it to my endocrinologist he said it was eczema\nBut it did not make sense to me that I developed eczema all over my body, all at once, after never having it in my life\nAlso switching detergents mostly fixed the problem I have not had this experience either, although my understanding is that you can develop an allergy like this at any time in life seemingly from nowhere.  \nIt is also possible that the brand of washing powder changed their format slightly or used slightly different ingredients in the batch you used? \nI do get the occasional patches of dermatitis I never had pre-surgery, but I am sure it is something to do with stress and hormones. I am a stress head and definitely cannot handle stress the same way these ways, so I always just assumed it is stress that is causing it.", "Paid Interview Opportunity Hello all! My name is Sarah and I work for a healthcare research company. Our client has a drug in development for acromegaly and would like us to interview individuals with acromegaly to get your perspective on current treatment and to hear about your experience. We will also give you an overview of the new product to get your opinion of it. This would be a 30-45 min interview. Please feel free to message me directly if you are interested or if you have questions! We will compensate you for your time.", "Acromegaly | NIDDK ", "Best diet? What is the best diet for acromegaly? I tried keto diet and my joints pain got worst. I would say a diet without meat, vegetarian because hormones in animals IGF -1 can be bad for acromegaly.", "Elevated IGF-1, two pituitary microadenomas, vision impairment, and migraines/headaches Hi! I have never posted on Reddit before, but waiting for doctors to get back to me is making me antsy and I could use some advice or words of encouragement.\nA little background: I am a 22 y/o female who was diagnosed with migraines and chronic daily headache back in highschool. It improved significantly when I went to college and has not really been an issue until this year. This April my migraines came back to the point where it was almost daily. And if I did not have a migraine, I had a headache. I have tried probably half a dozen different migraine treatments along with lifestyle changes and holistic medicine, but they still persist. \n\nAt this point it is more like twice a week migraines, but I still have a headache daily and my vision is blurry/just weird even with my contacts or glasses on. My neurologist ordered an MRI and then a pituitary MRI where they found a \"stable 4 x 9 x 7 mm probable proteinaceous pars intermedia cyst or Rathke's cleft cyst, and stable 5 mm cyst within the infundibulum\". She then sent me to an endocrinologist for blood work where I was found to have an elevated IGF-1 of 440.2ng/mL (standard range 107-351 ng/mL). I also have slightly elevated calcium and glucose, but that is just barely so. Besides the headache and vision issues I have not had many symptoms that fit acromegaly. I have always been a sweaty/kind of oily person no matter what I do, and I definitely have not noticed any changes physically. Both my neurologist and endocrinologist, prior to the IGF-1 result, said they think it is unlikely the pituitary cysts are causing my migraines or headaches. I have not heard from my endocrinologist since the results were released (it is automatic so there was no information or notes with the results) and I am driving myself a little nuts. I have done a fair amount of research trying to figure out what all this means, but I am just not sure and getting in contact with my doctors is a challenge. I just started a new job and these migraines have taken over my life; I would really like to have a solution.\n\nSo I guess my question is has anyone had bad headaches or migraines with similar results? What did your doctors do? What do I have ahead of me at this point? Thank you to anyone that took the time to read all of this, I really appreciate any feedback! I would consult with a 2nd Endocrinologist ASAP. There are many great endos out there.\n\nSadly, my first symptoms started with headaches/migraines and double vision when I was 10. I went to the local hospital for a CT scan which is where they found my Pituitary Adenoma. It was the size of a golf ball.\n\nIt sounds as though it could be Acromegaly but I would absolutely get a 2nd opinion if your Endocrinologist is unresponsive.\n\nBest of luck. I do not know anything about the type of cyst you mentioned but after a quick search it sounds like your symptoms could be caused by both of those growths. You are pretty young but it is awesome to catch these things relatively early before other, more long term, symptoms start to develop. Lots of people go decades without knowing they have an issue.\n\nBased on your decreased quality of life due to the migraines and vision, my guess is that your endocrinologist may refer you to a neurosurgeon to have one or both of the masses removed. I have had the procedure, it is called a Transsphenoidal Surgery. They go in through your nose to get to your pituitary. Like anything else, it has risks and benefits. The best advice is to go to a skilled surgeon who does the procedure very regularly. Omg I may very well be the closest match to similar situation! I only had a single pituitary adenoma bit o had to have surgery twice. Please PM me... I will gladly share with you everything I have done in the past 13 years to try and figure it all out... Maybe my path can help you figure yours out sooner than later! \\&gt;Based on your decreased quality of life due to the migraines and vision, my guess is that your endocrinologist may refer you to a neurosurgeon to have one or both of the masses removed. I have had the procedure, it is called a Transsphenoidal Surgery. They go in through your nose to get to your pituitary. Like anything else, it has risks and benefits. The best advice is to go to a skilled surgeon who does the procedure very regularly.\n\nThis would be my take, too.  if they can be easily removed via a successful transphenoidal surgery you potentially have a very good outlook. idk - not a doctor. \n\n\\&gt;You are pretty young but it is awesome to catch these things relatively early before other, more long term, symptoms start to develop. Lots of people go decades without knowing they have an issue.\n\nSeconding this sentiment too.  These are hopefully other factors in your favour. \n\n&amp;#x200B;\n\nGood luck!", "any over the counter or natural remedies out there? Hey all, so I actually have narcolepsy. And for that they prescribe GHB which causes the body to release more growth hormone.  I love this medication and I do not want to stop as it is all that is worked for me. \n\nI had to start drinking \"L-Citrulline DL Malate 2:1\" by another's recommendation 2x a day and it got rid of all the joint pain and tendon pain for me. However, I still have some mild carpel tunnel symptoms. I read that it is edema causing the nerve to swell. I have been increasing my potassium and magnesium with no luck yet. Any one have luck treating that over the counter or naturally?\n\nI cannot afford to continually go to the doctor, I have no insurance... \n\nI appreciate any help so so so much! Think you may get better responses in r/narcolepsy I tried in several groups specific to that medication. The only thing anyone could think of was the \"l-citrulline malate\" solution. The other people who have gotten the carpel tunnel just quit the meds. I figured I would just try everywhere people are knowledgeable on growth hormone b/c I have been looking for a solution for a while.", "Could this be the source of my facial changes? I (38F) just got a Facebook memory reminder of a photo from some time ago, and was shocked by the difference. I look like a completely different person. My nose and jaw in particular.\n\nI first learned of acromegaly about 10 years ago when I had a few abnormal blood tests and was referred to an endocrinologist for a suspected prolactinoma. He did some tests and told me I was fine, and though I had done a bunch of reading about endocrine tumors in advance of my appointment, I basically forgot about it since then.\n\nIs there someone who could look at a few photos from over time and evaluate from that whether it is worth asking my GP to do any testing for acromegaly? I do not want to come off as a hypochondriac (both from embarrassment and because I do not want it to color her opinion on any future health complaints I might bring her, in case I am totally off base here).\n\nThanks in advance! \n\nOther potentially relevant symptoms are extremely difficult weight loss, constant fatigue, and carpal tunnel syndrome.", "Struggling with this disease I have been diagnosed for almost 20 years. On and off meds. Recently, my Somatuline dose is not showing control over my IGF-1 Levels. Started another med on top of that one. I really hate this disease.  \nAnyone in or around the Portland, Oregon/Vancouver, Washington area also struggling that would ever want to chat or meet up, let me know. Would love to commiserate with another acromegaly sufferer like myself and do not know anyone else with this diagnosis.", "Hair loss due to acro? Hey all! I am still in the midst of being diagnosed, but I was wondering if any of you experienced extreme hair loss before being treated for anything. I am a 25F and I used to have such thick curly hair, but now I have about 1/4 of what I used to. I do have high testosterone levels and an elevated growth hormone, but no apparent pituitary tumor. Long time acromegaly patient here. I have not lost hair due to increased IGF-1 levels, but I do know testosterone replacement can thin your hair. I am on that as well (38 M). Chat with your endo. Hair loss can be caused by many things, including stress. I actually had extreme hair loss after my surgery. I lost over half my volume of hair, and it has yet to grow back. My levels still were not under control after the surgery, so it could be possible.", "Ringing in my ears... Hi all, I hope you are all doing well amidst this pandemic. I am still in the process of being diagnosed although my endo did say there was a small tumor on my pituitary about 2x5mm. No treatment yet, but I have noticed over the past week or so ringing in my ears and the feeling of stuffed ears. Similar to how one would feel being on an airplane, except there is nothing I can do to “pop” my ears or alleviate the pressure. Have any of you experienced any similar symptoms? I had consistent ringing at one point, but it coincided with a larger tumor, loss of sight, extreme lethargy, and cyclical headaches every afternoon. My IGF 1 was at 1200. You are early days yet. I would not expect you to exhibit ringing without the large production of IGF 1. Unless it was physical pressure on the ear and your small tumor happens to be too close to the ear? Just guessing here. Hey - the fullness and ringing are a sign of COVID. I have it.", "How fast does acromegaly develop? I am just curious. I got tested in June 2018 because I have hyperprolactinemia and so they automatically test for acromegaly but my IGF levels came back normal then. I am worried that I might have this condition because of some physical changes I have been experiencing but then it could all be just speculation. Both my ending and doctor said I do not have it but I just cannot shake it. So could you develop this disorder in a matter of 7 months to 2 years? Or does it take longer? It depends. A pituitary tumor can grow and change over time. If you have a tumor, it could very well be growing and now effecting your growth hormone levels. I would start with another lab draw, if your values are creeping up, an MRI (with and without contrast) should be your next step.\n\n&amp;#x200B;\n\nI am currently on my third pituitary tumor. I have had a resection twice. So been living with this for a long time (initial acromegaly diagnosis was in 2002).\n\nKeep pushing your docs. They should have no problem ordering labs, that is fairly non-invasive and a responsible use of healthcare funds. First I want to say that you are a very strong person and so I want to thank you so much for taking the time to answer this. I appreciate it so much. Also I was told my multiple people (health care pros) that I do not have it because my IGF is normal and they already tested me so I do not get why I would develop it though it is always in the back of my mind. I should get another lab to make sure. Also I had 2 MRIs last year with and without contrast and they did not find any tumors at all so I am not sure what would cause the acromegaly. It is a mystery to me.  You may want to consider that it is something else. There are lots of other rare and even common endocrine disorders that could be causing your symptoms. I am no doctor but I would request an appointment and insist on pursuing the cause of the symptoms. Thanks I will consider it. My hands and feet are growing crooked and my head is growing or expaning especially my forehead is growing taller and wider. I cannot think of anything else but acromegaly My pituitary tumor was found in June 2004. It was monitored for years, as well as my prolactin. I started gaining weight like crazy. I was 98 lbs when I graduated in May 2004. I was 140ish when I got married in 2008.\n\nMy first endocrinologist never checked my igf levels, she just called me obese and made me cry. When I went to my endo I have now, she took one look at me and immediately suspected acro. I am only 5’1 but my hands and feet were big and swollen, my skin is thick in my face.\n\nMy igf levels were 450 in sept 2011 (normal for my age at the time was below 300. I was 25.) she checked them again in November, they were 600. In feb before my surgery it was over 1000. So I would say we caught the rise as it was happening.\n\nI will share some pictures, to give you more of an understanding. 98.0 lbs ≈ 44.5 kilograms ^(1 pound ≈ 0.45kg)\n\n\n\n^(I am a bot. Downvote to remove.) \n\n_____\n\n  ^| ^( ^| ^( ^| ^( ^| ^( ^| ^( ^| Thank you so much for the response. It means a lot to me. You can share pictures if you wish that would be helpful. So it took several years to see the changes? For me its my forehead go wider, jaw, face wider hands and feet crooked. Lots of swelling? Does that sound like it to you? Thanks again!   Thank you SO much for sharing. I admire your strength and resilience when it comes to this. You are amazing. Also thank you for listening to me &lt;3 Well in 2018 I was diagnosed with hyperprolactinimea (I was on Invega Sustenna) and that is pituitary related. I had 2 MRIs (with and without contrast) last year and they found no tumors at all. My IGF levels were normal in June 2018. However I feel something being secreted by my pineal gland and I have things like crooked hands and feet now, face seemed to have gotten bigger same with the tongue, swelling. I feel so self conscious. Worse is none of my doctors are taking me seriously they are just brushing it off as me being manic and its so upsetting. Also is the symptoms of acromegaly like bone growth are they reversible? You really only have long bone growth prior to and during puberty. As adults our growth plates are firm and so you mostly see soft tissue growth and changes. Some smaller bones like your feet MAY grow but not much and I do not think that would be reversible. Ah I see so facial bone changes would not be reversible? Hi. If you have acro, some meds will reduce swelling if your facial changes are due to that. If it is bone growth on your face, that can only be fixed with reconstructive surgery. Mine was jaw growth and i had surgery. You can read details of my experience in replies to an earlier recent post.\n\nEven if it is not acro, please continue to post if you need support or have questions about surgery. Thank you so much!! That is very helpful. It could possibly be PCOS inflammation that is making my face look larger. My receding hairline could be making my forehead look bigger. And the hands and feet could be due to the birth control inducing Rheumatoid Arthritis because that only appeared the month I started taking it. Either way I want the test done again. But again thank you so much for your response it means so much!! ", "Bones reverting back to normal (or close to) once levels are stable. I know we have a rare hormone condition. I know there are very little resources for us, minus what our doctors tell us. I just wanted to share this information I got from my neurosurgeon today, because I am struggling with how acromegaly has affected me physically. I am sure someone out there is too, or will be, and hopefully this will help. He said that 50-60% of people he has seen see their bones (specifically their face) revert back to normal after two to three years, with normal levels. I told him, \"not to be a Google doctor\" I was a bit skeptical as everything I have read said they do not. He assured me he usually sees it happen, and they go back to how they looked before or close to it. He said if I get plastic surgery now that I might end up hating it two to three years down the road, because my bones were still changing. So, I guess there is hope that even our bones are not permanently affected by acromegaly.\n\n\nI have now had two test results come back with everything in the normal range. It is been a fight for two years, as my levels did not improve after surgery. I was facing getting radiation, another surgery, or daily injections (on top of my monthly one) if my levels did not improve. Thankfully all it took was doubling up on my oral medicine. If anyone has been diagnosed with acromegaly, and needs someone to talk to: I am here. Just send me a PM, or even respond to this thread (I will get the alert). I have had this for almost 20 years. Once igf1 is under control you will definitely notice that your face changes and your features become more refined. \n\nAs you probably know it is very common for surgery not to result in a cure and meds are required. Where carbegoline fails, it is then on to octreotide or lanreotide, then pasireotide and/or pegvisomant. Radiotherapy comes with other risks (hypopituitarism where you end up not producing sufficient levels of a range of other important/ essential hormones).\n\nIts a bit of trial and error with the meds but hopefully you will land with one that works for you. It is worth reading the latest consensus statement on acromegaly:\n \n\nI hope you end up getting the meds that work for you. A good endocrinologist is essential. Take care. Hey, I appreciate the response! I will be looking at that link right after this post. \n\n\nYeah, I was warned surgery would not fix everything, but was told Somatuline usually fixes most people's levels. So, yes, I am already on lanoretide--have been for almost two years. The Cabergoline is not too new either, but doubling its dose is. My doctors have already talked about Pegvisomant being the next step, but I really did not want it to get that far. Getting stabbed in the butt once a month is enough for me, lol. They offered radiation but said I would not see results for up to 10 years. They also said having a second, more aggressive surgery, would likely kill my pituitary gland, forcing me to take even more meds.\n\n\nThank you for the reassurance on the whole facial feature thing. It is good to know my neurosurgeon still knows what he is talking about, haha. I do like my endocrinologist, and he definitely seems to be knowledgeable about treating acromegaly. I just wanted this to be \"fixed\" already. Glad that you are happy with your endocrinologist, that is really important. I know how you feel about wanting it fixed already! It took me a while to get things under control. Before heading to pegvisomant, it is definitely worth talking to your doctor about pasireotide, which is only a once a month shot as well but operates on additional receptors (some people do not express the two receptors that lanreotide and octreotide work on (I did not) but do respond to pasireotide, so that is usually the next step. \n\nWithin a week or two lots of the swelling went down, joints stopped hurting, no night sweats etc. Quite remarkable. And then over a few years facial features sort of shrink back. It is an insidious disease but the options are so much greater then they were even 10 years ago and once you find something that gets that igf1 under control it is as though you do not even have it. So hang in there, one step at a time and you will get there. I think my endocrinologist did mention it, as he gave me a bunch of options. I could have doubled my Somatuline dose above the recommended levels (which I see is mentioned in that link), he mentioned another drug, and then Somavert. He did not want to go full radiation or surgery just yet. But he mentioned it is hard to get insurances to cover Somavert, due to the cost, so he started me on Cabergoline first. My prolactin levels were still relatively high too. I believe he mentioned that Somavert is more aggressive and would be a good combination with the Somatuline, but I could be mis-remembering. I will definitely ask about the pasireotide though, because I know Somavert came with some nasty side effects.\n\n\nThat is reassuring. It is just that last month's blood work was the first time all my levels were normal. My doctors were really hopeful that we finally got me stabilized, and I guess that started affecting me too. Then to find out my IGF-1 spiked up again was really demoralizing. I was hoping to start my recovery from what Acromegaly has done to me, and that just got ripped from my hands. I am having a hard time accepting it, so I really appreciate you reaching out.\n\n\nOne other thing I am curious about... did your thyroid (and all the cyst nodules) shrink or disappear once you got your Arcomegaly under control? I did not have major issues with my thyroid, only the adenoma on my pituitary. \n\nAfter a while with levels going up and down it is a bit of a rollercoaster but although it is a cliche, taking one day at a time helps and also developing a general acceptance that there will be a few set backs here and there but remember that they are only passing through and you will get there in the end! \n\nI seem to recall that pasireotide is a bit cheaper then pegvisomant so I hope your insurance comes to the party if the current meds do not work out. I did radiation in the form of cyberknife surgery after 2 failed surgeries in 2010. (My tumor surrounds my carotid artery and they could not cut it out without severing my artery). Within 3 months my tumor shrunk by 50 percent and has remained stable (not growing) ever since. I did 20 LAN Octreotide with great success at keeping Igf-1 levels normal beginning a short time after surgery until 2017, when I lost insurance. My symptoms have remained absent since then even without Octreatide. My neurosurgeon,  Dr. William White, who pioneered the transnasal resection surgery at Barrows Neurological center, related that it sometimes happens where patients stabalize to a normal Igf-1 after taking Octreatide for a period of years and can go off drug therapy permenantly. I hope that is what is happened with me. It certainly did not take 10 years to see results of radiation for me. I got the impression that cyberknife was pretty new back then, and they didnt really know what to expect, so they were surprised and pleased with the results. The receptionist told me they only used the machine about 12 times that year (and not just for pituitay tumors). I hope my experience is hopeful for those in the midst of the struggle. I appreciate you sharing your experience! I have heard good things about the Gamma Knife, but my doctors seem to want to try other medication options before going that route. It is reassuring to know it did not take 10 years to see results. Did the radiation end up negatively impacting your pituitary to where you needed to take other medication, or was that unaffected too?\n\n\nI see my endocrinologist on Wednesday and really hope he still is not pushing for the daily injections as my best option right now. They have also stated once levels are stabilized there is a chance I can be fully weaned off all medication, it is just getting to that point that is proving frustrating. Apparently Somatuline also helps reduce tumor size, but that sadly has not been the case for me. I have been on the max recommended dosage for over 1.5 years now. Just thought I would post a reply to myself to update the information here.\n\n\nI saw my endocrinologist today. I will be starting the daily injections of Somavert, but was warned it could be a couple weeks until insurance approves it. It is apparently very expensive. We are reducing my Cabergoline back to my original dose. He was still not for a second surgery or radiation. Repeating that it would probably take me 10 years to see full results with radiation, and surgery would most likely compromise my pituitary gland and put me on extra medications (radiation also runs that risk too). He said that Somatuline is a stronger version of Sandostatin, and the next progression was Somavert in terms of potency. He again said we could try 180mg of Somatuline, but it would then be off-label for that level of dosage. I have struggled with side effects from the Somatuline so I really did not want to go that route, and he did not seem that confident either. I think he is also concerned because I am still experiencing Acromegaly symptoms. Then just the typical blood work, MRI, follow-up stuff three months after I start the Somavert. The headaches are getting really bad again, so I am hoping this new treatment will help with that and the other symptoms.  My pituitary has successfully functioned prior to and after surgery and cyberknife. I have never needed to supplement for pituitary function.  Good luck with radiation. I am unfamiliar with Somovert, but hope it does good things alongside Gammaknife. When my headaches were bad, I had a series of them lasting from 1pm to 4pm daily, 2 minutes long and 10 minutes apart. My IGF-1 at the time was almost 1200. Anybody else have cyclical headaches like this? That is so reassuring to hear your pituitary gland was not affected! It is not guaranteed yet that I will be getting the stereotactic radiosurgery, but more than likely that will be the route we go. I am getting another MRI done within a week for them to start mapping out everything.\n\n\nMy headaches were all over the place. They would come and go throughout the day, or last all day, so I cannot say mine were like that.", "High IGF, normal GH? Does anyone have any experience with this? I have had slowly escalating IGF levels (pituitary surgery 2 years ago, remission since) but my GH is normal and my oGTT is normal. The symptoms of this disease are so nuanced that I am not sure that I am having recurrence. My latest MRI shows a small cyst and post-surgical scarring but no apparent tumor. \n\nI have seen studies about elevated IGF and normal GH being linked to early disease process but my endocrinologist disagrees. She is admittedly not an expert in this field, but seems skeptical that there is any active disease. Does anyone have any experience with this? I know our community is small, but I would like any input! I am not sure, as I have not experienced this. I did find this after a quick search. It would appear it can be normal and not mean acromegaly has become active again. (\n\n\nI have never had to do the OGTT. Mine has always been via blood work without the glucose. Currently I have elevated IGF-1 levels and slightly below average GH. I also have scarring, and a cyst, which they now think may still be part of the tumor. My endocrinologist and neurosurgeon are concerned, and are talking about possibly adding more medication, or another surgery, or radiation. But I have never been in remission, and even after surgery we have been battling to get my levels normal. So I think this is one of those nuances. But I did want to add all that to valid that your concern is justified.\n\n\nIs it possible to find an endocrinologist who specializes in acromegaly, or someone who is more familiar with it? Maybe ask for just blood work without the glucose? I have experienced this! How many times have you tested your IGF? First time I was testes IGF came back as elevated, the fasting GH came back normal. I waited 3 months and we tested my IGF again and it was in the normal range. My Endocrinologist is confident that the first test was a false positive. Let me know what else you found out. Thank you so much for the reply! My endo is admittedly new to this, as my regular endo retired. The endocrinologist at the university where I had my tumor removed is booked over 6 months ahead. My husband and I are trying to conceive (I am now semi-panhypopituitary) and have had to put fertility treatment aside for my health despite wanting a kid like it is no tomorrow.\n\nI did not have the OGTT on diagnosis. My IGF was over 1000 and GH &gt;9. Now I have a normal GH but elevated IGF. This alone was enough for my doctor to halt fertility treatment. I just feel like I am in limbo with no reassurance that there will ever be an answer. IGF elevated the last three checks, spanned over 4 months. OGTT and GH are normal and my scan did not show any residual tumor. I am so sorry to hear this is interfering with you trying to conceive! I hope it gets figured out in a timely manner. I wish there were more resources for us. Are all your tests after a 12 hour fast? Yes. From what I understand about Acromegaly is that you have to have two things to confirm the disease; a high IGF and a high GH only after a glucose test (both test done while fasting) it is possible that you may just have high IGF. Some people just run high but never develop the disease. Keep us posted. When you say you read research it is sign of early disease process, which disease ? Acromegaly. IGF is the \"gold standard\" hormone to measure in this disease. Not much else affects IGF. Can I ask you how high is your IGF now? Mine is elevated 2x already but GH is normal, prolactin was slightly elevated few times but normal now. Dr said “it is nothing”. But I have a bunch of odd symptoms so trying to find answers. Update:\n\nAfter four months of elevated IGF levels, my endo and I decided to start treatment with cabergoline but decided to get a baseline IGF and GH to get ready for treatment. \n\nI had not even picked the cabergoline up yet when my endo called and said my IGF was back to normal. She is just as stumped as I am. It dropped over 100 in a month.\n\nMy theory is the progesterone treatment I took early this year to start my period interfered. I no longer naturally get a period after pituitary damage.\n\nI will find out for sure in a couple weeks when we test again, but we now know that IGF is not such a reliable biomarker, at least for me.\n\nThe important takeaway for me: I am still in remission. My tumor is not back. No drugs. I am still in good shape. I am so happy to hear this! Thanks for the update!", "I am concerned that I have acromegaly. My face has not changed much except for my lips and forehead. I also have many of the other additional symptoms.What are early signs and symptoms? Where do I go from here?  I definitely do not see any red flags on your face, but I am not really good at spotting it on faces. Do you have any new bite issues? My jaw grew and really messed up my bite, dental referrals for changing bite and jaw alignment are one of the leading ways that people get diagnosed. Depending on your age, shoe size going up, or hands growing and rings no longer fitting. I do. My bottom teeth have all spaced out in the past 2 years and I also now have a partial overbite. They also said my jaw has grown… I just made a text post to include my other symptoms as well. Tanks for your response thought! That is really really helpful! Ask your doctor to check your human growth hormone (HGH) and insulin growth like factor 1 (IGF-1) The first step is always an appt with a medical provider for both a physical and assessment of the symptoms you are experiencing. Scroll down here in the group,you will see 3 infographics mentioning all symptoms. You need to do blood tests for IGF 1 and GH growth hormones. You will need a referral to consult endocrinologist. Getting a proper DX for acromegaly can take time because it is a rare disease. You look very normal to me. Do an IGF and Growth hormone test immediately if you feel you may have acromegaly.", "Did you experience any changes after surgery? Specifically related to ring size, shoe size and facial appearance.  My ring size went back down and my feet stopped swelling as much. I also lost some of the harshness in my facial features that developed, but still have some notable differences to how I looked previously. Hang in there and I wish you the best with your surgery! My surgery was not curative but with radiation and medication, my ring size is down a bit. My feet did not shrink.", "Breakthroughs in Treatment Dosing Increase Access to Life-Changing Medication for Acromegaly Patients  Thankfully, my insurance fully covers my 20mg daily pegvisoment dose, but it would be nice to not need a daily injection. Does anyone else around here require pegvisoment for control? This is good to hear - I will have to ask my endocrinologist about it. I am on lanreotide and it is expensive but not as expensive as the daily injection mentioned here. Sandostatin LAR was barely budging my IGF-1 numbers, I was staying in the high 400s. An acromegaly Facebook group I am a part of had a lot of mentions of the combination therapy. I asked my Endo about it and have been on 20mg once a week for a little over a month. It has dropped me into the 380s which is just about a 100 drop for me. She just increased to twice a week for me and I am really excited because I feel better than I have in a long time. I am hoping twice a week drops me into normal range but it might take 3x a week.  My Endo said they work better together for some reason. I could not get any lower than 680 on any of the other meds. I am just glad something worked.\n\nEdit: I am glad you are feeling better and that the combo treatment is hopefully working for you!", "Is it possible to have acromegally without Feet and handa growth?\n\nMy lips and nose are growing over time...\n\nThis are my lips without doing any effort to make them apparently smaller\n\nIve always had thick lips since child, but this is another level.\n\n\n\nThanks. Lab work will be your definitive answer. See a doctor and get worked up for it. thanks for your answer, regarding acromegaly without hands growing, do you know if that is possible? I do not. Symptoms can vary among patients. That is why you really need a work up with an endocrinologist.", "Low GH High IGF1 Hello Guys.\n\nWaiting to hear back from my specialist but have been doing multiple tests to determine whether or not I have acromegaly. I recently got a test and my IGF-1 is elevated past normal ranges however my GH is less than 1. Did any one else have similar conditions?\n\n&amp;#x200B;\n\nI am 25M and do not believe I yet experienced many symptoms, however I due to delays and botched surpression tests I am sitting here anxious on the possible outcome.\n\n&amp;#x200B;\n\nMost of the time acromegaly shows increased GH and IGF1 so I was just wondering if anyone had any results similar to mine and what their outcome was?\n\n&amp;#x200B;\n\nAny and all help would be appreciated guys, as this is more anxiety awaiting tests on top of an already challenging month. How high is your IGF1? Asking bc I am in the same boat as you. IGF1: 353,7ng/ml. Normal range: 80,0 - 255,0. This was found by random bc it was planned to get HGH injections to heal another disease of mine. Now I probably need to get a head MRT. Hi in the same boat as you, I am Dad👨 I do not remember off the top of my head however my results were not that far out of the higher range. The doctor did not want me to proceed to have an MRI after a growth hormone suppression test so I am not sure if I would be of any help. I am 26, high igf 1 and low GH. No signs of acromegaly but my endocrinologist wants to test me again in 3 months. My Ifg one has been in the 380 range and my GH has been like .3.  \n\n\nI had a brain MRI because of slightly high prolactin (it is normal now). No pituitary tumor but partially empty sells syndrome.", "Medication a cause? Can acromegaly be caused or triggered by medication like a glucocorticoid ? I believe it can cause the opposite issue, growth failure, so I would not think it would be a cause in acromegaly.    \nAs far as I am aware the only know cause is a tumour, in the pituitary gland usually but can be in the lungs, pancreas or liver, that secretes a excess of a growth-hormone related endocrine. So I would have to say a medication with known possible side effects of stopping growth does not sound a likely cause, however I am not a doctor.", "Lab results are in, follow up in November ", "What is causing elevated growth hormone?? Hi all! I hope you are all doing well and staying healthy. I have been busy with appointments and I have found myself with more questions than answers. Upon seeing the best pituitary specialists on the west coast, I was told they could not be of assistance because there is no apparent tumor on my pituitary gland. It appears to just be a cyst that will not require surgery. Although my growth hormone suppression test has come back elevated twice and my IGF-1 has come back elevated once out of the three times I was tested. I have all the symptoms of acromegaly, but none affect me as much as my appearance change over the past 8 years or so. I have seen myself slowly change and it is to the point now that my jaw bite is off, hats are tighter and I do not even recognize myself anymore. Family members and friends will saw they do not notice a huge difference, but no one knows your body like you do...this is an emotional and psychological pain I truly would not wish upon anyone. This is all only amplified by the fact that there seems to be no treatment or answers for me. I have elevated testosterone, elevated calcium levels and elevated growth hormone but no pituitary tumor...does anyone know any other possibilities of what exactly could be causing this elevated growth hormone? I know it is very very rare that a tumor elsewhere in the body could be secreting growth hormone, but I am going to ask for a full body scan just in case. If it is not that I truly have no idea what could be causing this and if it will ever be fixed. I think adrenal glands is another possibility, try researching that. This disease sucks. Even when you think you have answers, you end up with more questions. I wish you luck. Hi I am sorry you have had such a rough time and I do not know if this may help, but where is your cyst? Is it possible it is anterior located on your pituitary gland as that is the area that impact the GH levels I understand. Have ypir specialists done a contrast MRI scan of your pituitary gland? A normal MRI has limited success at best in revealing the growths. I ask as the location of my macroadenoma was anterior. Could the cyst be damaging the anterior and triggering the elevated hormone levels perhaps? I do hope you find a solution, I understand - as does anyone who has the condition or is now in remission - how ghastly it is and how hard it is to deal with. Wishing you all the best. I completely understand what you are going through and saying for over 15 years now I have had to deal with the same battle with my IGF 1. And prolactin.   I thought it was being managed well until 10 years ago  my body started changing again and another tumor was found and was more difficult to treat.  Earlier this year my Vitiman D levels dropped drastically and my IGF 1 shout up to 107, a second tumor was found on the opposite of my platuitary gland. My doctor's have no answers", "Help symptoms Hi,\n\nI have acromegaly facial features, will check if I have this condition (very rough facial features, progressibly worse), should had been done years ago, I have some questions:\n\n&amp;#x200B;\n\n1 - Besides the facial features do you have also have / had any of the following symptoms?\n\n\\- heat intolerance.\n\n\\- face more swolen some days than the others? it seems to be related to when I eat more healthy my face gets more swolen, when I eat crap with sugar and less healthy food my face gets less swolen. Or in your case was pretty constant?\n\n\\- burning in the face skin?\n\n\\- pulmonary hypertension 30mmHg\n\n\\- hypertension\n\n\\- weak beard, really weak. I am on my 30s\n\n\\- Extremly thick skin.\n\n&amp;#x200B;\n\n2 - Should I go directly to an endocronologist? Or general practitioner?\n\n&amp;#x200B;\n\nThank you for your time.", "Is frontal bossing (Forehead enlargement) reversible after remission?  Potentially. I think it would depend on how much bone formation in the skull was expanded during the period of growth with no treatment. Definitely something worth discussing with your provider (endocrinologist). I think it depends on how much growth &amp; how soon you receive treatment. Speak to your specialist but also be aware you are probably more aware of it than anyone else is, I am acutely aware of mine but people I have met since who did not know me before do not know there was ever a problem or think there is anything different about my face", "IGF-1 Values With Treatment Timeline  50% of acromegaly take in alone or in combination with other meds dostinex.", "My looooooooooong story of getting diagnosed with acromegaly. I was diagnosed with acromegaly caused by a pituitary macroadenoma in 2007 at the age of 22. Because of the subtle onset and seemingly unrelated symptoms it can take years before a person is diagnosed, and I was no exception. \n\nFor years I watched as my body gained more and more weight, and there seemed to be little I could do to change that fact, an aunt who I had not seen in over a year commented on how my voice sounded huskier, I became more and more depressed (and because of this I started shutting people out of my life and losing parts of myself). About a year before my diagnosis, my period starting going haywire, I would have it one month, and then nothing the next, before it eventually vanished, when I would asked my doctor about it she thought it might just be stress-related, as I was a full time student working two jobs. I began getting intermittent mind-splitting headaches because of the extra pressure resulting from the growing tumor in my brain space that I did not know I had. Nothing helped but time and a dark room. I began sleeping more and more, and it was never enough. I dropped out of school the semester before my diagnosis because I could not muster up enough energy to make it into class, I began sleeping 18+ hours a day. It took all that I had to not give up entirely, suicide became more and more appealing. \n\nYou see I blamed myself, I thought I was not enough, that everything was a flaw in my character and will power. I had failed school, I would quit one job, I could not keep from gaining weight, I was always in a dull state of pain, my face was changing (which I thought was from the weight), and the fatigue. The fatigue was the most bittersweet part. I hated being so tired, but sleep was the only refuge I could find, so I opened up my heart and arms, and clung to the numbness it offered. It was not until I began noticing changes in my vision, before the truth finally revealed itself, however my optometrist was booked out 2 months in advance. \n\nThe day of my eye appointment finally came, at the end of the visit the optometrist told me my vision was as expected, my nearsightedness was continually it is trend of growing worse with age. I then asked why it was that I could not see the outside edges of the eye chart with each individual eye, she took note and began a different evaluation, and declared that I must have suffered from a mild stroke to account for this abnormality. I was incredulous. A stroke?! In my indignant state I phoned my mom, and told her the diagnois, she did not believe it either, and instructed me to seek a second opinion from a friend of hers, an ophthalmologist. The doctor was very friendly and agreed to see me after his last patient of the day (which to this day I cannot thank him enough for doing). Within 5 minutes of my appointment with him, he said he was 99% certain that I had a pituitary tumor that was putting pressure on my optic chiasm, resulting in the loss of the outside edges of my visual field. He ordered an MRI. A couple days later the MRI confirmed his diagnosis-- I had a pituitary macroadenoma the size of a golf ball. \n\nA week after that I had an appointment with a neural surgeon and later an endocrinologist who both further diagnosed me with acromegaly as the result of the pituitary tumor. And with that all my weird un-synchronistic symptoms finally made sense, there was an answer and the answer was not my own ineptitude. Finally I had hope. The major brain surgery I was facing in a few days time did not faze me. I was finally happy, drunk from the hope of the end to all my suffering. \n\nBy sharing my story, and creating this page, I hope I am able to help others suffering from this disorder, and provide necessary awareness that it in fact exists at all. I still blame myself for not being more proactive in my healthcare and getting diagnosed sooner, and with more awareness I want to help prevent others from going through this. When I think about how I wanted to end my life when everything was at its very worst, I am thankful what residual strength I had not to. This strength came mostly from my family, who have been with me every step of the way of my diagnosis and treatment. \n\nI do not claim to be an expert, but I have lived (and continue to live) through it, so please feel free to ask me any questions you may have, and I will try my best to answer them. I nearly cried reading this. I am so glad that I am not alone.\n\n(sorry for my really long answer, but I need to talk to someone)\n\nMy experience has been very different from yours in a few ways, but much of it was the same for me.\n\nI was told that I had Major Depression in high school (I do not think I did) but I kept pressing for answers. My emotional state was fine in my late teen years, but my body slowly started degrading. I was in constant physical pain, my muscles and joints, and had very bad migraines (they only stopped for a while after having my wisdom teeth removed). Any exercise would wear me out for days. My head felt foggy and the memory loss began. I also had a lot of abdominal pain. They told me I had Chronic Fatigue Syndrome, fibromyalgia, and Irritable Bowel Syndrome.\n\nI got better for a little while in college, but things suddenly went downhill very fast. My vision got terrible over the course of a few months, but glasses did not help me. Things were a little more clear, but the new glasses made me feel so dizzy and nauseated that I could not wear them. I asked if my prescription had changed but the optometrist said it had not. Around this time I had an MRI because of my frequent migraines, but everything came back \"normal.\"\n\nAt this point I could barely even think straight any more. I could barely remember things, I was like an old person with dementia. My grades suffered. It was also impossible to stay awake (I frequently had sleep attacks in the middle of class or even while driving) so they put me on all kinds of stimulants. It did not work, so I dropped out of college and stopped all my drugs. I was soon diagnosed with \"probable\" Narcolepsy after a nap test confirmed that I was hitting REM sleep within minutes.\n\nI then started a new job working full time at a store. I was hired to be on the sales floor but those lying assholes made work in the stock room instead, moving heavy boxes all day long. My physical pain had never been that bad in my life. The arches of my feet began collapsing and bunions started forming in only a few months. I was extremely exhausted and my boss always asked me if I was showing up to work on drugs (of course, I was only taking the stimulants for narcolepsy).\n\nSoon my muscles gave out and I was incredibly weak. I started losing balance and dropping things or falling. My fingers became clumsy and I could not walk right; it was all stumbling like a drunk. My hands started to shake and I started to stutter a bit. It became harder to articulate what I was trying to say as well, and my jaw and tongue did not seem to work right. It even became hard to chew.\n\nA few weeks ago I was fired for poor performance (I am too weak to move all their fucking boxes). Now I usually just lay on the floor most of the day waiting for my roommate to come home and help me stand up. It is getting harder to breathe, my brain feels like jelly, and my hands and feet do not work right. \n\nI have been to doctor after doctor trying to get my life back. They just kept shrugging it off as fibromyalgia without even offering me any treatment options. It was not until I saw this nice Gynecologist (I have had spotting every day for 2 full months now) and he ran a bunch of tests to try to help me figure out my fatigue. One of the things he thought to check was the possibility of low IGF1 levels.\n\nStrangely enough, it was the opposite.\n\nIGF-1 value 625, standard range 108-548 (77 over range)\n\nI went to an endocrinologist and she said \"you do not LOOK like someone with acromegaly\" and shrugged me off without offering any help.\n\nI went back to that Gyno and he was shocked. He said he would never seen someone as young as me with levels that high before. He thought the lab made a mistake, so he ordered tests from a different lab.\n\nThis morning I checked my medical records online and saw this:\n\nIGF-1 value 594, standard range 138-442 (152 over range)\n\nIGF-1 binding protein 3 value 8.0, standard range 3.0-7.3 (0.7 over range)\n\nI do not know what to make of this. The only thing I know of that can cause this would be acromegaly. I am lost and scared right now because my symptoms do not seem typical for it either.\n\nI turn 20 this month. I am so much younger than most people with acromegaly. It sounds like you have also been dealing with this since you were nearly this young. How did you do it? How did you cope with this? The biggest lesson I have learned from all of this is being an active participant in my health care, and trusting my body when something is or is not right. I work in the health care field now, and I see far too many people be passive participants, or not participate at all. \nI would suggest starting over again with your PCP, or a different one, or even your gyno, state all the symptoms you have been having, include your lab results. And ask for f/u labs, and a Brain MRI w/&amp;w/o contrast (w/ contrast is important in a radiologist getting a good view of the pituitary gland). \nAnother good idea, as your having problems with your vision, would be to set up an appt with an ophthalmologist and get a visual field test ( A quick test to help determine whether you are experiencing visual field loss is to stare straight ahead and use a finger or a pen and bring it to the outermost aspect of you peripheral vision, moving along the same plane as your eyes slowly bring the object closer towards your center line moving in an arc.     Take note of where you initially see the object. It is best to do this with another person, to diminish bias, they can hold up multiple fingers or objects and ask you to tell them how many there are. Something surprising I learned is that we lose lower energy colors of the color spectrum first, like red. If you are experiencing peripheral vision loss, try this test again with a red colored straw, or pen, etc, notice when you first see the object, then notice when you can first acknowledge it is color. \nFrom the symptoms you have stated and because your IGF-1 is so high, if you do have acromegaly, my guess is that it is from a pituitary tumor. If your MRI comes back \"clean\" I would not rule out acromegaly. Sometimes acromegaly can be caused by tumors in the pancreas, or adrenal glands. Or take me for example, after going through the surgery to have my tumor removed, my symptoms and lab levels (IGF-1 and GH) lessened and normalized, but then after a year they slowly started to increase, despite \"clean\" MRI results, my endo thinks that there are still some residual rebellious tumor cells pumping out the extra hormones, so now I am on some pretty expensive medication to keep them normal. \nAs the pituitary gland is deemed the master hormone gland, it is also important to get other hormone levels checked. It likely could be pumping out too much or too little of other hormones, some good ones to get checked, in addition to your IGF-1 and GH, would be: Prolactin, Luteinizing Hormone (LH), Follicle Stimulating Hormone (FSH), Adenocorticotropic Hormone (ACTH), Thyroid Stimulating Hormone (TSH). If you are experiencing problems with your menstrual cycle I would strongly recommend doing this, for me my prolactin, LH and FSH levels were high as well as my IGF-1 and GH. Another test I recommend getting is what is called a glucose tolerance test (GTT), and measure not only your glucose, but your IGF-1 levels over two or three hours after drinking this nasty glucose drink. \nBe aware that many insurance companies will not cover some of these tests for routine testing, or screening, so your doctor might hesitate on ordering them, as you might have to pay out of pocket.\nGood luck with everything. Let me know if I can provide further assistance. One of the best things I have discovered and have started doing for myself is adhering to a ketogenic diet. If you follow the subreddits r/keto, r/ketoscience and r/xxketo, you can find more information. This diet has helped bring down my IGF-1 levels (supplemented with medication), and there is strong evidence that the lack of glucose in your system helps to starve cancer and tumor cells, which thrive on a high-glucose diet.  Thank you so much for your reply, it means so much that someone is willing to help me. The doctors really are not helping.\n\nNone of them seem to want to step on each other's toes. The Gynecologist would not order the OGTT, he wanted the Endocrinologist to do it. The Neurologist would not order an MRI, she also wanted the Endocrinologist to do it. But the Endocrinologist refused to order either because I do not have the \"classic\" symptoms or whatever. That should not matter though, because from what I have read acromegaly sometimes presents differently in young people with aggressive or early stage disease anyway.\n\nI have an appointment with a different Endocrinologist, but I have to wait two full months before I can see him. My PCP is useless, she basically just told me \"Western medicine cannot help you\" and sent me a referral to acupuncture (which I did not do, because I am pretty sure that the placebo effect cannot fix this).\n\nI am at a loss because the healthcare system I use does not seem to like people switching doctors, and all the good doctors have several months of wait time or are not even accepting new patients at all. I feel like I am fighting doctors when I should really be fighting my disease. I do not know why they seem to hate me so much, I am not argumentative or rude to them, nor do I do anything obnoxious like go in there blabbing about some crap I read on WebMD.\n\nThanks again for the tips, if I find a good doctor I will have those tests ordered. I will also see if I can go to an ophthalmologist (maybe he can tell me why my eyes hurt when I move them in their sockets!) but of course that requires a referral and my PCP has already given up on me. Any updates on your diagnosis? I have Acro and my IGF was only slightly high as well. I just had my tumor removed last week. I hope you respond with good news! Hi. I am going into my tenth year post surgery. Last MRI was clean and my neurosurgeon has said no more yearly MRIs! \n\nAfter a year from the surgery my IGF-1 started to rise so my endocrinologist put me on Somatuline and then later to somavert. I eventually had to go off the somatuline due to gallbladder side effects which resulted in me having it removed but then I have not started it again because I hated it so much. Talks of irradiating my pituitary gland began but we finally found the right dose of somavert, which is a daily injection ☹️. \n\nI have also discussed a ketogenic diet with my endocrinologist after reading about some of its medical benefits and she gave me the go-ahead and her support and is interested in the results. I am on my second trial of trying the diet. It is a hard one to commit too and I have not been on it long enough to know if it is beneficial or not. But my last lab work up was done last week and I had my lowest IGF-1 in years. 🎉 If this diet works I would like to try titering down on my somavert or changing to every other day. I would like to be off medication permanently but if it keeps me healthy it is a small sacrifice. Somavert is really expensive even with my insurance but I found a wonderful Pfizer co-pay program that brought the cost for me down to $5/mo. If that is a route you need to take in the future it is very useful info. \n\nThey had me do 5 year work ups for a colonoscopy, DEXA and an echo. The first year I had MRIs every 6mos and after that every year. Everything always came back negative. \n\nPost surgery I also had diabetes inspidus due to some damage during the procedure to my hypothalamus, I decided to treat it with increasing my water intake as I did not want to be any more medicated than I had to be and it eventually resolved on its own. \n\nI also had thyroid cancer that my endocrinologist cannot say with certainty is directly related to my pituitary tumor. She did dx me with a thyroid goiter a month after my surgery so they do seem connected. After my case she has said she is noticing a significant number of acro patients that also have thyroid goiters but there is not much research into why or how. I had half my thyroid removed as a result and now I am on medication for life 😩 (idk if you have picked up the thread, but I hate taking medication) \n\nHow are you doing? I would love to help out in whatever capacity I can. It is a lot to take on all at once. Despite all my issues I have lived a fairly normal life. There is no reason it is got to take control of yours. As it is rare and not well known I did not have anyone I could talk to about their own personal experience and how they navigated their treatment. I wish(?) I could say my experience is typical but I just do not know much about the acro community to know. I really hope this helps. Please let me know about your own progress through this. \n\n❤️", "After the death of her husband &amp; with no breadwinner in the house, Mary Ann Bevan decided to enter a contest and won the offensive title of \"ugliest woman in the world\" &amp; was hired by a circus. She endured the ridicule of of others in order to raise her children &amp; give them a better life. ", "Acromegaly overview ", "Female, 30. Have a microadenoma. Prolactin level is slightly elevated (44.6 ng/mL) as is IGF-1 (305 ng/mL.) I meet with an endocrinologist on the 7th. But how concerned should I be about being slight elevated (prolactin) and in the 99th percentile (IGF-1?) I am just worrying my head off. I do not know my GH levels, but assuming they correlate with IGF-1, it is likely to be either slightly elevated or upper limits of normal.\n\nI am worried about acromegaly. I know both GH levels and prolactin levels can be controlled fairly easily by a dopamine antagonist. At worst, I would be looking at surgery or radiotherapy. But oh my God I just was diagnosed with temporal lobe seizures last August, did not find medicine that worked until February, and just want the world to cut me a break.\n\nBut it is unclear to me how concerning these levels actually are, and if the upper limit of normal is always \"bad\" or just something to watch for, because there has to be someone there at the upper end of normal to establish a reference range to begin with. My endocrinologist did not seem very concerned about the elevated prolactin levels, although she does want to redo the test and do another MRI. My last one was six months ago. I know prolactin levels can be affected by things like stress -- I am studying for my MCAT (in July) so it is easy to say I am indeed stressed.\n\nIt is the GH that worries me. I have been 5'9'' since middle school, so it is not like I am suddenly tall. And I took the panel without any concerning symptoms -- she actually ordered it in February just as a precaution but I was not able to take it until now due to covid.\n\nWhat do these reference ranges mean? If my prolactin level is found to be \"normal\" in my next test but my GH is \"elevated\" but not to a level of concern where they would take action, what would this mean for my lifestyle? Is it the equivalent of me taking a low dose of steroids?\n\nThanks everyone. Not really so much of a \"what is going on question\" but more of a \"how worried should I be?\" Hi! 32F, diagnosed at 23. You are going to worry no matter what. There is a tumor in your head. Microadenoma is definitely a plus! Right now all you can do is get more testing (ugh, story of our lives!) and stay in close communication with your doctors until more is figured out. \n\nTake care of yourself and fight for yourself. If something does not seem right to you, question it. Change doctors until you are comfortable. Best of luck in your journey. Why is a microadenoma is a plus? Many on this sub (I assume) have macroadenomas, so microadenoma seems to us to be a good case. I agree with the earlier comment, worrying is inevitable. I am not an expert, but comparing your levels/symptoms to what I had, do not be too worried. Even in the worst case, surgery is scary, but it is effective, and pretty safe. It sounds to me like you are in a decent place, you have options for treatment, trust you doctor and try not to hurt your body with unwarranted stress Thanks, this is very helpful.\n\nThey found the tumor last year when trying to see if there was any brain abnormality causing seizures (there was not) and told me not to worry, 10% of the US population has them &amp; to just get my hormones checked as a precaution. I did inform them I am on a very low dose of an SSRI for sleep, and they told me it may be the cause of the excess prolactin. In fact, there was an article in an Italian medical journal I found online that connect the medication to excess prolactin, so that is good news.\n\nI guess there is a small chance I am just the 99th percentile for growth hormone and someone has to be there to establish the reference range. They got back with me today and told me that it \"was not concerning\" and just \"something to watch.\" I guess if they do tell me on the 7th it is not yet pathological I will start weight training because it sounds like being at the upper end of normal or above normal is the equivalent of a low dose of steroids. Looking on the bright side I guess.\n\nThanks again. I will know more in a week or so.", "My Acro Story Hi everyone.\n\nI am 30 years old, female, living in Iowa. When I was in college I had a size 8 ring and a size 7 1/2 shoe. My smile was beautiful. About 4 years ago while looking at pictures I noticed that my smile was not right. My face looked more manly. I had to severely restrict my diet to keep my weight under control. I was always tired. I chalked all of this up to aging and was pretty depressed about it. Last May I got married and I did not even want to smile in the photos because my smile had gotten so ugly. My ring size was now a 10 and I wore a size 9 shoe.\n\nAround November I started having horrible headaches whenever I stood up. They are excruciating - my vision goes spotty and I cannot even breathe because the pain is so strong. They go away after a minute or so. I finally saw a doctor in February who sent me straight for an MRI. I did not hear anything for 3-4 days so I figured it was normal.\n\nI access my chart online, and I am emailed every time there is a new test result. I woke up on 2/23 to the MRI report stating that I had a tumor on my pituitary gland. Of course, I panicked. I called my doctor who claimed she had tried to call me. I had no missed calls or voicemails. \n\nI was sent for a repeat MRI and to a neurosurgeon. I could not get into the neurosurgeon for 2 weeks. When I finally saw him, he asked where my endocrinology tests were. ... I was never sent to an endocrinologist. He would barely talk to me about anything until I saw them.\n\n2 weeks later, I still did not have an appointment. I was leaving for my honeymoon for a week and needed to get things squared away before I left the country. Turns out the endocrinologist's office lost my paperwork. The neurosurgeon's office went ahead and ordered blood tests anyway, knowing I was leaving. I had my blood drawn and while I was on vacation got the result of my growth hormone, which was double the high-end of normal. It was bittersweet - I had suspected acromegaly due to my physical changes, and now I knew why. It was not aging, it was not my fault, and there is finally an explanation for my symptoms.\n\nI came back from my honeymoon last weekend and I finally got an appointment with endocrinology... for almost 2 weeks later. I got angry. I called the neurosurgeon's office and asked for a referral to the University of Iowa. I am really flabbergasted that the only neurosurgeon clinic and endocrinology clinic in Des Moines are private clinics. I feel like I am nothing more than a dollar sign and that my case is not important. The neurosurgeon I spoke with does not even do these surgeries that often. I was just fed up with all of this dragging out. I was called from the U of I on Tuesday, and they wanted to meet with me on Wednesday. Finally, progress! I met with the surgeon and I felt instantly at ease. He is a specialist in this field and performs this surgery at least once a week. We set up surgery for the 14th. I see endocrinology on the 6th. I will likely have the IGF-1 and an oGTT that day, but either way this has to come out. \n\nI am relieved that something is finally happening. It is only been 6 weeks, but had I not asked for a referral I would still be waiting.  How are you doing now? ", "IGF-1 results are in... Hi all, I am new here and still trying to wrap my (steadily growing) head around a diagnosis, while still dealing with an increasing number of symptoms. I have not been diagnosed yet, I am waiting for my MRI to be approved, but I am afraid all of my symptoms align with this disorder and IGF-1 results seem to support it. My endo said my IGF-1 is at 336ng/mL and normal would be between 100-311. So it does not seem too elevated right now, but symptoms over the past few years are worrisome. \n\nI would say starting in 2011-12 I had acne, coarse skin, excessive body hair and sweating. While all of these things were difficult to deal with in high school, my doctor and those around me just chalked it up to teenage hormones. I was placed on accutane, given drysol for sweating and that was that. \n\nI did not suffer with any acne or sweating issues for a while, but I still had excessive body hair and major anxiety. The kind that leaves you flushed and unable to sustain eye contact or conversation. I noticed around 2015 that I just did not look quite like myself in pictures. I could not pinpoint what, but I did not look like myself. I thought my eyes looked different and my jaw wider and longer. Again, everyone just said it was a part of growing older. Our bodies change, it is normal! Out of an effort to not appear vain, I agreed with them. But I knew deep down something was not normal. Of course besides my own subtle observations, excessive hair and anxiety, there were not many other symptoms to go off on. That and also the fact that I was not even aware acromegaly existed. \n\nFast forward to 2018, I started breaking out again like I did in 2011. Rough oily coarse skin, hair loss, skin tags, prominent forehead lines and a slew of other things became much more apparent. These were not “normal” things for a 25F to be dealing with, aging aside. I noticed that my left eyelid was slightly more swollen than my right. Again, everyone thought I was crazy and that it looked the same to them. Slowly my vision worsened, especially in my left eye. It always feels strained, blurry most days and I see black floaters constantly. I have seen three different ophthalmologists and all tell me I am fine...\n\nAnother interesting find, back in September 2019 I went to the ER for stomach pains. They did a CT scan of my lower body and found a bone growth on my pelvic bone. At the time I did not even know what acromegaly was so I did not think much of it, but I do not think it would be insane to say it is related. It is a bone growth after all, which is the basis of acromegaly...a biopsy was performed and concluded that it was benign and basically just bone growing. \n\nNow here we are in 2020, amidst really strange times, but my health is at an all time low. Both mentally and physically. Family and friends still do not see a significant difference in my appearance, but I see the difference in pictures, the mirror and definitely in how I feel. My forehead has seemed to grow both taller and wider. Hats that fit me back in 2018 no longer do. I have suffered from TMJ issues since 2015, but now my bite is slightly off. I just feel so desperate for a diagnosis, even though I am afraid to hear it. It sounds stupid and I do not really know where else to turn because this seems like quite the small community, but I wish so desperately to have anything else. You understand the struggle of looking in the mirror and not even recognizing yourself anymore and feeling like you never will again. I used to feel beautiful and now I run from family photos, I avoid catching my reflection and it is such an isolating and depressing feeling. To feel like you have already lost yourself or at least lost the things you once loved. I pray we all find some peace, but I am feeling quite hopeless at the moment. Take care and thanks to anyone who got through this extremely long post. Been an acromegaly patient for almost 18 years now. There is hope. There are decent meds out there (expensive, but usually covered by insurance) and there are also surgical treatments depending on the size of your tumor. That does not always solve the problem. I have had 2 surgeries and it kept growing back. Tried Gamma Knife in 2006, but in 2018 it returned. \n\nSome days it really sucks. I have a lot of joint and back pain issues, but I try to remember, this is not 100 years ago. We know what acromegaly is and how to treat it.\n\nKeep your head up. Even with lower IGF-1 numbers, you may still need meds which will help. My numbers are not exceptionally high, but I am on the middle dose of Somatuline (Lanreotide). It is been working well for me and after over a year on Somatuline I do not experience nearly as many side effects.  \n\n\nHope you get a diagnosis quickly and that you can start to treat your symptoms and feel better. Hang in there, distant virtual hugs from another acromegaly patient.  \n:) I am the wife of a patient who was diagnosed by an amazing endo over 2o years ago.  Up until then his other doctors kept thinking it was something else.  I suggest you keep a journal.  There are options for medications if you do not have insurance.  This is certainly an expensive condition.  Sorry to say that most Acromegaly patients have other conditions that are related to the diagnosis.  But first and foremost....be your own advocate.  Hopefully your family is supportive.  That is a hurdle for a lot of people.  As a side note....skin tags on the outside are indicative of colon polyps on the inside.  Ask for a referral to a gastroenterologist and insist on a colonoscopy (if you have not already had one).  Do not take no for an answer.  Technically you are 'too young' but this condition makes you prone to polyps.  Take some supportive data you can find on this with you when you ask for your referral.   Good luck. Thank you for the response! It is been quite the journey and still no diagnosis, but I am praying for treatment soon. I had an MRI done on Monday and the results came back the same day. My general practitioner said everything looks normal so to just work with my endocrinologist regarding my symptoms...so it is been very confusing. I have all the symptoms of acromegaly, an elevated IGF-1, but no apparent tumor... Thank you for the wonderful advice! I feel very blessed to have such a wonderful family supporting me through this very confusing journey, but even then it is hard not to feel alone. The effects of this condition are so isolating and difficult to explain, but hopefully once I begin treatment I will start to look and feel more like myself. Thanks again for the response! If you do not mind me asking, what are your IGF-1 levels currently? Which is ok too. It can still be treated. \nHonestly, not having a visible tumor is good news.\nThat means it is currently small enough to not cause any problems from size.\nLarger ones can destroy your optic chiasm (optic nerves) and cause other issues, possibly even requiring a shunt to be placed (which no one wants).\nKeep on your providers to address this and make sure you get your lab work done regularly.\nSending you virtual hope and support.\nStay strong\n:) My last  labs were done in January My IGF-1 was 288 (range 53-331). It has been as high as 680 before.  However, I have been managed on Somatuline for over a year at this point. I have now moved to labs every 6 months.\nI was getting them every 3 months but was costing too much. I am American and we are nickle and dimed for everything little healthcare cost. I agree with the poster who said to get the colonoscopy. My prolactin was elevated. This led to my MRI showing a 4x6 mm adenoma. My IGF1 was elevated, but my OGTT was negative. They think I am in the incipient stages. I have skin tags, oily skin, acne and bad hair growth. I had a colonoscopy for an unrelated cause and had 3 hyperplastic polyps, which is a clinical feature of acromegaly. They are going to watch me closely and when my IGF1 is consistently elevated remove it. They just do not want to take it out until they can confirm acro even though it is highly suspected. I understand your journey and want for a diagnosis. I am praying for you! Yeah that is one thing I am worried about too. I am American as well and my insurance runs out come November so I am trying to get as much covered right now as I can! \n\nOnce you got your IGF-1 levels regulated did you notice any physical changes? If so, about how long did it take for you to notice these changes? Thank you, I will be praying for you too! I will definitely have to ask for a colonoscopy considering I have all those symptoms. Have you noticed any changes to your appearance at all? Back when I was first diagnosed, Absolutely. That is a tough question. I saw an endo 6years ago for something unrelated, he took one look at my hands and told me that he suspected I had acromegaly. My IGF1 was normal and I went on my way. I can see changes in pictures, but I am only 28 and I do not know what it just normal aging if that makes sense. My hands are huge. My feet are normal as far as I know. My forehead has always been big and it does appear to be bigger in a way and lumpy so to speak. My nose seems a bit more wide. What is the worst for me is acne and hair growth. I am scared of the facial growing to come if it takes years to diagnose, but as for now it is not bad. My neurologist suspects my face is changing from acro because I have a lot of pins and needles and twitching of my face. Idk if that helps at all. In my opinion, the changing of facial features indicates that the disease has had some time to do its thing. It sounds a lot like the symptoms I presented when untreated. Currently, I am medically controlled, and I live a normal life. No surgery, no radiation. I am 4 cm taller than I was initially when I entered adulthood ;) and some of the swelling in my face has gone down, so I look more like myself :) Truly, it is better to know and be able to get the care you need. My life has continued for the better after treatment :) It sucks, as all us here know, to have elevated growth hormone. But so cool for you that no tumor on your MRI! Take every blessing as it comes. Good luck on your treatment,  and keep hanging here with us. We got your back.", "Do you think bone changes is reversible with time? ", "Friend who hasnt seen me in years told me my face \"masculinized\", asked me if i take steroids or something. I think my nose, browridge and maxilla got bigger over the years. I also have trouble sleeping and cant feel pain in my little fingers. Could this be agromegaly? ", "Acromegaly symptoms  There is a complete lack of knowledge about this orphan disease. Too many people just do not understand it", "Fertility post surgery I (29F) had surgery almost 3 years ago. My thyroid and reproductive hormones are the only ones that have not returned to normal. I was wondering if anyone has a similar experience and what their fertility journey looked like? My endocrinologist told me at the time I would struggle to have children but I have not been able to find anything online to understand what that journey will actually look like with secondary hypogonadism. I want someone I can talk to that actually understands what I am going through.. Are you in the Facebook group? I do not care much for Facebook but the acro community on there is definitely the biggest that I know of, so you will get way more answers and input than here.  for the general group and  for the women's-only group - the verification process can take a bit as they will ask for a lot of info but it is worth it, both communities are extremely active. That is awesome, I am not currently on it. The only group I am on is a New Zealand based one which is not very active. I will give it a go thank you. I know I am 12 days late on this, sorry about that. I just found out last Friday that I am pregnant! I am five weeks, as of yesterday. My husband and I have literally been trying for almost TWELVE years to get pregnant. I have had a couple chemical pregnancies and false positive pregnancy tests.\n\nI have not had my period since September, my husband and I have been going through some personal family stuff. We literally had sex twice in March and miraculously conceived on the 28th. \n\nI had surgery in feb of 2012, and have seen the same endocrinologist since August of 2011. She also does reproductive endocrinology on top of pituitary, endocrine etc ... she told me I most likely would not conceive on my own. I have no idea how this happened, it is so random. I have an appointment with her Wednesday, before she feels comfortable enough to send me to OB. I am not going to tell you “not to try” because that is the worst thing you can tell any woman. I do want you to know, it is not impossible. I turn 35 this year and literally had given up hope. For the first time ever, my progesterone is 16.45!!!! The highest it had ever been was like four. Once. The last eight years it is been &lt;0.20.\n\nJust please, do not give up hope. Do not have anything to add - just wanted to send my love &amp; congrats!! Xx Congratulations! Really awesome to hear good news on a thread that is usually filled with pretty discouraging or scary topics. Happy things are looking up for some of us.", "What does a normal glucose suppression test look like? My endo said mine was normal but I am not supper sure. So my very first IGF-1 and Growth Hormone levels showed as 358 ug/L (normal range is 102-326) and 10.1 ug/L (normal range is 0.0-8.0) respectively. So both were above the normal average.\n\nSo then my endo ordered a glucose suppression test which went as follows:\n- GH Baseline: 1.1 ug/L\n- GH 30 mins: 0.5 ug/L\n- GH 60 mins: 0.2 ug/L\n- GH 90 mins: 0.2 ug/L\n- GH 120 mins: 0.3 ug/L\n- GH 180 mins: 12.1 ug/L\n\nAt 180 mins we had to stop the exam early because my glucose level was dangerously low (and the lab technician said it was rare for the test to end early the way that morning had). \n\nIs this a normal Glucose Suppression test result? Why did my GH spike in the end. And why was my GH and IGF-1 so high before?\n\nMy endo wants to disregard the idea of acromegaly due to the suppression test result being “normal”, and he will not explain to me the significance of the abnormality that is seen in my pituitary on the MRI.\n\nThings are not adding up, and I am super confused. Also, my endo will not get back to me to answer my questions. Does anyone have any advice or can anyone explain  what happened with my suppression test?\n\nThanks! I do not have answers to help you but wanted to share my experience and confusion. I have a prolactin producing tumour and have been on cabergoline for 3 months. At last blood test, prolactin was back in range but my IGF-1 was slightly high. Endo did not check IGF-1 before starting caber. I do not have any symptoms of high GH. Tumour is 10mm and endo said it is probably been growing for 4-5 years. \n\nTrying to get GH suppression test has been stressful. First lab said they do not do that test. Endo then made the test simple by wanting samples at 1 hour and 2 hour mark, not every 30 mins. The 2nd lab said they have never done this test and they were all confused about the proper procedure. \n\nMy results were even more confusing. Fasting baseline was &lt;0.1 ug/L, post glucose 1 hour was &lt;0.1 again and at 2 hours it 0.1 ug\\L.\n\nMy endo is not sure about diagnosis and wants do another test but he said numbers are reassuring. He said IGF-1 is probably high because in Canada they use old immunoassays which tend to skew high. It is been frustrating. Oh wow!!! Thanks for sharing! I find that there seems to be many flaws and road bumps in the Acromegaly diagnosis process. \n\nSame as you, I often end up more confused, and I find it frustrating that the doctors cannot provide any sort of clarification.", "Best hair and skin routine for people who are untreated? What did you do to calm down the oil on your face and in your hair while you were untreated? Did you shower more often, did you use certain products, or take certain supplements? I do not know how severe is your acromegaly, but get treated ASAP.I do not want to scare you, but untreated acromegaly can be very dangerous, even deadly.Use products to alleviate oily skin. Ok so I shower pretty frequently (sweaty and sensitive skin, so after any sunscreen use, any time in a pool etc) - but get used to washing your hair less. It does not need to be washed every day, and once you are in that cycle your scalp gets used to producing that much oil I am in Canada and the wait is very slow. Should I just pay for my own MRI out of pocket to skip the line?? If you can afford it,yes, but the MRI must show specific area of the brain , the pituitary gland… On the request sheet, it must be written to check for acromegaly", "Prolactin levels and pituitary tumor My nurse ruled out pituitary tumor because my prolactin levels were normal. Can someone please confirm if it is possible for prolactin levels to be low while growth hormone levels to be high? \n\nI have recently been getting headaches every day and they are always at the back of my head. I feel like my headaches have a \"pulse\" of their own as I feel a rhythmic beating, almost like a heartbeat.  I feel my nose and jaw are wider but this could be because of my insulin resistance. But none of these can explain why the gaps between my teeth are also getting wider. I have always had a little bit of gap but they are very very noticeable now. \n\nI do not sweat too much and I have not monitored by shoe sizes carefully.  Thank you! Yeah it definitely is possible - go back, ask again, tell the nurse to document her refusal to test and her reasoning for it. Bring evidence with you My prolactin levels were normal and I had a GH secreting macroadenoma 1cmx1cm. So yes, it is very possible lol. Tell your doctor to order you a full hormone lab and a brain MRI. And if they find something, make sure that nurse gets educated and understands the importance of diagnosing Acromegaly as early as possible. Sheesh.", "Acromegaly  Great post and good to see it but i feel most of these signs and symptoms are so difficult to spot at the time, and only a doctor would spot them IF he knew what he was looking for, plus we do not all have them all either.  \nI did not really notice anything wrong - I was a single mum with a stressful job so headaches were nothing new and my (Now EX!) GP attributed my growing hands and feet to me being obese &amp; sent me to a bewildered dietician!  (I was a little overweight but by no means obese). The enlargement of my jaw and nose were so gradual I did not notice, I am not one for selfies. I did have problems with my vision but only realised that with hindsight (your brain will simply make up what it thinks should be in those blank spots you cannot see). I did not have excessive sweating and just about everything else you would need a doctor to spot anyway. I can fully understand why a diagnosis takes years. I did not even realise I had a problem but I was so far along, another doctor knew straight away just by a passing glance at me. Scarey stuff. Indeed, rare diseases diagnosis can take at least 8 years.Better awareness is needed fir Drs. Yeah much as the med students do sometimes make me feel like a performing seal or a side-shoe freak, I always allow them into my consultations. My old GP did not know what it was, and had no interest to learn when he was told, that is why he is my EX-GP...", "Acromegaly symptoms ", "30m IGF-1 386,4ng/ml. How common is a natural high IGF-1? Hello. I will hopefuly get a GH suppression test and MRI soon. The IGF-1 value was an incidental finding because I was GOING to get HGH treatment for regenerative measures because of fluoroquinolone toxicity (FQAD). Because of FQAD I have TONS of bad symptoms since 8 years (like muscle, tendon, nerve and head pain) but NOT the common symptoms of acromegaly exept sudden libido loss (my sex hormones are okay though). The plan to get HGH treatment is stopped for now. What is the likelihood of having a naturally high IGF-1? 386,4ng/ml seems pretty high to me (measured on two days within an interval of 10 days). What do you think? Btw. the normal range is given as 80,0 - 255,0 ng/ml I am in the same boat. I have some bad vertigo so they did an MRI and found my pituitary was large but they did not see a tumor exactly. My IGF 1 tests have been high (between 350-450) every time I have taken them over the last 2 years. OGTT has been inconclusive. At a loss with this stuff. I do not have any other symptoms other than Sinus issues and snoring and high blood pressure but I am also overweight so who knows if it is connected. \n\nI am a 28 year old male by the way. It is so frustrating how little info there is out there. I hope you found some answers. Why did you have your IGF1 tested in the first place? When trying to figure out the Vertigo they did an MRI and saw what they thought was a tumor on my pituitary. So they ordered a bunch of hormone labs to see what it may be doing.", "Can it be acromegaly? Hi Everyone,\n\nI am a 23 year old female. 119/120lbs, 5'1. \n\nI visited the Gyno one day because I was feeling cramps outside my normal menstrual cycle. I get my menstrual cycle frequently once a month never really late/sometimes a day earlier, never out of the ordinary. However, because of the pains, my Gyno decided to do blood work. She noticed my prolactin was slightly elevated, so she sent me directly to a Endocrinologist. I went and repeated the lab work with additional testing. The endo said I have \"Hashimoto\" so clearly, low thyroid hormones at this point. My IGF-1 was a bit high as well as prolactin so she sent me to do an MRI to access an adenoma. The MRI came out normal, no adenoma. She advised - \"You are healthy, do not worry\" Come back in 6 months to repeat tests. My primary advised to repeat test with him and if anything, he will send me to another endo for a second opinion. I have no symptoms of any sort, to be honest. I continue to get my regular periods...I read online that prolactin can be elevated for many reasons as well as IGF-1..and some sites do state that it can be elevated due to low thyroid hormones. At this point, I am just over thinking of what it can be...and thought I would get on here to hear some opinions. \n\nThank you for reading.", "Did acromegaly widen your face I am asking if acromegale made your cheekbones far away from each other or widened your middle face by anymeans? Because i think my face got wider according to  joint widening in axial or cervical spine which in return forces your tongue to widen your maxilla or middle face as well to compensate for the physical or biomechanical changes in your spine and to maintain head balance. Not my cheekbones but my nose definitely got wider My cheek bones are definately wider. I lost weight down to a size 10 (F), and a friend told me I should stop because my face was looking skeletal. Also my lower jaw has grown; my lower right molars align now outside of my upper molars, so I can only chew on one side. Also, I have always had a gap between my 2 front teeth, now they are so close together I have to force tooth floss between them. I resized my wedding ring after I lost weight (I was less than when I got married by 1 size) from a size 8 to a size 10, my knuckles had grown so much. I buy wide (EE) mens shoes to get the width I need for my 6.5 Womens size foot. My nose still looks the same though. Is all good.  Well so glad your nose is the same. You know nose is everything in life hahaha. I hope you get well ;) have you considered surgery yet Done and done...and done again. I was diagnosed in 2004 followed by a very successful surgery. A new tumor grew in 2006-7 during my last pregnancy, this time surrounding my carotid artery.  2006-2010 is when most of my bone growth occurred. By mid 2009 I was really ill. Two more surgeries in 2010 to get as much as possible removed. Cyberknife 10 months later in late 2010. Then Sandostatin. I have done pretty well since then. Not too bad for having acromegaly for at least 20 years. I am really glad it went successfuly for you! May I ask if finger bone deformities gone back to normal looking? I am talking about the finger tip tufting So, no,  the size of my knuckles has never reverted to the original size , nor do I expect them too.\nHowever,  my feet did revert to a smaller size after my first surgery.  I attribute this occurrence to the immense amount of water weight I shed in the second week after surgery. They wanted to diagnose diabetes insipidus, but it occurred 1 week after surgery, and resolved after about 1.5 weeks. My face returned to its normal shape, and my feet were too big for a pair of shoes I had purchased a week before surgery. The surgeon concurred that it was likely the pituitary started regulating fluid to a more normal standard than it had been able to do prior to surgery.  So I was keeping an excess of fluid prior to surgery,  when I got rid of it after surgery, my feet size went down. But I think bone growth is permanent. Thanks to you for replying and putting effort in your replies I really appreciate you :). Last question do you think your cognitive functions are stable now ? Like attention span, memory, excequitive function and quality of life. Well...some might disagree...I did just turn 49, but I think I am doing ok. Are you struggling with cognitive functions? These specific issues have never been a problem for me, except as a result of extreme lethargy during the period when my IGF-1 levels were at 1200. Then nothing worked. I simply could not think,  or move. But those things resolved after surgery and when I had returned to normal IGF-1 levels. I did have very slight brain damage after surgery in the form of occasionally not being able to recall vocabulary. I am a voracious reader, and my verbal acumen was a delight in conversational fencing. That is hard for me now. I realized my new difficulty as I was fixing dinner with my husband. I requested he pass the \"thing in front of him that was round and used to hold fruit, please?\" He held it up and asked jokingly \"You mean the BOWL?\" It is not often, and does not seem to matter how familiar the term; sometimes it is my husbands name. I dont think people notice.  It did not hinder me from completing my bachelors degree with a 4.0 GPA. I also had nerve damage for my right eye that has \"mostly\" healed...much more than my surgeon expected. I have difficulty with constriction and peripheral focus. Only eye doctors and myself notice. (That surgery accessed the brain through the eye socket). Short answer is yes, cognitive and physical function return with normal  hormone levels. Surgical damage seems to be a very minor possiblity, but may be more permanent. Yet we heal much from such physical damage! I thank you for listening to my stories. They are not of much interest to most audiences. I wish you the best on your journey of healing. Why do you think that? Its totally interesting to hear you. I have had my hormone levels under control for 7 months but still i have cognitive issue after eating and irritability and impulsivity its some kind of insulin resistance inside the brain I think as a result of IGF-1 extreme levels before control, and I always feel like there is a halo of bad cells after eating that surrounds my body and it gets better day by day but by a really small percentage but there is progress. I am 23 btw Its frustrating when the disease gets in the way of living.  I am sorry your struggling with these persistent difficulties. Do you experience other symptoms of diabetes in addition to insulin resistance in the brain? How high was the IGF-1 before it got under control? At one  point, mine was high enough that I did not feel like I could drive to the doc for the shot, my cognitive ability and lethargy were so concerning. My sister drove me. As we returned home, I felt completely capable; the drug took effect so fast.  What is your ACTH level? Your questions should be topics to discuss with your endocronologist next time you visit. Do you have an endocrinologist that knows pituitary tumors? I have found not all do. Some settle into the routine of treating diabetes and are unfamiliar with rarer types of endocrine  disorders. Yea my endocrinologist is an expert but he is not available right now so I am trying to gain informatiob off reddit. Last thing I need to lnow is that what are the medications your endeinologist used to control all the morbidities that high IgF levels left you with? Aside from pituitary control medications. The only thing my endo does thus far is to keep the tumor from producing excessively high hormones and to prevent further tumor growth through drug therapy.  No doctor has suggested treatment for any of the others side effects such as wide feet/hands,  jaw, cheekbones, etc. I have always assumed they are freebies I get to enjoy for life. I do believe doctors have therapies to address other hormonal or organ function issues, like low libido or thyroid dysfunctions. I hope you get to talk with your doc soon. Best wishes for you!", "Acromegaly Awareness Day November 1st ", "Advice So, I just got my blood test results for IGF-1 and it was double what is acceptable. My hands are bigger, my eyes ache, I have no period, my feet have gone up two sizes, and a litany of other symptoms that all point to this condition. I am hoping to have an MRI soon (insurance and scheduling problems) but these headaches are killing me. Over the counter painkillers do not work. Any advice to help me get through the day? Tbh... pituitary headaches are a unique kind of horrible. I have had some temporary relief with cbd oil, but it was not till debulking (surgery) that my headaches let up. Good luck fellow giantess 💞 Thank you for your kind words! 🥰 I have had some luck with cold packs, but I cannot wear those around all day while I work. I may have to give cbd a shot. \nThe irony is that I was always made fun of for being short (5'3\"). I may have gained a half an inch, but it feels like a very cruel prank at this point.", "Advice and support needed Hi everyone, I am new to Reddit so I thought I would kind of introduce myself. I am a 22 year old female from PA, I was diagnosed around October of 2019. My 2 cm tumor was lifting my optic nerves and has \"broken through\" the wall towards my coroted artories. I had surgery in December 2019, but recently found out that about 15% of my tumor had to be left due to its proximity to my coroted artories (I was originally told they were almost positive they got everything out). I was told I will probably end up having radiation and be on medication, but due to all the Covid-19 shut downs I am unable to meet the endocrinologist my neurosurgeon recommended and get the blood work they requested. \n\nI am feeling very overwhelmed and frustrated by everything. This tumor has forced me to push back my college graduation to next year which has changed pretty much everything. I have been way more irritable and angry lately and my mom keeps telling me I am \"different\" than I was before my surgery. Has anyone else experienced mood changes? My neurosurgeon told my mom that it is probably because of all the trauma I have experienced but my mom keeps insisting that I am different (which hurts a lot honestly). \n\nI am not looking for anything specific here, but having my life turned upside down in the last 6 months has been difficult and I could use some support since my family does not  understand what I am going through. Hey there! To be honest, I think your mum and your neurosurgeon are both right - of course you are going to be different with what you have been through and it probably is due to trauma.  I had PTSD following my surgery.  \nI am no medical expert but I was told similar to you following my surgery for the same reasons, and although different circumstances than a lockdown, I did not end up having radiotherapy in the end, and the only follow up medication I had was steroids for 6 months. I think sometimes they suggest these things in advance to prepare you just in case, but they are not always needed.   \nI completely understand how anxious you must be feeling though, I am currently awaiting surgery for a cancer right now and it is so frustrating, worrying and plain annoying. Most surgery has been cancelled right now, but the most urgent obviously has not. If your doctors think you need further treatment, I have no doubt they will follow up with you soon, but for now try not to worry, I certainly would not want to be in a hospital right now if it was not absolutely vital! Try to relax and just focus on your recovery for now. You have been through a traumatic experience that requires both physical and mental healing, and you need this downtime &amp; rest. Hugs 💜 xx Thank you for your support ❤️ \nI have suspected for a bit now that I do have PTSD from my surgery. I was in the hospital for almost a week afterwards with diabetes insipidus and had countless panic attacks while there. Do you have any advice as to how you dealt with your PTSD? I feel a bit lost with how to handle it. I feel you, I got meningitis and my expected 1 day stay turned into 10 days in ICU. To be honest, I did not realise I had PTSD either, It was a new GP diagnosed me years later. I did see a psychologist at the time but I was really just in denial of the enormity of the whole thing for years. I would definitely recommend therapy as soon as you feel ready to talk, and definitely one who understands what you went through. Finding that understanding was key I think. So many people do not understand what you have been through, you do not look sick after all, and then they assume the surgery is the solution and you will now make a full &amp; speedy recovery to be back to normal again. For me at least, the reality was although it did stop further damage, it cannot repair what is already been done, and that is really hard to accept. Your life is and will be changed forever, that is a huge thing to come to terms with. I definitely recommend therapy. And online support groups were a godsend too. Just being able to reach out to people who get it helps enormously too. I know it feels like it sometimes but I promise you are not alone, just reach out 💜 The tumor messed up your hormones. So I would not call it PTSD, but an adjustment to new hormone levels. Mood swings are a symptom of changing hormone levels (think pregnant women). It would have been nice if your endocrinologist had mentioned this. Also, radiation is really a last resort technique. But it may be cheaper than a lifetime of medication (especially in the US without insurance). But radiation can also cause damage, that needs treatment in and of its own. So please get your doctors to inform you properly. (For example, radiation may have negative effects on fertility as well...) More questions can also be directed in the facebook group Acromegaly Support. (A bit more lively than here, although things here have improved.)", "Do your hands and feet get longer by this disease or do they only get thicker?  Can be both, but everyone is symptoms can vary. As in, even at 35 or 40? \n\nI am curious because I study the body, and I thought that should not be possible after your growth plates close. Yeah in my 30's and my show size went up at least 1/2 size, my feet would not fit in my shoes any more length wise. Damn. From my non-scientific view of a family member whose acromegaly started post puberty their hands, feet, etc got larger but not necessarily longer. Thicker at first . They get wider first as a result of spreading they lengthn Diagnosed at 28 - in the last decade I went up at least a full shoe size and they are thicker, higher arches, wider in general. Fingers got thicker, but compared to the rest of my body my hands are also disproportionately massive. \nIt is not AS much a bone turnover thing when you develop acromegaly as an adult, and you are right that growth plates have closed by the end of puberty, but your soft tissues thicken and space between joints can grow. It depends.  If it is affecting the bone itself in your feet and how it affects it, yes it can.", "2015 vs 2021. Does my face look longer in the 2021 pic than the 2015 pic? My husband pointed this out and now I am worried something is wrong. ", "Acromegaly ", "Injection itch What helps for the severe itch I get from the injection site?", "Diagnosed with acro in Sept 2020. Surgery In Nov 2020. Tried cabergoline first with no igf change. Now on octreotide monthly injection. Igf doing good now. Issue: I feel like my short term memory/attention span/cognitive function is now crap. definitely feeling the fog. Anyone else? ", "IGF-1 high, was diagnosed with prolactinoma 4 months ago, worried about GH being high too Hi all, \n\nFound out about high prolactin about 3 months ago. MRI showed 10mm tumour. Been on cabergoline since then and prolactin is back in range (was 130). I was happy about that, however my IGF-1 came back elevated. It was 282. Upper normal limit is 238 (sorry, forgot the units). Endo did not check IGF-1 before starting cabergoline. \n\nEndo now wants me to do growth hormone suppression test. I have been reading posts here. I do not seem to have any symptoms of high GH. Either my GH is OK, just IGF-1 is high or GH must have just recently gone up and symptoms have not shown up yet. \n\nIt was not easy to be diagnosed with a tumour but I was over that and glad that cabergoline is working. But now I am freaking out again about possible high GH. \n\nLooking for comments on what to expect if GH does come back high. Could IGF-1 be high because of something else? Thank you. Someone smarter than me can correct me, but my understanding is that the pituitary (and maybe a tumor) creates the growth hormone. The growth hormone makes its way to your liver where IGF-1 is produced.  The IGF-1 then interacts with the rest of your body to stimulate the appropriate bodily growth, or the symptoms of acromegaly if there is too much IGF-1. \n\nThey interplay with each other but it is the IGF-1 number that you need to worry about.  One of the acromegaly treatments, pegvisoment, blocks GH absorption into the liver, reducing the creation of IGF-1. \n\nJust a non-medical guess, but your tumor is likely producing some extra GH in addition to prolactin.  If you are not experiencing symptoms, it may not be a big deal. I am surprised they did not look into it sooner.  The cabergoline is a treatment for mild acromegaly so it may push your IGF-1 down a bit further anyway. Thanks for that info. You are right, IGF-1 is what makes changes in body. Endo estimated the tumour has been growing for at least 4-6 years. I have not noticed any symptoms in all those years so really hoping GH is normal and only IGF-1 is high. \n\nI am prediabetic and curious if insulin resistance will elevate IGF-1. Just really bummed out. Going to get GH suppression test done this week. The way to decisively see what is going on is called an Oral Glucose Tolerance Test. I am not sure if you will have to come off of cabergoline to have one done (as mentioned, cabergoline can be used to manage mildly elevated IGF-1)  \n\n\n(  \n\n\nDepending on your tumor's composition, the cells to make excess prolactin may be sparsely or densely granulated. The same is true for GH-producing tumors, and if your tumor is making both hormones they can come in any sort of combo -- maybe yours is making more prolactin than GH. My partner was diagnosed with a mixed somatotroph-lactotroph adenoma a bit more than a year ago, and it was the hyperprolactinemia symptoms that got them their acromegaly diagnosis I am doing that test tomorrow. Endo did not ask me to come off cabergoline. \n\nDid your partner also have symptoms of acromegaly? If dostinex does not help to lower growth hormones, you will need acromegaly injections. It is helpful but has a lot of side effects. All of the other comments on here are excellent. However, consider that maybe you do have some acromegaly symptoms. Acromegaly can cause insulin resistance issues, and sometimes addressing the acro can help with normalising natural insulin production. Oftentimes people do not get an acro diagnosis until they are diagnosed with heart disease, diabetes and high blood pressure (all of which acro can slowly exacerbate!)\n\nTumors can make multiple hormones, and a tailored approach to your meds is going to be key. You do not get tumor pathology until after a surgery to tell you decisively what your tumor is overproducing. My GP got my hyperprolactinemia diagnosed before ordering my IGF1 levels, which were much more conclusive than yours when it comes to the degree of elevation, because my tumor is making LOTS of GH and a little bit of prolactin 🤷‍♀️ Injections CAN come with lots of side effects, but we do have very effective methods of disease control these days and many people do just fine on them. I am actually feeling better than I have in YEARS only two months into using somavert, it is going just swell so far 🤞😅🤞 Thank you for useful info. Do you have any links about insulin resistance and acromegaly? \n\nEndo said tumor has been growing for at least 4-6 years and if it is making too much GH (along with too much prolactin), I would expect to see some body changes. \n\nHe also said my IGF-1 levels are not that high and that immunoassays used in Canada are old and tend to skew higher than normal levels. \n\nIs daily injections the only available med for acromegaly? That is good to hear and happy you are feeling great!", "IGF-1 levels What were some of your IGF-1 levels (ng/ml) before being diagnosed with acromegaly? 1200 700 725", "Long Beach Investment Properties - Buckingham Investments ", "Artificial vs natural acromegaly So I have met some guys that use high doses of hgh and they are huge but they look proportionate, even in their skulls. Why is it that a lot of people that use artificial growth hormone seem to maintain a proportional body and face while those that have naturally induced acromegaly usually from a pituitary disorder seem to look out of proportion such as the enlarged lips and nose? So pretty much like Rich Piana vs Andre. Is it the fact that what these guys are using is not bioidentical or the fact that they are using other substances in conjunction with growth hormone? I am no endocrinologist, but my guess is likely dosaging and frequency.\n\nThose of us with acromegaly are naturally producing high amounts of growth hormone, but it is not regulated at all. They may be using high doses of HGH but it is not a natural form of it (it is likely a growth hormone stimulator that they take) which tells their bodies to produce more but likely not at the levels we are at - AND, they have to keep taking those meds to produce that level of growth hormone. We do not. It just keeps happening.  \n\n\nI have actually made that joke a million times. They spend millions in Hollywood for growth hormone treatments to look younger and healthier, yet I get a surplus supply for free (which is also slowly destroying my body) ha ha ha  ha ha!!! So Funny! /s\n\nBut honestly, it is likely due to the dosing and frequency of the use of those meds. I have asked my experienced Endocrinologist about this before and as far as i remember he told me that Growtth hornone injections  or exogenous induced acromegaly is mostly of the time reversible because they are not predisposed to it geneticaly like someone who have pituitary tumor. I think he also told me as far as I can remember that pituitary tumors produce GH 24/7 in doses if compared to international units of HGH injections would be like 80-100 IU per day which is insane no bodybuilder in the world inject that much. But yea still bodybuilders produce acromegalic features and enlarged organs and guts and coarse skin and facial features and arthropatthies and so on but I think most of the time its reversible for them so it doesnt progress any farther because they are not geneticaly predisposed maybe. I have made that same joke too - I mean how lucky are we!! /s I am just so glad to hear someone who finally gets it!! I would like to have it extracted from my blood and sell it for millions to those people in Hollywood....or Lance Armstrong. IRL though, I am able to build muscle fast, even though I am a 49 yr old female, unlike my weak sisters, so there is that.  We should start an acromegalic body building competition league. Lemonade out of lemons. We would get kicked out of regular leagues for illegal dosing. HA!", "For those of you who have been treated - what else was beneficial to your treatment/recovery besides tumour surgery? Also is there any thing you avoid since you diagnoses? Have you done physio, massages, hormone therapy, diet changes, lifestyle changes, using new skin products, additional medications, supplements and vitamins, foods, certain physical activities, specific counselling, etc…Anything at all? And what do you avoid? (you can use the above list for inspiration, but feel free to go beyond the list) Exercise. My joints are trashed from the arthritis and it is a lot harder to stay in shape and keep weight off without the extra hormones. Dostinex I am vegetarian it helps tremendously to lower my growth hormones. I am better now and my acromegaly is very well controlled Cupping therapy is one of the only things that gives my symptoms relief. My skincare routine is pretty extensive. LOW IMPACT exercise (specifically yoga) is where you want to be - preserve your mobility, get as strong as you possibly can", "Somatuline (Lanreotide) Just Started Hi, Just found this sub. I have had acromegaly for years. I had a gamma knife procedure in 2006 and it worked until this year, my pituitary tumor is back. I started Somatuline yesterday and the side effects are brutal. Anyone else have any experience with Somatuline over Sandostatin (Octreotide)? I was on Sandostatin between 2002-2007, it was pretty awful too.  My friend said she is been on Lanreotide for years and it had worked well, but she had to also take somatuline because her levels began to spike back up.\n\nThey frequently change her L meds to find a balance.\n\nSide effects were that she is lost more weight than expected. Even her doctor told her to just eat anything.  I am struggling with the side effects honestly. I have lost some weight but if I have to stay on this med I am concerned I will lose way too much as well.\n\nthank you for your response. It is difficult to find anyone willing to have a dialog about this. Hello - I know this is an old post but I just came upon it today. When I initially started taking Somatuline, I did have some side-effects (usually in the days immediately after the injection) but they diminished after several months. At this point, I no longer notice any of the side-effects. I cannot say if this is typical, but I hope it could be the same for you? Thank you for the response. I am only 3 months in. Hopefully they will diminish with time. Goal is surgery in a few months so hopefully will not have to stay on it. I have been taking somatuline for over a year now. I had to be on it even after surgery. I only experience the side effects after a dosage increase now, and am currently at the max dose. It did take about four months for me to stop experiencing any side effects, so hopefully they ebb for you soon! ", "Testing now About 4 weeks ago I received a message from an endocrinologist in Scotland, I am in the US. He saw a video of me and suggested I follow up with my dr. to see if I have acromegaly. My IGF was 367. Followed up with an MRI, nothing in pituitary. Today was a CT of my torso, nothing noticeable in this test either. Has anyone else had the same results? Just wondering what is next.  Sorry you are having a hard time, this stuff can be incredibly stressful. I would say you should find the best Endocrinologist in your local area and get an appointment. They can do a physical checkout of you, analyze your symptoms, and suggest more labwork and more imaging if necessary. That is what I would suggest anyway. Thank you. I have an appointment but cannot get in until September. My in network Endo could not see me for 3 months. I did a lot of research and shopped around, eventually found a few great endos (I called maybe 5-7 within driving distance) that could take me the next week. Had more labs done, more imaging, got my diagnosis and neurosurgery referral, sought out the best neurosurgeon I could find, traveled to NYC and had surgery two weeks later. Im not saying this all to antagonize you, rather to say that if it is stressing you out and causing you emotional/mental pain like it did me, it can be done. If you are not a headcase like myself you can probably wait until August lol 😂. If you have any questions or need support or anything let me know. I am sorry you have got such a wait but as another commentator mentioned, is it possible you can get an earlier appointment with a different endocrinologist, or are all appointments COVID delays? I usually get my hormone levels checked every 6 months but I am seriously delayed right now due to the lockdown. As in 18 months delayed. Not good but I think I am okay so I am not stressing so much.\nWhat a truly wonderful thing for that Scottish doctor to do though! I understand that you are probably stressed out &amp; afraid right now, but if he is right, at least you are taking steps now to verify it and if needed, get treatment. My own GP was forever telling me I was just obese and implied my growth and pains were all in my head. My diagnosis too came about by chance because someone who knew acromegaly just happened to see me and led me to the right people. I am 15 years post op but I still send a card every year to thank him! Idk what area you guys all live in but I can share what endos and neurosurgeon I used if that is helpful. Did your operation normalize your GH or do you use medication now to help? I am in the U.K. so I am pretty much stuck with mine! I actually see 2 different endos in 2 different hospitals and counties (long boring story. Has its pros &amp; cons - twice the opinions and expertise but also it can feel like I am just a performing seal or side-show exhibit just wheeled out by teen boys for the bragging rights sometimes) but I cannot get in to see either at the moment due to the complete lockdown &amp; resulting appointment delays. I called them recently and they said the backlog is crazy. But thank you, that is very kind of you.   \nI was on various meds for the first year post op (sorry I cannot remember which now) &amp; I still take a lot of strong painkillers daily. I have had a few bizarre fluctuations with my GH and IGF-1 over the years, one led to some investigation with my pancreas that did not seem to go anywhere, and I still have unresolved issues with hypoglycaemia they feel is connected but cannot get to the bottom of, but I have had no further treatments as such. I was told I would have to be monitored for life though. (Joys...!) Wow. That is a roller coaster of a story. Some complain about the American healthcare system but I am extremely grateful to have choices and flexibility. It has been a blessing for me. I am 1 week post surgery. Hoping to have my GH and IGF tested soon to see if the surgery normalized them. Fingers crossed. Oh do not get me wrong, I am 15 years down the road and that is the only real complaint I have. And it is not the NHS’s fault a lockdown hit! Both hospitals are less than an hours travel away. One hospital is a teaching hospital and it was totally my choice to allow students in my consultations (I have heard it can take people over 10 years to get a diagnosis so the more who can identify it, the better right?) it is just sometimes I think some doctors forget their patient is a real live person not just a paper case study or rare specimen of something they rarely get the chance to see in person. But I do feel I get listened to, and any issues I have investigated, even if they cannot find an answer, and then they are honest about it. Usually I get at least 2 GTT with follow-up appointments a year, and an MRI, and end up seeing one of the country’s top endocrinologist at least once every 6 months. and for that I pay nothing. I dread to think what that would have cost me in the States. I think I am pretty lucky to be fair. I also went to a University associated hospital. I went to Weill Cornell in NY. I think that is important because the disease needs more attention and education and I am happy to be the test subject 😂. I have a high deductible HSA insurance plan so it did end up costing me a few thousand dollars which my HSA covered most of at the end of the day. Most people I know pay nothing though, especially if they are lower income or have employer provided insurance. I am happy to hear everything is working out for you. We need advocates and people who have experience with his stuff from all over the globe because it is a different experience wherever you go. Absolutely we do! I love hearing about the OP’s Scottish endocrinologist, and telling my own diagnosis story but always think “There but for the grace if God...”. I even heard of a nun who was diagnosed because she was doing one of those happy 10min round up news segments- and a random doctor spotted her and KNEW immediately looking at her she had acromegaly, he contacted the tv station &amp; she got tested and treatment.   \nAs I said my own GP was not only a rude asshat, but he did not want to know anything afterwards either. I got loads of information from The Pituitary Foundation (if you have not heard of them, they are a fantastic resource - an absolutely amazing charity I still support, their website is so full of information &amp; downloadables) and he would not even look, just threw it all in the bin whilst I was sat there. I now have a different GP! One of the student doctors who saw me at my first hospital appointment now runs the endocrinology department there &amp; he always had a keen but respectful fascination with acromegaly. I have heard other patients &amp; doctors think highly of him too, I can see why. And other doctors have asked me could they use my case for a paper, conference, and/or case study - gladly! My GP saw me for the first time and immediately had my GH and IGF tested that day. I am extremely blessed and cannot thank him enough. I owe him a great deal. Being your own advocate and seeking the best medical professionals possible is something that I cannot recommend enough to people. True, although I cannot really comment on that as I really did get the best care possible without me having to do anything. All referrals, consults and tests were set up for me, and really quickly - all I had to do was turn up! Even better the country’s top specialist was local to me too so I really did not have to do much except be there. But if I thought I was getting the shitty end of the stick, you can bet I would speak up! That was similar for me. I went to a new doctor for a general physical and talked to him about my joints, hands, and feet. He immediately said it sounded like Acromegaly, he also pointed out my face structure. Had the bloodwork the same day. It was amazing to finally know what was going on. I cannot say enough good things about the Mayo in Rochester, MN. I had my lab work, MRI, endo, and neurosurgery consult in one day. The surgery was two days later. Same thing happened again when I had my Gammaknife consult. We do mail-in labs for all my level checks. I am on the same boat. Initial igf-1 level was 490. I did an MRI and was not able to locate the tumor on the pituitary gland. Levels of ghrh (Growth hormone release hormone) was normal so Endo ruled out other kind of tumors. Now I am on Cabergoline and that had been a bad trip without end. \nEndo thinks the tumor will change/grow so have another MRI in two months. \nJust wanted to share that i understand the feeling of not getting a clear answer and staying in limbo. It is not easy Out of curiosity, could you share who the doctor was? I am American but my partner is from Glasgow, and my British visa application is currently processing. I have been in touch with Marta Korbonits (( - who is based in London and doing a lot of very research regarding acromegaly that is pertinent to my circumstances. She is mentioned a few hospitals in Scotland that I will likely end up getting care at, and I have got a good idea of which hospitals would serve me best when it comes to the care I will need, but it would be excellent to hear who pushed your diagnosis (not to be diminutive or dismissive of your personal experiences with this disease in any way, but 367 is a very marginally high IGF1 number! I would like to know who is thinking the right thoughts when it comes to rare endocrine disorders you know?) It is been a while but finally got into the endo last week. Another round of testing Monday lead to glucose tolerance test and gh test. Gh levels did not drop so more testing is needed. Hoping to get it scheduled for early next week. \n\nFYI still communicating with the Scottish endo, he is great to have someone to communicate with.", "US Registered Nurse: My Acromegaly Story I am now in year 21 of this disease. I have had surgery twice and a gamma knife procedure.\nUnfortunately, my tumor has grown back again.\nNeurosurgery does not think it is safe or a good idea to do another surgery.\nI am now on Somatuline (extremely expensive) but it is controlling my IGF-1 levels and has shrunk the tumor.\nIt is definitely frustrating to know that I will be stuck with these expensive injections for likely the rest of my life.\nJust wanted to share. If anyone out there ever needs to chat about dealing with their acromegaly or needs assistance in finding resources, please let me know. sorry to invade your space, but I have a question, is it possible to adquire acromegalia at 16-17 yo and not having gigantism?\n\nI am a man if that matters!\n\nthanks Absolutely.\nHowever, your first step is blood work. You should speak with your doctor about it. You will want to get an IGF-1 level along with a growth hormone level (although that fluctuates throughout the day).\n\nMy initial diagnosis was when I was 16, so no, it is not out of the ordinary to experience that as a young person. It could be puberty also. They may also order an MRI to verify the presence of a pituitary tumor.\n\nBottom line - see your medical provider and at least get some baseline blood work done. &gt;My initial diagnosis was when I was 16,\n\ndid you had abnormal growth in terms of height? Coolfungy, i want to make sure you know about copay assist for somatuline through the ibsen cares program. I think they will cover copays up to $20k annually. For me, they just wanted me to cover $5 per injection. No. I am tall, but not extreme. My father is also tall. I do and use it. It is very awesome. I only call out the expense because it is priced so ridiculously high. As someone in the US, it terrifies me to know if I lost my insurance I would be screwed. Sorry to invade, I have the same issue, did one surgery Dec 2017, they removed most of the tumor but some residual remains as indicated by MRI but fortunately it has not grown after a year now as per my recent MRI. The IGF-1 dropped from the 900+ µg/L before surgery to the \\~500 range post surgery with 30mg of Sandostatin monthly injections and just before 2-3 months the dose was raised to 40mg Sandostatin and IGF-1 dropped to normal level 127 µg/L. \n\n&amp;#x200B;\n\nMy question, Is it really true that if the IGF-1 dropped to normal the tumor would shrink and will i eventually get rid off those injections?\n\n&amp;#x200B;\n\nAlmost all my main hormones have gone, Would it be possible that the pituitary will rebuilt and re function producing hormones ? I am struggling with controlling my hormones, maybe i need an outstanding endo.\n\n&amp;#x200B;\n\nOn my next endo visit i am planning to ask him to optimize hormones, Thyroid, Cortisol and Testosterone Which when should i start with or the sequence is irrelevant? Ok thanks.\nI also adquired prognatism recently...\nOther changes are difficult to measure but this happen... I can only answer these questions to a point because I am no expert, just a patient like the rest of you. BUT, it is my understanding that it is the Sandostatin that keeps the tumor shrunk.\nThat is my experience anyway.\nI am on Somatuline (lanreotide) but similar drug to Sandostatin (octreotide).\nStaying on the injections is what controls your growth hormone (which is what your IGF-1 labs measure over time). Since growth hormone fluctuates throughout the day, IGF-1 is an indicator over time what your growth hormone levels are.\nIf there is residual tumor and you stop the Sandostatin, the tumor will likely grow back (that is my experience anyway).\n\nI would certainly have a conversation with your endocrinologist.\nIf your other hormones are truly low your endocrinologist should be replacing them. If that is not happening I would question them on it and/or seek out another doc. Try to find one that specializes in pituitary tumors. Hey, I am a bit late to this post but I hope you are still around and able to answer some questions.\n\n\nI was diagnosed with acromegaly just over two years ago with surgery following shortly after. My IGF-1 and GH levels dropped a fair bit after surgery (as to be expected). Over time it did not continue to drop so they put me on Somatuline, and I am currently taking the maximum dosage of 120mg. According to the MRIs my tumor is still there, but not growing. My IGF-1 levels are slowly increasing though. My endocrinologist wants to put me on a daily injection, and said that will hopefully only last for about two years. He did not seem too concerned.\n\n\nToday I just saw my neurosurgeon for a follow-up, and he was the most concerned I have seen him since pre-surgery. He warned me that while people do typically die in their 50s due to the illness being untreated, if left at an uncontrolled, elevated rate I could develop issues (and ultimately die) in my late-30s or 40s. I am currently in my early 30s. He said to give the daily injections a try, but was convinced if it does not improve my levels that I will need another surgery and/or radiation. When I saw my endocrinologist last month he seemed more relaxed about the situation and gave a few options where we ultimately settled on the daily injections (the most expensive option, even more than the Somatuline, hmm). He did mention surgery and radiation, but as last resorts. I am a bit thrown off with how \"animated\" my neurosurgeon was with my choices.\n\n\nI guess I am just wondering how a second surgery and the gamma knife procedure went for you. I have been told it is highly likely my pituitary will be destroyed and I will have to be on replacement hormones, and probably go into early menopause. Were they more aggressive in choosing a second surgery and radiation, instead of trying medications first, due to your age? At least that is the impression I got from your post is that instead of medication first they chose to do another surgery and radiation. My experience was the opposite, but it now seems I am heading towards that direction.", "Chiasma Announces FDA Acceptance of Mycapssa New Drug Application Resubmission | 13JAN20  Wow, this would be so much more convenient than injections - here is hoping that it is effective and becomes available.", "Jaw movement This might sound ridiculous (it certainly does to me!) but post surgery, have you experienced temporary jaw growth or movement again? \nI am 15 years post surgery and besides the joint &amp; muscle pain, &amp; fatigue have no real issues, but I never never had symptoms pre-surgery except my hands &amp; feet growing, I was diagnosed by fluke really. But the last few weeks I have noticed my lower jaw seems to be moving. One day I can get my front teeth to meet, the next day I cannot, then I can again. It seems it is temporarily growing then receding throughout the day. It did grow before my surgery and subsequently quickly reversed after surgery and I have not had any more issues since - except now. I have not been able to get in for any blood tests or GTT since pre-lockdown but I have got a telephone consult in a few weeks. I am not entirely convinced the same is not happening with my nose either but I have not long since had major surgery on that so I am not sure on that either. I know this all sounds stupid, but then all the symptoms of acromegaly did before I had them too, can anyone else relate to this? And if it is not due to acromegaly, what on Earth else could cause it? I would really try and get that bloodwork done as soon as you can. It does sound like you are having some symptoms and I have heard that the tumors can regrow after surgery. Yeah, they can &amp; that is my fear to be honest. I have had issues with trigeminal neuralgia too in the past (all apparently related to the acromegaly) and that pain has been flailing up again recently too. But it is the temporary shifting then settling back in place of the jaw that does not really fit with that. I knew it grew out before my surgery then shrunk back after treatment but I am not medically knowledgeable enough to know what the exact cause of the movement was, and googling just confuses me more. I know it is a crazy ask but as it is the endocrinology appointment that is already scheduled I was hoping maybe someone else could relate &amp; comment. My clinic are not the best and really just want to continue phone appointments right now but I think I need my bloods updating, I just do not know if they will take me seriously enough to bring me in. \nThanks for commenting though, it is hard to stay calm when you just do not know! Mine fluctuated at first too. I think part of it is it moves, then your muscles compensate to realign your bite, then it grows some more. Until eventually it just goes totally out of alignment.  At least that is how I think mine went. I am four years into trying to get it all put back together.\n\nAddition: I hope it all works out. At least you know what it might be. That is the problem, I am 15 years post surgery, it should have settled by now, and I am pretty sure it did. It is only the last few weeks I have thought it was shifting again so I have been monitoring it and sure enough, it is fluctuating. I have got an appointment booked anyway in a couple weeks so I will mention it and see, and I will be pushing to get my bloods redone. It is been 2 years since I was checked (which does not help my anxiety either!) plus I have forgotten (or intentionally blocked) so much of how and what happened back then.", "21F struggling immensely with possible Acromegaly diagnosis Hi everyone, I am a 21F and got diagnosed with a pituitary micro adenoma in 2020. My endocrinologist assumed it was prolactin secreting even though my prolactin was not too high (but my IGF-1 was higher than normal). When I brought up my IGF-1 levels I was instantly dismissed and told it had no significance in anything by multiple doctors. Fast forward to Dec 2021, my endocrinologist admits that my high IGF-1 could mean acromegaly and I will be getting confirmation in 2-3 weeks. I honestly feel hopeless, I have always experienced severe body and face dysmorphia but never knew why. I stoped birth control in 2020 and that is when I noticed my face and body changed drastically to the point where people I went to high school with do not recognize me. My cognitive function has also declined and my memory is in the first percentile. I am so self conscious, especially now knowing I may look completely distorted to someone who knew me from 4-5 years ago. I do not really see a point in living when everything I have researched about this disease seems horrifying and I feel like an alien. I do not recognize myself and mentally I am not doing well thinking about how this disease may further impact my appearance and health. I do not have family or anyone to talk to about this (I have not told my friends and my parents do not care). If anyone has any positive stories that will give me hope that would be greatly appreciated.", "Does acromegaly cause a rapid heart pulse?  Cardiac issues are a big concern for serious or uncontrolled acromegaly.  I think people also need to be cautious about other hormones that can be impacted by the disease and surgical or radiation treatments like cortisol or thyroid issues. Thanks I figured you were an MD or something medical, you post a lot of infographics in the sub. I am acromegalic patient\nDX 6 years ago I am acromegalic patient\nDX 6 years ago I also have it, I always wonder if others get the same amount of comprehensive care as I have gotten. I went through all the normal control treatments, but my Doc also referred me for a thyroid ultrasound, colonoscopy, echo-cardiograph, sleep study, ortho consult, and pretty comprehensive MRI and bloodwork monitoring. I think the goal is to catch any co-morbidities early. I have not seen in person my endocrinologist since January 2020 because of COVID-19. I have an appointment this November and I will demand an in person visit. I suspect I am in the beginning of cardiac abnormalities due to acromegaly. Yes I had a clear heart echo at the beginning of the year but was referred to a cardiologist because I have developed a fast resting heart beat. Endo says it is a potential side effect of some of the acro meds but wants it checked out just in case. I take dostinex for acromegaly", "Acromegaly and vaginismus? Hi, I was recently diagnosed with acromegaly (32/F). My elevated hormones are GH and IGF-1, and my blood glucose is also elevated. Along with the diagnosis I have been reading up on how elevated IGF-1 and insulin are associated with development of colon polyps... I am still in the process of sorting out my treatment but I believe at some point in the near future I will have to go get a colonoscopy as a preventative measure.\n\nAnyway, getting to the point. I had just a shot-in-the-dark, sort of idea, but... are there any other women out there diagnosed with acromegaly who have had persistent trouble with vaginismus/painful intercourse in the years leading up to their diagnosis? I have had painful intercourse consistently (and have tested negative for all other vaginal conditions, STDs, etc-- have so far been unable to find any other cause). Since IGF-1 and insulin cause proliferation of colonic mucosal lining, I wondered if it could do the same in the vagina. And maybe there is a link there to my pain.\n\nVery random thought I know. But if there is something there, I would love to help point it out... the more data, the better. Alternatively, if you do not have this problem at all - that is useful data as well, and please say so. This was literally just a shot in the dark. No for me, (F, 49, diagnosed at 32yrs.old). However,  the endocronologist asks every visit if my sex desire is normal, so sex hormones are definately affected. Thank you! My libido has been terrible for a long time now. I see loss of libido listed regularly as a men's symptom, but it seems to mysteriously vanish from the list of women's symptoms.... I think this can be due to prolactin levels, which can be high in acro due to co-secreting tumor. Have your prolactin levels been checked? I am in the process of acro diagnosis. I have painful intercourse but that is probably my endometriosis. Although, maybe you are on to something else. The sex drive sounds like prolactin issue though. Also, have your estrogen and progesterone checked."]