["kind of dying to be manhandled 🌸 ", "Shopped tag: Yes or no? I mean, a lot of these will be. But should I just leave it as part of a real tag? It is still real world, even if not technically real.\n\nOpinions?", "Throw me on the couch and fuck me😳 ", "There are many interesting things in the forest, how do you like such adventures?😏 ", "I want to share with you my wonderful mood😜 ", "Just a little window nude (f40s) ", "One in the rink... ", "Do we still love simple nudes?😳🙈 ", "Happy Monday! Let us start the week with some good sex? ", "So, anal? ", "Same as the other, i did not find the original pictures  That is so beautiful. Two guys go suck at the same time awesome", "Happy (f)at 🐱 Friday everyone ", "Hope this pic makes you smile ☺️ ", "Serving you a full English breakfast ", "Take your pick ", "Long socks, boobs, and pussy combo (f) ", "Twice as wet? ", "Sending you morning vibes 🙈 (f) ", "I eel like I was having a great pussy day. Thought I would get a second opinion. ", "I never thought I would be showing off (f)or strangers but I am hooked ", "Just turned 18! Hi GW ✨  🌹 ", "Would you fuck a girl with my body type? 🥺 ", " just come between my legs please 🙄 ", "I promise I am tight in every place ", "I heard you like gingers so I thought I would show you my matching pussy ", "Do these milkshakes bring all the boys to the yard? ", "Something I found on imagefap.com ", "Do you think I can enter classroom like this? 😇 (F) ", "Album of  or /u/doubledickdude ", "Another album ;P ", "are you a an of collars ? ", "Take a quick break (f)rom work to fuck me like an animal 😚 ", "I love showing you my perky tits ", "Who wants to be my next big mistake?😉  ", "Do I deserve your dick? (F) ", "So many o you have asked to see behind 😈 Was it worth the wait? ", "Would you have un with a milf like me? ", "Is my ass fat enough for you? waiting on SC mithrilcent  User has less than a day and 3 different sc accounts... I would ignore and bury this one", "From the AMA ", "I am ready for a good pounding 😉 ", "my biggest (f)lex is my waist to ass ratio ", "Are simple nudes appreciated here?  😌 ", "Do you need a fun sized MILF ", " Fuck me like the cute little wall ornament I am 😈😈😈 ", "I always see big boobs in here, but I hope you appreciate my B cups💗 ", "What would you do if I opened the door like this? Comment below ", "New Year, new content, hope everyone likes!  This is the same guy as in the \"chunky ones\" post. He went by \"ExtraNoodle\" on LPSG. Sadly, the account is no longer active. I hope they are real. So hot!", "You see a real slut in the wild! What is your reaction? ", "ofice cunt ", "iso someone who wants to split a stuffed crust pizza (f) ", "Which of my features do you like the most? ", "Who is next?  ", "Me  love it! Dude... Thank you so much for posting again. I have been hoping you would. They are just beautiful. And if that is precum on your sheets... even hotter! Any chance of seeing them hard? You have an amazing gift. Can you do a video? Omg that is amazing. Please post more. Are you erect in this photo or do they get bigger? They do get a bit bigger. I am not fully erect there. They are not huge though. Pretty average as far as size goes. Yeah, I will do it soon. Yea seems semi hard. Average X2, lol. Atleast you then can double the girth if you need. \n\nI assume each are about 5-6 inch long and 4-5 inch thick. Still amazing. Thanks for sharing Yeah pretty much Nice. That is pretty big. \n\nCan you feel them independently of each other? Like of left is stroked you can feel it only on that one? Independently Nice... So if you jerk of off an orgasm can you then continue again on the other dick and orgasm again? \n\nOr once you come you are done. \n\nI assume all fluids shoot out both dicks at the same time whenever you decide to pee or cum. Its only one orgasm regardless of which one was stimulated. Its ine system in that sense. And yeah fluids are shared. Ah ok. Interesting. Thanks. Hope you will share more So in other words you have about 10 inches of cock... Man, that in itself is completely amazing! Lol yeah kind of. TECHNICALLY. xD Just, wow. It would be so cool to see what they look like at their max! xD Wo!? Seriously? Cannot wait for this.\n\n&amp;#x200B;\n\nThanks for atleast posting pics. MORE! I LOVE YOUR COCKS That is so cool. Thanks for sharing!\n\nI hope I am not being rude by asking, but; Have you had sex and if so, how did it go? Yes I have had sex. With a few women and a couple of men. In general very good. Nice. Were you partner's able to take both at once? *volunteers to be your JO bud :p* If that is not winning the lottery of life, not sure what is. Again, thanks for sharing and I am very jealous. a couple of them were. some tried and could not, some would not brought it up. Makes sense. That is a lot of girth if two dicks. \n\nCan we see them erect? Question... Say you have only one hole available, or one hand... Do you have a go-to dick? A favourite one to use? What an amazing thing, to have a choice! Hope you post more pics soon!! Still waiting I am curious as to whether underwear is easy to wear or if they are a bit tight do you go commando? Are there any bulge pics around? hi that is some hot stuff &gt; &lt; Would love to see more of them", "Time to li(f)t up my favourite dress! ", "Felt sexy; took a picture.  ", " ever wonder what the girl next door looks like under her sundress? ", "Soft smile to match softer tits mine snapchat seasonslovak ", "Play time is not over yet, right? (F) ", "Diphalia ", "I am looking for camping partners! Must be ok with nudity and (f)ucking in the great outdoors 🙂 ", "One guy for each. ", "I like to think I am still pretty cute with no makeup 🥰 ", "Please cum again 😘😘😘 (first time here. Hiiii!) ", "Please remind me how amazing my tiddys are ;)  ", "Just a simple nude of a real, petite girl. I hope you like it! ", "How does it work? Do both of them function? Only one? Neither? Most say both function, although they both have different 'personalities' or like, different flow rates, different proportions of the total load / pee come out of both, and I bet (unconfirmed) if you held one tightly enough, you could make all of the cum or pee come out of the other one. Huh, well i learned something new today! I have been interested in diphallia for many years and also have some anatomy knowledge... here is some of what I know:\n\nThere are two basic types of diphallia. True diphallia and what is called pseudo-diphallia. In the first type the cocks tend to be arranged upper and lower. The second type, left and right. In the ‘true’ condition things tend to be more ‘messed up’ in other ways behind the scenes. there may be two bladders to drain and there may be associate problems with the anus and gut. One of the cocks tends to be developed more or less than the other and may be fairly non functional to an extent. The scrotum can be messed up too or split. In the true condition there are two genuine separate independent cocks though. At an anatomical level both have two corpus cavernousi (that is the two rods that make up the shaft of the penis like normal).\n\nPseudo-diphallus is different. In this situation, one cock splits into two somewhere along its length. This might happen around the base of the shaft, it might only happen close to the tip (see the double headed cock pic further down the page, and you might only be able to tell if you pull the skin back). In this situation typically there is only one bladder and the urethra (pee tube) splits too somewhere along the length. Both of the cocks tend to be similarly developed but the key thing is that both have only one corpus cavernous each. In essence you have two separate ‘half penis’ but of course in the case of those that split before they exit the body to everyone else they look complete in that each have a normal looking head etc...\n\nHow do that work? That is the big question. There is limited information out there and a lot of it can be from cases like ‘double dick dude’ which if turn out to be an elaborate hoax would be a great shame... remember also that in western countries especially most of us that are affected by diphallia would be ‘corrected’ soon after birth meaning that there are much fewer cases actually out there living to adulthood.\n\nThat being said, with pseudo-diphallia most of what our moderator said above is true. In essence the cocks function more as one. Pissing, and cumming occurs together as the tubes are connected. They erect at the same time etc. However, one may have more flow than the other and you could pinch one to keep it soft or from pissing etc...\n\nIn true diphallia, if you were able to find that extremely rare case with two well developed cocks, theoretically the guy would be able to independently drain each bladder at his will so pee out of both or one separately but he would have to pee out of both as he would likely have two bladders to drain... we have limited control of our erections so thoughts that lead to an erection are likely to erect both cocks but again theoretically they could work more independently eg if one got stimulated. They could also potentially cum separately.", "Do you like all natural real girls? 😊 ", "Who wants to snuggle? 🥰🌈  ", "I swear I always take the best pictures in the shower (F) ⭐️❤️ ", "the 4’11 Latin girl is super tight too 😇 ", "An actual user with (incomplete) Diphallia The user u/ratemydickp is the person. He posted photos of his condition to his account before he saddly deactivated it earlier today. Before he did so I got the chance to speak with him and ask him a few questions about his condition before he did. He had two shafts fused together with two heads at the tip of his conjoined penis with his one urethra in between them both. His conjoined shafts started next to each other above his testicles and then began to twist slightly as they got to his penis' two heads. It was truly great speaking with him and actually talking to someone who really did have diphallia (even if it was some incomplete form of diphallia). He posted a few pictures of his conjoined \"double penis\" as he called it, from several angles, both erect and flaccid. Sadly he deleted his account today as well as all of his photos, as far as I know only two (low res) still exist online, and you can find them if you google \"double penis\" in images. He did some AMAs and you can still find them on his account. I really am saddened that he deleted his account and wish he someday decides to return to reddit and share his story with us once again. I did not know where to post this so I decided to just post it here (maybe someone archived his images as well). If you are reading this man thanks again for speaking to me and sharing it with us. It was really something. Good luck out there. You have a gift. I did not find the images with the \"double penis\" :[ oh man wish i was here to see the posts :/ Did you have any image of it? Screenshot myb", "I never share my pussy and I am super nervous about it. How does she look? ", "An album of 20 of my archive ", "Your POV before you split me open with your tongue 👅 (f30) ", "5ft &amp; 46kg.. my body is built for one thing...🤭💓 ", "Just curious if you would fuck me?? (F) 😏 ", "Can someone drive me to school please? 🥺 (f) ", "Am I your type? ", "ould you rather fuck me in my tight ass or pussy? snap : atmpeer 😙😙😙 ", "(F)or late night scrollers ", "same case that the other   I wish I could find this guy to suck him off", "This is my (f)irst full body pic 🥺 hope someone likes it x ", "(F) Breakfast is ready &amp; you are more than welcome to play with your food.. ", "One guy, two big thick cocks ", "Feeling extra milfy this morning 😋 39y(f) ", "My nipples are so biteable and pussy fresh shaved. Want To try? 😇 (f) ", "✨ tits ✨ am I right? (f) ", "Hope this help you to wake up in a good mood. (F) ", "Some wanted more... Tell me if i should keep going... (F) ", "Just tiny 19 year old who wants to make you hard ", "I miss my naked nighttime drives 🚓🤪... and long hair :’)  ", "Two heads for the price of one ", "Back dimples for the win! ", "When I bent down my neighbor was extremely surprised 😇 (f) ", "was told that no one checks horny reddit at this time; any late nighters want to prove me wrong? ", "Is this curvy? 👀 (F) ", "Got nervous about this one and deleted, decided to repost! (F) ", "Hope futa is okay, we need more activity ", "Eat me til I cry, call that whine and dine 😏 30(F) ", "Would you fuck a girl with my boob size? ", "My first face reveal on Reddit 😊 I am both shy and excited. ", "Just shaved, I hope you enjoy the view 💕 (oc) ", "Does red suit me? ❤️ ", "Mireille G pour Thierry ", "Make some room for titties in your face ", "Partial glans diphallia?  This definitely looks like a double glans aka a double headed cock. Nice find! I wonder if he has two urethral openings and pisses and cums from two places. Thanks for sharing. I wonder how many other people are out there? I do not think so, it looks so rudimentary.", "😝 Does my ass meet your standards??😜😉1-10!?!?23 ", "Can we normalize being topless at work? I am here for it ", "Just hanging out ", "Nothin special.. just flashin my tits again ", "Do you like my tiny ass? 🍑 ", "upgraded to a better camera or you guys 💕 ", "Straight out the shower 💦 want to give me a reason to get back in there? 😼 ", "Hopefully a 33yo dreamer can still do it for you ", "Is it butt naked or buck naked? I always orget... ", "Vacation nudes hit different (f) ", "Who wants to bury their face between my Scottish thighs? 😈🍑 ", "Obscured base ", "is this inviting enough? ", "may not have a perfect body but it is all real🤍 ", "inally sharing my first full frontal on and off, here on GW. Took me 8 months because I was waiting till I felt ready &amp; comfortable and not doing for someone else. Cheers. ", " hello Reddit ", "u/ratemydick    These are the only remaining images online from the user u/ratemydickp before he deleted his account. Before he did so I got the chance to speak with him and ask him a few questions about his condition. He had two shafts fused together with two heads at the tip of his penis with his one urethra in between them both. It was truly great speaking with him and actually talking to someone who really did have diphallia (even if it was some incomplete form of diphallia). He posted a few other pictures of his conjoined \"double penis\" as he called it and sadly he deleted his account today as well as all of his photos, as far as I know these two are the only ones that still exist online. I really am saddened that he deleted his account and wish he someday decides to return to reddit and share his story with us once again. I did not know where to post these images so I decided to just post them here. If you are reading this man thanks again for speaking to me. It was really something. Good luck out there", "Have you even ucked tennis player? 🎾 ", "This guy also has something else different.  6 toes bingo  Any idea who he is? nope :/ Aw damn. Guess I will have to reverse image search", "I hope I am your type o(f) girl. ", "Anyone appreciate a simple mirror nude? ", "milf mode 🤓 ", "Beach day... If I am a sunny, happy mess now, what would I look like after a good (f)uck? ", "No reason to be shy, I am showing you all the places you can touch me ", "When you are bored at the traffic lights🤪🤭 ", "I get of(f) to you getting off to me ", "I love my nipples being sucked on  ", "I am bisexual so I understand why men go crazy for my kind of body ", "I broke my arm riding my horse so can I ride you instead? 🥰 ", "Just found this one on twitter  Where lol Link? Sadly this one is fake :/ This is so sexy", "If you were my neighbor I would cheeky smile at you like that 😈 ", " my hair has gotten long enough that I can now present my cosplay of Eve, and I am here to tempt you to sin with me 😈 ", "One above the other ", "First post: The first one I saw. ", "Do you enjoy big asses and stocking? check sc gushjuvenile ", "Might need some help applying sunscreen next time... 😳🙈  ", "Let us crawl into bed together. ☺️  ", "POV: Your 19 year old neighbor invites you into her room and you see this, what you doing? 😘❤  (who wants an anal post?) ", "Chunky ones ", "If we spend a night together, would you be back for more?🤭 ", "2 kids and a lot of breastfeeding later...do you still fancy me?  ", "how do i look in this? 🖤 ", "This was from a video, but the video got taken down which sucks  If anybody has the video, pls tell me", "Would you suck them both  All day long Nice edit. I do not mean that sarcastically, this is a very clean edit. Wish it was true I would milk them both What fun !!! 👅", "Car sex is underrated😈 (f) ", "Good morning (f)rom MI! ", "Its all i found about the guy of the down post :[  Do not say I am not good to you guys.  Hi not good to you guys, I am Dad👨 Thank you 😭\n\nWow those are hella interesting! This is diphallia or body mod?", "I hope extremely small latin girls make you horny 💕 ", "Someone know what happened with menkar_alkhiba? :[  Unsure. But if he does return, I would love the see more pictures / videos. It is so hot! Same", "Do small boobs get love here ? 25 ", "How deep could you uck me? 😈 ", "Hope I can make your Monday a little less “Monday” 😉 ", "First outdoor pics ever! Should i make more? ", "quite a package  How completely functional are both Not real no shit quite the photoshopping skills", "Oups! That might have happened on purpose ", " On vacation with friends 🔥 Meet me in the bedroom ! 😈 ", "24 (F) Wakey wakey ", "Saturday boredom. (F) ", "Ignore my silly face and look at how cute my pussy is pls ", "Late night post (f)or me ", "You come home and I am waiting for you like this... Staring contest starts NOW ", "Today it is officially the no bra day! I just made it up... approved? (F) ", "showing off in the mirror waiting on SC clunderclueless ", "Im sure this is not the first time that you see this but, to me is hard to find   I have so many questions If this is oc Same here I would love to meet him", "Never saw this one here. &amp;#x200B;\n\n*Processing img 37hg34oj47q61...* It counts. Where is this from? Any more of this? ive never seen two headed penis Where did you find? I think I found this on a 4chan board, but I do not know if there is more. Which one? I have posted this 7 mo ago, no idea anymore bro", "Unsure if it is real but it is damn sexy.  Wow... First new diphallia pics I have seen in a while, and they are beautiful! Where did you find them, are there any more? I wish menkar_alkhiba had not stopped posting, his are still the best I have ever seen .. He had an account on motherless and imagefap. Unfortunately he had deleted his accounts by the time I had found them. Please post any more you find, of him or any others... This is so damn hot! ikr. smh i thought this could be old pics of DDD b4 he had surgery, but im prolly wrong. still hot as hell Did DDD have a dick removed?!? oh no. he just had a surgery to space up in between them, since he was feeling the tensions there for long. or smtg. Look it up,", " Technically a sub incision, but also technically shut up he is hot. ", "A(f)ter the morning shower🧚🏻‍♀️ ", "Any real videos of cumming? I want to see how two dicks would come when attached to one body. Amy vids out there?", "Sometimes I wish I could wear my Sundress like this to show off my cute preky tits!🤭❤️ ", "I would not be afraid to show off either ", "(F)irst post! Cannot wait to share more (21) 🥰 ", "Sundress = easy access? ", "Outdoor nudity is the best! 🌿 ", "Hey babe, do you want anal or pussy tonight? ", "two’fer  Damn that is hot 🥵 Would u mind posying few more pics 🥺🥺🥺 It looks awesome Yummy!! I would love to get a taste of those! That is the hottest thing I have seen in a while! Sexy as fuck! That looks hot, can you do a video or more pics? 🥵", "Mine  would love to suck them both at the same time would love to suck them both at the same time would love to suck them both at the same time would love to suck them both at the same time", "My fuckbuddy moved so now I am in desperate need of a good tongue fuck👅...Any takers!?!?😜😉 ", "when i am horny - i am a slut😈 ", "Hot titties, (f)resh off the press! Get ya hot titties here! ", "Rubbing your own cock heads together  Is this from a porno? Yeah I think so Hmmm. Wonder which one ", "This is what I hide under my conservative clothes. Do you like it? ", "It is my birthday! So here is my birthday suit 🎂 ", "I would want to show off as well  Any idea who he is? You decide what hole or holes they go in", "I get your attention and you get to enjoy the view, sounds (f)air to me ", "Date night lash ", "Tell me if this pic put a smile on you face...Or some blood in your cock! (F) ", "This is one of my favourite positions to have my cunt and asshole fucked in. 😜 ", "What is the first thing you are doing to me? ", "I like this pic, but porn has made me feel weird about my non-bleached hole😣🍑  ", "The paler the skin, the pinker the pussy (f) ", "That other guy is so totally jealous.  It looks photoshopped to me", "Can we take turns eating our lunch??😝 You eat me, then I will suck you!?!?🤤😉 ", "I do not often wear a bra with this shirt but luckily you get to see what is hiding underneath ;) ", "How do you like this On/Off? 🥰 ", "took this right before getting ready for work, think u could convince me to stay home? 😇 ", "Black jeans (/u/doubledickdude) ", "Who needs bikinis anyway? ", "I feel like a greek goddess in this lingerie💕 (f19) ", "Consider this your invitation to pound my pussy! Will you RSVP? ", "Fine I will show you. But do not tell anyone! (F) ", "Is your morning wood ready to have some fun with a little Scottish lass? ", "I I made you stop scrolling, you deserve to bend me over ", "To the Dude that laughed at me today. This is what you are missing! (F) ", "Love making messes  "]