["Does myasthenia Give you very bad back pain and muscle pain? I was recently diagnosed and have uncomfortable back pain muscle pain and bone pain is this common with this condition? I am 25 years old and was diagnosed about three months ago thank you It was for me. It felt like I had growing pains. It went away once I started taking Pyridostigmine Thank you so much for telling me that I actually feel very relieved I thought I was getting osteoporosis or something it is so uncomfortable really East my concerns I really appreciate it thank you so much. No problem. This disease has been a really strange thing to experience. I remember wondering if the bone pain was going to be permanent and feeling terrified about it because of how horrible it was. Oh my gosh that is exactly what I am experiencing. The disease is hard enough without all the problems that come with it. Thank you again for telling me about your experience you have really Eased my mind. I have all kinds of pain from weak muscles being weak ! I have various muscle pain that comes and goes in different areas. Some days none at all, other days I have pain, and yet other days I am fatigued. It can be none of the items mentioned or any combination of them. I have really fluctuating pain, some days it is horrible and some days it is negligible. As I physio my guess is that it is due to the muscle weakness and that can wreak havoc, and may explain why it fluctuates. Hi, I just wanted to ask, when was your pain mostly? Mine is the worst on the back. Thanks so much!! Mine was in my legs. As soon as I started taking the ach meds the pain went away I have not had that experience exactly, I was diagnosed in January and my pain is mainly from not being able to hold my head and neck up in fact its changing my entire skeletal form and that is giving me horrible anxiety.  Also I could not chew food all year (still kind of) and I have jaw pain from forcing my mouth to close with my hand to chew and I swear my jaw line is eroding completely.", "Does anyone that has myasthenia gravis also have hyperthyroidism? Just wanted to know if I was the only one. If you have both do you follow a certain diet or eat whatever you want.", "I am a pregnant genetic carrier of CMS Hi, this is the only subreddit I found about this. I just found out today I am a carrier of Congenital Myasthenic Syndrome. We are going to get my husband tested as well and if he is also a carrier there is a 1 in 4 chance our son will be born with CMS or Congenital myasthenia. Reading about it online has scared the shit out of me, so I am wondering if people who are also diagnosed or are diagnosed with similar conditions can give me a rundown on how it effects your lives, and maybe things which would be good for us to know as his parents. I know its silly to get worked up about, especially not knowing if my husband is also a carrier, but it is our first baby and I personally am pretty worried. You know, as a parent you just want your kid's life to be perfect and easy(which I know is impossible, but one can hope, right?) \n\nThanks so much in advance!! Hello my name is omar , i am 19 and have myastjenia gravis treatement resistant and according to the 5 doctors i have been to it is possible my case is one of the worse they ve possibly seen . However i am currently on rituxhimab and mestinon as well 1s corticotherapy.  My case is stable as of the past few months.  According to my doctors any regumar case is more than guarenteed a normal life after this treatement , a normal case of myasthenia is easilt dealt with and most ppl don t sweat it much . Thr risks of it being lethal and dangerous and lethal like in ly case are ridiculously low and yet with moderne medicine it is still possible . \nTldr : normal myasthenia is managable and can even be negated by rituximab and even the most deadly forms can have somwhat of a normal life\nI hope this helps \nAlso i be only been on this treatement for 4 months as i got myasthenia from a thymus cancer last \nYear Hi! \n\nFirst of all, congratulations to your pregnancy! I understand your concerns and the anxiousness of wanting answers. I am a (F18), and although I was not diagnosed with CMS, I was diagnosed with Juvenile Myasthenia Gravis at 11 years old. My mom had to do everything for me except my homework. It was and is the probably the hardest thing I ever experienced,. I went through two thymectomies (because I still had some remaining after the first one), two rituximab infusions, tons of IVIG, and multiple intubations. My doctor later updated my status to Refractory Myasthenia Gravis. \n\nEven though all the hospitalizations and treatments, I still got to be a kid. My mom taught me early on in my diagnosis to not focus on my limitations but on my abilities. Which was very empowering as a child and now. She enrolled me in Muscular Dystrophy Camp, got me a wish from Make-A-Wish, and always help me find things that peaked my interest. I looked up to my mom and step dad for everything with my health. Seeing them not scared made me fearless and want to fight. \n\nNow, I know a concern might also be acceptance from peers as well. The kids at my elementary and middle school could not wrap their brains around my health, they were very empathetic to me and had my back. They would tie my shoes, help me up if I fell down, stand up to bullies for me, carry my things, send me cards in the hospital, look out for me, and more. One time, my next door neighbor rode the same bus as me since kindergarten and everyday she would wait for me to get in my house safely and help me up my steps before she went into hers. \n\nNot only did I have my parents, friends, and family, but I also had nurses and medical terms cheering me on along the way. My nurses and medical team would sneak in candy for me, they taught me how to swallow pills with pudding, dance and sing with me, hold my hand and sit in my room when I was on life support. I am very fortunate and blessed for the experiences I had and I am grateful that I am able to share them with you today. \n\nMy point is somethings are just not in your control but you can make the most of it. Yes the unknown is scary, but at the end of the day what matters most is that you will love your child regardless. Just because you have Myasthenia Gravis that does not mean your life is over. You just need to make accommodations and adjustments. Also, Myasthenia Gravis is called a snowflake disease, because everyone experience is unique to their own and no two are the same. Thus, your child can still have a fulfilling life if they are diagnosed with CMS. I can tell you are going to be a great parents. \n\nI hope this helps and I appreciate you taking the time out to ask! Wishing you a safe and easy delivery and congratulations to you again!!", "Prednisone aesthetic Any one else commiserate with me on not recognizing yourself in the mirror while on high dose steroids.  It is cosmetic, the least important thing and when your breathing is compromised you KNOW what is important but it is just so disorienting and as someone who has struggled with eating disorders it is doubly disturbing. Just looking to know that other people get this thing that feels so shallow but ends up consuming more of your energy than you would ever imagine. It is the absolute worst! The chipmunk cheeks! I have so many pictures of life events that I hate just because of my steroid face and body. Luckily I am off now and it went away even as I began to taper. Hope you get off soon! YES! YES! YES! I understand and felt the same way! I felt ungrateful that while I was finally able to “live” again, why was I so fixed on what I looked like. I had less trouble with it when I was bald with  cancer. But the prednisone bubble head was intense! I was good for almost 6 months - I really watched what I ate and exercised a ton! Then BAM!!! It all came to a screeching halt - the weight was not gradual it was an avalanche over night it seemed. I became the staypuff marshmallow monster from Ghostbusters, the Michelin Man, the super cute wombat with glasses meme over night! My doctors even felt bad for me. I gained 60 pounds in less than 3 months, the depression and humiliation was real. \nIt was a long road getting off prednisone - lots of crying and anger but I am almost 2 years out - I am happy to report my head has now shrunk to normal size and my body is following suit but it is a PROCESS to say the least - the struggle is real! My skin is different now - I am not 30 anymore, heck I am not even 40 anymore so it is to be expected my skin just could not keep up after all that ( and I have some issues around that) but I try to find gratitude where I can and I look at those wombat days as a necessary evil - like no hair during chemo. My heart goes out to you and YOU ARE NOT ALONE. We all feel it, some more than others - you are not shallow. Looking like you is psychologically important - I learned with cancer that looking different is hard, it is a friggin pep talk everyday just to meet a friend or even come out of the bathroom. It was worse with MG and prednisone cause with cancer at least people know/understand what you are going through but prednisone they just think whatever they think when they see a heavy person. \nI use to say to myself, “ hey there wombat girl!!! You will not always be a wombat!” Big hugs to you!!! Be gentle and loving to yourself - you are going through something no one but people like us understand and it is HUGE! Just try to not let it consume you. It is amazing to see a jawline again LOL! Totally understand!!! My doses are really high and I do not feel like myself anymore, like if my mind was somewhere else. Have not gain weight cause Iam controlling what Iam eating, I just lost a lot of weight recently and I do not want to gain anymore, not sure if it is something I can avoid, but Iam scared.\n\nBut you must know... You are not alone on this journey! Remember to tell yourself that you are beautiful no matter what, and that the pills will make your body stronger. I completely feel this! Hardly recognize myself I needed this thread so bad. I did not even consider the weight gain and chipmunk cheeks and consequent body dysmorphia I was going through was because of prednisone! I have been on prednisone for 6 months now and have put on 10kgs! (22 pounds) so fast. Reading the comments on this made me feel a little less alone. I am grateful to have strength again but feeling and looking like my old self might take a while ..\nIt hurts though because friends and family do not realise that it is from the steroids either so I get a lot of, “Your MG is better now why do not you exercise more you have put on so much weight”, “You have started to gain so much weight what happened?” And that really gets to me. That when I most forget to just be kind to my healing body, the body that after 7 years of misdiagnosis finally has the help it needs in the form of prednisone and pyridostigmine.", "Living with MG, my story so far... ", "Always in pain! I just got diagnosed finally with MG after symptoms since the beginning of the year. Countless hospital visits..ect. I wake up in so much pain everyday and I am trying to figure out what helps? Can anyone let me know what helps them with there symptoms and pain?  For some people diet makes a difference. Less meat.  For some it is just a matter of getting the right medication.  Stress makes it worse Thank you! It just constantly feels like my body is being pulled to the ground. I do not know if that makes sense. Just hurt so much constantly tired and ahhh I take mestinon but maybe I am not on a high enough dose. Idk just frustrated I get what you are saying about feeling pulled down. I know I need to nap when my mind continuously drifts to thoughts of sleeping on the floor, or the deck, or the lawn or just about any flat surface nearby. \n\nI recently had a small increase (25%) of my mestinon dosage and it really seemed to help with that feeling so you are probably right about a medication change being required. It took me a bit of time on the new dosage to feel the change but it is been a noticeable improvement. Definitely worth talking to the doctor about it. Good luck. Plenty of rest and managing stress helps. Taking the correct dose of pyridostigmine at the correct times helps me as well. Periodically I have delayed a dose or taken a smaller dose since I feel well and that usually does not work so well in the long run. Sometimes my allergies aggravate the MG so I always stay on top of those. In the end, some days I feel better than others. Pain is not a symptom of MG Does anyone get horrible stomach aches from the medications? Feels like my stomachs on fire What helps to stop it ? Very helpful information thank you I am not sure what medications you are on but I had a lot of trouble with the Mestinon. My neurologist suggested Loperamide, the active ingredient in Immodium, to counteract the effects of Mestinon on the digestive system. I now take one Immodium every morning and counter the effects with a tablespoon of Metamucil every night. I also cannot eat large meals anymore like a burger and fries will be too much and I can have either but not both. The combination of Immodium, Metamucil and small meals has relieved all of my stomach related issues. \n\nI have played with this routine many times and I keep having to come back to it. Not sure if it helps but it is a place to start. Good luck. Thank you so much! This really helps. I am going back to my doctor next week so I will ask her also. I am gunna try your method seems like it should do the trick. Much appreciated.", "Anyone here have heart conditions AND myasthenia gravis? Hello all, \n\nI am currently in the process of being diagnosed with myasthenia gravis, due to having nearly all the symptoms (trouble swallowing, muscle weakness, vision problems, ptosis, etc...) but I also suffer from SVT (supraventricular tachycardia), which has made my heart rate go up to 176 beats per minute and I had to get my heart restarted once. I have had SVT since my late teens. I cannot find any information if this is common to have both a heart condition and MG, but I also know MG is pretty rare. So I am genuinely curious if anyone else has had similar health issues as me? My husband had a heart attack before his diagnosis and before MG symptoms showed up.  He got a stent and is doing ok. It took a year before his MG medications became effective", "MG and Covid-19 vaccine Hi, thank you for this community, I would been reading the post slowly as they are very interesting.\n\n\nIs there any contraindications in taking the vaccine?\n\nWhich are the pros and cons with the different labs that provide the vaccine (AstraZeneca, Pfizer,... etc) regarding MG?\n\nGreetings from Colombia\nThank you in advance My doctors recommended I get the vaccine, however, the efficacy depends on what treatment you are on. Thanks! I am taking Pyridostigmine (Mestinon) and  Azathioprine Since you are on an immunosuppressant, you‘ll likely have less protection from the vaccine. I was on only prednisone and mestinon when I got both doses. I am going to get a blood test done to see if I have any immunity, but I did not have any crazy side effects/ flares after getting the vaccine. It was recommended I got it by my neuro. The covid vaccines are not a “live” vaccine - so not a problem for the majority of us - \nI did not even have side effects from my \nPfizer  Vaccine. Thank you for your answers. Now I feel more comfortable to take the vaccine. Take care! My neurologist highly recommended that I get vaccinated. I had Pfizer and did not have any side effects. I am on on pyridostigmine.", "How do you manage to work with your MG? Hi All,\n\n&amp;#x200B;\n\nFor the past two years, I have had a tentative diagnosis of seronegative Myasthenia Gravis, mainly tentative because my neurologist wanted me to get a single-fiber EMG before fully labeling me as MG. This got pushed back from insurance and covid but I am finally being referred to a neuro-muscular specialist.\n\n&amp;#x200B;\n\nMy main question is how do you manage to make an income with this disease? I am in grad school \"full time\" but really only spend 10-15 hours a week on it. I was planning to adjunct a class or two and do some freelance writing when done with school, but, If I am being honest I do not think I can manage to really work more than 15 hours a week with this disease. How do you all manage to make it work?  \n\n&amp;#x200B;\n\nI really do not want to file for SSI OR SSDI if at all possible, but may have to keep that open as an option. I am in grad school, work a real job 40 hours a week and an internship on the other two days I am off work from my real job. So I work 7 days a week in addition to doing coursework. My disease is severe and I am hospitalized frequently, but not since February, since I have been on a high dose of prednisone for a while now and started receiving rituxan in March. Prior to this I was absolutely miserable for a whole year. Nothing was working and they diagnosed me with refractory MG and lupus. So, I really do not have an answer to your question except that for me at least, I have no choice but to work. As I do not have friends or family to help me out and SSD does not pay enough money for someone to reasonably live on. I do, however, receive reasonable accommodations through both my school and my job. So I am able to work from home some days of the week and others I am in the office. With school, I get extended due dates and more time on tests and audio versions of textbooks and all online readings due to the blurred and double vision from MG. So, that stuff could be helpful. I will check into resources from my school, so far I mainly have essays not tests but my professors have been really great managing if I need extra time from a flare up. I also do not have people to rely beyond my mom who lets me live with her in exchange to help her with chores. But she is not doing so well and I imagine in a few years I may not have this option. So far all my ideas are to either find a remote job, do adjunct and freelance work because like you I do not have much of a choice. Does the blurring effect your ft job? I find that this is a problem for me. I am on the computer less in my full time job than when I am writing papers and reading articles for school. This has worried me for a while. Taking pyridostigmine and knowing when to rest has made a difference. I adjusted my physical activities on the weekends and limit my social outings. I am fortunate my job is a mixture of computer work, collaboration with other employees, problem resolution and future planning. There are days when my hands hurt to much to write or type so I try to do something else. When I feel good I try to complete work that is more physical. When I do not feel well I do something not so demanding. Most importantly I constantly work on managing stress as that is a big trigger for me. I make sure I get extra rest. My entire life I functioned on six hours of sleep and felt great. Now I do about ten a day which helps a lot. I guess all the little things I do differently now add up enough to get through my work day.  Some days are more challenging than others. Your totally right about managing physical activities. I was doing pretty decent, but I need to have my meds adjusted as my limits seem to have decreased without me doubt anything different from my normal rest schedule. I am more calmer now hearing stories of people being accommodated at work if I ever do pursue a 9-5. I do think I may stick to freelance and adjuncting so I can manage my schedule better unless I need more pay.\n\n The past month my eyes have been super droopy doing any work which sadly is all remote online. That is my hurdle right now I hope can be managed better. Do you feel rituxan has made a big difference to the disease? I was hoping to start it this summer but instead my MMF dose has been increased which is not working so well. Hopefully in future I will be able to have it so just need a bit of hope it might make a difference🤞 I am 70-80% of what I was before this flare that has lasted almost a year. So I think rituxan has helped greatly. I am on cellcept as well for maintenance and VERY high doses of mestinon.", "May have this I was recently told by my doctor I may have mg, I have had trouble chewing for a year now and it is gotten to the point I can barely chew and swallow, even soft foods or liquids, I am at the point I want to ask for a feeding tube as I am practically starving all the time even though I have gastroparesis. \n\nI had blood taken the other day but it will take weeks to get back. She says I probably either have myasthenia gravis or multiple sclerosis.\n\nIt is like my muscles in my mouth do not know how to work anymore, how to chew, move my tongue and food around my mouth and how to swallow. I also have trouble smiling etc. I also have muscle weakness in my hands, arms and legs. As well as my hands constantly going numb.\n\nCould I have this? So sorry your going through this. My first symptoms were actually trouble swallowing before it became generalized. Did they at least give you some Mestonin to try while they wait? Most doctors usually have no problems giving a trial as it has very little side effects. When I was first given it I was able to eat alot better, but I still choke sometimes on dry and chewier foods. \n\nI am not a speech therapist so do not take this as the right method but for the past month during my Myasthenic Crisis I was basically choking on everything and mainly subsisted on protein shakes and apple sauce when I could barely swallow. Very soft pasta with alfredo sauce or mashed potatoes if I could manage a bit more. \n\nIt sounds like your a bit worse at this point for the advice above.  If you absolutely cannot swallow water or your own saliva please call your doctor or go to the ER ASAP. If you do have MG that could easily turn into a crisis. Hours before I went into a Crisis I could not even swallow water without choking.\n\nEdit: in terms if you could have this? It is possible but there are also quite a few other diseases that it also could be. You need to see a neurologist or neuro-muscular specialist ASAP. They will most likely do a range of tests to confirm it. It is going to be too hard for someone on reddit to confirm. Good luck. You can always message me of you need a friend to talk about it. They did not as they wanted to test me first and are not at all familiar with it, just talked to another doctor about my situation and they suggested I get checked for it. I am leaving for vegas tomorrow for a week for a planned trip we have had for months. Today I am a bit better and can swallow water and even ate a bit of soft hamburger today woo!\n\nIf it does get worse in vegas I will be sure to visit the ER, especially if I cannot swallow my own spit or drink water like how it gets some days. As soon as I get back I am asking for a feeding tube though if I do not end up in the hospital in vegas.\n\nI will not be alone at all during this time so I am not too worried about going to vegas, just if I have to go to the hospital but I do not think I am quite at that point yet.\n\nThank you for the kind advice I really appreciate it! So my advice: get a new doctor if you do not like the care. I do not know if that is a neurologist or PCP but if it is a PCP they should not be messing around with that and just refer out. You also may need more than bloodtests to be diagnosed. They are not trained in these diseases at all. My PCP admitted this to me herself and she constantly has to rely on guidance from my neuro. My neurologist has to rely on a neuro muscular specialist. If it is your neuro then I think you need to tell them directly how bad it is and just ask if they will give you a two week trial to see if it helps at all.\n\n I do not know about feeding tubes, so def ask your doctor who you feel is knowledgeable. Hopefully they can give you a med to try and see if it makes any difference before that. You should not have to beg for a feeding tube before they try medications.\n\nI live in AZ and let me tell you there are many of doctors, EMT's and nurses who have no clue how to treat these diseases in my state. Look up emergency plans and instructions and have them printed and in your purse for worst case scenario for both diseases until you are fully diagnosed. You may not need it now, but they have saved me plenty of times so always have them.\n\nAlso just so you or anyone needs to know: if you start not being able to hold your head up and have trouble breathing these are signs you might be in a myasthenic crisis. Call an ambulance ASAP.  No clue if you actually have MS what you need to look out for. Gotcha, it is my pcp but she probably does not realize how serious it is tbh, and I have seen a neurologist before for different problems so I can possibly get into them sooner than a new patient would but they are still weeks to months out usually.\n\nI have always been prepared for the possibility of a feeding tube because of my gastroparesis but I will mention the meds first and see if they help. I live in Utah currently.\n\nAlso thank you I will be sure to get emergency instructions just in case. Yeah I do not think she does realized how serious neuro-muscular diseases are. Try and explain to her the seriousness for a referral and qualified neurologist to review this. If you can see a neurologist maybe try and explain the need for an urgent appt. Many times if there is a serious illness and symptoms severe as yours they will find a time somehow for you.  \n\nI hope you do not have to go to the hospital and you have a great trip. Maybe if you call and lay everything out to the PCP's office how serious this is she may give you a trial of Mestonin before you go. Sadly I am leaving tomorrow and the doctors office is closed. But in case of emergency I can tell my husband what meds they should give me.\n\nI will also be sure to call my neurologist and see how soon I can get an appointment. Well have a great trip :) hopefully LV is not too hot, or they already have some indoor pools. I would love to swim inside a pool right now, but like an indoor pool with AC. It is just too hot for me in AZ! Thank you!! It will be quite hot but we will mostly be out and about at night luckily. And we will hopefully be swimming if it isnt too hot! Luckily our local rec center has an indoor pool and it is a life saver haha. I hope you will have an answer soon. I second the recommendation to see a neurologist ASAP. In addition, if it really turns out to be MG please look up what drugs you are not supposed to be taking. There are a couple of antibiotics and antidepressants you should not take. Some antibiotics can even trigger myasthenic crisis in the worst case, and most doctors do not know about it. Alcohol also worsenes symptoms. I had some weakness with chewing and swallowing once of twice before I was on pyridostigmine.  I noticed that after talking for long periods of time and eating hot foods made it worse. After starting the pyridostigmine I do not seem to have those issues. Some days my hands still hurt but that is usually right around the time I need my medication.  I still experience a few hours fatigue each day and I just have to rest then. I too live in Utah and there are good neurologist here. It may take seeing a few before you done find one that you are comfortable with. Thank you for letting me know, I take over 10 different medications a day for different ailments including depression and anxiety. I have not had antibiotics for years but I will be sure to look up what ones are a danger to me. Thank you! I have a neurologist I already see but I am not sure if he is familiar with mg so I may have to do some searching around. I am in utah also and the university of utah neurology dept has experts on MG. I have been looking because I ended up at the er and the doc there suspects MG.", "Looking for advice for diagnosis Hi all,\n\nI have been having on and off weakness issues for the past 2 years. Recently I discovered this disease, and everything seemed to make sense. However, when I went to the ophthalmologist about my droopy eyelids, he was quite dismissive. That day was a better day, but I did show him some photos of worse days. He said it could be myasthenia or a physical issue, that he could test me, but it would be better if I watched my symptoms and only came back when “I was having real problems”, and said that “myasthenia often goes away or remains in the eyes, and is quite common”. From my independent research, these statements seem false. I did however get him to send me for blood testing, and I am awaiting AChR blocking and binding antibodies, but even is I test positive he seems reluctant to send me on to further specialists.\n\nMy symptoms are very variable. When I am in a bad state, I struggle to walk to my work (10 minutes away) and breathing gets very difficult. It almost feels like I am falling asleep, but I cannot sleep when I try. My eyelids also get (mildly) droopy and my vision blurred. Other days I feel completely fine. I have never had swallowing issues. I have been to a PCP everytime this has happened but they always turn me away after a CBC comes back normal. \n\nOverall I am quite frustrated, and not really sure what to do. Is my ophthalmologist correct? Should I just wait to see if my symptoms progress further? Or should I push for further testing? I have been like this so long I am honestly not sure what is normal or not at this point. \n\nThanks for your help, and I apologise if this is the wrong sub for this. I do not have it but my husband does. Only one eye is affected usually and they can test by holding a cold pack on the eye and that usually helps it get better. \n\nMy husband was having blurry vision because one eye had gone crocked. When cold it went right.\n\nNot sure if that helps but I would talk to your regular doctor as well. Thank you for the response! :) very helpful If you do not get much help here feel free to ask me more and I will help when I can. My husband was also feeling weak and he felt it was though his hands forgot to do what his mind was telling them to do.  Especially after a repeated motion Use the ice pack test on the droopy eyelid. The get tested for the antibodies. Ridiculous response from them. Go to your doctor. By the sound of your symptoms its generalised already - there is no need for you to suffer someone not taking this seriously. Hopefully the first line of treatment (pyridostigmine) helps you. Being diagnosed can be a long process but try to find a good neuro if you can. It took me 1,5 years and more than 6 dismissive ophthalmologists and like other 10 specialists (vestibular, ENT, neurologists, psychiatrist) to get to a diagnosis. And only after my symptoms worsened did they actually properly take myasthenia into consideration.\n\nMy advice - do not despair or self-diagnose obviously, but at the same time do not be afraid to be your own advocate. Bearing in mind that myasthenia is rare, if you doctors have ruled out other issues (cannot give a differential diagnosis for you, but in my case it was vestibular testing, head MRI, thyroid panel, binocular testing), then myasthenia is definitely an option. Just keep in mind that you can have negative blood tests but still have it. Could require further testing so, again, I would say push for these if you feel like there is definitely smth wrong with your body and doctors do not have an answer. Too many times I was told to just live with it or just ignore it when I walk do not the street. You cannot fing ignore double vision thank you very much. \n\nMine also started with super subtle symptoms like feeling out of body - not classic lol but I think it was because I was losing my 3D vision due to my eyes muscle becoming weak. \n\nAlso do not wait for symptoms to progress just so the docs job is easier. It is easier to control in mild/moderate forms and you want to stop it from generalising further, if it is myasthenia.\n\nAlthough I do know this is a rare disease I am constantly frustrated with how many PCP and even neurologists are not familiar with this and are dismissive. \nBest of luck and keep us updated. Ditto this.\n\nIf you are having generalized symptoms, you need to see a neurologist for treatment and care.  Go to PCP for a referral.  I would recommend going to the best research hospital in your area, the neurologists there will be better prepared to diagnose and monitor your condition. Thanks for your help! I am glad I am not the only one who thought this response was ridiculous! Thank you! I will definitely go to my PCP. Thanks! I have done the ice pack a few times. I do always see improvement (which prompted me to visit the ophthalmologist). Awaiting results for the antibodies :) Thanks for sharing your story. I definitely empathise with your experience with dismissive doctors, but totally agree I do not want to self diagnose which I think holds me back from pushing further. But I definitely will try to advocate for further testing! :) thanks again!", "Could this be myasthenia gravis (PLS advise) Generally very healthy but about 5 years developed sudden ptosis in one eye after an eye infection. Had another eye infection last year, ptosis got worse. Worsens when tired/in the evening. Sometimes double vision when Im very tired usually after 10pm. \n\nAlso sometimes a tingling/numbness in a very specific area on my face/running down cheek to chin on one side. \n\nOne side body weakness/numbness particularly most noticeable when typing-fingers feel slower-less agile. than the other hand. \n\nI tried the ice pack test on my ptotic eye- and it was positive.\n\nIm currently waiting for blood antibody results. Do you think i have myasthenia gravis 😢☠️\n\nalso, Ive been getting a lot of chills upon exertion, some joint pain in the morning when I make up. Are these related or do i have something else? Definitely sounds like MG and the onset of symptoms was very similar to mine. Hope you get results soon and can get started on treatment! yeah well, just tested negative for the main ACHR blocking, binding, antibodies... Did they also test you for Musk? And do CT of chest? It is not unheard of to be negative antibody but still clinically diagnosed with MG im still waiting for musk. idk ive also been having some mild numbness/weakness one side of body and i do not think that is an MG symptom. I had numbness and still do sometimes that the drs say is not MG but I think they just do not know fully. I had my first neurologist tell me that he has multiple patients with the one sided face numbness/tingling. I also had my hand go numb some and my fingers lock up and stop working while typing as well. It started off by just slowing or feeling stiff then fully locked up. So I think you should continue to push for diagnosis and get a CT and get a doctor to test you on mestinon for the symptoms. but for me, it is been having over the past 2 months where it was first numbness in fingertips, then now more of a general mild numbness on/off in hands/feet/leg etc mostly all left side. it is weird bc the eye pain that ive been having is in the left side but ive have a ptotic eyelid on the right eye for years before this reset onset of strange symptoms. My left leg sometimes feel stiff/weaker than my right when I walk. But on MRI, no spinal or brain lesions like multiple sclerosis.\nstill think it could be MG? i know the ice cube test is accurate (my right eyelid went up markedly when I did it) but i just do not know anymore :( I get numbness in extremities when they are too fatigued. As to the eyelid, it could be because you are left eye is working harder I had a similar issue as well when I first had onset of symptoms. \nFor me I had rapid onset because I was studying for the bar but most people I think is much more gradual as yours. I still think MG personally based on the overall onset and symptoms. Each case of MG is different but they do have similarities. \nDid you only have MRI not a CT? \nI think overall you have to be your own advocate and you know your body better than anybody or doctor so sometimes you have to push to get the correct diagnosis. Have you tried taking mestinon yet? My all my blood tests came back negative but my doctor prescribed me some and basically said “Take this. If it works, you will feel the affects in 45 minutes. If you are not sure, take more. If you take 60 mg and feel nothing by the 3rd day then I think it is safe to say you do not have it.” Within 45 minutes of taking 15mg it is like I felt blood rush through my body. I did not know my body could have that much energy This does not exclude mg. get tested for musk and lrp4. If negative you might still have seronegative mg so get a single fiber electromiography (performed by somebody who actually has experience with this, otherwise pointless). Just FYI, as an mg patient. Some symptoms could be secondary. For example, if you have weak muscles than you can theoretically compress some nerves leading to numbness and sensory deficits. Nad and not saying you have/do not have mg I tested negative with the bloodwork, but came back positive after a single-fiber EMG. for all the people here who have suggested MG, can you please share your symptom onset/body part etc? Thank you so much!", "What to not do! What is a bad thing to do if I have myastenia gravis? Not getting enough sleep. Overdoing it. Listen to your  body. It will tell you when to quit and rest.", "Congenital Myasthenia Gravis..I which I have , it is kind of rare ..just trying to see if anyone else here has it (diagnosed 6 months after Birth) I would have a few questions for anyone on here that has CMG, I am 44 and just have not had any changes throughout my life and have always been on mestinon , as I was told many years ago , was not much they could do due to its congenital , I am curious if anything has changed and If is what has , I am really weak all the time these days and up until 4-5 years ago , I was pretty stable in the best ways I could , any feedback would be greatly appreciated..thank you in advance My daughter likely has this.  None of the tests have come back positive, but her symptoms are 100% matching and she responds to mestinon.  The genotyping test was also negative, but from what I have read, the sequencing list is not complete. Okay , how old is she ?..and what made you check her out ?..I had to have a muscle sample cut from the top of my thigh with no medicine at all , no numbing ..nothing ..about an inch and half cut in my leg while strapped down so that they could test the muscle tissue I guess, kind of inhumane but that was the procedure , I was probably like 5-6 years old , also please forgive me I forget the name of this test , I had to hold a small roll like object while holding my middle finger straight out , while Hooked to a Machine , I remember my finger tiring out and shaking they were testing my muscle endurance, but I have just been on mestinon, and was curious other options have come available", "Do I have myasthenia gravis?  Need help understanding the test. In the process of joining the military and it is impossible with this on my medical record. When I was younger was diagnosed with “pre assumed myasthenia gravis” did not have any formal test done so decided to actually do the test thanks in advance. From these lab numbers you do not seem to be AChR positive but if you have myasthenia symptoms you may have it still. Definitely follow up with a doctor preferably neurologist or nuero muscular specialist Thank you 🙏 I am going through this right now.  Every blood test I have done comes back negative but the meds they give for MG work, so its a presumptive positive, I am told.  \nThe meds do not work 100% so he has me doing the IVIG.  My last dose was Friday so I am waiting to see how it works.  \n  Get a good neurologist and hopefully they can help.", "Symptom Advice Hey everyone,\nI am not sure if this is against the rules, please let me know if so. \nI am sorry for the long post, I want to explain what I have been going through and ask for everyone is opinion or insights. \n\nTLDR: 30 yo FM with enlarged submandibular lymph node, enlarged thymus and symptoms of extreme fatigue, brain fog, possible muscle weakness and weightloss. \n\nJune 2020 I saw my PCP for extreme exhaustion and an enlarged lymphnode on the right submandibular region. The lymphnode was biopsied, came back benign.\n Sept 2020 the area below the lymph node on my neck seemed swollen so I went back to pcp, we discussed this as well as me feeling short of breath or tightness in my chest on and off. She sent me for a neck CT and incidentally they found a \"mass\" in my chest which turns out to be my thymus enlarged to the measurements of 3.4 x 2.6 x 6.3 cm. The CT shows soft tissue density without obvious fat interspersed.  No one seemed worried about anything so I did not really look any further for diagnosis. \n\n(At that time they suspected it may be lymphoma but that was ruled out. You may see in my profile that I was posting on r/lymphoma for advice as I was facing the lymphnode biopsy around this time.)\n\nFrom Sept 2020 until now (April 2021) I have been having strange and troubling symptoms on and off. These things are all very transient so I will do my best to explain. \nFor a period of time I experienced a strange feeling of muscle ache/exhaustion and a feeling of \"fullness\" in my throat. The muscle ache I felt seemed to be the muscles inside my throat, not my neck. I remember thinking to myself it felt as if something heavy were hanging down in my chest and tugging on the muscles or ligaments in my throat if that makes sense. \nI also remember noticing for a short period of time that my throat seemed to still have chewed food after I swallow. I would need to swallow a few more times to clear it. Incidentally I also remember liquids regularly entering my sinuses at that time when I would try to drink. That passed, I saw an ENT, she said GERD was responsible. \nI have days ocassionally where I will be doing regular chores like folding laundry and my upper arms/shoulders feel ready to give out. I need frequent breaks. I remember one specific instance where I was hanging up my shower curtain and I was able to do 2 or 3 hooks at a time before the burning in my arms forced me to rest.\nOcassionally, as I am standing doing dishes or cooking dinner my legs seem to shake for no reason. They shake as if I had worked out very hard the day before and they are exhausted. I remember one specific occasion where I jogged from my front door to my car and back because I needed a pacifier from the car. When I got back into the house I had to hold the counter to get to the couch my legs were so fried. After resting a minute I was fine. \nOn another occasion I was doing dishes and my legs were wobbling like a baby giraffe. \nI do not have double vision but my vision does seem to be more blurry lately. Some days driving home from work my eyes are so tired they start crossing. \nI have had a few strange pressure headaches. They are not painful but my eyes feel very full and irritated. I mainly feel the pressure in and behind my eyes when I feel it. \nI have also had transient episodes of chest pain that feels like tightness or heaviness in my chest that is sometimes accompanied by wheezing that I can feel/hear, although it never gets extreme.\nSome days I seem to drop things repeatedly. They fall right out of my hands. My phone, for example will just slip out of my grip. \nI finally went back to my pcp this week because of the episodes of weakness as well as recent episodes of hand tremors that I cannot explain. (Meaning I have eaten, I have had rest and I am not emotionally stressed so I do not know why they are happening.)\n\nMy pcp did blood work which showed a few things. Some anemia, vit. Deficiencies and she did an ANA which showed a 1:160 ratio with finely speckled patern. I beleive I do have thyroid antibodies, although my thyroid is currently functioning normally. \n\nA lot of these things can be attributed to anxiety, the anemia or the vit def. I have been in and out of the doctor so much over the last few months that I am hesitant to really push much harder, I am worried they will think I am attention seeking. \nMy concern is that the anemia and vit. Deficiencies are things I have been dealing with. I know what that exhaustion feels like. This feels different to me. \nI may be jumping the gun because I have an enlarged thymus, perhaps all these things are not really connected. \nIf anyone has any insights or any advice to offer or even just wants to share their own story I would so appreciate it. Do you have ever have trouble with slurred speech/ nasally speech? \nThe trouble swallowing and getting liquids in your sinuses makes me think it could be worth seeing a neurologist to get checked for MG.( does water get up your nose when drinking sometimes?) \n\nAlso the extreme weakness in your extremities and heaviness on your chest is also worrying. When I was really sick with it, I would feel that it was really hard to get a full breath in and I could not lay flat on my back. \n\nI hope you are able to get in to see someone, and feel free to send me a message anytime! Thank you so much for the response! \nI have not ever had any noticable speach issue. I do talk extremely fast and lately I have had to try to slow it down because I find myself getting tongue tied a lot. \n\nIf you do not mind my asking, I have kind of a specific question. A lot of the symptoms I am mentioning here are really transient for me. I experience them infrequently and for the most part it is all pretty mild. I am really wondering if this might just all be in my head. Maybe just a strong hypochondriac reaction as I am aware that I have the thymic mass. \n\nWhen you experienced your symptoms were they very obviously something wrong, or did you go through a period of time where you thought you might just be imagining some of it or over reacting? Yeah, I first noticed a drooping of my right eyelid— which would usually get worse later in the day/ when I was tired and stressed. \nI definitely did not know what to think, and did not really take it very seriously at first because it would get better and worse. \nA few months in though I ended up with double vision and both eyelids drooping. Eventually it got to generalized so it affected all my muscles \n\nI can get overthinking and thinking you are overreacting, and I totally do not want to add to any anxiety by making this bigger than it might be, but as someone who has had a few ICU visits because of this, it is worth it to get it checked out. \n\nBe pushy, a lot of doctors and even nurses can be dismissive of your concerns, but it is better to be safe than sorry ❤️ Thank you a million, I cannot express how much I appreciate the information and the time you took to share it. Greetings. My initial symptoms were much milder than what you are experiencing but they were also periodic and varied in intensity and duration. \n\nMy diagnosis took a long time and was disturbingly lengthened due to the fact that MG is a very rare condition and my first neurologist was well beyond the age he should have been practicing. Three different specialists all failed to identify my symptoms as possibly being MG (and at the time I knew nothing about MG) therefore testing was delayed until I demanded and eventually received a referral for a second neurologists opinion. The second neurologist had suspicions of MG on my first visit and within two weeks my diagnosis was confirmed and I was being treated. \n\nMG is a rare condition, many (possibly most) family doctors will never actually treat a case of MG so it is not top of mind for them with our symptoms. Given some of the symptoms you describe I would request a neurologist referral specifically addressing your concern of MG. If tests come back negative for MG then request further testing until all options have been excluded or you have a diagnosis. Your symptoms, like mine were, can be dismissed for a long time but they are your body telling you something is wrong.\n\nConsidering it might be MG may you find your path to diagnosis free of obstruction and your stride long and strong, best of luck. Thank you very very much for sharing this. You are welcome. Whait what do you have because I have the same symptoms as you? I have generalized myasthenia Gravis I agree with the above and believe that you should ask for the antibody test. My symptoms were more rapid in some instances because I was extremely stressed taking the bar but they are transient and the more fatigued, hot, or stressed you are the worse they will get. Thank you very much for the response.", "Recovering from covid/pneumonia I am finally at home after a 10 day stay in the hospital for covid/pneumonia. I am still on oxygen and need to take it easy. The first several days I was there were rough and I was not making any improvement, but I finally turned a corner and started getting better. Thankfully I had just had 5 days of IVIG before I got sick. I was fully vaccinated, but cellcept may have made the vaccine less effective. I just cannot wait for all of this to be behind me! Covid is no joke! I wish you a speedy recovery and hope that you do not have any lasting lung issues. Hope you feel fully recovered soon! How much cellcept are you on and what vaccine did you get? Thank you! I am on 1000mg twice a day. I got the moderna vaccine. Thank you! I am on 500mg twice a day and got Moderna too. Do you normally get IVIG? No, I had only had one other round about a year prior to this one. I will be talking with my doctor about whether we are going to continue IVIG. We are you in ICU? No, thankfully I was not. Are you still short of breath or lightheaded when you get up? My boyfriend just came home and they did not really tell him anything he could be doing at home. They sent him home with a volumetric exerciser but his lungs can hardly do it Not any more. When I first came home, yes. I am still on oxygen but I do not think I will be on it much longer. Did he come home on oxygen? And do you have a pulse oximeter? Yeah they did not really send me home with any instructions either. He was on the hospital for about 10 days too! Did not come home with oxygen, they said his need was so low he did not need to. But his blood pressure has stayed really low. We do have a pulse ox too! His BP was 95/60 earlier. It all just seems scary, especially thinking about scarring on the lungs and all that. That is good that he does not need oxygen at home! Yeah my BP stayed low for a while. It is still on the low side but not abnormally low. In the hospital they had me on a med to raise it and gave me fluids a couple times to raise it too. I know I worry too about permanent lung damage too but I am trying to think positive! True 😔 wish you a quick recovery and that you will be off the oxygen soon! :) How is your recovery going? Pretty well, thank you for asking! Yesterday I went to Starbucks without my oxygen on (I brought it with just in case) and I am not wearing it around the house but I did wear it to bed last night. So I am making really good progress. I do still tire really easily (more so than normal) but I am doing so much better! Thank you so much for thinking of me!", "Does this sound like it? \nBackground:\n\n- 21 Year Old Male \n- 155 Lbs, 5’ 10 \n- active but not athletic\n- no chronic health conditions \n\n\n\nReason for last visit: Benign premature ventricular contractions. \n\n\nRecently I went to the doc for heart palpitations that were ruled benign by an echo and EKG. Likely due to life stress. \n\nI was prescribed 15 mg pills of Metoprolol to take as needed with the palpitations. I took one on 09-21-2021 at night to see if I would have side effects. Took ibuprofen the next morning  for pain in my leg as well.  That night, I had severe panic attacks, which is unusual for me followed by sweats and weird heat regulation. The next day I went to work and felt fine. Towards the end of my shift I started feeling weakness in my arms and legs and start having panic attacks again in addition to tremors and sweating. I have never had symptoms like this before in my life. I went home and lay down and the next day I awoke with slightly less weakness but still present. Thinking this could be due to anxiety, I took another beta blocker Thursday afternoon. Almost immediately I start experiencing panic attacks tremors and muscle weakness again. I do not hopped on an exercise bike which made the weakness in my legs 10 times worse. I then went to the urgency room where are the doctor said it was most likely the beta blockers that were causing this. It is now Wednesday and I am still feeling extremely fatigued and weak if I exercise my extremities but I no longer have panic attacks or tremors. It does not seem to affect my actual strength but rather makes my muscles have much less stamina. If this is the beta blocker how long is it supposed to last because I feel like I cannot do anything. I also have been having erectile dysfunction since taking this. The last time I took a beta blocker was on 09-23-2021.\n\nThis is not a normal feeling for me as I am active and normally do not tire easily. Two weeks ago I was perfectly fine. Any help or words of wisdom regarding the side effects would be greatly appreciated. While I am not give any medical advice I will share my experience with beta blockers. Around thirty five years ago I was prescribed them for high blood pressure. Took them for about five years with zero symptoms. Doctor retired and new doctor took me off of them and put me on different medication. Took new medication for thirty years without any issue.  Five years ago doctor wanted to go back to beta blockers. Since I took them before with out any issues I started them again. About three days in I had no energy at all, winded, night sweats, and vivid dreams that interrupted my sleep. I told the doctor who said wait and see if they go away. I went about three weeks and then I told the doctor I was stopping them and going back to old medication because I cannot function. The doctor agreed. It took about two weeks before I felt better. Then I went five years feeling normal and doing what I wanted. I woke up one morning with a droopy eye and one month later I was diagnosed with MG.", "No good news? Update from my surgery:\n\nThe tumor on my thymus gland has spread too much to the lining of my lungs so surgery is not an option to remove any of the gland or tumor. \n\nIt is not really life threatening at the moment so i feel okay in that aspect.\n\nbut i will probably need to do chemo and radiation to get rid of as much of it as we can. \n\nso the only thing i really have to worry about is my autoimmune disease and go from there with treatments.\n\ni do not really know how to feel but yeah.    Hang in there, hoping you can get some management to make it better. Sending good vibes to you! Do you have to stay in the hospital long? That has to be scary for you!  I hope the treatments reduce the tumor for you. Hugs I am saddened to learn that your tumor has spread and could not be removed. Hang in there as I am sure the medical staff will have a treatment plan for you. i am home now actually! i was in there from june 15 til today so it was a long time it felt like. i am okay now just healing from the robot surgery that ended up just being a biopsy but my side pain is not too bad. i find out after thursday what my oncology and neuromuscular team want to do moving forward with the tumor. thanks for the support guys 💖 Hang in there.  Are you getting treatment for MG? After 6 years my tumour suddenly disappeared.  I was too unwell for surgery so the drs were monitoring it closely.  I was on retuximab and regular IVIG.  I reduced inflammatory food from my diet etc too.  But the the tumour disappeared.  Just wanted to share.  All the best. i have been taking prednisone and mestinon daily since being diagnosed a month ago and the tumor on my thymus has spread too much to the lining of my left lung/diaphragm so we could not do the surgery for it. i will be starting on chemo once a week and radiation five days a week soon\n\ni also did 7 plex treatments while in the hospital May I ask where are you based?  Prednisone only masks the symptoms and mestinon is temporary.  Retuximab is a type of chemo that would help.  But it is very expensive so not usually offered in public hospitals.  I had to pay for it myself.  Are you able to get a second opinion? I have had plex too when I was really sick.   Hang in there, I hope you will get it sorted soon Kansas, i live 40 mins from the university of kansas and they have a rlly good neurologist/neuromuscular section. i am going to be getting taxol and carboplatin chemo treatments. my myasthenia is pretty well controlled at the moment so the main goal for now is the get the thymoma small enough to surgically remove it so it does not hurt my lungs any more then worry more about the myasthenia (basically what my neurologist said)", "Brow lift for saggy eyelids/brows/headaches? just wondering if anyone has ever had a brow lift done to help them deal with what feels like a constant need to keep their forehead muscles pulled up to combat ptosis/ eyebrows that feel low when no effort is made?", "Myasthenia Gravis. - ppt download ", "ABN guidance on Covid-19 ", "Omnilife product Focus and MG I have read in several forums that some products of Omnilife could improve the neurological system and brain functions. One of the products more commented is ( (here in LATAM it is known as Optimus) because it has acetylcholine supplements.\n\nSome of you have tried this product? I want to know if it has some negatives effects to MG before I start consuming it. \n\nThanks in advance.", "Diagnosed in January/anxiety This is my very first time reaching out to other MG Warriors, this year almost killed me and I could use some support and advice.  I was hospitalized at the height of the pandemic when there were 4,500 Americans dying a day and I was alone and totally without speech.  Since January I have had 20 rounds of plasmapheresis, 5 IVIGs, 1 thymectamy and a partridge and a pair tree.  After my thymectamy I went into immediate respiratory distress as they did not have my mestinon available for after the surgery and I was speech impaired and hardly breathing and could not get the doctors and nurses to understand me and was almost intubated. December through May was an extremely traumatizing time for me and my brain literally will not let me go to the hospitals at all now.  I have had spreading numbness in my chest, and chest pains I went to the ER (MG has totally taken my speech) and the nurse said my husband could not accompany me, and I had kind of like a flashback I guess of being bed bound with nurses and doctors giving me magnesium and not hearing me saying I cannot have it.  Anyways I guess my point is, how do people with MG deal with severe anxiety and depression?  I know some meds make things worse but at this point my anxiety and panic attacks are not letting me continue the treatment I desperately need and they make all of my symptoms gravely worse.  How do you find a team that works for you and cares for you?  I feel like I got a strange diagnosis and just kind of left floundering the medical system during covid.  As many of you know it is difficult to do ANYTHING when MG is present let alone work a medical system 🙃 HALP Legally they CANNOT refuse your husband accompanying you as due to your condition you have special needs. If you cannot speak at the time have your husband tell them that you cannot speak and need someone accompanying you to advocate for you and tell them medications you cannot have that will literally cause your death. Do NOT take no for an answer. And yes use big words like death, scare them into following the law if you have to.\n\nI am lucky enough that what I had turned out not to be MG but I still try to stick around this community to help others out going through health issues as god knows the things I have been through with the medical system. Having someone to advocate for you is the #1 step you can take when you have health problems, especially when you cannot advocate for yourself for whatever reason.\n\nYes I know covid is a big deal right now, I had it myself even after getting fully vaccinated. What some doctors and nurses need to realize though is that sometimes not having that extra person there to help advocate and speak for you, does much more harm than good.\n\nI suggest you also carry a card or piece of paper with you in case of emergency that says something along the lines of. \"I have myasthenia gravis, I cannot speak and need you to call my husband (husbands number) do NOT give me magnesium (etc.) It can and WILL kill me.\" This made me tear up a little bit, you have no idea how little information I am getting from doctors that for someone on a reddit thred to give me that advice means the world.  Thanks for sticking close to the community ❤ I would not think they could deny your spouse as your spouse may need to make decisions for you. I was lucky as I found a doctor that was knowledgeable and I connected with although it was my second doctor. Every referral made has been good. I monitor what items to avoid and I am not afraid to say I should not take that and I will not. I also watch what I eat and see if anything triggers or makes me feel worse. They may be related or a coincidence but then I avoid whatever the trigger was for a while. It is a constant monitoring myself, knowing what I can do, what I am limited, and when to rest. I am fortunate that I am happy with my medical team and we work together. I have a supportive family and employer which helps. Hang in there.", "Symptom question I posted this question in a different group but then found this group. Can Myasthenia Gravis cause severe knee joint, leg pain? Can it cause muscle pain and severe leg stiffness? If it can then I will post my other question.\n\nThank you in advance. After my eyes my most affected body parts are my legs. I do not get much joint pain but my calves do get very weak and sometimes I have moderate pain in my quads. The weakness in my calves is worst before bed and the quads hurt most in the morning before my medication kicks in.\n\nThey say everyone experiences this disease differently so your symptoms may or may not match anyone else's symptoms. What is your second question? Thank you very much. I get horrible burning pain in the hip joints and my knees struggle in the morning until I get going. Thank you. I have horrendous stiff muscles mostly in my calves and  knees. All arthritis tests have ruled that out. I have a pain in my neck/throat that has been there for years. Just trying to figure things out. i think i have had a flareup recently and i have been having joint pain in the morning- fingers, knee, back...! Curious if myasthenia gravis is related to it or not My joint pain and muscle pain is 24hrs so I an not sure what is going on for me. have you tried getting a CBC blood panel? what about test for arthritis or lupus? I have had this for over ten years. At first the inflammation would show up on blood tests but not now and it is much worse. They thought I had arthritis but now they say I do not. I have had all the blood tests and they all come back negative. It is like my leg muscle have tendonitis full time but no injuries to cause it. I walk like a 90 year old. Prednisone cures it but they will not give me that anymore. I am allergic to aspirin that narrows down my over the counter options. and how old are you? this the pain begin with the onset and diagnosis of myasthenia gravis I am 54 now. This started 11 years ago after some kind of severe flu and never went away. I am looking into what might be the cause and MG seemed to fit some of my symptoms so I am looking into that. I have hypothyroidism, severe B12 and Vit. D deficiencies. I have a ache/pain in my neck. My endo just ignores my inquiries about that. I had terrible joint pain to the point where it took me an hour to get out of bed in the morning some days, but that is because my muscles were basically working overtime. That is how I feel and I have had a bakers cyst behind one knee causing me to limp. Nobody will help me with it.", "Remission and no meds Has anybody gone into remission and been able to be off meds? If so, how long? Did your symptoms come back? I am on low dose cellcept after thymectomy in March 2019 and have been stable since. My doctor discussed either switching to low dose prednisone or IVIG instead of cellcept (to potentially get pregnant) or to try to go without medication in 6 months. Obviously being able to be off medication would be ideal but dr explained that they cannot be certain how/when my symptoms would come back including potentially being worse symptoms than before diagnosis. \nIf anyone has been off medication please share! Was diagnosed in 2013, went into full remission for almost 7 years where I did not need to take any medication. Last year my symptoms came back with a vengeance, which my neuro described as atypical. I am seronegative, no thymectomy, but am about to start ivig therapy after having awful side effects from cellcept. It is absolutely possible, and they call myasthenia the snowflake disease because there is not a one size fits all in terms of treatment and remission. There is hope! Thank you!! I hope ivig goes well for you!! Thank you! I wish nothing but the best for you as well! Hi! I was diagnosed in 2016 and had full sternal thymectomy in early 2017. Have been off meds since a week after that surgery. I find when I am really stressed or anxious I will feel like im having a symptom but it usually goes away quickly—Sometimes I think it could just be me remembering my prior symptoms during those times as well (and the trauma around those scary symptoms) and then I almost make it worse for myself. I am always like on the lookout lol but no meds which I am grateful foR.. hoping that it stays that way forever. Congrats!! Thank you! I have been luckily stable even before my thymectomy I was not symptomatic or taking mestinon just prednisone and cellcept and have since been weaned down to lose dose without symptoms mostly. I do notice if I overdo it I get leg or arm weakness like after I hiked for 3 days in a row long distance but once o rested for two days I was ok. I think I get the stress of the trauma sometimes as well. My worry going off fully is having to mentally deal with symptoms again potentially or them being much worse. I have a stressful job that sometimes I also do not sleep enough because I am working too much too.", "mYASTHENIA gRAVIS &amp; M.R.I I am appointed for an MRI and I got a list to check off one point asking if I had this disease, why? I have myasthenia gravis. There is a small chance that the contrast medium used in an MRI scan could temporarily worsen the symptoms of MG which, at worst, could potentially lead to a myasthenic crisis (respiratory arrest because the diaphragm - important muscle involved in breathing - stops working). They also ask for kidney damage and diabetes which I assume this contrast also puts those individuals at risk. They gave me contrast before I knew I had myasthenia. Made me feel like a noodle", "Anyone get the Covid 19 vaccination yet? Looks like I am going to have to wait a while but my neurologist recommends it and the guidance from ( ( ( ) says most MG patients should get it.  My wife, who does not have MG, has had her first dose of the Moderna vaccine and was under the weather for 2 days, nothing major.  I am just wondering if anyone with MG out there was able to get vaccinated and how it went.  Thanks! Hi! I had my Oxford Astra Zeneca vaccine. Did not exacerbate my symptoms in any way. Had a low fever for 2 days and muscle pain. Felt sluggish. So quite normal side effects, all in all. Thank you for the reply!  I was lucky enough to get the Pfizer vaccine.  I have had both doses.  I did not feel any symptoms after the first dose.  After the second dose I had a bit of a sore arm for about 3 days but nothing else.  I am taking immunosuppressants so that may have limited my body’s response. Nw! I also heard that Pfizer gives less side effects - all the people I know that have had it were perfectly fine afterwards, apart from a sore arm. So maybe it is also that! Happy I had mine before going on immunosuppressive drugs. I know I am late here, but I have had both doses of the Pfizer and I felt great after. First dose i slept for 10 hours straight. Second dose I felt like I could do hurdles. \n\nThat said, I had IVIG scheduled the next day both times. I had to get my doses done within less than an hours notice so it just happened to work out that way That is what I am doing, waiting for it to be approved by the fda since right now it is now I had Pfizer without any reaction or issues.  Neurologist highly recommended that I get a vaccination. Father had the Pfizer vaccine and he has MG and ALS - zero side effects.  Mom got it too, she does NOT have any neuromuscular issues, and again...zero side effects.  They are both 80.", "Huperzine A I read online (various articles) that some MG sufferers purchased huperzine A tablets online so I bought some to try and actually they have helped me with my double vision (I potentially have ocular MG). I have not been officially diagnosed by my doctors yet (had the blood test, awaiting an appointment) but it is an acetylcholinesterase inhibitor, similar to mestinon, but apparently with a longer half life and less side effects with similar efficacy. \n\nNot sure if anyone else has tried this or not but I noticed the effects after one day. I am able to use my phone and type this with very minimal trouble (it is wearing off as it has been over 18h since the first (and only) dose at 100mcg). I am unsure of the long term effects (if there are any) but I imagine a lot of 'herbal tablets' have a lower risk than pharmacological compounds, or else they would not be so easily accessible (i.e. without prescription).\n\nHas anyone else tried this and/or other supplements (coenzyme Q10, choline, etc) I have not tried it, but I will look into it now. I would love an alternative to mestinon. I have been having a lot of trouble with it lately, actually. I was diagnosed about 6 weeks ago. After 2 weeks on mestinon, my doc doubled my dose. It gave me stomach problems that were so bad that it felt worse than childbirth. I ended up in the clinic, dehydrated and in need of a bag of saline. I also have elevated liver enzymes, so I have imaging to do as well. So, now I am back on a low dose of mestinon. It sure makes all my muscles jump/twitch, though. Not fun.\n\nKeep me posted on how it is working out for you! It took awhile to get the diagnosis, but just knowing I was not crazy was such a huge relief. haha. I literally took my first dose yesterday but noticed the effects immediately without any (noticeable) side effects but my vision was about 95% until the end of the day where it was starting to wear off. I still had a tiny bit of double vision but that was so tiny that to me, I was basically seeing in HD again haha. \n\nI hope you are okay after that, I literally googled Huperzine A Myasthenia and a few articles come up with people who have tried it and they say it is pretty good. They use it in cycles (2-4 weeks on, 1 week off) and said when it stops working, they use mestionon then switch back to Hup A with no issues. I am keeping a close eye on any changes to noticeable side effects but have no idea how it changes anything but so far so good. ", "Does anybody experience twitching with their myasthenia? I think mine might be triggered by Mestinon After 2 years of tests and doctors and theories I finally got back a positive LRP4 test!! I previously had a positive muscle striated antibody test (which was then negative). Negative SFEMG, cause my main problem is double vision and they cannot obviously test on the extraocular muscles. I respond to Mestinon in terms of my ptosis and neck weakness but not my diplopia - will get corticosteroids. \n\nI have started to notice twitching in some muscles (does not follow a pattern). This has only started after I was put on Mestinon and is worse if I take my Mestinon without food. After getting the LRP4 positive test I slightly freaked out after seeing it is also present in ALS. Add the muscle twitching and I went slightly crazy. \n\nWhile I know that Mestinon can cause muscle twitching and fine tremors, I was looking to see is any people actually also experience this. I will of course talk to my neurologists but ALS kind of scared me, even though I do not have any other symptoms and I am a 26F, so not exactly in the demographic for that. Clean brain and spine MRI.\n\nAfter 2 years of wrong diagnoses it is kind of easy to spiral out when reading about anything so hopefully you can appreciate that. Thanks!! I take Mestinon and have muscle twitching.  I just had a discussion with my oncologist about muscle twitching this week.  He specializes in patients with thymoma and MG.  He also has done research on MG treatments.  He actually brought it up and said that often patients see it in their palms just below the thumb.  Just to relate, my story began with a visit to the emergency room where I was referred to a neurologist to specifically check for ALS.  Waiting for that appointment was torture.  So, I know your worry.  Luckily, my neurologist immediately ruled out ALS and diagnosed MG.  Waiting and worrying is so hard.  I wish you the best. Did you mean a neurologist or an oncologist? And thank you so much for your reply!! Really puts my mind at ease before I see my neurologist in 3 weeks. I also did some digging on the internet and here and saw that other mg patients also experience twitching, apparently after taking Mestinon without food. Thanks again for you answer and all the best to you too! I wish there was more awareness of this condition and more information. Hopefully if anybody ever thinks of twitching they can find this. :) I am glad you found my comment helpful. I have been helped here before so I am glad I could give back. It really does help to talk to others with the same condition.  I did mean oncologist.  I do have a neurologist but in addition I found an oncologist that specializes in mg patients that have a thymoma.  I have a great neurologist but my oncologist seems to know just as much about mg.  He was even part of a team that was trying to develop a new treatment for mg.  I feel very lucky with the care I am able to receive. Wow that sounds amazing. I cannot even remember how many neurologists I saw that did not even suggest mg - borderline negligence if you ask me. Thankfully my thymus is clear for now, although I might get a thymectomy. Again, many thanks for your input!! Hi there! I realize your comment is old but I also know others may come back and read it if experiencing same. I have MG and am also a neuro PA. Mestinon can definitely cause muscle twitching (fasciculations) and cramping! It is one of the side effects of its action on nicotinic acetylcholine receptors. Totally normal but can be alarming at first. Anecdotally I find mine is worse when I overexert, am dehydrated or even really anxious. Best of luck! Thanks so much - really appreciate the reply. Now that I have a bit more experience with Mestinon I think the dosage was too much for me (as I am anti lrp4). Thanks so much for taking the time to answer, I hope somebody as freaked out as I was will find this post", "Has anyone tried or had any success with LDN? (Low Dose Naltrexone) I seen this post on Facebook under the LDN group and I was wondering if anyone here had tried the drug?    \n\n\n&amp;#x200B;\n\n Wow. That would be awesome. I am going to research. It was designed to get junkies off heroin as it is an opioid receptor blocker but they realised in low doses that it is remarkably effective for nervous system related chronic illnesses like M.E, Fibromyalgia, MS etc.  It is relatively side effect free but because it is out of patent it is not profitable for drug companies so they do not make it.  The success Stories on the Facebook group are remarkable.  Most Doctors will not subscribe but it is been around for decades so the risks known and are low. I tried LDN right after being diagnosed. However, I was trying everything. I am in remission now, but still on a low-dose immunosuppressant. I am not 100%, but I am good guys I am probably 90% and I am bad days probably 70 to 80% of normal. But, I do not know if they LDN did it, or if it was something else. I did notice some neurological things with LDN, visual things, kind of like when you have been watching an old CRT, or an old television, and when closing the eyes, you see continue to see pulsations. That happened to every night whenever I would wake up at three or 4 of the clock in the morning. There may have been some auditory effects also, but they were minor. So if I am understanding you correctly it is not available easily and doctors do not prescribe it very often? It would be a great alternative if it does not come with the long term effects that steroids do. I have just been put on steroids as my Mestonin has started to become less effective after two 1/2 years. I have read that high dose vitamin d actually alleviates and helps many autoimmune symptoms. It is a newer alternative treatment in myasthenia and MS and a few others. I believe it is more common in other countries but I remember reading a few articles that detailed studies on it. Granted 15,000 iu is nowhere near the 80,000 iu per day that was listed in treatment but was something that popped out to me. I will def look into vitamin d supplementation now  especially since my very first visit to a doctor when this all started was low levels of vitamin d. I tried LDN and did not have any luck with it for my MG 🤷🏼 What country are you in if you do not mind me asking?  I will hopefully be able to show you were to get it. US  Ah so it looks like that is set up outside of insurance and I would have to pay. I will talk to my neurologist as I do not know what their team has knowledge in, or even specialized in MG,but not something I can afford to pay out of pocket right now. Some neurologists will prescribe it.  Good luck. Thanks, I think I will just bring it up with my doctors as they know my medical history and MG best. Hopefully someone else can find it useful though.", "skin changes not going to lie plasmapheresis got my skin GLOWING lmao..", "Tight diaphragm? does anyone else here ever feel like their diaphragm area/middle back is being squeezed sometimes like a tight hug? i am assuming this is an MG thing since i have only been experiencing it since being diagnosed and i bring it up to all of my drs of course. comes and goes usually just wondering if anyone else here has experienced the same thing. Does it feel like you are short of breath or like your having trouble breathing at a normal rate? Usually, that feeling happens when I have either of those symptoms. I would tell your doctor who manages your MG right away and keep watch of your symptoms. \n\nI had a crisis in June/early July and since the past week I have had these symptoms again ( plasmapheresis worse off I guess :( ) and I will likely need to have plasmapheresis on an outpatient basis until my immunosuppressants kick in. I have only had respiratory problems due to MG the past 6 months after being diagnosed for two years, so I guess it got worse.\n\nI do not want to alarm you or anyone else, but, you should always note respiratory issues with MG. Even if you do not feel short of breath with tightness make sure to tell your doctor and track your symptoms. I learned firsthand how fast it can strike and turn into a myasthenic crisis.  MG is different for everyone so my case may not be the same as yours but everyone with MG should be aware and cautious of respiratory symptoms. Yes tight diaphragm for me too, the doctors thought I was making it up that I could feel how weak my diaphragm was, but it is just your muscles getting too tired I guess.  I always pop a mestinon immediately when I start feeling that, it gets scary, if it gets unmanageable go to the ER!", "Please share positive stories and outcomes with me! My mom was diag w/MG in the beginning of the year.  Quick background but she presented w/ocular symptoms around Thanksgiving last year and took about 4 months to get the MG diagnosis.  She was positive for all of the bloodwork, scans on her brain and thymus all came back fine, so they started her on the cocktail of cellcept, mestinon, and prednisone (hope I have those meds right!).  There was an improvement in her ocular symptoms over time (at one point she was not able to open her eyelid at all and at the end of June she could fully open her eye) but the doc made some adjustments and put her on mestinon timespan which she had a reaction to (diarrhea for a month which led to no absorbtion of her meds.... Her symptoms all regressed back to the start...)  Finally got that under control and at a follow up last week, her neuro made more adjustments and wants to start ivig soon. \n\nHer symptoms currently are weakness and trembling in upper and lower extremities, double vision and loss of motor control in right eye, general loss of strength.  In the meantime the steroid threw her into diabetes, so we are dealing with getting her sugars under control. Her recent change in meds (including starting to taper off of the steroid) killed her appetite but her sugars have been better, which is all so confusing.\n\nObviously she is in a depression because she needs so much help taking care of herself. I remain hopeful she will see improvement soon but some days it is hard to try and pep talk her up and keep her mood positive.\n\nGeneral questions, but how long did it take for you all to see an improvement in symptoms? Anyone have any experience with ivig? She is very nervous about it. If you have weakness/trembling, did you have any improvement in that?  I know and understand it is different for everyone but i am hoping sharing some positive outcomes with her will help her to see a light at the end of the tunnel.  She misses cooking and baking and frankly, leaving home and being able to walk at the grocery store would prob make her day lol", "Antibodies present but considered negative for MG?  I am not the most familiar with labs but mine was similar. It did not give me a full diagnosis, but my neurologist gave me a tentative diagnosis of seronegative Myasthenia and put me on Mestonin. I was told to go to a neuro-muscular for more testing. It is going to depend on your doctor, some want very concrete data and others are more flexible. I am not sure what all goes into the diagnosis but my droopy eye was the key for my doctor to order labs. All of my antibodies were positive. \nAchr binding 27\nAchr blocking 50%\nAchr modulating 70%\n\nTwo weeks after the lab tests results, eye was normal. \n\nEight months later the ct scan showed a thymoma. Did you find the Mesitonin helped? Well yes, but after two years I needed to adjust to 1 every 8 to 1 every 4 hours. I am in the hospital right now recovering from a Myasthenic Crisis and on high doses of steroids and plasmapheresis. The Mestonin alone, even when at an increase dosage could not prevented the crisis so most likely I will have more meds added to my daily routine. Everyone is different with this disease and has varying levels of how bad it affects them so my scenario may not be yours.  I know it is difficult when sero-negative to get a doctor that can take you seriously but definitely try to advocate for yourself. Mestonin has relatively lower side effects. Sorry to hear about your current condition… hope it resolves soon. Thanks for the help! I am doing much better and should be home Sunday or Monday if I keep improving. It is not a fun experience and terrifying to be in the ICU. I hope you get some answers soon, I know from experience that sometimes it can take a few years before the doctor will give a full daignosis ( well for sero-negative in my case) but I hope it goes quick for you. Also there are several other anti-bodies associated with MG and it does not look like you had them done. Yeah, I had my PCP run the tests prior to seeing neuro next week… so hopefully the neuro will put me through the ringer of testing so we can get some answers. Yes your neurologist should do that! My PCP can handle a bit but even she said it is way out of internal medicine's scope. Definitely aim for a neurologist who knows about MG or go to a Neuro Muscular Nerologist if your insurance allows. Believe it or not I have had some bad encounters with some neurologists when hospitalized who clearly knew nothing beyond a textbook answer on MG and basically told me it was all in my head and sending me home to call my neurologist urgently in the morning.\n\nEven during the this crisis I clearly explained to the 911 operator about the disease and when the paramedics arrived and I was basically paralyzed one person kept repeating \" is it psych? Is she a psych case?\" Even after being told no it is neurological. Even asked me if I could walk when my body could not even breathe. Seriously print out emergency forms and instructions for EMTs and nurses and keep with at all times. Most Myasthenia sites have this available for download. I woke up one day with my left eyelid drooping and a very bad case of diplopia.\n\nMy neurologist ran all the bloodwork and strangely enough I tested negative for Myasthenia Gravis.  Prior to the tests he gave me prednisone but it did nothing. Four days later he checked in on me and I told him that nothing changed so he prescribed me Mestonin in the same day my I went back to normal and my double vision was gone it was like a miracle.\n\nI cannot stop thinking of the negative results though. He said for now he is considering it myasthenia gravis, in the meantime he sending me to a Myasthenia Gravis Specialist.\n\nI found a PDF online that talks about MG, ocular MG and LEMS. It suggests that if all the symptoms are present for MG but the patient tests negative then the patient should be tested for a different antibody.\n\n85 percent to 90 percent of people with LEMS test positive for antibodies against the P/Q type voltage-gated calcium channel (VGCC).  I discovered this by researching MG on my own. \n\nIf anyone is interested here is the link to the PDF and the above is on page 10. If I tested negative for the antibodies for MG, Should I ask to be tested for antibodies against the (VGCC) to rule out LEMS?\n\n(", "LRP4 Symptoms Hi everyone,\n\nI was recently diagnosed with dSNMG. I am LRP4 positive. I would classify my symptoms as being MGFA grade IIA.\n\nIt started with a droopy right eyelid last year and has now progressed into droopiness in both eyelids, slightly blurry vision, and mild oropharyngeal weakness. Can anyone share their experience with this specific antibody? What were your symptoms? What treatment plan did you follow? Have you gone into remission?\n\nI am fortunate to have fairly mild symptoms which have remained stable for the past six months.\n\nI am set to start Mestinon (liquid version) in the next couple of days. I will be on a low dose in the beginning (30 mg 3x/day). We will see how things progress from there. There s a fb group dedicated to rare ab:lrp4, Titin and agrin. I recommend you join it Thank you, I did.", "Hey we made the news, but also that comment?  I have never heard of anyone getting ivig drips two times a month? I had it during a flare where I had to visit hospital a week ago but is not the cost for this treatment enormous? I also assumed typical medication like low and high dose steroids in conjunction with maybe a 6 month ivig drip was the worst case scenario. not IVIG, but i am currently receiving twice weekly plasmapheresis sessions to treat my MG. i had a 2 week stint in the hospital where they started me on plasmapheresis and now it is my maintenance therapy. i am assuming steroids are more common, but my neuro does not want me on them bc of the long term side effects.  Soliris.  It is a newish drug that happens to also work for  MG. It is pretty good at clearing the neuromuscular junction blockages.  I have gotten usage back of some of the more atrophied muscles. But still struggle with swallowing and keeping my O2 up. \n\nI have gotten much better on it.  Not enough to stop getting it though - 😟\n\nIt is rather expensive.  \n\n$97,000 is billed each time. I  have Medicare and AARP UnitedHealthcare Medicare Complete.  I have a yearly out of pocket cap that I reach in the first two weeks of the year. \n\nWe make payment arrangements with the hospital -  it is a lot.    But the IVIg just was not cutting it down enough. \n\n( I am sorry to hear that. I had no idea it was that expensive. I was mainly curious on why anyone would need ivig drips that many times but it seems it was something else entirely.Did you not try a high dose or low dose steroid regimen first or was that out of question for yourself based on your medical history? Exactly. Steroids were not an option for me. Allergic to most. \n\nPlus, steroids are a first onset type of treatment.  I was misdiagnosed for so many years that I was in full crisis before it was recognized as MG.  \n\nI am also 64. So not as responsive to treatment because neuromuscular junction blockage damage is at a serious level.  I have regained some…. But not all. \n\nEarly diagnosis is key.", "What is your fatigue like? CFS? I am curious what general fatigue is like in MG, I am reading conflicting things online as to if MG causes general (non muscular) fatigue / tiredness / exhaustion in addition to muscle weakness. I have a CFS diagnosis, but I am curious if I might actually have MG since I also have trouble swallowing and vision issues. Also, have any treatments helped with fatigue if you do have it? General fatigue is horrible. When it is affecting me, it feels like I have to fight gravity at all times. It makes doing anything exhausting. \n   I am doing IVIG and last month I felt like a million dollars, this month, not so much. I do not know if it can vary from month to month.  I have only had 2 treatments so far, so its new to me. \nI have generalized myasthenia gravis and I am sero-negative. The med Pyridostigmine works enough that I can eat and drive. It helps a ton but not enough to make life ok. With the IVIG and the Pyridostigmine, it is been mostly ok. \nI hope this helps.", "Can I have a mild myasthenia gravis? I do not know what exactly I have but something is wrong obviously. I am 33 years old male. I have got Dysautonomia and Raynauds disease diagnosis, but I wonder if I can also have myasthenia gravis, because some mild symptoms of myasthenia occurring in my body after the combination of stress/heat and physical exercises. I can walk 10km per day and run 2km per day, but I have a trouble with squatting and pushups. There are some days when I do 20 squats, 10 pushups and I start experiencing swallowing problems, tightness in the throat, some breathing difficulty. If I continue to stress and push myself and ignore this symptoms and do not rest I am starting to have an extreme weakness to the point that I can no longer walk/slurry speach/and habit to support my head when I am eating because it feels heavy. But all this symptoms occur only if I ignore them and keep pushing myself. If I have a few days rest I do not feel any of the symptoms. And then If I do not do stressful exercises and do just walking/bicycle, symptoms never occur. Also I do not have vision problems and droopy eyelid. So the question is: may I have a mild myasthenia gravis when symptoms occur only after some exercises (not cardio, but rather squatting/pushups/some heavy lifting?) or my symptoms are due to my dysautonomia because Dysautonomia people also may have this symptoms. Also btw first swallowing/breathing/weakness symptoms I started to feel 10 years ago and since then it did not got worse. I want to start going to the gym, but I cannot even increase the number of pushups or squatts. There is a limit that I just cannot brake through no matter how hard I try. If I do more I am starting to have some dysautonomia and/or myasthenia symptoms... BTW. Sorry for my English. Its not my native language. Thanks. Absolutely. How ever. Swallowing and breathing issues are a big red flag leading up to a MG crisis. You need a doctor's appointment. \n\nFirst - in case it becomes an emergency - If you end up in an ER room a NB d they want to put you on breathing assistance---. \n\nCPAP is bad for MG patients.  We can be too weak to exhale against the machine. We will sufficate with the unexpelled CO2. \n\nBiPAP or just Oxygen are our options. \n\nMany of us with MG have had the symptoms all our lives - just progressive through the years. Stress or heat or exhaustion or magnesium supliments or Levofloxin  or... The list is quite long of things that can set your symptoms roaring to life. \n\nIn my case, I was 60 before I got a diagnosis while in an ICU.  I do not want that for you.  \n\nMG is so rare family medicine or ER  doctors may never diagnose a case in their whole career. \n\nYou must be your own advocate.  \n\n1. Start reading and researching and journal your symptoms.  \n\n  A.You need to be able to articulate your symptoms to a neurologist. \n\n  B. You need to avoid triggers!  There are drugs to avoid lists on many sites. Be very careful of supliments. Magnesium is really bad for MG and there are more. \n\n2. Research a neuromuscular based neurologist.  Like other specialists - some neurologist see mostly seizure patients - some are headache specialist, etc. Depending on your insurance requirements you may have to get a referral to the neurologist of your choice. \n\n3. Research your insurance. It is brutal but you need to have good insurance in the US. Does your insurance cover treatments for rare diseases? You have not been diagnosed yet - so double check. You may be where you can make a change. \n\n4. If the doctor is not listening or dismissive - vote with your insurance and take your thousands of dollars in income to someone who cares about you.  Find another.  \n\nI have had 60 years of untreated MG - so lots of damaged neuromuscular junctions - and my current treatment is IV therapy 2x month with Soliris (expensive) and daily Mestonin (cheap). \n\nThere are many  doctors who treat with steroids \n\n- I personally do not think long term steroids are safe for anyone - I am also allergic to several brands  (it is the base the use for the pills) so I skipped them with approval of my Neuro. \n\n  You are young and you may be able to acheive remission or reduced symptoms with care.  \n\nKeep asking questions!\n\nHugs. I believe I have, and have had, this illness.", "Could I have Myasthenia Gravis? Today I went to an optometrist to examine my potential diagnosis and after careful examination, what we propose as an explanation kind of shocked me. She did a couple of physical examination, but the most interesting one was an \"ice pack test\" where my eyelids opened much bigger after it was applied for around 2-5 minutes. \n\nShe said that I could potentially have Myasthenia Gravis, and sent me for two blood tests: for for ACHR and another some muscle antibodies tests. She told me that those tests are not absolutely accurate, and might result in false negative which requires further testing. \n\nInitially i went in just hoping for a **Blepharoplasty** to make my eyes look bigger (because people keep on telling my i look tired for the past 10 years), but reading some of the symptoms of Myasthenia Gravis, it look to me that I might be onto something. \n\n1) I do experience unexplained excessive fatigue, and tingling of extremities sometimes. Been trying to solve it for years but havent found the cause. My energy usually plummets in the evening and gets better with rest. \n\n2) I have been diagnosed with anxiety, which I read is often a misdiagnosis for Myasthenia Gravis (though i wonder why)\n\n3) I do not experience significant weakness in my muscles elsewhere apart from my face(eyes and mouth). I am actually fit, can run 10km easily and lift frequently. \n\n4) Shallow breathing, and oftentimes forget to breathe. Not sure if this is connected. \n\nIs the ice pack test conclusive of the condition? knowing that the next review is 6 weeks later, i was tempted to try mestonin to alleviate my fatigue but im worried about self medication. \n\nThank you :) Go straight to a neurologist. Look for a neurologist who treats neuromuscular diseases. This would be the best option.  \n\nMG is an individual disease. All our symptoms are the same but in different combinations. \n\nI have facial weakness that shows in old photos. No smile or one sided smile - droopy eye lids or only my right eye lid.  \nPretend you are blowing up a balloon and try to keep the air in while putting pressure on your cheeks.\nWeak hand and arm strength. \nI have trouble chewing and swallowing with out choking. \nSo many more. I was scheduled to meet a neurologist in the same hospital along with this eye surgeon in 6 weeks time. Part of me hope that I have finally found an explanation to my fatigue but at the same time worried about having an autoimmune disease. Hi there. I have recently (September) been diagnosed and I have been on Mestonin for about three months now. I cannot emphasize enough that you should wait for your doctor to prescribe this medication as the side effects are quite varied and may cause more problems than it alleviates. I am seeing the Doc next week to try a dosage adjustment. If that does not help we may try the slow release version or move to a different family of drugs.\n\nYour fear is a natural response to some scary news but from what I can gather for some people their MG is only a blip in their day and for others it can be a defining condition of their lives. I am not sure where on that spectrum I will wind up when we find the best medication for me but I hope I lean more toward the blip and I hope the same for you. \n\nGood luck with it all and keep in mind you are your best healthcare advocate. Thank you, I shall wait then.", "An Open Letter to the Doctor Who Doubted Me  Thank you for this!! I needed it!! He doubts me everytime!! I am so sad that you can relate. We all deserve better.", "Convincing myself I have this and getting really anxious. Please help, do my symptoms match up? For about 6 years now, I have had issues fully emptying my bladder. I always have the feeling I need to pee. Always. Urologists have found nothing wrong &amp; told me it was anxiety, but that was 4 years ago and I have just been dealing with it since. Recently a few months ago, I was getting double vision, blurry vision out of nowhere when I am tired and have been using my phone (I am moderately myopic, have dry eyes and astigmatism so I assumed that was all related and did not mention it to my eye doctor.) My eyebrow area has also been sagging and I am only 24. I can compare it to pictures from years ago and my eyebrow area has clearly moved down on my eyelids. I do not have eyelid ptosis however. One of my eyes does look smaller than the other and that is also a new thing. Now recently I have been having issues catching my breath. I did have covid in December and experienced issues with high heart rate and shortness of breath, so I assumed it was all related, but now I am terrified I have been missing symptoms for years. Does this sound like myasthenia gravis? Or am I overreacting? Please help, I am really freaking out. When I started having my double vision symptoms, I went to an ophthalmologist and my eyes were fine but something was not. From there, drs best guess what that I had ocular myasthenia gravis and referred me to a neurologist/neuromuscular specialist. In your case since you have a preexisting ocular condition, I would consult an ophthalmologist to see if any of them could cause that double vision. \n\nWith all the other symptoms, see your PCP and ask for some bloodwork. Tell him absolutely everything. Make a list of everything you have noticed, any muscle weakness and how often it occurs. Doctors are going to want to rule out absolutely everything, not only with bloodwork but other procedures and tests like an EMG. The best thing you could do for yourself right now is to cover all the bases and start getting some answers asap. And of course, if you cannot breathe please get to an ER. Do not wait. \n\nI wish you the very best. Thank you so much for your reply. I just have one question: when you had your double vision did it come and go or was it constant? About how long did it last at one time? Seconds/minutes/hours?", "Having my second round of IVIG today and I am nervous! I had my first round about a year ago and had a reaction to it after the first two days which caused the last three days to be postponed by a couple of weeks and I did not see any improvement. At the time we decided not to go forward with it. Now we have decided to try it again and I am just hoping that I do not have another reaction to it. Wish me luck! Good luck and smooth sailing. - take the allergy meds and Tylenol - and ….\n\nTake something to do!  Do you crochet? Read? Sew? Draw? Have a iPad?  Anything that will keep you distracted from worry.  \n\nI also take my own drinks and snacks.  The nurses are too busy to be expected to be there right when you need drinks. They will appreciate you more than you will believe. \n\nLet us know how you are doing.  \n\nHugs Thank you! The nurse is actually coming to my house to do the infusion so I will have plenty of TV to watch and stuff to do (although last time I ended up sleeping most of the time). I will keep you posted! I hope you are able to tolerate the treatment. I had my first infusions 2 weeks ago and even though I did not feel much at the time I am now 70-80% functional again, which is a lot after 2 years of being sedentary. The nurses kept pushing reminding me to hydrate and I wound up over hydrated with a mild headache. I slowed down on the water and then had zero side effects except my breathing was a bit more laboured than normal, that has since disappeared.\n\nGood luck Thank you! Today was my fourth day. Yesterday I had a horrible migraine that even my migraine medicine would not touch. Today seems better so far. I do notice that my breathing is a little bit labored as well. I am so glad that it has helped you so much! I am hoping to see an improvement this time, too! I agree with everything mentioned above but would just add to hydrate like crazy starting the day before, during and a few days after. My nurse always tells me this and that it will help reduce headache. When I do not, I can definitely tell the difference. My mom starts ivig today and i am curious to know how you did?", "What was your achr antibody result when you were disgnosed? I know some labs have a cut off of 0.45 others higher etc IgM was 18 I do not remember my number, but I do know it came back as negative for MG. My diagnosis actually came after a single-fiber EMG.", "Had a massage yesterday and my therapist snickered and said “cute toes”. Then we talked about Myasthenia Gravis.  mg is related to your cute toes?", "Relief after 1 year of hell and finally getting treated This will be a bit of a long post but man does it feel good to finally get treated. I got diagnosed a few weeks ago after going through 6 doctors and explaining to them the exact same symptoms over and over. I had zero energy I difficulty lift my arms and legs and my vision was blurr. This escalated even more into insomnia and barely being able to sleep. I did not know at the time but I was having problems breathing when I was sleeping. Eventually my vision got so bad I started seeing overlapped images and did not even feel comfortable to drive for days. \n\nMeanwhile, all the doctors I went to were either urgent care or primary care and though I explained all of this to them I got hit with either “allergies” and “depression” or dehydration if it was urgent care when I explained I had trouble breathing  because all my regular  blood tests were normal. I could no longer function normally and it is purely because it was coronavirus and I was sitting at home that I believe I probably did not go to an emergency room when it was at its worse. \n\nHow I eventually got diagnosed was going to a neurolo ophthalmologist after I went to a regular ophthalmologist and had to switch to daily Toric lenses which still did not provide any relief and forced me to wear glasses. Soon after my vision was not only blurry and doubled but I could barely move my eyes due to the intense amount of pain for weeks. Of course I had many other problems as well but it would be almost every symptom of myasthenia from ocular to generalized so I feel I do not need to expand .Within 10 minutes of describing this to my neuro opto, he strongly felt it was myasthenia and ordered an mri just to clear other suspicions as well as the antibody blood tests. The blood tests were actually borderline but I got started on pyridostigmine bromide and a confirmation with a single fiber later on. \n\nWithin thirty minutes of taking medication I felt 5 pounds lift off my shoulders,legs and chest and walked without dragging my foot . After playing with the medication for a week I finally settled ,with consultation from my doctor, on 2x every four hours, as my eye pain did not dissipate until that high of a dose and came back almost like clockwork . But it feels like I am finally getting back to normal after 2 weeks. \n\nI guess the morale of the story is: if you do not feel good then do not let anyone tell you otherwise. For me it felt like every day got one percent harder until I could no longer do any work at all. The normal doctor is just trained to deal with simple things, and if you know something is wrong, take it seriously unlike me because I believed in what I was being told and that I was just depressed or had allergies. Congrats on getting treated! The very first dose of medication worked like magic for me too. I cried because I could finally smile again :') Hope everything goes well for you from here on out. Stay safe! Congratulations on your diagnosis seems like an odd thing to say but I think everyone here can relate to your relief after struggling to get a diagnosis. \n\nI am no doctor so take nothing I say as medical advice. If your system is handling the pyridostigmine that is great and you can stop reading the rest of this paragraph. I had a lot of digestive issues with it and my doctor suggested Loperamide, the active ingredient in Imodium, and some psyllium fibre. I now take one Imodium in the morning, about an hour after my first pyridostigmine, and a tablespoon of Metamucil late in the evening, an hour after my last dose of pyridostigmine. That regimen has completely cleared up my digestive issues. \n\nThis darn thing has really thrown me for a loop but I am gradually getting my head around changing my life to accommodate it. Today I mowed my lawn for the last time, I am hiring someone to do it for me and for me that is not something I thought I would never do.\n\nAnyhow, I have a tendency to ramble so I will go now. This sub is pretty quiet but I try to check in at least once a week. \n\nGood luck on your journey and may the wind always be at your back. Out of curiosity how old are you? I am just now getting my strength back and I used to lift and run twice a day. I have not been able to do anything for almost a year , and I want to apply for law enforcement agencies. I was able to do a full workout today and breathing had certainly gotten easier. I thought I was going to have to give up on it. Now I can do most activities but still get tired in evenings, so I guess my question is will this get better the longer I take it, because right now it seems the symptoms return as soon as 4 hours are up for me at least I am not a doctor so please treat everything I say as suspect. \n\nI am 56, diagnosed at 55. I am glad to hear you are getting your strength back. 18 months ago I was at the gym 3-4 days a week and was walking 30 kms a week. I am still on a minimum dose of pyridostigmine but see my neurologist in two weeks and I expect to walk out with a prescription similar to your dosage. \n\nEnough about me, your question is about pyridostigmine (mestinon). From the research I have done and from what the doctors have told me each dose of pyridostigmine has an active time of 3-5 hours with a 30-60 minute onset. The body does not store the drug nor does it repair the immune system, it is more complicated than my description but it basically works by preventing the destruction of the neurotransmitter that your immune system is attacking. Once the dose wears off the attacks begins anew until your next dose takes effect. My muscles always gives me about a one hour notice that my next dose is coming up, I am only three times a day so 5 hours between doses. \n\nRemission does happen and is sometimes permanent. If I remember correctly about 15% of patients experience remissions. I have seen no evidence to back it up but I have read that there are higher rates of remission amongst those who have thymectomies, again I have not seen any reputable studies supporting this and I am not a doctor.\n\nAs far as affecting a career in law enforcement there are so many variables involved it would be hard for me to answer that question. I would suggest you speak to law enforcement entities in your community, the will have policies regarding fitness for duty and I am sure the largest ones, think state police, or national police if that is your situation, will have an HR department that could speak directly to your questions. There are also may different roles in law enforcement and you may need to tweak your goals to accommodate your condition. It is a question you could ask if you get a negative response to your questions about MG. \n\nWhatever your future holds keep working out as much as you are able, the stronger those muscles are the longer they will work for you. Also remember that if your condition worsens mestinon is only the first step in treatment there is stronger medicine out there but mestinon has the fewest side effects and is the easiest to manage.\n\nI hope this helps. Hey, thanks for the extensive response, I did notice that in my case as well and I guess that is a talk for next visit. I was afraid that it was more of a stop gate sort of drug but I appreciate the response regardless. I am 39, I was working out everyday after working two jobs and caring for the kids. I can barely wipe my own butt now I am so tired all the time. I tried the holistic route, it does not work for us. We get so weak our bones begin to get brittle and breathing becomes difficult too Yea I was just working out one day under a lot of stress and when I tried running a mile I just felt my arms like go limp and next day it felt like my lungs and it had gotten harder to breathe like a day later I cut down my running to half a mile and my legs went last. Then the double vision started was horrible. Truly do not wish what happened to me on anyone because I sat in this zombie state for a year. I am glad the pyridostigmine is working well for you. It is too bad it took so long for the diagnosis. My diagnosis took about a month and then all my symptoms went away. A few months later a thymoma was found and the thymoma along with my thymus was removed. My symptoms are worse post surgery and so I  started pyridostigmine. I have to take it every four hours as well. If I do not eat small meals regularly my systems get worse. While I do not believe there is any medical proof I have modified my diet and that seems to help a little bit. So were your stomach issues constipation? My doctor told me I would have the opposite problem (I am on an extremely high dosage 180mg XR twice a day and 90mg 5 times a day) and I am still constipated. I would not call it constipation or diarrhea. I was having bowel movements every 1 to 2 hours but they were like little (excuse the incoming imagery but it is the most accurate) cat turds. I was also eating less due to the discomfort of constant gas and I was not digesting vegetable matter well. My neurologist recommended immodium for the BM frequency and gas and my GP recommended Metamucil for bulk. In the end the combination  has worked well. Whoa that sounds so similar to what I am experiencing I think it is a pretty common effect of the mestinon. I am no doctor but if I understand correctly the digestive muscles are not affected by MG but they are affected by the mestinon so the digestive process accelerates. If that is the worst thing I have to deal with though I can handle it.\n\nIf you are going to try the immodium/metamucil cure I will tell you my strategy as it took some trial and error to find the sweet spot, YMMV. One immodium in the morning about a half hour after the mestinon and 1 Tablespoon of metamucil in the late evening, that is all, easy peasy. I am now considering playing with the timing of the metamucil because I find myself waking earlier in the morning than I would like just to have a crap. I want to get back to having a perfect bowel movement every morning like clockwork. I feel more constipated than anything else I do think smaller, more frequent meals is in some of the literature I have read. I have had to do that too and find it really helps with digestion but god forbid I am late eating. I thought I might be having sugar issues but all my tests are good so it is just a question of balancing enough calories in the gut to keep me going but not overfilling it to the point of discomfort. What prompted the thymoma diagnosis?  Did they do an MRI to find it?  The neurologist said I was a healthy person with not other problems so they did not think I would have a thymoma. The neurologist said it was the prudent thing to do and check for but they did not think I had one. They ordered a ct scan and I had a a tumor. They could not believe it.", "Could these be symptoms of myasthenia gravis (age 20)? I am starting to wonder if I could have this because I noticed my eye lids have always kind of called over half of my eye- it is never looked like something I should see a doctor about or crazy droopy so I never thought much of it. The eye doctor has mentioned me having convergence insufficiency. I feel like adderall helps treat this for me. I used to bump into things when walking &amp; wall vertically without realizing it. I was so cry and not aware of where I was as much when I was walking. I had trouble reading and with comprehension &amp; issues skipping paragraphs. I also had issues seeing from the side. Adderalll fixes this and I can stay alert.\n\nSince I was young whenever I get hair cuts the stylist always has to keep telling my to hold my head up straight &amp; keep re positioning it for me because it falls constantly in whatever way the hairdresser brushes my hair or anything without me realizing. \n\nI have adhd so I was not sure if that could have caused the head falling- I recently got places on adderall. I had selective mutism as a child, trichotrillonomia shes 12-18, sinusitis/deviated septum airways issue, &amp; some parts of Tourette’s syndrom- I am not sure if this is related at all but I thought I would mention it just in case. I saw a weak neck is a symptom. I feel like I have always been kind of weak- I am 20 years old now. I have also always had a nasal/ higher pitch voices and I startle easily. I have always gotten sick for longer than others and much quicker. I have also always been underweight a little bit and have recently gone vegan &amp; am struggling getting to a healthy BMI.", "Omnilife products in MG patients I have read in several forums that some products of Omnilife could improve the neurological system and brain functions. One of the products more commented is ( (here in LATAM it is known as Optimus) because it has acetylcholine supplements.\n\nSome of you have tried this product? I want to know if it has some negatives effects to MG before I start consuming it. \n\nThanks in advance. Someone maybe? Following", "Is an SFEMG absolutely necessary to diagnose OMG? I will try to make this short. I have had ptosis and occasional double vision for 4 years. I also had generalized weakness during this time. The eye problems and the weakness vary day-to-day, sometimes hour-to-hour. \n\nI have had two very painful, typical EMGs. One was normal, one was abnormal and showed slowed latencies in 3 limbs. I was sent to an ALS clinic, when they ruled out ALS they blamed it on my genetic condition (Ehlers Danlos). \n\nFast forward 4 years, i have had 2 doctors independent from one another take one look at my eye and ask “do you have MG?” When my new ophthalmologist was insistent that I see neuro again, I did. They ran the most common antibody which was negative. No other antibodies tested. \n\nThey discovered through routine bloodwork that I had primary hyperparathyroidism due to two tumors in my neck. This can cause generalized weakness due to elevated calcium. When they removed the tumors, incidentally they took my thymus as well as one of the tumors was behind it. After several weeks my generalized weakness improved a lot. \n\nHowever I still have the droopy lid and double vision. The attending neuro at my university hospital examined me (first exam was done by the neuro resident) and said she was fairly certain I had OMG based on a Cogan twitch, verified fatiguable ptosis and other factors. She set me up with their neuromuscular disease clinic and an appointment for a SFEMG.  \n\nHere is the deal. I cannot tolerate another EMG. Especially not on the face. I will not be able to sit still. I am not a baby about procedures. I have had a dozen + surgeries, many major. I will not be able to do the EMG and I am afraid that will once again be the end of the road. I do not want another disease but I would love to try mestinon to potentially improve my ocular function. \n\n\nI have to believe others cannot tolerate this painful exam and can still get a diagnosis or have the condition ruled out.   \n\nI saw that the ice pack test is highly sensitive and pretty specific for OMG. anyone that is seronegative here get a firm diagnosis and mestinon trial without the SFEMG? \n\nThree EMGs just seems inhumane for one person. For more context on why I just cannot do another EMG or do not want to, \n\nWhen they went hunting for the tumors in my neck, they used a 4D CT with a sensitivity rate of 92.5 percent — nearly identical to the stats on SFEMG. \n\nThe CT missed both tumors in my neck. Pathology and two surgeons verified they were real and what they expected. \n\nSo stats do not necessarily sway me anymore. I had trouble sitting still for the EMG because I have arthritis (psoriatic) and the post-effects of the two previous EMGs were not good. I cannot afford the time off either. Is there anything else here that you have not done that could help?   \n (\n\nMy mom's symptoms started out just as yours had and her eye specialist is also the one who caught it and ordered all of the testing.  She tested positive for all 3 of the AChR antibodies (binding, blocking, and modulating) but I think there are other tests they can do.  She did not have an EMG or a SFEMG, but the other scans they sent her for were normal (and no thymoma). Ah, thank you for the link!\n\nI think that, instead of submitting me for a third painful emg, I am willing to do another blood test to check for the Musk and other antibodies. That was not done. However, with ocular MG I understand that 50 percent of us will be seronegative. \n\nI do not believe it is generalized because my body symptoms improved once my blood chemistry was balanced through the tumor resection. \n\nI think, unfortunately, these concurrent issues — tumors and MG symptoms — delayed diagnosis and put me through additional unnecessary painful testing because my body weakness did not fit general MG, but it did fit the profile for my endocrine tumors, and my eye symptoms did not fit the profile for my endocrine tumors, but it does fit the profile for OMG. \n\nAnyways, thank you for the link and sharing your mom’s story. It is really helpful to hear how others were diagnosed! I want to be a good advocate for myself (I have not been in the past) and hearing how others walked through this is invaluable. My ophthalmologist diagnosed me after running a ACHr binding, blocking, and modulating test. I was positive for all three sent me to a neurologist who said you have MG. The test and symptoms are conclusive. Then scheduled a ct scan and I had a thymoma. No other test were ran. Thymoma has been removed but I still take some pyridostigmine and modify my daily activities. Thank you so much for the reply. My neuro only ordered blocking and binding for ACHr, which were. No other antibodies were tested. \n\nThat is why I was wondering if I absolutely need the SFEMG for a complete diagnosis. I would be happy to trial some mestinon to see if it is affective. I have heard objective improvement on mestinon is definitively diagnostic. \n\nI am so sorry you are going through this! I wish you so much luck. \n\nSigh, here is to hoping. I hope you Thank you. I am sorry you are suffering and going through continual testing", "Blood Test Hi everybody,\n\nI have recently been tested for Myasthenia Gravis, and i got my blood test results back today in my account. However, I have no idea what any of the numbers mean, since there is not too much info on the internet. I have not heard back from the neurologist yet, but since i am anxious about it I wanted to post my results here and see if any of you know what they mean! I know the blood tests are not always a definitive answer, so I am just curious. Thank you!!\n\n&amp;#x200B;\n\nAcetylcholine Rec Bind Ab &lt;0.30 nmol/L  \nAcetylcholine Rec Bloc Ab &lt;15 % Inhibition\n\nAcetylcholine Rec Mod Ab 26 % Inhibition\n\nStriated Muscle Ab Screen NEGATIVE Highly unlikely you have myasthenia. It is impossible to tell without knowing what other tests have been done or not done. Sometimes the only way to confirm is with a single fiber emg after all other conditions have been ruled out and after an mri. In my case I was borderline for blocking but negative for others  and had generalized as well as ocular and had to get started on pyridostigmine to great relief due to my eyes being so distorted from blurry double vision and intense pain after procrastinating for so long on going to doctors. There are some other tests that can be done in regards to immunoassays but these are relatively new and I doubt many neurons or opto neuros would help. \n\n  Simply put ask your neuro if you can go in a week of pyridostigmine and see what happens. It is relatively harmless  as long as you stick to under 2 pills every 5-6 hours when you start, outside of stomach cramps and diarrhea. When I first took pyridostigmine I could feel my neck muscles spasming  and start getting a range of motion as well as my posture correcting and appendages feeling lighter. I had to play for a week to find out it took 2 pills to every 3-4 hours to get rid of ocular pain with double vision still persistingto this day. However I am much younger and after 4 weeks of solid training and building strength back up I mostly just deal with a little blurriness, minor to moderate fatigue. I have thankfully been able to go back to almost full physical activity since before this happened. Good luck and message me if you need any more help or have questions.\n\nEdit: I would also like to point out that single  fiber emg does not 100 percent eliminate myasthenia as there are a few  different types and congenital or neonatal that has persisted since birth may be a rarer subtype called seronegative in which no blood tests will confirm. In this case simply starting pyridostigmine and observing and marking responses in a journal will give you more insight than anything else. You can have MG and not have the antibodies btw", "tattoo sadness i am kind of bummed bc i am very into tattoos and want to get more but i am kind of upset bc i do not know if i will be able to get them again bc of mg. i have not rlly asked any of my doctors what they think bc they will probably just be like ur health is more important or something lol.\n\nhas anyone else gotten tattoos after being diagnosed and not had any problems? obv going to wait til after my thymectomy soon but i guess it is still too early to tell how my immune system will be after. (adding on in comments) i mostly wonder due to the whole compromised immune system thing I just got two this year.  No problems with my mg. \n\nBut I developed an allergy to fish a few years ago. and apparently the second artist used something like A and D (which has fish oil ) and caused a big issue.\n\nFirst one went on with out an issue at all. okay awesome thank u! i usually use aquafore for my tattoos while they heal. Do not know the answer to this but I will sometime in the near future. I plan to get some snowflakes and an awareness ribbon around my surgical scars.\n\nJune is MG awareness month so I have a couple of toenails polished teal, our ribbon color. Not that big of deal for some but this is not something men usually do. Luckily I have a very supportive wife i honestly love the color of our ribbon! i want to get a ribbon on my neck where my catheter scar will be but of course not sure that will be smart for me to do i case i need plasmapheresis again 😂 I was just diagnosed 2 years ago.  Thymectomy a year ago.  I want one on my wrist but I have not been able to pick exactly what I want   I have read certain meds may react so I am hesitant while I am on as much as I am (cellcept mestinon and prednisone) but one day…  it would be my only visible to the public tattoo.  My others all hide under clothing.", "anxiety and mg i wish it were easier for me to tell the difference between anxiety symptoms and certain mg symptoms bc this is no fun. \n\ni also start radiation and chemo for my thymoma, 6weeks of treatment. just want it over with\n\ni also really hope i do not have to do plex again while i am doing treatments bc that 50 min drive to the other hospital near me that does plex while also have radiation 5 days of the week does not sound fun at all. \n\ni just want this to be over with. So sorry you have to go through chemo and radiation. I wish you the best of luck and a speedy recovery. I will be thinking of you. I wish you the best. I had my thymoma removed but did not have to get chemo. I also have anxiety. My neurologist recommended a psychiatrist that has experience with neuro patients. The meds from the psychiatrist have really helped even though it took us a while to find a med and dose that worked. I would recommend talking to your neurologist about this since anxiety pretty much comes with the territory.", "MG and working out I have just been diagnosed with MG and was hoping to get some advice about what kind of workouts I should be doing or can be doing if any. I would say walking is a great exercise if you can do it. Also using light dumbbells. That is what I do currently. It all depends on your stability symptom wise and where your symptoms are. I was lifting heavily when I got diagnosed and continued to do so because the medication and then thymectomy stabilized me. But have noticed that overhead is much more difficult at times It 100% depends on how much mobility you have and like many of us what day it is. But 100% I recommend yoga. My doctors recommended it, as well as my physical therapist. It is something you can do even when doing anything is a struggle - just the breathing and gentle stretching can feel good. Also I walk and have a core strengthening, as well arm and leg routine designed by my trainer. We all are so different, but you can workout - it may not be like before and you may have to be more patient with yourself, but it is completely possible and actually good for us as well. I was not able to workout for a year bc I was in an exacerbation. But now that treatment seems to be working I have been doing pilates and contortion. I got weak in one pilates class where my arm gave out in side plank and I fell, but that was just one bad day out of 6 weeks of good days. \nTL;DR if you do not want to read  the second part and also I worked backwards : \n1. figure out what your extent and capabilities are and how much your affected by MG first.\n2.  Build up strength, stamina and  breathing exercises before attempting anything major. \n3. Progress to jogging half a mile and lifting light weights for mid/high sets and beating your MG fatigue if applicable and increasing your breathing capabilities \n4. This is where it gets tough, force yourself to start exercising twice a day, once in morning and once in afternoon, walk after every meal. Nothing strenuous at beginning. \n5. Progress to moderate intensity workouts and move to HIIT. There are limited studies, with my personal experiences, that support HIIT and moderate lifting of weights.however never try to over exert or max or go heavy. At most you should aim for 70 percent of what you can reasonably do without a spotter for any exercise and at least 8 times. You can always go slow on concentric and eccentric motions of exercises  to compensate more than enough for the low/mid weight. It is a different form of progressive overload that is overlooked by many  yet crucial when dealing with disorders that trigger with exacerbations due to stress. Another example of this would be Addison’s disease. \n\nIf you need advice on dieting or lifting or how to incorporate breathing properly and cardio into your routine feel free to reach out and message me. I may not be able to give you the exact answers due to me being younger than the average person at 29, however I am sure I can help. Also I am not a doctor so do not do anything I recommend without taking into account how you feel, and consulting your doctor if you have severe problems. \n\nHey friend a little back story before I answer your question, I was a very active person before my myasthenia symptoms hit like a truck after a tooth infection and a lot of stress. I had these small bouts of extreme fatigue, winded after few exercises and inability to do many things along with a slight slur and minor difficulty walking since around 12th grade. That was 10 years ago for me. Over the course of next ten years there was 1-2 years before the worst flare , where I actually had to go and get diagnosed by an opto neuro when it involved my eyes along with deteriorating my energy and preventing me from doing a single push-up, where I truly felt normal along with getting in best shape of my life  and had it under  control/remission . \n\nAnyway, to get to the point, in my case and from what I have read from limited studies,  moderate HIIT, and lifting about 50-70 percent of your max for a standard push/pull/leg or whatever split you want does the ticket for me. Of course this is not saying you can do that immediately, however, after 1 month of building stamina and muscular strength I have been able to  get  back into a twice daily routine of exercising and lifting. I realize what I am saying seems counter intuitive to Mg, and believe me, starting back and pushing through that nightmare of fatigue and zero energy and forcing appendages to move even with medication help, but I truly believe this will work for many. \n\nI am speaking solely from personal experience as well and have dealt with many generalized issues from Myasthenia throughout my life. I am also relatively young at 29 and though I had flares in the past, my crisis did not happen until this year. I spent nearly the whole year sitting in misery until my diagnosis and getting started on treatment. Therefore without knowing what your individual problems/ age , relating to MG is and how severe it is along with how well you react to pyridostigmine or whatever your taking and how much it helps you move, I could not say do anything  specifically other than what I listed above,  but only AFTER you have built the stamina, musclar strength and/or breathing capability back up. I am not OP but I really appreciate your detailed response. I have had to give up on my exercise routine and I have been struggling trying to come up with an approach that will allow me to create a new routine I can accommodate. Thanks for all the ideas they will be very helpful. For sure message me if you want to know exactly how I started and I would be happy to go into more detail. It is all about pacing yourself. I am now on month 2 and it is all about patience and sticking to a routine. It is not easy and it is okay to fall back on some days. It took me nearly four weeks to get back in a routine due to setbacks from insomnia, lack of energy and straight inability to do anything.", "Two questions I got to ask I have been diagnosed with Ocular MG when i was 17. I am 25 now and though I have learned to cope, I have done little to no research on it much to my own bouts of apathy. There is words going about between my parents and doctors, so I feel like I would get more straight answers here.\n\n1) if I had to go under the knife for any reason, would i have to be put under a different anesthetic? Would doctors using the common anesthetic have any adverse effect on me?\n\n2) would working out, doing a bit of muscle building for overall wellness help improve muscle weakness, and lack of energy? I have always felt like I had much more limited use of energy to go about my day and it really sucks.\n\nI know i should have been smarter about this and did my research when i was younger, but me being married now, 25, and having this, back issues, and tachycardia, if I do not do something now while I am at my \"prime\", I feel like I will deteriorate at a much earlier age and i do not want that, nor worry my wife that I will only live to 50 or something. \n\nAny advice helps.", "How long did it take before Mestinon became effective for you?  I am newly diagnosed and started Mestinon last week, 60 mg three times daily. So far, no effect whatsoever on my muscle weakness or double vision, but I can no longer eat solid food without almost immediate diarrhea and/or vomiting, and I feel dizzy after taking each dose. \n\nI am trying to figure out whether this is part of a normal burn-in period and I should stick out the (horrible) adverse effects because I will likely start feeling good after a few more weeks, or whether I should have started feeling something good. Y now if it was going to happen. \n\nI also have lupus so I have already been on CellCept and steroids for quite some time; not sure if that makes a difference. Thanks for the support I have already gotten browsing this helpful community, and thanks in advance for your thoughts here. You may just need a higher dose. I felt the effects after 45 minutes of the first dose. It felt like a rush of blood through my body. I started on 15mg daily 3 times daily. My disease progressed very acutely, to the point where I was on about 540mg daily 6 months later, but I also quit smoking, alcohol, and caffeine at the same time. I noticed mine within an hour of the first dose. Definitely worth discuss ling with your health care provider a different treatment plan. As for the gastrointestinal problems, I take metaclopramide every morning which takes the edge off. I feel for you though, it is not pleasant. Higher dose! Reminds me of the joke about the restaurant critic saying, the food is so terrible and the portions are so small. But seriously, when you were on the lower dose at the beginning did you feel anything positive at all happening? Any small awakenings? I have been tracking my symptoms and I honestly think I am worse since starting Mestinon, sigh. But, maybe without it I would be getting even worse even faster. Who knows! My prescription is written for 3/day to move up to 4/day if I need it so I suppose I will give it a go? Hard to imagine feeling worse than I do now, so why not? I am glad to hear it is working for you and also many congratulations on all the great quits - each of those is hard to quit on its own but to do all three at once must have required superhuman abilities! O wow, an hour. I was thinking it was maybe like some of my lupus meds that take months to notice anything. I do have a call in to my doctor. I suspect I will have to make a try of 4/day before this medicine officially does not work for me. The trouble is, I am already on steroids and immunosuppressants for lupus, and I cannot dial those up much, so I am not sure what comes next in the hierarchy. I wish I could take metaclopramide but I get truly bizarre adverse effects. Thank you for the feedback. It is truly helpful. I think you should talk to your doctor about a different treatment.\n\nI started this drug 60mg 4 time a day and can tell you that it is working it took about 3 days to kick in I also take a steroid and that rally helps with my muscle fatigue the only issue I am still having is wanting to fall asleep during the day. Well, I have since relapsed on caffeine and nicotine after 3 years clean.... but it worked while it lasted. \n\nMy neuro was telling me that too much mestinon can have the opposite effect, so it might be worth just trying to do 15mg one morning? I would still consult them first.\n\nDefinitely taking it for the first time was a revelation. I was absolutely a positive influence and I was so glad I had it. \n\nI am on 180ER twice a day + 60 up to 3 times a day as needed depending on how I am feeling. My doctor told me to experiment with the doses, because I am ultimately the one who is going to decide what I need and how much. \n\nAround the time When I was first diagnosed it took me a good hour or two in the morning just to get out of bed. My muscle pain and fatigue were that difficult. That was before I was on the 180ER. I would have to wake up an hour or two before my “real” alarm and take my mestinon, go back to sleep, let it kick in, and then “actually wake up”. After the ER, I could wake up somewhat normal.\n\nI also need IVIG now twice monthly, otherwise I will get a bad flare up and/or crisis. That is a really interesting idea that too much can have the opposite effect. I have a few other meds where I get a paradoxical effect (Benadryl makes me wired and unable to move) so it would not be out of left field for this to happen with Mestinon. \n\nMy doctor has not returned my calls or messages so I am not sure what to do but I may try changing the dose or just stopping altogether until I hear something back.\n\nI am really glad you have sorted out the dose and regime that works for you. Since I am new to this world I do not really understand what constitutes a crisis yet, and what I would do about it if I had one. Any guidance? Generally within an hour I can see a difference. There are times when I am about a half hour away from the next dosage and I can tell I need it. I started with 30mg every six hours but I only needed to take it one or twice a day. Then went a few months without needing it at all. Went back to 30 mg every six hours and began to feel worse. Stopped taking it for a few days felt better and then got worse. Started back on 15mg every six hours for a month or so. Then had to increase to 30 mg every six hours for a few months.  Now at 60 mg every six hours and have felt the best in over a year. Some days if I had an alcoholic drink I was fine while other times I felt miserable for days. Recently I have stopped all alcohol and have felt good for weeks although it sucks because I miss have a cocktail. Update, Friday I increased the dose to 4/day, felt worse. Left about 100 messages at doctor’s office. Finally heard back, they want me to go back to 3 and are adding Hyosine to help with side effects. I feel really terrible and am having a hard time breathing and seeing. If I do not feel better in the morning I am just going to go to the emergency room and see if they have any better ideas.", "For those in College: disability accommodations? Hi All,\n\n&amp;#x200B;\n\nI am in my second year of grad school and my student advisor recommended that I take advantage of the DSA in the school in case I need more time due to a flare-up. So far all my teachers have been great but I understand this may be helpful for when I have an instructor that does not feel the need to help me when I get sick. I am just a bit unsure on what else I should be asking for that may help beyond extra time for papers when I need it. I am willing to try any accommodation that may make my life easier, and I feel silly for waiting so long to be honest.\n\nI am also stumped on a statement on my disability. Specifically, they want a statement from me along with my doctor's notes. I  just have never had to actually write a statement on why this disease is disabling. I feel like I could write a novel just on that subject alone. \n\n&amp;#x200B;\n\nI will be seeing my neurologist and PCP this week to follow up on a Myasthenic Crisis hospital stay so I am sure they can give me some help too.  If you know any resources or links to sites specifically outlining disability accommodation for MG it would be so helpful! I know I will most likely need it for jobs in the future. I had crisis during BAR prep and had to get accommodations. Specifically more time as it was causing my hands to cramp up and also my eyes to fatigue. I had my dr write in as such on the paperwork and gave paperwork showing what MG is and how it affects the body.", "MyRealWorldMG  We are delighted to introduce a new study that will measure the impact of #myastheniagravis on patients’ daily lives. Find out how to be part of this study at (\n\nCurrently available in the UK only. Watch this space as it gets launched in other countries in 2020! ( \\#myastheniagravis #MGStrong #rarediseases", "Welcome to r/Myasthenia_Gravis! **What is this place?!**\n\nMyasthenia gravis (MG) is a chronic autoimmune neuromuscular disease that causes weakness in the skeletal muscles, which are responsible for breathing and moving parts of the body, including the arms and legs. This is a positive community that seeks to provide resources, support, and friendly conversation to people who suffer from MG (or those who know someone who does).\n\n**What can we talk about?**\n\nAnything related to MG or that affects your life because of MG. Remember that this is a happy place, though. We try to keep the negativity down and find positive ways of dealing with our challenges. However, we do have *Sick Rant Saturdays* which will be a future stickied thread posted each week. Sometimes we just need to get it out there, and I want this to be a safe space for that, too. Please keep any rants in the weekly thread. :)\n\n**Are there rules?**\n\nOf course. Please check the side bar for general rules. We plan to implement a wiki and general FAQ in the coming weeks, as well as lists of helpful resources for those with MG (from the newly diagnosed to long-time sufferers) and their loved ones.\n\n**Do I have Myasthenia Gravis?**\n\nMuch to our parents' collective chagrin, we are not doctors. We cannot diagnose you and we cannot give qualified medical advice. However, we can provide you with support, solidarity, and our own experiences that may be helpful to you in your medical journey. Remember that we are all different and that our doctors are the only ones uniquely qualified to give us each individualized plans of care. Hello! I have been really noticing symptoms since April, and I am seeing a neuromuscular specialist in 2 weeks to hopefully get a diagnosis and some treatment options. \nI live in Virginia and OMG I am so glad that the super humid 80-90+ degree days are over! Welcome! I currently live in Florida, so I feel your pain. I am moving to NC, so at least I will have cooler winters!\n\nGood luck with the testing. Just getting a diagnosis made me feel soooo much better.", "Nicotine So, I used to be a heavy smoker. After my first year, I basically used two packs a day and then went on for 6 years. I vaped for about 2 years  until I quit nicotine, caffeine, and alcohol. About 6 months after I was diagnosed with MG.  I basically “washed the engine” and found the problems.  I was nicotine free for 2 or 3 years and recently picked up vaping again because of severe stress. I noticed that when I do vape first thing in the morning before I take my mestinon, I get a rush in my legs. It is weird. It feels exactly like the first few times I took mestinon when I was initially diagnosed with MG in the first place. I felt a rush of blood and strength in my legs. It does not feel like a head high when I first started baking again or when I initially started in the first place. \n\nI constantly want nictotine all day. And I mean all day. Since getting back on nicotine, I basically do not need prednisone to keep my energy constant. And I desperately need to get off of it completely. Other stimulants are not beneficial for me because they make me agitated or give me severe muscle cramps like prednisone does The side effects are detrimental to my career this point and are just as bad as being too weak to work because of MG.\n\nI am currently also on three muscle relaxers to help with pain that my neuro is having trouble diagnosing. She also wants me taping down my mestinon to get my strength back. I am taking  9 different a day, a majority of which is twice. Other doctors want to put me on more meds, too. Right now I am on mestinon 180ER x’s 2\n\nI recently stumbled across something about nicotinic receptors and how it effects acetylcholine receptors. Basically, MG blocks acetylcholine from reaching nicotinic receptors and making them function properly. Does anyone here have more in-depth information about this?\n\nObviously, I should stop vaping because of its effects on the lungs and how that can make MG worse, but are there any studies that show nicotine without smoking or chewing tobacco can benefit MG patients at all? From what I know nicotine should actually be worsening myasthenia, there is even studies that found smokers with ocular MG are more prone to develop generalized MG, and might be a MG risk factor overall. So the recommendation would definitely be to quit smoking, it has other health benefits after all. I am also surprised about you taking muscle relaxants, they are actually supposed to be worsening MG symptoms and some even may trigger myasthenic crisis in rare cases. Maybe talk this over with your neurologist? Please note that I am not a medical doctor, just an interested individual with a PhD in a biomedical field It is weird. When the mestinon is working well, I get really bad muscle spasm, tension, and very acute numbness in select toes. Without it I am in severe pain. It could be spinal cord compression somewhere but it is hard to say\n\nWithout it, I can barely stand or move. I was under the impression nicotine made MG symptoms worse. Very interesting.", "MyRealWorldMG ", "Hair loss with Mestinon Has anyone here experienced hair loss with mestinon? I take the generic pyridostigmine at 240mg per day. Last night I noticed my hair started falling out in the back. It is not coming out from the root; I think it is just breaking really, really easily.\n\nI was just wondering if anybody else had this issue. I have been looking it up online, and it seems like a pretty common side-effect of the medication. I need to figure out what to do to curb the hair loss as much as I can. Are you taking anything else? I did not come across that as a side effect from what I saw but it is one with imuran - I started losing hair when I got to my full dose but it seems to have slowed down now as I have adjusted thankfully  Most of what I have been taken are things I have been on for years, like gabapentin and an anti-depressant. However, I was recently put on a large amount of prednisone before surgery (unrelated to MG).\n\nSo, I have started taking biotin to hopefully encourage hair growth. My nails are growing scary fast now. haha. I figure, if I do not get the bald patch to start growing, I will go to my husband's barber who makes shaved-hair-masterpieces. Maybe he can make it look like something I did on purpose! haha", "First year 55 yo male that started with mild ptosis in one eye. Ophthalmologist checked eye and then ran AChR test which was positive for MG. Sent me to neurologist. \n\nNeurologist checked me and said MG was very mild and ptosis had subsided. I was very active and could to physical work all day in the heat  without issues. I would get a little tired sometimes but chalked that up to age. Neurologist said it would be prudent to run a ct chest scan but did not think it would show anything and said no treatment was necessary. Scan came back with a 3 centimeter thymoma. \n\nI had my thymus and the tumor removed. Felt great without any symptoms for the first eight weeks post surgery. Neurologist and surgeon felt I had a great chance of going into remission. \n\nMuscle cramps in my hands, weakness, and muscle pain then started. Neurologist started me on a low dose of pyridostigmine. I am now a 56 yo that has weakness, muscle pain and fatigue after doing a small amount of physical work. I am still trying to figure this out and going one day at a time. It has changed everything I can and cannot do. I am 39 yo male - I took a walk yesterday and napped for an hour. That was a busy day for me. \n\nI was working two jobs and 12-16 hours a day 5 years ago when my symptoms hit. I was king of the hill, active, engaging, participating in life and thriving member of the community...\n\nI understand you, and something I read a few posts down is naps are the cure and I have been surrendering my manhood to slowing it down and taking it easy, redirected my life energy into unwinding and relaxing. Not something I am good at, but learning. Thank you for posting. I am 10 months into my diagnosis (diagnosed at 55) and I am stunned at how quickly my strength and stamina have deteriorated. Like yourself I first went to the doctor with ptosis. Unfortunately for me it took months to get a diagnosis but during that time I was never really affected by fatigue except that I would get double vision after driving for an hour.  \n\nLast summer I did a three day wilderness fishing trip with several portages. By the end of the second day I was really feeling the fatigue but I chalked it up to age and being a little more out of shape than last year's trip. The day that trip ended I started my mestinon script and all my symptoms faded away. I felt great, except for some side effects but we got those addressed, and between the covid lockdown and early retirement life was not very demanding. \n\nSince the spring hit and I am trying to do things outside I am experiencing a rapid decline in my strength and stamina to the point where daily napping is not an option, it is an absolute. Yesterday I vacuumed the car, hooked up the outside water and ran a few hoses, mowed the front lawn and barbecued some chicken wings. In all 2-3 hours of activity. That was all I had in me, I could not even help with the dishes. Today I did another 45 minutes of yard work and smoked some ribs for dinner, I was too tired to even eat, that was at 4 pm. I tried to nap but my legs just kept cramping so hard they woke me up.\n\nI am not trying to one up you here I am just sharing because I think we are going through the same thing and I am just a tiny bit further along in the process. \n\nOne thing that my wife and I have just started is a weekly schedule with specific chores that need to be done, we have assigned each chore a specific day of the week, some days have multiple tasks and we each have our own specific tasks. We have finished two weeks of the schedule and need to make some revisions (I also need to reign in my urges to do more) but just taking the steps to take control back from the fatigue has raised both our moods. \n\nAnother thing I need to be aware of is eating at proper intervals. My meals have to be smaller and sometimes it is not always easy to eat when I should. I am quickly learning that delaying a meal can cause a rapid increase in fatigue accompanied with a mood change; a low blood sugar reaction but scarily rapid in onset and intensity. At that point I cannot even think of food and instead have a liquid meal replacement and head to bed.\n\nLately I have been wishing for an MG mentor who could walk me through this experience and give me some guidance on what to expect but I have not been able to figure that avenue out yet. It is also been suggested to me that some therapy might be helpful through this transition. I am exploring that right now and I will see what develops. \n\n\ntldr: Anyhow, that is me trying to let you know that I also find myself going through this surprisingly strange process and I really wish it had a user's guide, or at least a tutorial I could play for a few hours, just to the a hang of the controls\n\nGood luck with everything I do not know why but it is strangely heartening to read that I am not alone facing the challenges of change. Hearing real experiences from other patients is a invaluable resource, thank you. &gt;At that point I cannot even think of food and instead have a liquid meal replacement and head to bed.\n\nI get this too, in fact, I take a shot of honey on a banana as my fuel, then pass out for an hour or two. You have a very interesting point about MG and diet and fatigue... I am only 6 weeks from diagnosis and have barely had enough calm time, I believe this thing is still flaring up. \n\nThank you for posting. I agree that this is really hard as a man, to tone down my masculine energy. It is affected me in many ways. It is very hard to go from a do anything anytime you want to planning activities and rest. I was very upbeat that remission would occur after the surgery. I too, find that hunger will increase symptoms.  Stress seems to be the biggest trigger for me.  I guess I need to learn to manage stress better. I never had a stress issue until now. It is frustrating that every day is a new adventure. Time will tell how thing go.  I wish there was more research and better medication for MG patients.", "Started with Mestinon Morning! I have started Mestinon last night,  10 mg BD for now. Neurologist said I can use it three times a day if necessary. \nThis morning my ankles and leg muscles feels stiff as well as neck muscles. Phlegm increased overnight. \nI had electrode test done two days ago. Could after effects cause muscle stiffness or is it the Mestinon? \nHow long does the body take to get used to treatment ( if at all)?\nVision also more impaired and out of focus at times. Thank-you for support. 😘 Increased mucus production is a common side effect.  \nYou may have gastro problems.  I sure do.  It does get a little better over time ... but of course no promises. \n\nBest wishes Mestinon is like battery. You recharge the battery when it is weak so, you can take one mestinon when you feel muscle weakness", "Participate in appearance research (Myasthenia Gravis) Hi everyone. I am Danielle, a research associate at the Centre for Appearance Research at University West of England Bristol (UWE). We are keen to get more people with Myasthenia Gravis involved in our research, to better understand what it is like to have Myasthenia Gravis alongside other conditions that affect people’s appearance. If you are interested in finding out more, you can join our Participant Pool: ( Thanks!\n\n", "MG symptoms but doctor refuses to investigate I have general muscle weakness throughout my body, which worsens throughout the day and with activity. My neck muscles become so weak it is hard to hold my head up. The muscles of my mouth/tongue also get weak the more I talk or eat, making it difficult to pronounce my words properly and difficult to swallow. I also experience difficulty breathing, numbness and tingling of the arms, legs and face. My eyelids will become droopy occasionally in the evenings. I end up with multiple folds on my upper eyelid where I usually have just one. Blurred vision is also an issue periodically. I saw a doctor today regarding these symptoms and he told me that MG is so rare and if I was able to hold my arms above my head and hold my eyes open for him then there is no way I have it. Thoughts? See another doctor! Yes different doctor who will take you seriously, and also get a referral to a neurologist ASAP. This disease is manageable with the right medications, which may take some time to figure out dosages and what works for you. With my mom’s MG, we went through 4-5 months of going to several hospitals, doctors, specialists and having tests done of all kinds before landing where we are today, nearly 4 years later she is finally on the right medication and doing well, living a pretty normal life. Good luck to you! If you have the kind of insurance that allows you to see a specialist with out a referral -run straight to a neuromuscular neurologist as fast as possible.  \n\nTo find out if a neurologist is a neuromuscular specialist - call the office and ask - especially ask if they treat MG. You are close to a serious episode when you are having trouble swallowing or holding your head up. \n\nWorst case - when you are feeling your worst go to the er and tell them you suspect MG and why.   Most doctors have never seen or diagnosed MG. \n\nBe your own advocate! x2. That one is ignorant! See another Dr ASAP! It could be dangerous since you are having difficulty breathing it could get worse. Please this is serious you should even go to an ER that has Neurology Specialists. That is how I found out i had MG. Unfortunately, after NO doctor listening i checked myself in to an ER at a hospital where they also specifically in Neurology and that is how they found out. But you have to go because it can so easily and quickly turn into a MG crisis. Specially if you are having a lot of stress and frustration from nobody listening to you. I understand how you feel, hope you get better. Keep us posted! Thank you! Glad to hear that there is effective treatment out there! I live in a small town a couple hours away from where I would find a neurologist but I will make the trip if that is what I need to do to get a proper evaluation/diagnosis. Thank you for your input! Unfortunately I do need a referral and that would come from my family doctor who was the one who just dismissed my concerns. I think my best bet is going to the ER at this point, even if I have to go a few times to get a doctor who will listen. Thanks for your response! Unfortunately I live in a very small town so I am lucky to even have a family doctor (the one who dismissed my concerns) let alone an ER with any specialists. I may have to travel a couple hours to the city to have them evaluate my symptoms! I will update when I get some answers! Best of luck", "MG in remission? I was diagnosed with MG about two years ago and seems that my symptoms are now in remission. I wish I could explain how my symptoms went away in two months without sounding incredulous but I would still like to share my experience. There is definitely lots of prayer but I started taking a pill that naturally helps testosterone production. Five natural ingredients from what I researched and I think it is one of these ingredients that helped. If you are interested please let me know and let us start a discussion to see if it helps anyone else as well. Please talk to your doctor. Testosterone has nothing to do with the way mg works. In the early days of my journey, before I was diagnosed, my symptoms would only show for short periods of time then go into remission for a year or more. One day it came on strong and has not gone into remission again. Everyone is different but please talk to your neurologist before self medicating with home remedies. Do you think stress was a trigger for you? Plus, I do not think it was the testosterone aspect but more to do with one of the ingredients. What are the ingredients? I think it is a possibility I cannot remember foyer but I read somewhere that low testosterone can be a trigger for myasthenia gravis. I have Addison’s disease and low testosterone just comes with that and I definitely think it was a trigger for me so I definitely think that is possible while you were in Remission. So happy for you! Ashwaganda, Forskoli, cacao see extract, caffeine, and a dopamine derivative", "Newly diagnosed question I went to the er on Thursday because I could not breath properly after some slight exertion. The er doc finally decided he thought it was MG. He pulled blood to check/verify MG. \n    I have an appt with my regular doctor on Tuesday. I have Crohns.\n     I am wondering who generally prescribes the meds to help this first.  The GP or when I see a neurologist. Not being able to swallow or chew more than a couple bites is getting old fast.  \n   I guess I am not formally diagnosed, but from everything I can see,  I have every symptom other than hoarse voice. I have been in the same boat for two years due to insurance issues getting the single fiber EMG but it was my actual neurologist who decided MG is the most likely culprit, especially after I responded well to meds. You will want to see your neurologist for medications and treatment, a neuro-muscular neurologist if possible. I know that is not easy, in my state ( I am in the US) there are only like 4 specialists. Your GP might prescribe medications but the two I have had would not touch it even for med adjustments while I was unable to get into my own neurologist as this disease is very specialized and can be complicated.\n\n&amp;#x200B;\n\nGood luck! Luckily I have really good insurance and the university has a neuro dept that specializes in MG. Im hoping the blood tests come back with some answers. \n     I will probably end up going to that neuro dept if i cannot get things figured out.  \n   Thanks for the advise. Keep in mind that sometimes an EMG is needed to confirm MG and bloodwork may not show anything if you are seronegative, that does not mean that there are not antibodies being produced but yours may be harder for the lab to see. That is my case, although they have not tested all the different anti-bodies that mark MG I see a neuro-muscular specialist tomorrow so I am sure he will. \n\nIf you have trouble with chewing and swallowing there is a free pdf cookbook called MG United, you can google it and it should pop up. Plenty of good meal ideas for when it is a bit difficult to chew or swallow.\n\n Good luck! It sounds like you are on the right track and have a doctor specialized in MG near you. Huge thanks for the cook book idea. \n  Eating has been the hardest so far. The good news is you have their attention.  \n\nNormally that is the hardest part- as diagnosing a rare disease by an ER  or family doc is a once in a career event for them. \n\nYour family doc may or may not prescribe Mestinon. Full disclosure, it takes some time for your body to adjust to this med - by body I mean your digestive system - sorry it is rough for a while but the med really helps.  \n\nNext you will most likely be sent to a neurologist.  \n\nIn preparation - try to research which neurologists  in your area are experienced in neuromuscular diseases.  It is normally listed in their bio online. Neuromuscular specialists generally work with your nearest hospital system. This could be important for possible IV therapies. \n\nThis way you can request a neuromuscular specialist when your doc writes the referral. \n\nOr he may just call and get you right in to see one.  \n\nYou must educate yourself. It is really important. There are contrasting views on treatments for MG. \n\nI personally feel that steroids are NOT a viable long term treatment for anything. You only have one set of organs. It is very bad for your organs to be on long term steroids. I am allergic to many types so I talked with my neuro and he agreed they are not for me. OK. stepping off the soap box.  \n\nThe younger you are the more possible it is you could go into remission from treatment. \n\nIVIG is a common MG treatment. It is very effective. \n\nResearching IVIG is eye opening. It is made from thousands of blood donations. Very humbling. \n\nAs I am older and I have no doubt I have had MG all my life- my symptoms were severe by the time I got diagnosed. IVIG was just not enough for me. \n\nI am on 2 x month Soliris IVs.  They really put ‘life’ back into my life.  I cannot run a race but I can go shopping with my grandkids again.  \n\nWe MGers have some serious issues with what is considered normal medicines.  Be sure to talk to every doctor you see from now on about possible drug effects from MG. I recommend you have the drug avoidance list from various MG sites with you (on your phone) at all times. \n\nSome of us (me) even have reactions to simple l novocaine shots at the dentist because of the epinephrine  —-\n\n(\n\n(\n\nLast thing. \n\nBIPap or just Oxygen NOT CPap. If you are ever in the hospital you need to know CPap is bad for us because you can suffocate from the weakness of your diaphragm with CPap.  \n\nAgain, read everything and become your own advocate.  \n\nBest wishes.  Let us know how you are. This is so good to know.  It definitely helps cut down the steep learning curve. I am 46 and have been very active. Weight lifting, riding dirt bikes, etc, so this complete exhaustion is scary and very hard to deal with.  \n   I have crohns, so bowl issues are par for the course. \nI will take a screenshot of your post to refer back to.  \n  I really appreciate the help A neurologist/neuromuscular specialist would be the one to treat you/medicate you. Idk if maybe your GP/primary might be willing to rx mestinon for you while you wait to get a referral to a neuromuscular specialist. Do not be discouraged if your labs come back negative. There are those of us (like me) who are seronegative but still have MG. Wishing you the best of luck on this journey! With a positive blood test my GP would not treat or prescribe medication. Sent me to a neurologist. That Is my guess as to what will happen. I am still going to ask... Many, many of us multiple autoimmune. It is almost par for the course.   \n\nAt your age, I would bet you will be able to knock back the symptoms. \n\nThere is a trainer on Instagram - Barry Potter - who has MG.  He is pretty active.  \n\nBest wishes. I went to my GP today and got the PA. Luckily he has seen MG once before and was willing to prescribe Mestinon. Two hours after taking a 60mg pill, my double vision is gone and I feel a lot better. Not 100% but enough that I am ok with it. \n    Now I need to get into a neurologist. Luckily, due to headaches I used to have, I am already a patient of one of the leading neurologists in utah. I think you are right. My gp wants to leave the mg stuff completely for the neurologist. You will have to be followed now and it will most likely take a while to dial in the meds and doses that work for you so it makes sense for the neuro to do this.", "thursday is the day. i am scheduled for my robotic thymectomy on thursday if i fully decide to do it then.\nmy last plasmapheresis treatment is monday. \ni wanted to go home because next week will be two weeks in the hospital and i want to wash my hair when i get my catheter out and see my cat and sleep in my own bed and just have a few days of \"normal.\"\nbut at the same time i am already here, i will be able to be monitored closely before surgery to make sure i am fully 100% strong enough to go under and have my lungs deflated and inflated again without needing to be on a ventilator for a long time. \n\ni feel like i did not have time to mourn my life before i got sick, or mourn who i was.\n\nbut the fact that my doctors think after a year or so my life could go back to almost normal and i can be in remission makes me just want to get it over with now. \n\ni know these people are smart i just wish i could let go of this sense to need control over my life and it is outcomes idk. Good luck and hang in there. As I mentioned I have been through the surgery. While there were some tough days i was able to get through it. I know you can as well. Keep strong and you will make it through the recovery. One thing to remember is time will erase the pain. My prayers are for a speedy recovery for you. Good luck! I had robotic thymectomy too and it went well but my surgeon did not even me of the gas build up from the inflation that hurts bad when you wake up. Do not sleep fully flat on tour back for awhile or the pain is worse. But overall it is worth it in my opinion it greatly helps and I am barely on any cellcept i am just scared abt the intubation/breathing machine part and they are not sure how long i will be on it ): but they all think i am strong enough and my last plex treatment is monday so. i am doin it. thank u 💖 thank u 💖 I hope your surgery went well. Hang in there.", "Waterfasting experiences? Hello theree \nIm diagnosed with MG when I was around 2 or 3 yesrs old and Im so struggling with losing weight - not the only one here likely. Anyway does someone have any experience with waterfasting during MG? I find it very hard to not have breakfast as within an hour of not eating after taking my meds my belly starts hurting very bad. Im thankful if anybody sees and answers! Don t u need water for your mestinon intake ? I need to drink water every 2h so i doubt it would work but i would also like to know what ppl have done to lose weight\nI ve only had it for around 8 months or so from cancer Oh im so sorry to hear about that. I hope youre doing better now!! \nAnd yes i also have to drink every 3 hours tho my belly only hurts in the morning after first taking meds and after that no more if i dont eat", "Physically demanding job I am 31 y.o., diagnosed with double seronegative generalized MG this past spring and currently taking imuran and mestinon for the last 2 months, plus a course of plasma exchange which did not seem to help much. My worst symptoms are double vision, crossing eyes, drooping eyelids and weakness in my arms and legs if I miss a dose of mestinon. Prior to treatment I also had lung weakness and shortness of breath but that has improved a lot now. Despite all this I am still able to do stuff like hiking and riding a bike in extreme summer heat without much fatigue. I am hoping the imuran will eventually help with the double vision. \n\nBefore all this I had decided to change careers to nursing and am finally at a place financially where I am able to enroll in pre-reqs this fall and send applications out. It is something I have wanted to do for a long time but am now having second thoughts due to the physical nature of the job. I would hate to not do this because of MG only to find that I improve with treatment. Thoughts? If not nursing, does anyone work a less physically demanding healthcare job? \n\nBtw, I had to quit my full time desk job because I could not handle the prolonged hours of screen time with my vision anymore... \n\n Hi I am 38 and was diagnosed with seronegative MG 3 years ago. I have been an ER nurse for 18 years. Working a 12-hour shift on the floor is no longer possible for me due to MG but I am still working full-time. I am the Nurse Educator for my ER now and work 8 hour shifts, much of which is at a desk. But I still get to jump in and help out with breaks and stuff so I do not feel like I am missing out. That is the thing about nursing - there is so many different types. Do not let the MG hold you back.  To add on to this, my Insurance company has an RN that calls to check-up and follow my treatment", "New MG Patient Hello everyone, I am a newly diagnosed MG patient learning about how I can live with it. I am excited I found this little community to share with. I have been struggling for years and just got my diagnosis so its a big relief for me.\n\nI was a busy/active person - manager in a factory and working out every day with kids, started coaching others in crossfit classes and doing crossfit, and then I got hurt. Everything was always burning, muscles never relaxed and I was experiencing and MG crisis due to diet and stress. Eventually, I plopped down on the floor quitting my career and hobbies, defeated, I began throwing money at doctors and healers for solutions.\n\nFinally found a holistic Chiro Nuerologist that did some blood work that discovered all of my symptoms matched with bloodwork proof. The remote work from the doctor was beneficial, I fired her and will be seeking a true neurologist for a complete workup, I need more help than what she offered. I do not feel 100% safe having these issues and her prescribing a probiotic (I still take them, they help, but I know my issues are deeper).\n\nTL;DR - I had my first sub mandibular lymph gland flare up a month ago, I woke in the middle of the night with obstructed breathing, never having this before I went to ER. I told them my new diagnosis and they sent me home with 10mg prednisone which helped. My question to all the \"veterans\" of MG is - do you experience a flare up or crisis often? What is your flare up and how do you manage it when it happens? Do you notice your body behaving differently before the flare up?\n\nThanks everyone! A crisis usually necessitates a 2 week long hospital stay on a ventilator. So sounds like you just had a flare? \n\nI have been in a flare since august so I cannot really remember what my flares were like before then. I have refractory MG which means it is not responding to traditional treatment. I am on rituxan now. I also have lupus. Rituxan treats both. Most aggressive treatment. \n\nNot sure I answered your questions...or what your questions were, but that is my story. Sounds like just a flare... my mistake, I will lurk more. Lymphs still a larger and a little tender, but not obstructing anything. Thanks for your reply Hi! I am on disability for MG. I have found that, for me, the best way to manage MG is by making sure I get plenty of rest. (Not just sleep, but reclining most of the day.) Unfortunately, any amount of physical activity leaves me exhausted, which doctors call \"post exertional malaise.\"\n\nThe first time I realized I had a problem was after hanging a new shower curtain. My arms just did not want to cooperate and I napped for several hours afterwards. \n\nFortunately, I have never had a full crisis. I do feel like I am constantly flaring if I do not pace myself. My advice would be is fight through all of the bull shit from the MG and subsequent issues from medication and stay as active as possible. I have been told by every neurologist that I would not be able to maintain an active lifestyle and continue CrossFit. Also that is easy for me to say as I do not have generalized MG, just shoulders and up is where I notice weakness but regardless do not give in to the condition it will make you miserable.", "How severe is your ptosis? ", "Web assisted telephone interview regarding your experiences of living with a Myasthenia Gravis Hi  ( We are conducting market research on behalf of a pharmaceutical company in UK, Germany and Netherlands. Taking this opportunity to have your voice heard would greatly help us further our research, and your participation would be hugely appreciated.\n\nThe purpose of the research is to understand your experiences of living with a Myasthenia Gravis. It will take the form of a web assisted telephone interview, \\. We will provide a payment of £90 paid after the interview has been conducted. \n\nClick on the link below and answer some quick qualifying questions here **\\*UK\\*** (\n\n**\\*Netherlands\\***: (\n\n**\\*Germany\\***: (", "i hope it is not spreading... doctors think that my thymus is a thymoma or whatever and they said it is fairly large so i have to now get a pet scan to find out how much it is spread or if it has. i do not want chemo i do not want radiation. I do not know if you have had it confirmed or how much you know about thymus glands. \nI will explain what I know and hope someone comes along and corrects me if I am wrong.\nThe thymus gland is apart of the immune system and sometimes can develop thymoma, which is more often than not a benign growth. Your doc can send you for a scan to check and if thymoma is present they generally decide to remove it, and it can make MG symptoms better and on occasion put it into remission. Chemo and radiotherapy may not be necessary, so try not to worry (stress will make your MG symptoms worse) until anything is confirmed.\n\nEdit. : I should have mentioned, my consultant suspected an enlarged thymus and sent me for a scan, I had to drink a dye beforehand, everything came back fine, there was no abnormalities. I think it is general practice for them to check for thymoma with MG patients, as that can occasionally be the cause. i am already in a hospital doing Plasmapheresis, they did an MRI on my head to rule out MS, and a cat scan on my chest and they said that my thymus is quite large and more than likely is thymoma, and they had the cancer team and chest surgeon team come in and talk to me, i get a pet scan tomorrow for a full body image to rule anything else out and to see how much the thymoma has possibly \"spread\" and if it is affecting my diaphragm i will need radiation and chemo then get the thymus removed\n\nthey thought they saw something on the left side that seemed to be leading from the stymus area but we shall see. My blood work was positive for myasthenia gravis and I had a slight droopy eyelid. My neurologist sent me immediately for a ct scan. I had a 3 centimeter thymoma in my thymus. While I am not a doctor my understanding is the thymus helps you immune system to develop but does not do anything for adults. I was told I needed to have my thymus removed as the thymoma was growing there. I had the thymoma and thymus removed in Dec 2020. It was benign so no other treatment was necessary. There is a good possibility my mg will lessen or go into remission and that is the waiting game now. I am happy to share the details on the procedure if you would like. if you could that would be nice, like pain, healing time, what surgical rout they took for the procedure, side affects you had if any at all (sorry for a weak response i am very tired tonight) I live in Utah and l had some very good doctors that diagnosed me quickly. In Feb 2020 I had a slight droopy eye off and on for three weeks. The doctor ruled out a stroke and then ran a blood test for mg. Actually eye was better before blood work results came back. Off to the neurologist. \n\nThe neurologist checked me and said it looked like a mild ocular mg. While my eye seemed fine she could make it droopy. Ordered a ct scan saying that was the prudent thing to do while she did not believe i would have anything as I was healthy otherwise. Got through the insurance red tape and results were as I stated. She immediately set up an appointment with a thoracic surgeon. \n\nThe surgeon walked me through the scan and surgical options. He said I needed to get the thymoma out as it looked like it was growing towards my heart and it should help with my mg. He stated he would take out the entire thymus gland and tumor. There were two surgical options. \n\n1. Split the sternum and remove the thymus and tumor. Four months without driving and most likely six months to return to work. Surgery would take 1 hour. \n2. His preferred method - bilateral endoscopic removal. Go in from both the right and left sides one at a time, collapsing each lung and remove everything. He said you must go in from both sides because of the chest curvature. Six hour operation, one week icu and back to work in 3-4 weeks. This was the option I chose.  \n\nOperation was six hours and I was awake in my icu room that evening. Pain was not bad but I was weak. I felt like I could go home the next day but what I did not realize is I had a spinal block that eliminated all pain. Lost’s of monitors hooked up to me, a chest tube on both sides, catheter, and a central line. \n\nDay 2. Spinal block work off and there was pain. It hurt to move for my lung X-ray but I did it.  I had deep breathing exercises and coughing to keep lungs open and fluid out. Pain was bad and the pain pump medication made me nauseous so I would not administer it. Worst pain I can describe in the morning but nurse and doctor distracted me and administered a large enough dose that I got sleepy and rested. In the evening pain level had gone down, they were forcing me to do coughing and breathing exercises and walk the icu floor. \n\nDay 3. More breathing exercises, more coughing and more walking. Daily chest X-ray. Pain was less, pain pump gone now. I had some oral pain medication and Tylenol. Chest tubes hurt and it was hard to lay in a position that did not make it worse. Doctors told me to walk a lot and get the fluid out of my chest so the tubes could come out. Catheter was removed. I was doing breath and coughing exercises and about 75%of my required walking. Deep breath still hurt and coughing still hurts. They gave me a pillow to hold against my chest when coughing to help. \n\nDay 4. Still breathing exercises and coughing hourly. Chest drainage is low enough tubes are pulled. No anesthesia and must hold your breath as they are pulled out and hole is closed. Not bad and to be honest the tubes hurt so bad getting them out was easy. Walked to X-ray and walked back. By the evening day 4 doctor released me. I was weak and the pain was not bad. Only taking Tylenol now. \n\nSpent the next few days in the recliner at home. Still did breathing, coughing, and walking every hour unless I was sleeping. Only taking Tylenol now. I would see improvements each week. Getting stronger and stopped coughing up fluid. Was cleared to cover all bandaged areas with plastic wrap and take a quick shower. It felt fantastic. Really pushed myself with breathing exercises and walking my house. Three weeks later in my final check up stitches were removed, and I wad cleared to drive and go back to work the next week. Basically 4 weeks from surgery to return to work. \n\nI was still tired and lacked strength from the surgery. Every couple of weeks I could see improvement and my chest was less tender. Two or three months post op I was doing well from the surgery but my hand and arm would cramp up. I also got tired easily if I did some physical work. Neurologist said that was the mg and they hoped I would have gone into remission. I was started on pyridostigmine 30mg every six hours. That is what I am still on and can get by. Doing to much physical work will wear me out and then I need to rest. I am adjusting and the doctors say it is a waiting game to see if I go into remission. \n\nAll of the breathing exercises were to avoid pneumonia since they collapsed both lungs during the surgery. I do not have any breathing issues now. I have three scars on my lest chest side and four on the right. The fourth scar on the right side is the longest as it was used to pull the thymus and thymoma out. The chest tube scars are the next largest and the remaining scars are very small. The chest tubes went in on each side at the lowest rib and the tube went all the way up to my shoulder blade. \n\nSorry this is so long. I am happy to share any more details or answer any questions. I fully understand your questions as I was there but I was flying solo as I did not have anyone to talk to. Please let me know if you have any other questions. this was very very helpful thank you so much! lucky they said my pet scan was not too bad and that they will not know if it is malignant or not til after they remove it, they obv want to wait til i am done with my plasmapheresis treatments (on my second one today i will be done next wednesday) and i get a bit stronger and gain a bit more weight) to figure out when to remove it. i have a muscle specialist on my team who works at a mayo clinic in the town i am being treated in (hes been researching and specializing in MG for many many years) and he wants to start me on a lower dose prednisone soon but obv has to talk to my surgeons and figure out when and what to do with that so they do not interfere with my surgery. i am taking mestinon every 8 hours here at the hospital and it works fairly well, i mostly just walk myself to the bathroom and back to bed. it is all really scary but yeah. i am sure things will be okay. I wish you the best of luck and a speedy recovery. Please do not hesitate to reach out if you have any questions.  It sounds like you have a good team of physicians.", "Taking Sinovac CoronaVac Hello everyone, hope you all are having a good time.\n\nThe National Vaccination Schema here in Colombia is applying CoronaVac to all citizen. I want to get vaccinated but I am concerned with the low effectiveness of this vaccine, plus the decrease of protection for people with immunosuppressed treatments like me.\n\nSomeone here has taken the CoronaVac vaccine? Is recommended for MG patients? Any information will be very helpful to decide if I must take it or not.\nThanks in advance. Let me preface this with the statement that I am not a doctor and I think you should speak to your neurologist about your concerns. \n\nData shows that the vaccine is still highly effective, but that does not mean you definitely will not get covid. It just means you probably will not. \n\nI am on Cellcept to control my symptoms and got the vaccine with minimal side effects at the recommendation of my neurologist. \n\nFrom my understanding and conversations with my neuro, we do not have enough data to say how immunosuppressed patients like us react to covid exposure post vaccine. I still wear a mask when I am indoors with others and practice social distancing, and wash my hands frequently. So far so good.\n\nEdit: diagnosed in 2013, am American. Agreed with all and definitely consult your doctor. My neurologist recommended to all his MG patients (he runs a clinic) and even though some data shows immunosuppressed may not make the antibodies in my opinion it was worth taking especially with my doctor recommending. The only thing my doctor said was that I should get vaccinated. He did not suggested me anything about the different labs.\n\nI am already took the vaccine and feel al right. Thank you so much for your help! Only question you need to ask is : \n\nIs this a live vaccine? \n\n—Live Vaccine is not good for Anyone with MG or   any autoimmune disease.  \n\nDo Not get the shot. \n\n\n—Non-Live vaccine is highly recommended.  \n\nGet the shot. \n\n\n\nI got the Pfizer vaccine and had no side effects at all. Hmm.. CoronaVac has a controlled tiny amount of live virus * panic * Happy to hear it!", "Getting very tired after eating. I do not know if this is related to MG or if this is a symptom of another issue altogether: \n\nAfter I eat a full meal, I basically get a flare-up to the point where I pass out. I am not talking about \"Oh I feel tired, I may need to lay down and take a snooze.\" No, like, if I am not on a bed or on a couch, I would be at risk of falling sometimes. My breathing becomes labored and I get intense brain fog. I sometimes need my cane to walk from room to room after a full stomach. It is started developing over the past month and has gotten progressively worse. I have tried different foods: Spicy, bland, gluten-free, dairy-free etc and it is all come back with the same result. I can only eat very small meals now or risk passing out. I can only eat about a cup of food at a time without getting a flare-up. Within the past week, I have now developed nausea all day the second I smell or eat any food, so I have gotten to the point where I need Pepto Bismol in order to maintain my diet. (currently waiting to see my neuro, waiting on nutritional shakes, waiting to see a gastro, waiting to see a hematologist) \n\nA little backstory: I have lost 34 pounds in 4 months this year. Four months later I have been trying to force myself to eat and have been only been able to put 2-3 back on. I have lost my appetite entirely. I was on prednisone and gained 17 pounds.", "benadryl during plex treatments i absolutely HATE when i have plasma days and need the benadryl in my IV to prevent reaction bc it makes me feel so paranoid and not relaxed during the treatment. \n\ndoes/has anyone else experience this and have advice on how to calm your nerves during the process bc of the benadryl I take a non “D” allergy med and tell the nurses I took my allergy meds at home.  I hope you can too. \n\nI also have big issues with Benadryl.  I am cranky then down and out sleepy on the med. the next day is like a hangover for me. the other day on my third treatment is when they finally did plasma and not the albumin and i legit had a panic attack bc of the benadryl my pulse went up to like 120 something resting it was not fun. today was actually fairly easy (my fifth one i have two more left) and the lady kind of took her time putting the benadryl in my IV so it was not as sudden of a come on i think. I hate that stuff.  Get better ! ty! still waiting to hear back about when they think i will b strong enough to have my thymectomy.", "Thymectomy for purely ocular MG? Been (tentatively) diagnosed with MG: negative Achr, MusK antibodies, negative EMG (scheduled for a single fiber one), clear chest CT\n\nPositive anti striational muscle antibodies and ocular MG symptoms including mild ptosis, diplopia (that worsens during the day), fatiguability with reading and being in busy places. Not fun seeing everything 2x. Clear brain mris, thyroid panel etc, basically no other cause for double vision.\n\nTried mestinon which did nothing for my diplopia (to be expected considering my antibodies). I am scheduled for an appointment with a MG expert. However I am extremely concerned about taking corticosteroids (which I understand is the next reasonable step). Previously took corticosteroids for an unrelated issue and the psychiatric side effects where absolutely crazy. Like delirium crazy. \n\nI did tons of research and saw that thymectomy, although not generally recommended for purely ocular MG, has better remission odds and also stop generalisation of the disease (not always ofc). \n\nMy question is if anybody has had a thymectomy for purely ocular mg? Ofc, doctors do know best but at the same time I want to fully understand my options and make an informed decision. I want to do what is best long term, even though it might involve surgery. I also want to be the best advocate for myself and that is why I am keen to understand other people’s xp. So any thoughts or experiences are much appreciated. Thanks! It took my husband a year of being on mestinon before it started to do anything for his eye. \n\nHis eye is fine now but I am not really sure of all the facts and details about it\n\nHe did not have a thymectomy", "Fatigue and MG research study ", "June is MG Awareness June is MG awareness month and our ribbon color is teal. Whenever I tell others about our condition they have no idea this disease existed. So to start up conversations and raise awareness I had one toenail on each foot painted teal. I plan to keep it on throughout June. We need to raise awareness so better treatments or a cure can be discovered.  We all need better treatment options to improve our lives.", "Double vision whilst using reading/using eletronics Hello,\n\nJust wondering how others who suffer from double vision brought about by ocular myasthenia manage it? I have a referral in a month but does anyone have any tips as I am currently not on any medication. I noticed I get it mostly when I use my laptop and my phone but it happens when I work and read (I am a student). I sometimes get double vision when I have been looking at a computer screen too long, but I do randomly notice it on any digital display. (The oven clock is one I always have to double-take, for example.)\n\nWhen it happens, I either step away from the screen if I can or wear an eye patch if I need to keep working. I find having an eye patch helps my double vision. Ill give it a try with the eye patch, thanks :) You are welcome! I actually bought a pretty cool looking one from Etsy just in case I need it while I am out. haha. I\"m currently being fitted for an occlusive contact lens, and I cannot wait! \nI spend a lot of time in front of computers and I personally do not feel safe being outside on my own due to the severity of my double vision and few near misses I have had in the past. \n\nI have worn the eye patch and it really was not  my style so I researched ways double vision was dealt with in general and an occlusive lens seemed the best solution for me. I brought this up with my ophthalmologist and she was all for it.  ", "Starting IVIG soon and looking for input. I was wondering if anyone could share their experience of IVIG treatment with me. I am most interested in the length of time it takes each time, especially the first batches, and how the treatment period affected your energy levels. Lastly, how effective was it as a treatment for you? The first rule of IVIg is — \n1. Take allergy meds and drink extra water before treatment. \n\n2. Take a drink or two and snacks with you. Also take something to keep yourself busy.  I always take sewing or crochet. \n\n3. Dress in loose layers.  Some places are cold and some are warm.  You never know.  \n\n4. Be polite to the staff - you will get to know them really well and they have needles. 😎\n\n5. IVIg sometimes triggers migraines or headaches.  \n If the headache gets severe you should call your doc or go in to the ER - there are some rare side effects from IVIg. \n\n6. If you are constantly having trouble with the ivs blowing and or getting blood clots get a port.  Best decision ever. I have had mine for over 2 years. \n\nIVIg  normally works well to help with the generalized symptoms. You should notice a change after the second or third treatment. The benefits should continue to develop through the treatments.  \n\nI was first dx after a serious crisis.  I was 60 at the time.  It is sometimes harder for us older people to regain our muscle use. Younger people can sometimes go into remission. \n\nAfter 2 years I had to switch to Soliris. It is somewhat better for me now.  \n\nBest of luck! You have managed to answer a number of questions that I did not even know were in my head and prepare me all in one go, thank you.\n\nI just have two quick questions: \n\nWhat is the purpose of the allergy medication? \n\nAlso, If you do not mind sharing, what kind of allergy medication were you using? I had IVIG just during crisis and it made me nauseous and vomit for a few days so the allergy medicine helps to abate those reactions. While I do not have any experience to form a comment, as an MG patient I wish you the best of luck. Hopefully it will relieve your symptoms. It is not bad, I am usually done in 3-4 hours. I have not had complications though. It was extremely effective and continues to be. Takes a few days the first round and last about 4-6 weeks. Hope it goes well! Thanks for the information, that will be helpful to have on hand then. Thanks. That so good to hear, thanks for the encouragement. I was at the infusion center for about 6 hours 4 consecutive days a month for about 4-5 months. It was not effective for me at all. They give you allergy medicine at the treatment center just in case you have a reaction Sorry it did not work for you but I appreciate the information. I should probably temper my expectations a bit. Thanks. It helps a lot of people. I have refractory MG. The docs and nurses always say Benadryl.  I hate it. It knocks me right out and I stay fuzzy all day.  So I take an Allegra or any brand regular allergy med.  \n\nI always figured that if I actually had a - bad - reaction they would give me some actual prescription RX. This way I could actually drive myself - I cannot drive on Benadryl. That must be really tough getting through the day. I hope you do not mind me asking but were you diagnosed as refractory in some way other than them running out of treatments? I am not sure how that works and am curious. Forewarned is forearmed, thanks. I am not a fan of allergy meds but I do have some low dose stuff I tolerate pretty well. Yeah they started calling it refractory when nothing was working. I started rituxan a couple of months ago. And I have had some positive results so far. It is not really a straightforward condition and I can only do so much research before descending into mild hypochondria. Good to hear you are getting some relief at last and I will add rituxan to my google list, thanks. I try to stay off of Google I also have lupus so that makes treatment a lot more difficult for me IVIG for me takes about 3.5 hrs but the rate is fairly high from what I started with. They now reach a max rate of 300ml/h but they will not likely start you out that fast. For me it is helped a ton in my lost recent crisis after 5 years remission after a thymectomy, where they gave it to me over the course of 5 days. Now I am on it once every 3 weeks with 5mg prednisone daily, methotrexate once a week and mestinon as needed daily. That has gotten me back close to normal. Able to do high intensity workouts 5 days a week and maintain a very active life. You are channeling my inner post!  My father was recently diagnosed with ALS &amp; MG, and they started him last week on IVIG - thankfully, in home.  (He is 80.)  He received his initial \"dosing\" (or \"load\") 25g daily for 5 days.  The treatments took about 3.5 hours; 1/2 hour for set up, some Banafin (Benadryl) and 2 Tylenol, putting the IV in, and getting the drip going.  It was then about 2.75 hours of drip.  He had zero side effects, which we are thankful for.  He hydrated like crazy the days before and during (we forced him, ha) and the first day, he got super sleepy around 6p (dinner time).  The other days, he had more energy.  The other 3 \"rounds\" are to be 65g every 3 weeks, for 2 days each.  (32.5g/day.)  The 3 week count begins at the start of your \"drip\", not the end.  I believe the dosing, the overall timeline, and the effects of course all are tailored to your age, weight, severity of condition (maybe?) etc.    \n\nWe are hopeful that it will help some of the cranial deficiencies he is experiencing (eyelid droop, swallowing issues, lack of feeling on tongue, etc.)  He is also lost an exorbitant amount of weight in the last 6 months, but they are not sure it is MG driven.    \n\nThe nurses that have come to the house swear by this treatment, one of our nurses sees an older lady that swears it has changed her life.  So if this is possible?  Go for it.  Right?  Sure hope it works out well for you. I am sorry to hear of your father's diagnosis, these auto-immune conditions do often cluster. Wish him my best and I hope he gets some relief from the IVig. Thank you for the detailed response, it is very helpful. That is a wicked treatment regiment but I am glad it is working for you. If you do not mind my asking how long has it been since your diagnosis? Thank you so much.  Wanted to share some of the dosing and timeline - it is all new to us.  I am feeling quite positive that it will work for him and you.  The nurses and doctors involved in his care are almost adamant that it will help.  We will wait to see.  Keep us posted on your journey with this?  Always good to have a friend and share information that just might help. I was diagnosed in 2014. I was in remission right after my thymectomy in mid 2014 to mid 2019. Been on that treatment plan ever since", "What do you do for fun? It took me a long time to come to terms with limited mobility. I have always been an avid gamer, but it got harder and harder for me to function with a mouse and keyboard for prolonged periods of time. So, my husband got me an Xbox controller and I use that with my PC. Now he is helping me build a battle station in/around my Poang chair. (It is the place where I am the most comfortable.)\n\nWhat do you do for fun? Have you found ways to participate in the things you used to do? I got into photography right before MG started significantly limiting me. Everyday I use crutches or a walker to get around, so I definitely understand mobility issues.\n\nMy wife and I watch shows through Netflix, Hulu, HBOGO. Whenever I am having a good day / couple hours I make the most of it and try and do something outside. That is awesome. My husband, son, and I are relocating from FL to MA in December. I am afraid of what the cold's going to do to me. However, I am originally from PA, so it is not like I have never dealt with winter. I just was not sick back then.\n\nAnyway, I also enjoy photography. It is just harder to do now. Mestinon has been helping some. I hope legal cannabis in MA will help, too. I miss feeling like I have a life! haha.\n\nI also really love streaming movies and TV. Have you binged anything good lately? You might be surprised by the cold, in a good way. Heat and humidity basically destroy me lol. I cannot be outside long during the summer or it just drains me. Anything over 70 and I can only be outside 10-15 minutes. Luckily with the cold, you can bundle up real good.\n\nI am not sure whether or not cannabis would help. I have never looked into it, but I would be worried about the muscle-relaxing properties. I get diaphragmatic weakness as well, so that could be an issue.\n\nGood shows - Game of Thrones, House of Cards, Westworld, Mindhunter, Stranger Things, Narcos, Shameless, Wayward Pines, The Path, Underground, Wentworth I am the same way when it is very hot. Perhaps the cold will actually be good for me!\n\nMy doctor actually recommended cannabis. I have had loads of gastrointestinal troubles and my medications have been exacerbating them. I asked if it would be safe for me to do while I was in Vegas recently, where it is legal. My husband and I got an edible cookie to split over a few days.\n\nFor the past two years, I have not been able to walk much farther than from my chair to the bathroom. After eating that cookie, I walked three miles on the Vegas strip and felt great! So, I am hopeful.\n\nIf you are interested in reading up on it, there is a ton of great research out there. ( I shared with my family.", "How long did it take before you all started feeling ok I feel like I cannot do anything anymore, I have a hard time putting in socks shows lifting things standing walking, I cannot chew things. Idk I just want to be able to at least get dressed by myself. Almost a year. Not until I was started on rituxan. I will never feel like I did before MG though. It took me four or five months after my thymectomy before I started to feel stronger. I also had started pyridostigmine every six hours. Some days I still have to rest more often than prior to surgery. The interesting thing is I felt better before the surgery and I was not taking any medication. Righy after I got out of the hospital I felt like the bionic woman but they had me hopped up on so much prednisone I literally would hulk out at the grocery store if someone cut in line. But once that got tapered down- it took a full two years for me to even out. I take mycophenolate and no more pred and even sometimes I feel like I still have weak days. Once everything started working I felt good, was really rolling into life...BUT since I had my vaccine I have had a hard time- it feels like the days before my diagnosis...total poop! But hang in there you will start to even out, it takes up to three months for some medications to really start working. Just be patient with yourself, and I recommend looking into ways to help your body reduce the amount of inflammation it creates. I did not understand how much my condition was affected by an over stimulated immune system until I had a blistering reaction to a skin treatment a week after the vaccination. It was like a one-two punch and put me into bed for 16 hours a day. \n\nI am coming back now but psychologically it is was a low point for me until I made the connection to the hyperactive immune response I was experiencing. I had not thought that inflammation could trigger the immune system but now that you bring it up the referral to the rheumatologist makes sense. Thanks for putting that in my thoughts, I have years of unhealthy habits to overcome and this only adds fuel to my fire. Same. After my crisis I had a really long recovery. It was at least a year.  \n\nI am in my 60s so I think that effected my recovery.   I have no doubt I have had MG all my life. So it is had all those years to damage my neuromuscular junctions.  I am recovering my abilities slowly but it is a rollercoaster - life stresses are a big trigger. \n\nAlso, when you are diagnosed with a chronic disease you feel relief because you finally know why you are suffering. But you also feel extreme sadness knowing your life will forever be different because you have to accept the limitations of your MG life.  \n\nIt is OK to grieve the loss of a “normal” life. We all go through it. \n\nHugs.\n\nEdit: forgot some words Yes. It is now my passion to keep inflammation as low as possible - I have changed my entire life and some days I miss who I was so hard but this woman THIS new woman has shit to do and I dont have time for this MG crap so I just do all the things, read all the things and it helps and psychological - you are right - it is hell...for 3 years I was afraid to start anything in my life for fear that I would have to stop cause I might almost die again- I felt dead inside, sometimes I still do - but I am clawing my way back - I do the meditation, which I suck at, I eat all veggies and low inflammatory foods, and work out (when I can) and it all bites cause sometimes I just want ice cream and cheese fries (with the super amazingly toxic liquid cheese) but then I remember I want to walk and talk without slurring and go to India or backpacking or just not have to piss in a diaper - so ya - all the things and it is hard but worth it. Love to you! I admire your candid approach and your hutzpah. This week I took some steps toward doing the things that refresh my soul and I quickly realized that with planning and effort I can still do those things, or at least a modified version of them. \n\nIndia was always a dream and I am **not** going to let that go now. Maybe not this year, or next, but it is a dream I can use to fuel the fire. \n\nThank you, and have a great day.", "What is your go to food or recipe when your tired and having trouble swallowing? Hi All, \n\nJust wondering what your favorite foods or recipes are for when your having issues swallowing so I can make a larger document to save.\n\nI am trying a Alfredo recipe today from the MG united cookbook, I just wish there was a larger cookbook aimed at people with MG. I just buy Vega protein shakes that are the meal replacement, or probiotic ones and use those. I generally stick to rotisserie chicken and small cut steamed veges, pasta. I feel like because I have done it long enough when I actually have to chew tough things like steak once a week or two weeks it is not as difficult and it is less noticeable. I also just constantly chew gum all the time. Seems to help on top of my moderate daily training. And I would not call my case minor or anything. I take pyridostigmine 360-480 mg a day sometimes low dose steroid if my eyes are in intense pain. Firm believe that a consistent training plan that scales slowly over weeks or low the , based on your own severity, can lessen or alleviate symptoms for generalized MG. Training plan as in working out? I do not know if that advice apply to everyone as my MG is uncontrolled and while I do try and do gentle stretches and walking sometimes even housework can fatigue my limbs. I mean I am glad it works for you, but I just do not think everyone is at that level and needs to talk with their doctor before starting a routine. Maybe if I can manage to get controlled better. i went into crisis state about two weeks ago after a month of worsening symptoms and one of the harder ones was my swallowing and chewing issues, one of my dietitians on my team at the hospital right now gave me a list of foods that are safe to eat/try out. just remember to focus on your chewing and swallowing and you will get there. i lost around 20lbs in the month leading up to now but def eat stuff like mashed potatoes smoothies with a spoon if you have any lip weakness, carnation breakfast drink mixes are really good for extra nutrition!  Luckily I have some mashed potatoes and I think some carnation breakfast mix in the house. The heat where I live has kind of made my symptoms for eating a bit worse so I have been skipping meals or eating really soft pasta. Going to try to add this to my list so I do not forget, thanks :) Well I am in that position now and currently in the iCU. I now know I should check in sooner with my neurologist when I start having an increase in weakness for a week like this. Have not eaten since Monday night, and as I am currently on the bipap and going through plasmapheresis I think it will be a few days before soft food. Even Jello sounds appealing.😥 i am sorry you got to go thru that wishing you all the best! i am happy i got my line out of my neck the other day and tmrrw is my thymectomy! you will get thru this good luck ❤️ Thank you ❤️ First Plasmapheresis gave me some mobility in my arms and feet back, sounds like I will be here at least 5 days. Having the neck line feels so odd does not it? Good luck with your surgery!", "Too embaraced to ask my doctor how it would affect my sex life due to my age and country of origine Ik this sounds trivial and stupid but i m 19 male and would like to know how it would affect my sex life , ik i have strong muscle weakness and trouble breathing, but should i also avoid things like viagra ? If anyone has had the courage to bring this up with their doctor pls let me know as the internet provides so little on myasthenia and almodt nothing on this subject . Here is a short article on intimacy and MG that might answer some of your questions. \n\nI do not know anything specifically about viagra, but looking up drug interactions is a good place to start. ", "):  😢😡😢😡😢 I am so sorry for your diagnosis. I wish they could have surgically removed the tumor.", "I got ya homie! ", "Severe reactions to IVIG Has anyone had bad reactions on a consistent basis? Recently I have been getting debilitating muscle cramps to the point where I should have gone to hospital, but I did not because of covid. Luckily I am fully vaccinated now. In speaking with my doctors, they seem puzzled.  A few of them think I may have been getting allergic reactions or aseptic meningitis after one or more treatments.  It usually happens anywhere between 6-48 hours after my last dose for the month( I get two right now). Sometimes the muscles in my right arm cramp up so much that I cannot open my fist and I get muscle spasms all over my legs in different locations and intervals. I normally get muscle spasms, but it seems to go to 11 after my treatments. My headache the first time around was so bad that I would rather feel the pain from my thymectomy again then feel that headache.\n\nHow do you feel after IVIG? It typically takes me at least a week before I feel better. Now I am really worried about you.  \n\nYou should not be getting IVIg.  You may develop even worse reactions.  \n\nGet your neurologist involved in finding an alternative medication - like Soliris - (and other new ones coming soon I hear)\n\nAnd for the rest of you guys reading this - if you have a reaction- You needed to go get medical care every time. Why? Because if you are in the US you have to play by your insurer’s playbook. And that playbook is followed by case managers with absolutely no medical experience. Therefore when it says at this level of MG the patient gets IVIg. Patient can only move to next level treatment (like Soliris )if not getting better or has adverse reactions. ( for example. The companies may vary)\n\n(Again! If anyone is having this serious reaction get it documented. Go to the ER )\n\nOnce documented - you can move on to a possibly better treatment. Like Soliris... it is expensive but - and here is the part people forget - you will end up paying your yearly deductible max with IVIG  too. Just at a later time. \n\nThis is how I handle the problem - granted I am in a still working income bracket (hubs) and am disabled not quite 65 - so Social Security Disability MEDICARE with AARP UnitedHealthcare Medicare Complete.  (By far and above the best package)\n\n-*•••Soliris has a discount card you may qualify for - as well as my hospital has plans to help people with this expense. \n\nEvery hospital/clinic will be happy to help because - Frankly, they know the rest of the billings will be covered (with prior authorization, etc you know what I mean) \n\nBe better my friend. I hope you will call your neuro I have talked to my neuro and she seems to think that it may not be IVIG related since it can take so long and the pharmacist is hazy on it as well but I seem to think so. They suspect that it might be seizures induced by lack of hydration but I get some before and after.  I have not heard of Soliris yet so I will definitely look into that. Thanks!", "What does myasthenia gravis trouble swallowing feel like? How does it show up on tests? For those who have mg &amp; trouble swallowing, can you describe what it feels like? What foods are difficult to swallow etc?\n\nIf you have had test done (barium swallow, upper endoscopy, esophageal mannometry) what did they show?\n\nI have dysphagia &amp; chronic fatigue syndrome, trying to understand if mg is something I should look into. For me, when I tried to swallow it got pushed up into my nasal cavity then when I tried to clear it, it was easy to get in my windpipe. I had to scrape out spit many times with a spoon, so I did not choke. It was pretty horrible. When my mg was at its worst, attempting to swallow felt like my throat just did not want to accept any food even though my brain was telling it to swallow and push the food down. If I did manage to swallow, it felt like I was swallowing a chunk of unchewed food that seemed to take forever to go down. On better days, there would be times where I would be able to 'swallow' no problem but it would go down the wrong hole and it hurt like hell.\n\n Some foods that got me through those times were soft rice noodles (cut them short to lower choking risk). Ate so much rice noodles back then that I will almost never touch them again today. Mashed potatoes and smoothies are good too. I guess just avoid anything tough/dry/spicy. \n\nI did not get any tests done for dysphagia specifically so I cannot help you there. The neuro just had a look into my mouth and could tell I was in bad shape from the irritation. All the best to you! When i had these symptoms it was hard to fall asleep cause i could not swallow my own saliva.\nI ate things i did not have to chew like puddings to save my strength for swallowing. As hard as I tried I could not get food pushed down my throat. I could some liquid and the colder the food was the better. Sometime trying would force the liquid out my mouth. Luckily this only lasted a few hours. Pyridostigmine made it easier to swallow and one my dosage was correct the difficulty went away. Interesting. Mashed potatoes are the worst for me. They were also one of the first foods I noticed I had trouble with. (Over time the foods I had trouble with increased.)", "Mestinon for the win! Woke up super short of breath but did not take my meds right away. Only used my inhaler. Took a shower and got ready thinking I may need to go to the hospital. Then I took my meds (including mestinon) and within 30min I felt so much better! I never realized how much it helps with breathing! It is all about my breathing and swallowing, too.  It is still surprising to me what a difference it makes for me. I know it is crazy how much it helps! Glad they are working well Out of curiosity what dosage mestinon are you taking?  I was on 30mg every six hours and the neurologist moved it to 60 as I was having symptoms. Symptoms are less now but about two hours after I take a dose my speech degrades for around thirty minutes. I am taking the extended release (180mg) twice a day with the 60mg throughout the day as needed. Thanks while I take a lower dose and I know it makes me feel better I am not sure it is dialed in. I will talk to my neurologist this month. If you feel you need a higher/ more frequent dose definitely ask your neuro about it! Good luck at your upcoming appointment!", "Muscle knots I have muscle knots in lower legs and lower arms. Possible symptom from MG? Anyone with similar symptoms? Yes and   kind of.  Both. \n\nI knew had some serious muscle atrophy in my shoulders and calves from having long term un-diagnosed MG. \n\nIn my experience - I get muscle pain when I am in a up swing of my condition.  When my treatment is working and my neuromuscular junctions begin to repair and function - I get out and about and my muscles hurt. \n\nI started Soliris 18 months ago. I can actually feel when the atrophied muscles are trying to come back.  As well as the rest of my body.  \n\nSo I get pain from the nerve re-activation. Sort of like electricity. And I get some real muscle pain from being able to use and develop my muscles.  \n\nMy feet, calves and neck are subject to the most cramping and knots.  \n\nBtw. Do not use magnesium for any reason.  It triggers MG. \n\nBest wishes", "MG and Colonoscopy My GP would like me to schedule a colonoscopy and I informed her I am concerned about having the procedure done. My concerns are focused around the anesthesia causing breathing issues and the prep medication may contain magnesium. It is my understanding the MG patients should avoid magnesium. She has asked me to discuss this with my neurologist before I absolutely refuse. \nHas anyone else gone through a colonoscopy knowing that you had MG?  What did you do?  What precautions, if any, did you take? I have my endoscopy, including colonoscopy, done before i got diagnosis for MG. As far as i know, MG patient only should avoid Magnesium injection. So, maybe its ok if the prep accidentaly contain Magnesium in it(?). But, u should definitely ask ur neurologist first. Luckily, the anesthesia didnt affect my breathing. It is scary out there for us!  \n\nYes you can get the procedure.  \n\nTell everyone you have mg!\n\nI have a talk with the doc and the anesthetist. I talk to the nurses as they get you ready. I talk to anyone who will listen. \n\nPrint out the pdf lists of “Drugs to avoid if you have Myasthenia Gravis” found on most of the mg websites. \n\n( \n\nArticle contains both links\n\nMaybe print two copies. \n\nTake them with you. Show them to every one. Sometimes the nurses or docs ask for a copy. They are happy to see you are informed. They want you to do well. They appreciate when you are your own advocate. \n\nI have not had a problem - so take care of yourself! Thank you all. I plan on talking to my neurologist in detail about this. GP doctor said there was no issues and yet I have read articles on what medications to watch out for. I have seen articles that one should do the prep and procedure in the hospital because you may become weak. I am not sure how much strength I would have without talking the pyridostigmine. \nI plan on bringing all of this up with the neurologist before I make my decision.", "EMG came back normal? They believe that I have MG. I have MS and there is no doubt that is what it is. The doctors are confused at how I may have BOTH. Apparently I am just good at getting autoimmune conditions.\n\nYesterday I had an EMG which was 100% normal. Is that normal for people with MG or is this a sign that it is not MG?to\n\nThanks in advance for anyone who has something to share. I really just want to feel better. Grasping at whatever answers I can right now. All my blood work has come back normal but I have mg for sure. This is quite a tricky illness is not it? It really is. 95% of my symptoms went away with my first IVIG treatment. The second one was just meh. Im so tired of not being able to see things close up due to the double vision. Goodness I can only imagine. I have had 1 episode of double vision which resolved itself (thankfully) and at the time I blamed my MS. Turns out I was blaming too much on MS... Hi, my symptoms did go back to normal. Earlier this year I was really struggling with MG symptoms, speech mostly and double vision. And then over a few months like magic they were gone. I do not know why or how. My EMG was also normal, but I definitely had noticeable symptoms at the time. I had even pretty much decided on having my thymus taken out it at the time. Wow! How random! Fingers crossed that it keeps up for you.", "MG and Covid I mostly went into remission 9 years ago after a thymectomy.  I got the first dose of the Pfizer shot in May and my symptoms got really bad. I then had my first Myasthenic crisis. My son had to call 911 because I could not breathe after a shower. He 2as traumatized, and I was terrified to get the second shot.\n\nAfter 9 years my neurologist retired and I have had an impossible time trying to find a new one during the pandemic so I could not ask any questions. \n\nAnyone have any thoughts on the vaccines, Covid and MG? From what I have read, Covid is definitely a trigger. That explains why you got worse with the vaccine+antibodies. If you live in NC I know a great one 😊 Also, I am so sorry to hear about the crisis. I hope you are feeling better.🙏🏻 Just tested positive for Covid. Wish me luck Oh no! Good luck! Rest and lots of fluids!! If you can contact a neurologist near you ASAP or at least a PCP. Maybe they can prescribe you IVIG or something even a Zpak to help. I could not even get mestinon after the first shot. Absolutely the worst nightmare trying to get in to a neurologist or pcp. I am double insured. I gave up. That is terrible. What about when you recently had to have 911 called? We are you hospitalized? I ended up having to get so bad and going to ER to originally get diagnosed so I get the shitiness of getting in with specialists I was hospitalized but ended up just walking out without discharge papers. Definitely did not speak to anyone about getting hooked up with aftercare, lol 9+ years ago was also a complete nightmare trying to get a Dx. I had double vision for almost a year after having my 2nd kid. I couldnt hold my infant from weakness or drive.. barely could walk with the vision issues. They kept saying I was sleep deprived and stressed and I should drink more water. Eventually the ptosis kicked in and they thought I was having a stroke. OHSU diagnosed me in 30 min. I had a thymectomy in Dec 2020. I did not go into remission and my neurologist highly recommended that I get a Covid vaccination. I did not have any adverse reaction. In fact I did not have any reaction to the vaccination at all. It could have been coincidence, it could have been the vaccine. I do not know, but good for you.  I am sorry try to find someone maybe even using teledoc I got MIS diagnosed at a hospital! Nightmare!", "did my first cleansing of the blood today  Ouch I hate those IVs for Plasmapheresis !  \nBut it really helps.  Get stronger soon. ! it is so uncomfortable the tape hurts the most honestly it is just tugging lol. doctors think my thymus is cancerous or something so i need a pet scan tmrrw to find out bc in my cat scan it looked fairly large so /:\n\nif it is large and spread close to my diaphragm i will need chemo and radiation then surgery ._. i am only 24 this is exhausting I did not have a bad thymus.  But…. From what I have learned in the last 4 years of research and talking To other MGers—-it makes a giant difference when it is bad and you have it removed. \n\nThe recovery is no fun but the end result is possible remission or low level mg where all you take is mestinon. \n\n Heal well.", "Question about prognosis Hey, my grandfather just got diagnosed with MG at a pretty advanced stage of the disease. He is been hospitalized because he is losing control of his tongue and diaphragm, leading to breathing problems. Looking back, he is had symptoms of this thing for almost ten years but his doctors overlooked it because he is old. I am wondering if you all can help me understand what to expect. How controllable is this disease with medications? Will be likely regain the control he is lost or does he have to deal with the loss for the rest of his life? What are the odds that this could kill him, given how advanced it is gotten? Thank you for your help Does he have a neurologist yet? My mom has been on Rituxan (infusion) for the past 2 years and it is done wonders for her. She has been symptom free. Takes time to find the right medication but keep asking questions and keep talking to doctors until you get him on a treatment that works for him. It can be really scary at first, hang in there. Thank you.  I do not know yet. I think his primary care physician is the one who admitted him. He is getting medication delivered straight to his stomach for five days to see if they can stabilize him. I will ask dad tomorrow", "Sclera redness and irritation Currently I am on 360 mg of pyridostigmine end 5 mg of prednisone for treating generalized and ocular myasthenia. While this has worked to a great effect and solved 95 percent of problems, the constant red sclera and irritation is always present. If I attempt to use lumify to correct it looks even worse the next morning than if I had not used it at all. Does anyone have a similar experience and if so is there a particular medication or self care techniques to get rid of this? I did on one eye before my symptoms were controlled because it would open in my sleep. I used a gel instead of drops at night to help with closure. My eyes used to kind of sting and get red randomly while I was on a high dosage of prednisolone. Since getting off prednisolone, I do not get that problem anymore! I think what worked best for me was to just keep myself hydrated and to reduce screen time. Fish oil may help too! :) Awesome I def tried a gel for my eyes last night  and this might actually have been the root of my problem with eyes opening during my sleep and me being unaware. I slept a bit longer and had a little more energy on top of my eyes actually feeling a little bit better in the morning despite the redness and irritation being present. I used a gel with mineral oil and something else. I had tried like 14 different eye drops and outside of the preservative free ones giving minor relief for an hour, this one actually seemed to work for relief. Thanks for the tip 🙏", "More tests Hi all. Going in Monday for another scan and electrode test. \n\nDiagnosed with MG in November, trying to adjust to new way of life. \n\nAny advice will help. \n\n👋 Say in you h with your neurologist, try to eat well, get plenty of rest, listen to your body when she is talking to you, join the Facebook group (very supportive) be resourceful. If they eventually suggest a thymectomy, I would suggestion consider it as a gateway for remission. Mestinon is a great medication also. If you ever need anything, please feel free  direct message me. I was diagnosed in April of 2019. Hi! I do not know your story but there is light at the end of the tunnel! When I was diagnosed I was so bad I could not shave my face, I could not walk up the stairs, and I could not cross the street by myself, all at the age of 22. I was on prednisone for about a year which was very hard due to all the side effects but now I am off prednisone and get Truxima infusions every 6 months and take Mestinon 4x a day. Without Mestinon I am able to walk and shave and do normal things without Mestinon, and while on Mestinon I am able to rock climb, snowboard, go backpacking, I am about 85% back to normal.\n\nMy advice is go above and beyond your treatment plan. I tried everything and what I found helped me is cutting out gluten, sugar, and alcohol, getting 8h of sleep per night, and being as active as I can every day. It sounds cheesy but it really is a fight you have to deal with every day and an extra layer of complication, but it is manageable and there are good tools available to fight back. Good luck!!", "Myasthenia Gravis Study ", "Possibly MG? Hi everyone, as of right now I am almost positive that I have MG. I have a neurology appointment next Tuesday and I am excited and hopeful to possibly finally be diagnosed and get treatment. \n\nI am a 23 year old female. In 2018, I first noticed my left eye drooping. I was still in college and at a research conference. As my friends were trying to take a picture of me at my poster, they noticed my eye acting really weird. When I looked at the pictures they took, I felt crazy because I never had a lazy eye and I was just utterly confused. I finished that research conference and it did bother me for a few days but it mysteriously disappeared and it was out of site out of mind. Now flash forward to 2019. I had just graduated from school and moved back home. I was working at a busy doctor’s office and I was getting migraines fairly regularly. I have a history of migraines which would usually coincide with my menstrual cycle so I was not worried at first. Then in December 2019, my job got really busy. I was always exhausted and we were very understaffed. My neck would be killing me at work and I was getting bad migraines. I went to urgent care one day when the pain got so bad I had to take off. The PA I saw felt that it must have been work related due to the set up of my desk and the way I had to move my neck etc. She felt that I did not need to see a neurologist and prescribed prednisone for about a week which she said would give my muscles a reset. It worked somewhat. And I just sucked it up and dealt with it. Then as I continued working it felt like my left eye would get really heavy and lazy as the day wore on. I was mainly working at the front desk and staring at a computer so I do not think any of my coworkers noticed to point it out. As soon as I would think I should see a doctor it would usually subside and I would forget about it. \n\nSince COVID19, I was furloughed. During my time at home I was reading a lot and looking at screens. My eyes would get really dry but I also noticed the drooping coming back. I pointed it out to my mom and sister and they noticed too. I finally went to my ophthalmologist two weeks ago and she noticed the drooping when I pointed it out. She gave me a visual field which came out normal. Diagnosed me with dry eye disease which I am taking Xiidra for and referred me to a neuro ophthalmologist. She said that nothing appeared to be wrong with my eyes and that it must be muscular. Which is pretty much what I thought myself. \n\nNow what I forgot to mention is that about a month ago I went for my yearly physical. At the physical I had not mentioned my eye drooping because I forgot about it like I said it comes and goes mainly when I am tired which is what has taken me so long to get it checked out. But I did mention to my PA there that I had trouble swallowing. Which also comes and goes. It mostly happens at dinner time. I will be eating and then my food usually gets stuck or I get really tired like chewing and swallowing. I usually eventually clear it with water but it is scary. However it also happens so sporadically that I always forget about it. When I mentioned it to the PA she felt my neck and said it felt normal and did blood work which ended up not showing anything suspicious for my thyroid. If I had mentioned the eye drooping maybe she would have referred me to a neurologist then but like I said I used to forget about it. She suggested that I record it next time I have trouble swallowing and start a journal to see if we could get to the root of it.\n\nSo after seeing my ophthalmologist I have been researching what could possibly be the cause which led me to MG. I realized that I have had trouble breathing a few times. There were several times I was laughing and got out of breath which was weird for me because I am in pretty good shape (used to work out every day but have stopped since COVID) and I do not have asthma just allergies. I ignored it because it went away with rest. And I just assumed it must have been cause I have not been working out since quarantine. Then one day I was working out at home and I could not breathe. But I also have an indoor allergy to dust and outdoor allergy to grass so I just felt like deep cleaning in my house and a high pollen count outside coupled with working out after not doing it for awhile were like causing me allergy induced asthma. This alarmed me and my plan was to tell my doctor but I also forgot about the incident because I got some rest that day and felt fine the following weeks. \n\nI know this was a really long post. But after my research and my history over the past few years, I am pretty convinced that I have MG. I had a large dermoid cyst on my ovary in 2017 which was surgically removed. Other than that I have just suffered from the migraines for years. I take sumatriptan as needed and record them with the migraine tracker app. I think some of them may have actually been due to the strain on my muscles both keeping my eyes open and my neck and head up. As of the past two weeks, I have had more trouble swallowing especially at night so I have been trying to eat what I can early in the day. And I have had a lot of trouble sleeping some of which I think is just the anxiety of waiting for my neurology appt but also because I have not been very active because I am always pretty fatigued. I also have some acid reflux the past few weeks which I feel may be somehow linked to the difficulty swallowing. Now I am just waiting for my neuro appointment on Tuesday. Hopefully everything goes well. While neck pain and migraines (pain in general) are not typical MG symptoms, ptosis (drooping eyelid) and trouble swallowing are. I doubt that breathing would be affected in a supposedly light form. If your doctor is thorough, he will make a tensilon test, take blood for antibody testing and check your thymus for any abnormalities.\nMG is pretty rare. It could be tons of other stuff and I hope you find out soon so you can have a peace of mind and tackle your symptoms.\nWishing you luck. &gt; While neck pain and migraines (pain in general) are not typical MG symptoms...\n\nWe are all different. Pre diagnosis, I could barely hold up my head at times due to the weakness in the muscles there and the effort it took to keep my chin from hitting my chest caused severe pain in my neck. Misdiagnosed by GP as arthritis in my neck, I would walk around in agony holding my chin up with a closed fist just to be able to see where I was going. It was horrible. \n\nI agree that they need to see a doctor, but I would insist on a referal to a neurologist who knows what blood test and physical testing are appropriate for narrowing down diagnosis. \n\nPerhaps my experience differs from yours because I have anti-MuSk antibody positive generalized MG.\n\nBetter to know what is going on than not.", "Occular form &amp; eyes asymmetric Hey! I (29 F) was diagnosed with MG ocular form in June this year (vaccine effect) I am on quite a high dose of pyridostigmine, I this far only am affected in my right eye (ptosis). I tried IVIG, that did not work and I underwent a VATS thymectomy in mid September. I still take pyridostigmine. \n\nWhen I take the medication, my unaffected eye becomes really wide awake and my affected eye mostly becomes normal-ish (but for a while) but the asymmetry of one very wide eye is absurd. I have quite narrow or small eyes and I do not even know anymore if this is a problem to .. who? My neurologist is rather radical, but maybe I should contact any eye doctors? \n\nHas anybody here experienced something alike? \n\nThis diagnosis has run havoc on my life (will I have symmetry, can I be confident, should I tell everybody, what about having kids in the future or  will I be a burden of a ragdoll to my husband in a few years? It is taking a toll  on me.\n\nI kind of need some small win. Thanks in advance for your replies. The opthalmologist will not do much unless you want to have surgery for the ptosis.  Mg is tough to fight but not impossible if you catch it early, especially for ocular form. I had my ocular remission for over a year. Only when it gets generalized then it becomes very problematic . Having kids will not be a problem, just taking care of them will.", "Sleep causing diplopia to worsen? Has anyone else experienced a worsening of diplopia after sleeping more than normal? I often go weeks with very little sleep and occasionally my body just crashes into a sleep that can last through an entire day and through the night (sometimes longer). Every time I get up and out of these periods my double vision is worse, \"almost maddening\" is how I describe it. My current treatment team is no help on this matter and I am reaching out in desperate hope that someone else has experienced this and even more hopeful that you have found a way to help with this symptom and share. My diplopia runs parallel with my tiredness. The more physically tired my muscles are the worse my diplopia gets. Some days I wear an eyepatch for a few to several hours, being sure to alternate eyes every 45 minutes or so. This gives each set of eye muscles some time to rest and I can tell when I no longer need the patch and can revert back to using both eyes. I also find low light conditions are easier on my eyes and bright sunlight, even with sunglasses, tires them out super quick.\n\nI still sleep well so none of this is like what you are experiencing but all I have to offer is my experience. \n\nI have read about prism lenses in eyeglasses helping with diplopia but I have not gone that route yet as apparently once you do your eyes will quickly come to depend on them and you will be stuck with them for life.\n\nI hope someone has more info for you, good luck. When this happens to me, I assume it is because I went much longer than normal without mestinon, for what that is worth", "VATS Thymectomy Long short story, this year has been the worst for my health so far. I was on ICU on February due to septic shock and major organ failure. It was a short stay, I was there for only two week and fully recovered, or so we thought. One I got out of the hospital we noticed some muscular weakness but did not looked into it cause we thought it was post ICU. Fast forward to April and I still have muscular weakness and some tremors on my right hand so I went to a neurologist who decided to ran some tests. He said everything was ok and that I should improve in a coule of.months. it did not happened.\n\nSo I went to another neurologist who suggested it might be myasthenia gravis, but my symptoms did not check: -Fatigue, tremors on right hand and left leg, double vision, trouble swallowing food and general weakness. Either way, she decided to prescribe me Mestinon and Prednisone. I started with 2 pills every 12 hours, and now Iam taking 1 every four hours. Got some other tests done and finally a thymoma showed up on a scan. This whole process has made me really anxious, and Iam not sure if I will ever recover. I already saw a surgeon and he suggested to have a Vats thymectomy, anyone here has been thru this kind of surgery? How long did it take for full recovery? What should I expect from it? I underwent bilateral endoscopy surgery to remove a thymoma and my thymus in December. Surgeon explained that with the curvature of the chest he had to go through both sides. It was a six hour surgery and each lung was collapsed as he was working on each side. I have three incisions on my left side and four on my right. \n\nSurgeon explained that I would awake from surgery in an icu room and my nurse was assigned to me only. He said he trains his team to follow his care and I would be in the icu between three to five days. It would be two weeks after discharge before I could consider going back to my desk job. I thought “we will see”. \n\nDay 1. Surgery went well and I woke up in an icu room without any major pain. Had a chest tube in each side, catheter, pic line in neck, back up line in wrist and all types of monitors connected. I was told to use my spirometer and I did not have any issue. Really wanted to sleep. \n\nDay2. Spinal block has worn off and I am in pain. Pain pump medication is making me nauseous. Doctor makes me cough repeatedly to clear lungs and use spirometer hourly. It hurts to cough, breath deep and walk. Daily lung X-ray and walk the hospital floor. I am week but I push myself. Finally enough pain medication that I can sleep. In the evening more coughing and breathing exercises per the doctor. I am to walk hospital six times a day. Lots of teams checking on me \n\nDay 3. Coughing and breathing exercises continue. Walking the hospital every two hours and daily X-ray. Chest tube still draining and the hurt. I am weak but keep pushing myself although it hurts. Medical team keeps pushing me and they say that is the fastest way to get out.  Catheter is removed today. \n\nDay 4. Daily X-ray and continued breathing exercises. I have stopped coughing up gunk from my lungs. Chest tubes removed today and I continue to walk the hospital. By six pm I am cleared to be released. Pic line removed an I am free to go home. \n\nAt home I could not sleep in my bed so I slept in a recliner. No pain medication was prescribed only Tylenol. I did my breathing exercises hourly and walked the house hourly. Pretty much my life for the next four or five days. I had to wrap chest I plastic wrap and take a super fast shower to keep incisions from getting wet. After a week I could sleep in bed. \n\nThree week post surgery I had stitches removed and was cleared to drive and go back to work the following week. Lungs test good and I attribute that to all the exercises they had me doing. \n\nBack to work four weeks after surgery and I was still a little weak and if I twisted or bent wrong my body made me aware. Literally each month I would feel better and notice a big improvement. No problems from the surgery now but I have still have some myasthenia Gravis symptoms. I am learning to rest a little more and limit some things I would have normally done. \n\nLet me know if you need anything else or additional details. I am happy to provide them Thank you so much for sharing your experience! I was afraid cause my Dr said that I could go home the same same, but as you said, \"we will see\". I think we know our body enough to know that this process is different on everyone and should not push ourselves just because the Dr said so.\n\nDo you feel your symptoms less than before the surgery? Are you still on meds for it? I may be a bit out of the norm. My first symptom, a droopy eye, was in February 2020. By the time my blood work confirmed MG my droopy eye was gone. That was March 2020.   I did not have any symptoms and was always a person that could do all types of physical work and live on about six hours of sleep.  Neurologist confirmed diagnosis but said I was not having any symptoms and there was not much to do. \n\nWent to second neurologist who said the same but also wanted ct scan. Lots of insurance red tape delayed it. I went through the summer and the only item I noticed was I would get a little tired after doing yard work. I was not on any medication. I was working and everything seemed fine. Ct results in late October showed that I had a 3 centimeter thymoma. I visited with the surgeon in November and surgery was in December. I still felt good and was not on any medication. \n\nSurgeon said collapsing lungs gave him the space to work and he would need to go in both sides to get everything. He stated I would be in the hospital for three to five days to make sure lungs were clear and functioning correctly.  All of the breathing and coughing exercises were to keep pneumonia away.  I have always been healthy and could bounce back from anything so I fingered I would be out of the hospital and back to work in three or four days.  Everyone I talked to said after a six hour operation you will be down for a couple of weeks. \n\nAfter the surgery I did not have any medication and as I said I was not on any prior to surgery. About two months post op I had some weakness in my hand, my eye would feel tired, and I experienced more fatigue after doing things I normally did. My neurologist started me in 30 mg of pyridostigmine every 6-8 hours. That is still what I am on.  I continue with the pyridostigmine and hope that I will be able to end taking it. Both the surgeon and neurologist felt I should have gone into remission and should not be on any medication. While it has been seven months they are still hoping it will change over the next year. \n\nThe unknown for me is would I have stayed the same or got worse if I did not have the surgery. Would the thymoma have grown into other organs. At least I know that  will not happen now."]